#pragma once

#include "../CoreUObject_classes.hpp"
#include "AIModule.hpp"
#include "AssetPackerRuntime.hpp"
#include "BattleField.hpp"
#include "DFMAbility.hpp"
#include "DFMGameHud.hpp"
#include "DFMGameplay.hpp"
#include "DFMGlobalDefines.hpp"
#include "DFMVehicle.hpp"
#include "Engine.hpp"
#include "GM.hpp"
#include "GPAudioRuntime.hpp"
#include "GPGameHud.hpp"
#include "GPGameplay.hpp"
#include "GPTween.hpp"
#include "GPUserInterfaceCore.hpp"
#include "GameCore.hpp"
#include "GameplayTags.hpp"
#include "InputCore.hpp"
#include "Slate.hpp"
#include "SlateCore.hpp"
#include "UMG.hpp"

namespace SDK
{

// Package: Breakthrough
// Enums: 52
// Structs: 108
// Classes: 470

struct AAIController;
struct AActor;
struct ABattleFieldCharacter;
struct ABattleFieldPlayerState;
struct ABattleRoutePoint;
struct ABreakableItem;
struct ABreakableItemBase;
struct ACHARACTER;
struct AController;
struct ADFFixedWeaponPawn;
struct ADFMAIPlayerController;
struct ADFMCharacter;
struct ADFMPlayerController;
struct ADFMPlayerState;
struct ADFMTieBreaker;
struct ADFMVehicleBase;
struct ADFScenceWeaponPawn;
struct AEmitterCameraLensEffectBase;
struct AFXProxyActor;
struct AGPCharacter;
struct AGPCharacterBase;
struct AGPGameMode;
struct AGPPlayerController;
struct AGPPlayerState;
struct AGPQuest;
struct AGPSceneActorReplicator;
struct AGPSequenceActor;
struct AGPVehicleBase;
struct AInteractorBase;
struct ALevelSequenceActor;
struct ANavExtendAgent;
struct ARecastNavMesh;

struct UReDeployVehiclePartStoreHUDViewController;
struct URealTimeVehiclePartStoreHUDViewController;
struct UReDeployChooseItemBaseHUDViewFramework;
struct UReDeployVehiclePartStoreHUDViewFramework;
struct URealTimeVehiclePartStoreHUDViewFramework;
struct URedeployChooseItemBaseView;
struct UReDeployVehiclePartStoreItemView;
struct URealTimeVehiclePartStoreItemView;
struct URebornWarTowerMarker;
struct ARedEnvelope;
struct ARedEnvelopeManager;
struct URedEnvelopeMaxHealthBuffEffectCueHandler;
struct URedEnvelopeMaxSpeedBuffEffectCueHandler;
struct URedeployArmItemHUDView;
struct URedeployArmItemHUDViewController;
struct URedeployArmItemHUDViewFramework;
struct URedeployArmItemView;
struct URedeployArmSelectedPackageItemView;
struct ARedeployCameraConfig;
struct URedeployChooseItemGroupView;
struct URedeployHotKeyView;
struct ARedeployMapRandomActor;
struct URedeployPointSelectEffectView;
struct UReDeployPointsPanel;
struct UReDeploySectorAnchorMarker;
struct URedeployUIElementView;
struct UOneDeployTypeVehiclesStatus;
struct UReDeployVehicleInfoHUDView;
struct UReDeployVehicleInfoHUDViewController;
struct UReDeployVehicleInfoHUDViewFramework;
struct UReDeployVehicleItemView;
struct UOneDeployTypeVehicles;
struct UReDeployVehicleStoreHUDView;
struct UReDeployVehicleStoreHUDViewController;
struct UReDeployVehicleStoreHUDViewFramework;
struct UReDeployVehicleStoreItemView;
struct URedeployWeaponPresetStoreBaseHUDView;
struct URedeployWeaponPresetStoreBaseHUDViewController;
struct URedeployWeaponPresetStoreBaseHUDViewFramework;
struct URedeployWeaponPresetStoreHUDView;
struct URedeployWeaponPresetStoreHUDViewController;
struct URedeployWeaponPresetStoreHUDViewFramework;
struct URedeployWeaponPresetStoreItemView;
struct URedeployWeaponStoreHUDView;
struct URedeployWeaponStoreHUDViewController;
struct URedeployWeaponStoreHUDViewFramework;
struct URedeployWeaponStoreItemView;
struct ASceneFXTrigger;
struct UScoreboardBaseWidget;
struct UScoreboardHUDView;
struct UScoreboardInGameHudView;
struct UScoreboardInGameHudController;
struct UScoreboardListItemBaseWidget;
struct UScreenMarkerRipple;
struct USectorAnchorCapView;
struct ASectorAnchorFlag;
struct ASectorAnchorFlag_HotFixActor;
struct USectorAnchorFlagAnimInstance;
struct USectorAnchorHardPointHUDView;
struct USectorAnchorHardPointViewController;
struct USectorAnchorHUDView;
struct USectorAnchorViewController;
struct USectorAnchorMarker;
struct ASectorOwnerSceneActor;
struct UFadingDirectionDataManager;
struct USectorSplineAreaHUDView;
struct USectorSplineAreaViewController;
struct ASectorTextSceneActor;
struct UHubOneTypeVehicleStatus;
struct ASpawnAreaHub;
struct ASpawnAreaHub_HotFixActor;
struct USpringFestSatellitedishComponent;
struct ASuezAutomaticRevolvingDoor;
struct UTacticalConquestEvolutionReviveDeployView;
struct UTacticalConquestEvolutionReviveDeployViewController;
struct UTacticalConquestEvolutionReviveDeployViewFramework;
struct AVehicleRefreshRule;

// Object: Enum Breakthrough.EBattleFieldMarkingItemType
enum class EBattleFieldMarkingItemType : uint8_t
{
	None = 0,
	QuickChat = 1,
	Marking = 2,
	EBattleFieldMarkingItemType_MAX = 3
};

// Object: Enum Breakthrough.ERankSkillBackgroundUIStyle
enum class ERankSkillBackgroundUIStyle : uint8_t
{
	E_None = 0,
	E_CanUse = 1,
	E_CantUse = 2,
	E_Selected = 3,
	E_MAX = 4
};

// Object: Enum Breakthrough.EBattleFlagState
enum class EBattleFlagState : uint8_t
{
	None = 0,
	Born = 1,
	Captured = 2,
	Dropped_AnchorCapture = 3,
	CoolingDown = 4,
	EBattleFlagState_MAX = 5
};

// Object: Enum Breakthrough.EBattleFlagAnchorState
enum class EBattleFlagAnchorState : uint8_t
{
	None = 0,
	HasFlag = 1,
	NoFlag = 2,
	FlagBornCoolingDown = 3,
	EBattleFlagAnchorState_MAX = 4
};

// Object: Enum Breakthrough.EBigeventCoorAnchorPerformMode
enum class EBigeventCoorAnchorPerformMode : uint8_t
{
	None = 0,
	CrackedLike = 1,
	IcelandLike = 2,
	GibraltarLike = 3,
	SuezLike = 4,
	EBigeventCoorAnchorPerformMode_MAX = 5
};

// Object: Enum Breakthrough.EVehicleSceneWeaponType
enum class EVehicleSceneWeaponType : uint8_t
{
	Vehicle = 0,
	SceneWeapon = 1,
	Skill = 2,
	FootSolider = 3,
	EVehicleSceneWeaponType_MAX = 4
};

// Object: Enum Breakthrough.EImpendingDeathClickTgLogType
enum class EImpendingDeathClickTgLogType : uint8_t
{
	None = 0,
	GiveUpButtonClick = 1,
	MayDayButtonClick = 2,
	EImpendingDeathClickTgLogType_MAX = 3
};

// Object: Enum Breakthrough.EOnePlayerOneSectorTLogDataType
enum class EOnePlayerOneSectorTLogDataType : uint8_t
{
	None = 0,
	RedeployStayTime = 1,
	SwitchHeroStayTime = 2,
	BackpackStayTime = 3,
	KillNum = 4,
	DeathNum = 5,
	Score = 6,
	SpawnRebornFlag = 7,
	TeammateRebornOnMyRebornFlag = 8,
	HalfJoinGame = 9,
	EnterSectorAnchorNum = 10,
	EnterSectorAnchorTime = 11,
	EnterSectorAnchorFightTime = 12,
	SupportSkillAssist = 13,
	SupportSkillKill = 14,
	SupportSkillNum = 15,
	SwitchBag = 16,
	SwitchArmItem = 17,
	BuildOneSatellitedish = 18,
	EOnePlayerOneSectorTLogDataType_MAX = 19
};

// Object: Enum Breakthrough.ERoundRedeployTLogDataType
enum class ERoundRedeployTLogDataType : uint8_t
{
	None = 0,
	EnterFirstDeployViewTime = 1,
	BeginFirstDeployTime = 2,
	FirstOpenDeployViewTime = 3,
	ERoundRedeployTLogDataType_MAX = 4
};

// Object: Enum Breakthrough.ERescueFailureReason
enum class ERescueFailureReason : uint8_t
{
	ERescue_None = 0,
	ERescue_Abandon_RescuerKilled = 1,
	ERescue_Abandon_RescuerGiveUp = 2,
	ERescue_MAX = 3
};

// Object: Enum Breakthrough.EExplodeType
enum class EExplodeType : uint8_t
{
	PlayerSkill = 0,
	Vehicle = 1,
	FieldSupport = 2,
	FieldSupportMissile = 3,
	EExplodeType_MAX = 4
};

// Object: Enum Breakthrough.ESectorAnchorState
enum class ESectorAnchorState : uint8_t
{
	DefendState = 0,
	DefendNeutral = 1,
	OffensiveNeutral = 2,
	OffensiveState = 3,
	ESectorAnchorState_MAX = 4
};

// Object: Enum Breakthrough.ERebornPositionType
enum class ERebornPositionType : uint8_t
{
	None = 0,
	Base = 1,
	Anchor = 2,
	Teammate = 3,
	Beacon = 4,
	VehicleOnBase = 5,
	VehicleOnTeammate = 6,
	VehicleOnSameCamp = 7,
	ERebornPositionType_MAX = 8
};

// Object: Enum Breakthrough.EDynamicMusicCondition
enum class EDynamicMusicCondition : uint8_t
{
	EInvalid = 0,
	EAttackerLeftVotes = 1,
	EDefenderLeftVotes = 2,
	ESectorOccupyProgress = 3,
	ELeftTime = 4,
	EOverTimeSectorOnlyOneAnchorOccupyProgress = 5,
	EOverTimeSectorMultiAnchorOccupyProgress = 6,
	EMax = 7,
	EDynamicMusicCondition_MAX = 8
};

// Object: Enum Breakthrough.ECommanderBeforeRedeployAudioType
enum class ECommanderBeforeRedeployAudioType : uint8_t
{
	None = 0,
	CommandersShow = 1,
	RedeployHint = 2,
	NormalTeamAudio = 3,
	GoldTeamAudio = 4,
	SelectDutyHint = 5,
	SelectDutyTip = 6,
	NormalTeamMemberAudio = 7,
	GoldTeamMemberAudio = 8,
	TeamListShow = 9,
	ShowCoolSandBox = 10,
	ECommanderBeforeRedeployAudioType_MAX = 11
};

// Object: Enum Breakthrough.EBreakthroughNarrativeTipTriggerType
enum class EBreakthroughNarrativeTipTriggerType : uint8_t
{
	None = 0,
	FirstDeploy = 1,
	SectorTrans = 2,
	SectorTransAndLastSectorBigEventHappen = 3,
	SectorTransAndLastSectorBigEventNotHappen = 4,
	SectorFightTicketReachX = 5,
	SectorFightTicketCostX = 6,
	SettlementBigEventHappen = 7,
	SettlementBigEventNotHappen = 8,
	EBreakthroughNarrativeTipTriggerType_MAX = 9
};

// Object: Enum Breakthrough.EBreakthroughTipType
enum class EBreakthroughTipType : uint8_t
{
	None = 0,
	BreakthroughGameStartOffence = 1,
	BreakthroughGameStartDefence = 2,
	BreakthroughGameOverOffenceVictory = 3,
	BreakthroughGameOverDefenceVictory = 4,
	BreakthroughGameOverOffenceDefeat = 5,
	BreakthroughGameOverDefenceDefeat = 6,
	BreakthroughHalfTimeRemain = 7,
	BreakthroughNoTime = 8,
	LeaveWarZoneTemporarily = 9,
	DieforLeaveWarZone = 10,
	BreakthroughSectorActivedOffence = 11,
	BreakthroughSectorActivedDefence = 12,
	BreakthroughSectorOccupyStatusChangedOffence = 13,
	BreakthroughSectorOccupyStatusChangedDefence = 14,
	BreakthroughSectorClear = 15,
	BreakthroughRetreatQuickly = 16,
	BreakthroughLastSectorActivedOffence = 17,
	BreakthroughLastSectorActivedDefence = 18,
	BreakthroughEnemyEnterOurSectorAnchor = 19,
	BreakthroughOurEnterEnemySectorAnchor = 20,
	BreakthroughEnemyTakeOverOccupyMoreThanHalf = 21,
	BreakthroughTakeOverOccupyMoreThanHalf = 22,
	EnemyTakeOverOccupySuccessfully = 23,
	TakeOverOccupySuccessfully = 24,
	BreakthroughLeftVotesRemaining80PercentOffence = 25,
	BreakthroughLeftVotesRemaining80PercentDefence = 26,
	BreakthroughLeftVotesRemaining50PercentOffence = 27,
	BreakthroughLeftVotesRemaining50PercentDefence = 28,
	BreakthroughLeftVotesRemaining25PercentOffence = 29,
	BreakthroughLeftVotesRemaining25PercentDefence = 30,
	BreakthroughLeftVotesRemaining15PercentOffence = 31,
	BreakthroughLeftVotesRemaining15PercentDefence = 32,
	BreakthroughEnemyLeftLowerThanX = 33,
	BreakthroughIceLandFirstRedeployOffence = 34,
	BreakthroughIceLandFirstRedeployDefence = 35,
	BreakthroughIceLandShipBlownIntoRedeploy = 36,
	BreakthroughIceLandShipNotBlownIntoRedeploy = 37,
	BreakthroughIceLandOffenseBaseStartOffence = 38,
	BreakthroughIceLandOffenseBaseStartDefence = 39,
	BreakthroughDesperateCounterattack = 40,
	BreakthroughOvertimeGameOffence = 41,
	BreakthroughOvertimeGameDefence = 42,
	BreakthroughOvertimeGameDefenderOccupyOneAnchorOffence = 43,
	BreakthroughOvertimeGameDefenderOccupyOneAnchorDefence = 44,
	BreakthroughWarTower3Active = 45,
	BreakthroughGuidedMissile = 46,
	BreakthroughSectorArtilerrate = 47,
	BreakthroughSectorSmoke = 48,
	BreakthroughVehicle = 49,
	BreakthroughRebornBeacons = 50,
	BreakthroughMidwayIntoTheGameOffence = 51,
	BreakthroughMidwayIntoTheGameDefence = 52,
	BreakthroughGuidedMissileReady = 53,
	BreakthroughSectorArtilerrateReady = 54,
	BreakthroughSectorSmokeReady = 55,
	BreakthroughVehicleReady = 56,
	BreakthroughRebornBeaconsReady = 57,
	BreakthroughCommanderSkillReady = 58,
	BreakthroughHighValueAnchorReady = 59,
	BreakthroughHighThreatVehicleReady = 60,
	BreakthroughFastDeployReady = 61,
	BreakthroughWarOrderTakeAnchorOrder = 62,
	BreakthroughWarOrderTakeAnchorStrong = 63,
	BreakthroughWarOrderKillTargetOrder = 64,
	BreakthroughWarOrderKillTargetStrong = 65,
	BreakthroughWarOrderBeTarget = 66,
	BreakthroughWarOrderKillTargetFinish = 67,
	BreakthroughWarOrderKillTargetCancel = 68,
	BreakthroughWarOrderTakeAnchorFinish = 69,
	BreakthroughBigEventCrackedWarehouseHappen = 70,
	BreakthroughBigEventIcelandTowerHappen = 71,
	BreakthroughBigEventIcelandTowerHP50Percent = 72,
	BreakthroughBigEventIcelandTowerHP30Percent = 73,
	BreakthroughBigEventIcelandSectorTrans = 74,
	BreakthroughBigEventIcelandSectorDisable = 75,
	BreakthroughBigEventGibraltarHappen = 76,
	BreakthroughSmallEventGibraltarFirstLine = 77,
	BreakthroughSmallEventGibraltarSecondLine = 78,
	BreakthroughSuezBigEventHappen = 79,
	BreakthroughSuezBigEventHP50Percent = 80,
	BreakthroughSuezBigEventTriggerWarning = 81,
	BreakthroughTheLastSectorAnchorOffence = 82,
	BreakthroughTheLastSectorAnchorDefence = 83,
	BreakthroughEnemyEnterOurFinalSectorAnchor = 84,
	BreakthroughOurEnterEnemyFinalSectorAnchor = 85,
	ConquestMidwayIntoTheGame = 86,
	ConquestFriendlyOccupyOneSectorAddScore = 87,
	ConquestEnemyOccupyOneSectorAddScore = 88,
	ConquestFriendlyOccupyAllSector = 89,
	ConquestEnemyOccupyAllSector = 90,
	ConquestFriendlyOccupyMoreSector = 91,
	ConquestEnemyOccupyMoreSector = 92,
	ConquestFriendlyTicketTakeLead = 93,
	ConquestEnemyTicketTakeLead = 94,
	ConquestSoonLose = 95,
	ConquestSoonWin = 96,
	ConquestSectorOccupyStatusChangedOffence = 97,
	ConquestSectorOccupyStatusChangedDefence = 98,
	ConquestTicketReach25PercentLead = 99,
	ConquestTicketReach25PercentFall = 100,
	ConquestTicketReach50PercentLead = 101,
	ConquestTicketReach50PercentFall = 102,
	ConquestTicketReach75PercentLead = 103,
	ConquestTicketReach75PercentFall = 104,
	ConquestGameStartOffence = 105,
	ConquestGameStartDefence = 106,
	ConquestGameOverOffenceVictory = 107,
	ConquestGameOverDefenceVictory = 108,
	ConquestGameOverOffenceDefeat = 109,
	ConquestGameOverDefenceDefeat = 110,
	ConquestGameOverOffenceDraw = 111,
	ConquestGameOverDefenceDraw = 112,
	FlagGameOverOffenceVictory = 113,
	FlagGameOverDefenceVictory = 114,
	FlagGameOverOffenceDefeat = 115,
	FlagGameOverDefenceDefeat = 116,
	FlagGameOverOffenceDraw = 117,
	FlagGameOverDefenceDraw = 118,
	CaptureTheFlagCamp0 = 119,
	CaptureTheFlagCamp1 = 120,
	CaptureFlagWeDroppedTheFlag = 121,
	CaptureFlagEnemyDroppedTheFlag = 122,
	CaptureFlagWeCaptureTheFlag = 123,
	CaptureFlagEnemyCaptureTheFlag = 124,
	CaptureFlagSelfCaptureTheFlag = 125,
	CaptureFlagWeGoal = 126,
	CaptureFlagEnemyGoal = 127,
	CaptureFlagWeRefresh = 128,
	CaptureFlagEnemyRefresh = 129,
	CaptureFlagWeRefreshAfterOccupied = 130,
	CaptureFlagEnemyRefreshAfterOccupied = 131,
	SuperiorityCampTriggerAddTimeOnFlagMode = 132,
	InferiorCampTriggerAddTimeOnFlagMode = 133,
	CommanderBeLocalPlayer = 134,
	CommanderNew = 135,
	CommanderHighThreatBeTarget = 136,
	CommanderHighThreatTarget = 137,
	CommanderFinishHighThreat = 138,
	CommanderFailHighThreat = 139,
	CommanderTempOccupyConcentratedFireSectorAnchorFriend = 140,
	CommanderTempOccupyConcentratedFireSectorAnchorEnemy = 141,
	CommanderFinishHoldConcentratedFireSectorAnchor = 142,
	CommanderFinishTakeConcentratedFireSectorAnchor = 143,
	CommanderFailConcentratedFireSectorAnchor = 144,
	CommanderOursBeOurConcentratedFireSectorAnchor = 145,
	CommanderTheirsBeOurConcentratedFireSectorAnchor = 146,
	CommanderOursBeTheirConcentratedFireSectorAnchor = 147,
	CommanderTheirsBeTheirConcentratedFireSectorAnchor = 148,
	CommanderHighThreatOrder = 149,
	CommanderConcentratedFireSectorAnchorOrder = 150,
	CommanderUseFastDeploySkill = 151,
	CommanderFastDeploySkillReady = 152,
	CommanderFastDeployDuration = 153,
	CommanderEnemyUseFastDeploySkill = 154,
	CommanderUseAttackReformSkill = 155,
	CommanderAttackReformSkillReady = 156,
	CommanderAttackReformDuration = 157,
	CommanderEnemyUseAttackReformSkill = 158,
	TeamLeaderBeLocalPlayer = 159,
	TeamLeaderNew = 160,
	CommanderChannelAdd = 161,
	CommanderChannelRemove = 162,
	CommanderChannelAddForSelfCamp = 163,
	GuideMobileBroadcastBreakthroughAttack = 164,
	GuideMobileBroadcastBreakthroughDefend = 165,
	GuideMobileBroadcastConquest = 166,
	GuideMobileAnchorFirstStartCapture = 167,
	ChristmasAmmoBoxInteractionSuccess = 168,
	SpringFestSatellitedishFirstSuccess = 169,
	SpringFestSatellitedishEasterEgg1Success = 170,
	SpringFestSatellitedishFinalEasterEggSuccess = 171,
	NavalBattleIntercontinentalBallisticMissileLaunch = 172,
	NavalBattleIntercontinentalBallisticMissileExplode = 173,
	FaultFoggyWeatherPhaseOne = 174,
	FaultFoggyWeatherPhaseTwo = 175,
	CampVehicleNumAvailable = 176,
	FreeBuildCoastalDefenseArtillery = 177,
	FreeBuildAntiAircraftGuns = 178,
	FreeBuildBunker = 179,
	BreakthroughHardPointNewFocus = 180,
	BreakthroughHardPointDefenderFighting = 181,
	BreakthroughHardPointAttackerFighting = 182,
	BreakthroughHardPointFriendlyCapture = 183,
	BreakthroughHardPointEnemyCapture = 184,
	BreakthroughHardPointEnemySeizeTheTarget = 185,
	BreakthroughHardPointHardPointActive = 186,
	SelfActivateEarthquakeDevice = 187,
	EnemyActivateEarthquakeDevice = 188,
	SelfUndoEarthquakeDevice = 189,
	EnemyUndoEarthquakeDevice = 190,
	EarthquakeDeviceTriggerBigEarthquakeByGTI = 191,
	EarthquakeDeviceTriggerBigEarthquakeByHVK = 192,
	EarthquakeDeviceTriggerMidEarthquake = 193,
	LastButOneMidBeforeBigEarthquake = 194,
	LastMidBeforeBigEarthquake = 195,
	S1DelayToS2TriggerBigEarthquake = 196,
	S2InformEarthquakeDevice = 197,
	S2BigEarthquaking = 198,
	S2BigEarthquakePost = 199,
	S34BigEarthquakePost = 200,
	PreBigEarthquake = 201,
	DynamicLayoutTrigger = 202,
	DynamicSpawnHubTrigger = 203,
	CaptureFlagWeRecaptureTheFlag = 204,
	KillingOverloadStatePlayer = 205,
	EnterOverloadState = 206,
	BreakthroughRedEnvelopeDecelerate = 207,
	CaptureFlagWaitToRecaptureTheFlag = 208,
	AutoTriggerType = 210,
	AutoTriggerType1 = 211,
	AutoTriggerType2 = 212,
	AutoTriggerType3 = 213,
	AutoTriggerType4 = 214,
	AutoTriggerType5 = 215,
	AutoTriggerType6 = 216,
	AutoTriggerType7 = 217,
	AutoTriggerType8 = 218,
	AutoTriggerType9 = 219,
	AutoTriggerType10 = 220,
	AutoTriggerType11 = 221,
	AutoTriggerType12 = 222,
	AutoTriggerType13 = 223,
	AutoTriggerType14 = 224,
	AutoTriggerType15 = 225,
	AutoTriggerType16 = 226,
	AutoTriggerType17 = 227,
	AutoTriggerType18 = 228,
	AutoTriggerType19 = 229,
	AutoTriggerType20 = 230,
	AutoTriggerType21 = 231,
	AutoTriggerType22 = 232,
	AutoTriggerType23 = 233,
	AutoTriggerType24 = 234,
	AutoTriggerType25 = 235,
	AutoTriggerType26 = 236,
	AutoTriggerType27 = 237,
	AutoTriggerType28 = 238,
	AutoTriggerType29 = 239,
	AutoTriggerType30 = 240,
	AutoTriggerType31 = 241,
	AutoTriggerType32 = 242,
	AutoTriggerType33 = 243,
	AutoTriggerType34 = 244,
	AutoTriggerType35 = 245,
	AutoTriggerType36 = 246,
	AutoTriggerType37 = 247,
	AutoTriggerType38 = 248,
	AutoTriggerType39 = 249,
	AutoTriggerType40 = 250,
	EBreakthroughTipType_MAX = 251
};

// Object: Enum Breakthrough.ERepositionReason
enum class ERepositionReason : uint8_t
{
	None = 0,
	Expanding = 1,
	Retracting = 2,
	Insert = 3,
	Delete = 4,
	ERepositionReason_MAX = 5
};

// Object: Enum Breakthrough.EBattleSupportViewState
enum class EBattleSupportViewState : uint8_t
{
	E_None = 0,
	E_FirstOpen = 1,
	E_Selected = 2,
	E_Cancled = 3,
	E_Closed = 4,
	E_MAX = 5
};

// Object: Enum Breakthrough.ERequestCancelAutoDeployReturnCode
enum class ERequestCancelAutoDeployReturnCode : uint8_t
{
	Success = 0,
	Error_NotHighView = 1,
	ERequestCancelAutoDeployReturnCode_MAX = 2
};

// Object: Enum Breakthrough.ERequestLockTeammateLocationReturnCode
enum class ERequestLockTeammateLocationReturnCode : uint8_t
{
	Success = 0,
	Error_RebornCharacterIsNull = 1,
	Error_RebornCharacterControllerIsNull = 2,
	Error_RebornCharacterNotSelf = 3,
	Error_HaveBeReborn = 4,
	Error_CharacterIsNull = 5,
	Error_OwnerPlayerStateIsNull = 6,
	Error_OwnerCharacterCampIsInvalid = 7,
	Error_GameStateIsNull = 8,
	Error_CurrentStageIsWaitingForPlayers = 9,
	Error_NotDead = 10,
	Error_CurrentStateIsNotHighView = 11,
	Error_InCD = 12,
	Error_SelectActorIdButNotFindActor = 13,
	Error_SelectEmpty = 14,
	Error_NotTeamPlayer = 15,
	Error_TeamPlayerDie = 16,
	Error_TeamPlayerInBattle = 17,
	Error_TeamPlayerCurrentStateCannotRedeploy = 18,
	Error_TeamPlayerNotInSafeZone = 19,
	Error_TeamPlayerInTransition = 20,
	Error_TeamPlayerInVehicle = 21,
	Error_VehicleFull = 22,
	Error_VehicleNotSelfCamp = 23,
	Error_VehicleNotInSafeZone = 24,
	Error_RebornFlagNotSelfCamp = 25,
	Error_RebornFlagNoAvailableTime = 26,
	Error_EnemySpawnAreaHub = 27,
	Error_SpawnAreaHubIsNotActive = 28,
	Error_SpawnAreaHubDisableFootSoldier = 29,
	Error_AnchorBeOccupy = 30,
	Error_SectorIsNotActive = 31,
	Error_PlayerDeployVehicleCD = 32,
	Error_LockedVehicleSpawnerNotInSpawnAreaHub = 33,
	Error_LockedVehicleSpawnerTypeNotMatch = 34,
	Error_VehicleTypeNotInSpawnAreaHub = 35,
	Error_VehicleSpawnerInCD = 36,
	Error_NoAvailableVehicleSpawner = 37,
	Error_VehicleSpawnerIsAlive = 38,
	Error_TeamMateNoSpace = 39,
	Error_SceneWeaponNotSameTeam = 40,
	Error_SwitchSceneWeaponToPlayerFailed = 41,
	ERequestLockTeammateLocationReturnCode_MAX = 42
};

// Object: Enum Breakthrough.ERequestRedeployReturnCode
enum class ERequestRedeployReturnCode : uint8_t
{
	Success = 0,
	Error_RebornCharacterIsNull = 1,
	Error_RebornCharacterControllerIsNull = 2,
	Error_RebornCharacterNotSelf = 3,
	Error_HaveBeReborn = 4,
	Error_CharacterIsNull = 5,
	Error_OwnerPlayerStateIsNull = 6,
	Error_OwnerCharacterCampIsInvalid = 7,
	Error_CurrentArmBagHasDisableOrLockedWeaponItem = 8,
	Error_GameStateIsNull = 9,
	Error_CurrentStageIsWaitingForPlayers = 10,
	Error_NotDead = 11,
	Error_CurrentStateIsNotHighView = 12,
	Error_InCD = 13,
	Error_SelectActorIdButNotFindActor = 14,
	Error_SelectEmpty = 15,
	Error_SelectPlayerNotPreLock = 16,
	Error_SelectPlayerIdNotMatchPreLock = 17,
	Error_NotTeamPlayer = 18,
	Error_TeamPlayerDie = 19,
	Error_TeamPlayerInBattle = 20,
	Error_TeamPlayerCurrentStateCannotRedeploy = 21,
	Error_TeamPlayerNotInSafeZone = 22,
	Error_TeamPlayerInTransition = 23,
	Error_TeamPlayerInVehicle = 24,
	Error_VehicleIsDead = 25,
	Error_VehicleFull = 26,
	Error_VehicleNotSelfCamp = 27,
	Error_VehicleNotInSafeZone = 28,
	Error_RebornFlagNotSelfCamp = 29,
	Error_RebornFlagNoAvailableTime = 30,
	Error_NavMeshSystemIsNull = 31,
	Error_NavMeshIsNull = 32,
	Error_RebornFlagNotOnNavMesh = 33,
	Error_EnemySpawnAreaHub = 34,
	Error_SpawnAreaHubIsNotActive = 35,
	Error_SpawnAreaHubDisableFootSoldier = 36,
	Error_AnchorBeOccupy = 37,
	Error_SectorIsNotActive = 38,
	Error_PlayerDeployVehicleCD = 39,
	Error_PlayerDeployVehicleMoreSingleUseRestrict = 40,
	Error_LockedVehicleSpawnerNotInSpawnAreaHub = 41,
	Error_LockedVehicleSpawnerTypeNotMatch = 42,
	Error_VehicleTypeNotInSpawnAreaHub = 43,
	Error_VehicleSpawnerInCD = 44,
	Error_NoAvailableVehicleSpawner = 45,
	Error_VehicleSpawnerIsAlive = 46,
	Error_TeamMateNoSpace = 47,
	Error_SceneWeaponNotSameTeam = 48,
	Error_SwitchSceneWeaponToPlayerFailed = 49,
	ERequestRedeployReturnCode_MAX = 50
};

// Object: Enum Breakthrough.ERedeployLockVehicleReturnCode
enum class ERedeployLockVehicleReturnCode : uint8_t
{
	Success = 0,
	Error_SelectActorIdButNotFindActor = 1,
	Error_NotVehicle = 2,
	ERedeployLockVehicleReturnCode_MAX = 3
};

// Object: Enum Breakthrough.ERedeployLockVehicleSpawnerReturnCode
enum class ERedeployLockVehicleSpawnerReturnCode : uint8_t
{
	Success = 0,
	Error_PlayerInRedeployCD = 1,
	Error_PlayerControllerIsNull = 2,
	Error_PlayerCharacterIsNull = 3,
	Error_PlayerStateIsNull = 4,
	Error_SpawnAreaHubCampError = 5,
	Error_VehicleTypeNotInSpawnAreaHub = 6,
	Error_VehicleSpawnerInCD = 7,
	Error_NoAvailableVehicleSpawner = 8,
	Error_VehicleSpawnerIsAllDeployed = 9,
	ERedeployLockVehicleSpawnerReturnCode_MAX = 10
};

// Object: Enum Breakthrough.ERedeployStoreType
enum class ERedeployStoreType : uint8_t
{
	ERedeployStore_None = 0,
	ERedeployStore_MainWeapon = 1,
	ERedeployStore_SecondaryWeapon = 2,
	ERedeployStore_MeleeWeapon = 3,
	ERedeployStore_ArmItem = 4,
	ERedeployStore_Vehicle = 5,
	ERedeployStore_WeaponPreset = 6,
	ERedeployStore_VehicleStore = 7,
	ERedeployStore_VehiclePartStore = 8,
	ERedeployStore_MAX = 9
};

// Object: Enum Breakthrough.EBreakthroughRedeployButtonState
enum class EBreakthroughRedeployButtonState : uint8_t
{
	WaitDeploy = 5,
	Deploying = 6,
	Deployed = 7,
	EBreakthroughRedeployButtonState_MAX = 8
};

// Object: Enum Breakthrough.EVoteCurStage
enum class EVoteCurStage : uint8_t
{
	PreTeamConstruct = 0,
	OnTeamConstruct1 = 1,
	OnTeamConstruct2 = 2,
	PostTeamConstruct = 3,
	EVoteCurStage_MAX = 4
};

// Object: Enum Breakthrough.ECurStage
enum class ECurStage : uint8_t
{
	PreTeamConstruct = 0,
	OnTeamConstruct1 = 1,
	OnTeamConstruct2 = 2,
	PostTeamConstruct = 3,
	ECurStage_MAX = 4
};

// Object: Enum Breakthrough.EPlayerGamePlayImageState
enum class EPlayerGamePlayImageState : uint8_t
{
	None = 0,
	UsingMed = 1,
	Driving = 2,
	ArmForce = 3,
	Dead = 4,
	Disconnect = 5,
	QuitGame = 6,
	EPlayerGamePlayImageState_MAX = 7
};

// Object: Enum Breakthrough.ETeammateStateType
enum class ETeammateStateType : uint8_t
{
	ETeammateStateType_Normal = 0,
	ETeammateStateType_Dying = 1,
	ETeammateStateType_Dead = 2,
	ETeammateStateType_Disconnect = 3,
	ETeammateStateType_Escaped = 4,
	ETeammateStateType_QuitGame = 5,
	ETeammateStateType_Count = 6,
	ETeammateStateType_MAX = 7
};

// Object: Enum Breakthrough.EBattleFlagAnchorUIState
enum class EBattleFlagAnchorUIState : uint8_t
{
	None = 0,
	HasFlag = 1,
	NoFlag = 2,
	CoolingDown = 3,
	CaptureEnemyFlag = 4,
	CaptureEnemyFlagAndCoolingDown = 5,
	EBattleFlagAnchorUIState_MAX = 6
};

// Object: Enum Breakthrough.EBattleFlagAnchorTextState
enum class EBattleFlagAnchorTextState : uint8_t
{
	None = 0,
	SelfCampAnchorHasFlag = 1,
	SelfCampAnchorAndSelfCaptureFlag = 2,
	EnemyCampAnchorHasFlag = 3,
	EBattleFlagAnchorTextState_MAX = 4
};

// Object: Enum Breakthrough.EBattleFlagTextState
enum class EBattleFlagTextState : uint8_t
{
	None = 0,
	SelfCampFlagBeCaptured = 1,
	SelfCampFlagDroppedOrAvailable = 2,
	EnemyCampFlagBeCaptured = 3,
	EnemyCampFlagDroppedOrAvailable = 4,
	EBattleFlagTextState_MAX = 5
};

// Object: Enum Breakthrough.EChangeableStatusType
enum class EChangeableStatusType : uint8_t
{
	None = 0,
	Christmas2024 = 1,
	SpringFestival2025 = 2,
	EChangeableStatusType_MAX = 3
};

// Object: Enum Breakthrough.EEarthquakeType
enum class EEarthquakeType : uint8_t
{
	None = 0,
	SmallEarthquake = 1,
	MidEarthquake = 2,
	BigEarthquake = 3,
	EEarthquakeType_MAX = 4
};

// Object: Enum Breakthrough.EFireworkType
enum class EFireworkType : uint8_t
{
	None = 0,
	SmallFirework = 1,
	LargeFirework = 2,
	EFireworkType_MAX = 3
};

// Object: Enum Breakthrough.ERecycleFreeBuildFortificationReturnCode
enum class ERecycleFreeBuildFortificationReturnCode : uint8_t
{
	Success = 0,
	Error_OperatorCharacterNull = 1,
	Error_NoSkillConfig = 2,
	Error_GameStateNull = 3,
	Error_OperatorPlayerStateNull = 4,
	Error_NoAuthority = 5,
	Error_SceneWeaponNull = 6,
	Error_PlayerInSceneWeapon = 7,
	ERecycleFreeBuildFortificationReturnCode_MAX = 8
};

// Object: Enum Breakthrough.EInteractNewYearEggsReturnCode
enum class EInteractNewYearEggsReturnCode : uint8_t
{
	Success = 0,
	Error_OperatorCharacterNull = 1,
	Error_GameStateNull = 2,
	Error_OperatorPlayerStateNull = 3,
	Error_NoAuthority = 4,
	Error_OperatorNotInVehicle = 5,
	EInteractNewYearEggsReturnCode_MAX = 6
};

// Object: Enum Breakthrough.EInteractVehicleSupplyStationReturnCode
enum class EInteractVehicleSupplyStationReturnCode : uint8_t
{
	Success = 0,
	Error_OperatorCharacterNull = 1,
	Error_GameStateNull = 2,
	Error_OperatorPlayerStateNull = 3,
	Error_NoAuthority = 4,
	Error_OperatorNotInVehicle = 5,
	EInteractVehicleSupplyStationReturnCode_MAX = 6
};

// Object: Enum Breakthrough.EFortificationBuildWeapon
enum class EFortificationBuildWeapon : uint8_t
{
	EFortificationBuildWeapon_None = 0,
	EFortificationBuildWeapon_Hammer = 1,
	EFortificationBuildWeapon_MAX = 2
};

// Object: Enum Breakthrough.EFortificationType
enum class EFortificationType : uint8_t
{
	EFortificationType_None = 0,
	EFortificationType_AmmoBox = 1,
	EFortificationType_SceneWeapon = 2,
	EFortificationType_BreakableItem = 3,
	EFortificationType_FreeConstruction = 4,
	EFortificationType_MAX = 5
};

// Object: Enum Breakthrough.EBreakthroughPlayerLifeStats
enum class EBreakthroughPlayerLifeStats : uint8_t
{
	TotalFightAsCommander = 0,
	Commander_Win = 1,
	Commander_Gametime = 2,
	Commander_Score = 3,
	Commander_Kill = 4,
	Commander_Death = 5,
	Commander_Like = 6,
	Commander_Recommand = 7,
	Win_Ratio = 8,
	Kill_By_Vehicle_Per_Minute = 9,
	Defeat_By_Per_Minute = 10,
	Help_Per_Minute = 11,
	Percentile_Of_Win_Ration = 12,
	Percentile_Of_Kill_By_Vehicle_Per_Minute = 13,
	Percentile_Of_Defeat_By_Per_Minute = 14,
	Percentile_Of_Help_Per_Minute = 15,
	Commander_Play = 16,
	TotalNum = 17,
	EBreakthroughPlayerLifeStats_MAX = 18
};

// Object: Enum Breakthrough.EBreakthroughStage
enum class EBreakthroughStage : uint8_t
{
	None = 0,
	LoadingMap = 1,
	WaitingForPlayers = 2,
	PreElection = 3,
	OnElection = 4,
	ElectionResult = 5,
	PreTeamConstruct = 6,
	OnTeamConstruct = 7,
	PostTeamConstruct = 8,
	PreMatch = 9,
	EntryCutscene = 10,
	Fighting = 11,
	BattleEnd = 12,
	EBreakthroughStage_MAX = 13
};

// Object: Enum Breakthrough.ESlotCompType
enum class ESlotCompType : uint8_t
{
	ESlotCompType_None = 0,
	ESlotCompType_Countdown = 1,
	ESlotCompType_Using = 2,
	ESlotCompType_Selected = 3,
	ESlotCompType_SmallLock = 4,
	ESlotCompType_Ban = 5,
	ESlotCompType_CommonPoint = 6,
	ESlotCompType_OnlyDFIcon = 7,
	ESlotCompType_Custom = 8,
	ESlotCompType_Check = 9,
	ESlotCompType_MAX = 10
};

// Object: Enum Breakthrough.ERedeployZOrderInsideRedeployMarker
enum class ERedeployZOrderInsideRedeployMarker : uint8_t
{
	None = 0,
	SelectQuad = 1,
	VehicleHub = 100,
	Top = 200,
	ERedeployZOrderInsideRedeployMarker_MAX = 201
};

// Object: Enum Breakthrough.ERedeployShowStage
enum class ERedeployShowStage : uint8_t
{
	Global = 0,
	Zoom = 1,
	ERedeployShowStage_MAX = 2
};

// Object: Enum Breakthrough.ERedeployMarkerType
enum class ERedeployMarkerType : uint8_t
{
	None = 0,
	SectorText = 1,
	CampPoint = 2,
	CampPointWithVehicle = 3,
	VehicleSelectQuad = 4,
	SameCampRebornFlag = 5,
	EnemyCampRebornFlag = 6,
	TeamDie = 7,
	SameCampDie = 8,
	EnemyCampDie = 9,
	VehiclePoint = 10,
	NeutralVehiclePoint = 11,
	EnemyCampVehiclePoint = 12,
	SameCampVehiclePoint = 13,
	TeamVehiclePoint = 14,
	EnemyCampPoint = 15,
	SameCampPoint = 16,
	TeammatePoint = 17,
	SameTeamLeader = 18,
	SectorAnchorInBattle = 19,
	SectorAnchorNormal = 20,
	RebornFlag = 21,
	SelectedPoint = 22,
	RandomReborn = 23,
	StaticPoint = 24,
	TeamStaticPoint = 25,
	CampStaticPoint = 26,
	EnemyStaticPoint = 27,
	CaptureFlagBase = 28,
	ERedeployMarkerType_MAX = 29
};

// Object: Enum Breakthrough.ERedeployKeybordMoveDirection
enum class ERedeployKeybordMoveDirection : uint8_t
{
	None = 0,
	Up = 1,
	Down = 2,
	Left = 3,
	Right = 4,
	ERedeployKeybordMoveDirection_MAX = 5
};

// Object: Enum Breakthrough.EReDeployVehicleItemViewUnDeployReason
enum class EReDeployVehicleItemViewUnDeployReason : uint8_t
{
	None = 0,
	TriggerSingleUseLimitation = 1,
	NoAvailableVehicle = 2,
	VehicleSpawnerCD = 3,
	PlayerDeployVehicleCD = 4,
	GroupVehicleLimitReached = 5,
	InsufficientScore = 6,
	EReDeployVehicleItemViewUnDeployReason_MAX = 7
};

// Object: Enum Breakthrough.EFlagAudioType
enum class EFlagAudioType : uint8_t
{
	E_Flag_Raise = 0,
	E_Flag_Down = 1,
	E_Flag_MoveDownStop = 2,
	E_Flag_MoveTopStop = 3,
	E_Flag_MAX = 4
};

// Object: Enum Breakthrough.EFlagStlyeType
enum class EFlagStlyeType : uint8_t
{
	E_FlagNeutralType = 0,
	E_FlagDefenseType = 1,
	E_FlagOffenseType = 2,
	E_MAX = 3
};

// Object: Enum Breakthrough.ESectorAnchorFlagState
enum class ESectorAnchorFlagState : uint8_t
{
	E_FlagDisActive = 0,
	E_FlagOwnedByDefense = 1,
	E_FlagDefenseLeading = 2,
	E_FlagNeutral = 3,
	E_FlagOffenseLeading = 4,
	E_FlagOwnedByOffense = 5,
	E_MAX = 6
};

// Object: ScriptStruct Breakthrough.ElectionChatInfo
// Size: 0x20 (Inherited: 0x0)
struct FElectionChatInfo
{
	int32_t ChatType; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	uint64_t SenderID; // 0x8(0x8)
	struct FString Message; // 0x10(0x10)
};

// Object: ScriptStruct Breakthrough.BreakthroughRedeploySelectPointTweenData
// Size: 0x1C (Inherited: 0x0)
struct FBreakthroughRedeploySelectPointTweenData
{
	uint8_t Pad_0x0[0x1C]; // 0x0(0x1C)
};

// Object: ScriptStruct Breakthrough.AreaActorInfo
// Size: 0x20 (Inherited: 0x0)
struct FAreaActorInfo
{
	struct ADFMCharacter* CHARACTER; // 0x0(0x8)
	struct ADFMVehicleBase* Vehicle; // 0x8(0x8)
	struct FVector Location; // 0x10(0xC)
	int32_t Camp; // 0x1C(0x4)
};

// Object: ScriptStruct Breakthrough.SpawnAreaHubGroup
// Size: 0x10 (Inherited: 0x0)
struct FSpawnAreaHubGroup
{
	struct TArray<struct TSoftObjectPtr<ASpawnAreaHub>> Content; // 0x0(0x10)
};

// Object: ScriptStruct Breakthrough.TeamConstructArrayItem
// Size: 0x18 (Inherited: 0x0)
struct FTeamConstructArrayItem
{
	struct ADFMPlayerState* CachedPS; // 0x0(0x8)
	int32_t PreviewTeam; // 0x8(0x4)
	uint8_t bPreviewLeader : 1; // 0xC(0x1), Mask(0x1)
	uint8_t BitPad_0xC_1 : 7; // 0xC(0x1)
	uint8_t Pad_0xD[0x1]; // 0xD(0x1)
	int16_t ChoosedWork; // 0xE(0x2)
	int16_t WorkRank; // 0x10(0x2)
	uint8_t Pad_0x12[0x2]; // 0x12(0x2)
	int32_t OutGameTeamID; // 0x14(0x4)
};

// Object: ScriptStruct Breakthrough.TeamLeaderImpeachItem
// Size: 0x20 (Inherited: 0x0)
struct FTeamLeaderImpeachItem
{
	struct ADFMPlayerState* Impeacher; // 0x0(0x8)
	struct ADFMPlayerState* OldLeader; // 0x8(0x8)
	int32_t CountDown; // 0x10(0x4)
	int32_t TeamID; // 0x14(0x4)
	int32_t State; // 0x18(0x4)
	int32_t Approved; // 0x1C(0x4)
};

// Object: ScriptStruct Breakthrough.CommanderVehicleThreatInfo
// Size: 0x28 (Inherited: 0x0)
struct FCommanderVehicleThreatInfo
{
	int32_t Camp; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct ADFMVehicleBase* MarkingVehicle; // 0x8(0x8)
	struct AGPCharacter* MarkingCharacter; // 0x10(0x8)
	struct TArray<struct AGPCharacter*> AssistPlayers; // 0x18(0x10)
};

// Object: ScriptStruct Breakthrough.MapGemGameSettings
// Size: 0x58 (Inherited: 0x10)
struct FMapGemGameSettings : FDescRowBase
{
	struct FName HeatMapTag; // 0x10(0x8)
	struct FGemGameSettings GemGameSettings; // 0x18(0x40)
};

// Object: ScriptStruct Breakthrough.RedeployCommanders
// Size: 0x10 (Inherited: 0x0)
struct FRedeployCommanders
{
	struct TArray<struct FString> Commanders; // 0x0(0x10)
};

// Object: ScriptStruct Breakthrough.RedeployCommanderConfigRow
// Size: 0x68 (Inherited: 0x10)
struct FRedeployCommanderConfigRow : FDescRowBase
{
	struct FName TagName; // 0x10(0x8)
	struct TMap<ERedeployStateFuture, struct FRedeployCommanders> RedeployCommanders; // 0x18(0x50)
};

// Object: ScriptStruct Breakthrough.BehaviorScoreExtraByTagDataRow
// Size: 0x68 (Inherited: 0x10)
struct FBehaviorScoreExtraByTagDataRow : FDescRowBase
{
	struct FName ScoreConfigTag; // 0x10(0x8)
	struct TMap<struct FName, struct FBehaviorScoreExtraData> BehaviorScoreExtraData; // 0x18(0x50)
};

// Object: ScriptStruct Breakthrough.BattleFieldMarkingItemArray
// Size: 0x10 (Inherited: 0x0)
struct FBattleFieldMarkingItemArray
{
	struct TArray<struct FBattleFieldMarkingItemData> MarkingItemArray; // 0x0(0x10)
};

// Object: ScriptStruct Breakthrough.BattleFieldMarkingItemData
// Size: 0x78 (Inherited: 0x0)
struct FBattleFieldMarkingItemData
{
	EBattleFieldMarkingItemType ItemType; // 0x0(0x1)
	EQuickChatMarkingItemType QuickChatItemType; // 0x1(0x1)
	uint8_t Pad_0x2[0x6]; // 0x2(0x6)
	struct FText MarkingItemText; // 0x8(0x18)
	struct FText MarkingItemDetailText; // 0x20(0x18)
	struct FSoftObjectPath MarkingItemIcon; // 0x38(0x18)
	struct FString CharacterVOName; // 0x50(0x10)
	float VOPlayIntervals; // 0x60(0x4)
	struct FLinearColor SlateColor; // 0x64(0x10)
	ETacticalMarkingType TacticalMarkingType; // 0x74(0x1)
	uint8_t Pad_0x75[0x3]; // 0x75(0x3)
};

// Object: ScriptStruct Breakthrough.VehicleThreatInfo
// Size: 0x18 (Inherited: 0x0)
struct FVehicleThreatInfo
{
	int32_t threatValue; // 0x0(0x4)
	int32_t Camp; // 0x4(0x4)
	struct TArray<struct AGPCharacter*> AssistPlayers; // 0x8(0x10)
};

// Object: ScriptStruct Breakthrough.RankSkillBackgroundUIInfo
// Size: 0x28 (Inherited: 0x0)
struct FRankSkillBackgroundUIInfo
{
	struct FSoftObjectPath IconPath; // 0x0(0x18)
	struct FLinearColor IconColor; // 0x18(0x10)
};

// Object: ScriptStruct Breakthrough.ConquestTopBarScoreInfo
// Size: 0x8 (Inherited: 0x0)
struct FConquestTopBarScoreInfo
{
	EConquestTopBarScoreType TopBarScoreType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t AddScore; // 0x4(0x4)
};

// Object: ScriptStruct Breakthrough.AnchorSpawnAreaGroup
// Size: 0x10 (Inherited: 0x0)
struct FAnchorSpawnAreaGroup
{
	struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>> Content; // 0x0(0x10)
};

// Object: ScriptStruct Breakthrough.PlayerInAnchorTimeInfo
// Size: 0x8 (Inherited: 0x0)
struct FPlayerInAnchorTimeInfo
{
	float EnterAnchorStartTime; // 0x0(0x4)
	float InAnchorFightTime; // 0x4(0x4)
};

// Object: ScriptStruct Breakthrough.CampOccupyRuntimeData
// Size: 0x60 (Inherited: 0x0)
struct FCampOccupyRuntimeData
{
	uint8_t Pad_0x0[0x58]; // 0x0(0x58)
	int32_t AliveCharactersNum; // 0x58(0x4)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
};

// Object: ScriptStruct Breakthrough.CampOccupyConfig
// Size: 0x30 (Inherited: 0x0)
struct FCampOccupyConfig
{
	int32_t CampId; // 0x0(0x4)
	float OccupySpeedFactor; // 0x4(0x4)
	struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>> InnerSpawnAreas; // 0x8(0x10)
	struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>> OuterSpawnAreas; // 0x18(0x10)
	struct ASpawnAreaHub* SpawnAreaHub; // 0x28(0x8)
};

// Object: ScriptStruct Breakthrough.BattleSectorExtraData
// Size: 0x20 (Inherited: 0x0)
struct FBattleSectorExtraData
{
	int32_t SerialNumber; // 0x0(0x4)
	int32_t AddVoteNum; // 0x4(0x4)
	int32_t ForbidHalfJoinVoteNum; // 0x8(0x4)
	uint8_t EnableHalfJoin; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	int32_t ForbidHalfJoinKillNum; // 0x10(0x4)
	float MatchDuration; // 0x14(0x4)
	float SectorTransTime; // 0x18(0x4)
	float CommanderSectorTransTime; // 0x1C(0x4)
};

// Object: ScriptStruct Breakthrough.BattleSectorExtraRow
// Size: 0x68 (Inherited: 0x10)
struct FBattleSectorExtraRow : FDescRowBase
{
	int32_t MapID; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct TMap<int32_t, struct FBattleSectorExtraData> BattleSectorExtraDataMap; // 0x18(0x50)
};

// Object: ScriptStruct Breakthrough.BattleSectorConcentratedFireRow
// Size: 0x68 (Inherited: 0x10)
struct FBattleSectorConcentratedFireRow : FDescRowBase
{
	int32_t MapID; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct TMap<int32_t, struct FName> BattleSectorConcentratedFireData; // 0x18(0x50)
};

// Object: ScriptStruct Breakthrough.BattleConcentratedFireRow
// Size: 0x60 (Inherited: 0x10)
struct FBattleConcentratedFireRow : FDescRowBase
{
	struct FName ConcentratedFireId; // 0x10(0x8)
	float CheckInterval; // 0x18(0x4)
	float CheckDelay; // 0x1C(0x4)
	float DisableCheckProgress; // 0x20(0x4)
	float AttackerBehaviorScoreMultiplier; // 0x24(0x4)
	float DefenderBehaviorScoreMultiplier; // 0x28(0x4)
	float AttackerUnitTimeScoreMultiplierWhenActivated; // 0x2C(0x4)
	float DefenderUnitTimeScoreMultiplierWhenActivated; // 0x30(0x4)
	int32_t AttackerBalanceScoreForTriggerDetection; // 0x34(0x4)
	int32_t DefenderBalanceScoreForTriggerDetection; // 0x38(0x4)
	int32_t AttackerBalanceScoreForCompleteCommand; // 0x3C(0x4)
	int32_t DefenderBalanceScoreForCompleteCommand; // 0x40(0x4)
	float AttackerCommandTime; // 0x44(0x4)
	float DefenderCommandTime; // 0x48(0x4)
	float AttackerDoneCommanderScoreMultiplier; // 0x4C(0x4)
	float DefenderDoneCommanderScoreMultiplier; // 0x50(0x4)
	float AttackerDoneCampScoreMultiplier; // 0x54(0x4)
	float DefenderDoneCampScoreMultiplier; // 0x58(0x4)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
};

// Object: ScriptStruct Breakthrough.HighThreatVehicleInfo
// Size: 0x10 (Inherited: 0x0)
struct FHighThreatVehicleInfo
{
	int32_t VehicleId; // 0x0(0x4)
	int32_t threatValue; // 0x4(0x4)
	float ScoreToThreatRatio; // 0x8(0x4)
	float BehaviorScoreMultiplier; // 0xC(0x4)
};

// Object: ScriptStruct Breakthrough.BattleFieldHighThreatVehicleRow
// Size: 0xD0 (Inherited: 0x10)
struct FBattleFieldHighThreatVehicleRow : FDescRowBase
{
	int32_t MapID; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct TMap<int32_t, struct FHighThreatVehicleInfo> AttackerVehicleConfig; // 0x18(0x50)
	struct TMap<int32_t, struct FHighThreatVehicleInfo> DefenderVehicleConfig; // 0x68(0x50)
	float CheckHighThreatInterval; // 0xB8(0x4)
	float CheckCDWhileHighThreatDead; // 0xBC(0x4)
	float CommandRemainTime; // 0xC0(0x4)
	float AttackerDoneCommanderScoreMultiplier; // 0xC4(0x4)
	float DefenderDoneCommanderScoreMultiplier; // 0xC8(0x4)
	uint8_t Pad_0xCC[0x4]; // 0xCC(0x4)
};

// Object: ScriptStruct Breakthrough.BattleSectorDefines
// Size: 0x58 (Inherited: 0x10)
struct FBattleSectorDefines : FDescRowBase
{
	int32_t SerialNumber; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct FText SectorName; // 0x18(0x18)
	float MatchDuration; // 0x30(0x4)
	int32_t AddVoteNum; // 0x34(0x4)
	float SectorTransTime; // 0x38(0x4)
	float CommanderSectorTransTime; // 0x3C(0x4)
	int32_t ForbidHalfJoinVoteNum; // 0x40(0x4)
	uint8_t EnableHalfJoin : 1; // 0x44(0x1), Mask(0x1)
	uint8_t BitPad_0x44_1 : 7; // 0x44(0x1)
	uint8_t Pad_0x45[0x3]; // 0x45(0x3)
	int32_t ForbidHalfJoinKillNum; // 0x48(0x4)
	float ForbidHalfJoinOccupyProgress; // 0x4C(0x4)
	float EnableHalfJoinOccupyProgress; // 0x50(0x4)
	uint8_t EnablePreloadTerrain : 1; // 0x54(0x1), Mask(0x1)
	uint8_t BitPad_0x54_1 : 7; // 0x54(0x1)
	uint8_t Pad_0x55[0x3]; // 0x55(0x3)
};

// Object: ScriptStruct Breakthrough.BattleFieldQuestObjectiveTipData
// Size: 0xC0 (Inherited: 0x0)
struct FBattleFieldQuestObjectiveTipData
{
	uint8_t IsUpdateObjective : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct FString DescText; // 0x8(0x10)
	struct FString BriefDescText; // 0x18(0x10)
	struct FString ProgressText; // 0x28(0x10)
	EBattleFieldQuestObjectionState ObjState; // 0x38(0x1)
	EGoalType ObjType; // 0x39(0x1)
	uint8_t Pad_0x3A[0x6]; // 0x3A(0x6)
	int64_t QuestObjectiveID; // 0x40(0x8)
	uint8_t bTimerStart : 1; // 0x48(0x1), Mask(0x1)
	uint8_t BitPad_0x48_1 : 7; // 0x48(0x1)
	uint8_t Pad_0x49[0x3]; // 0x49(0x3)
	float TimeLimitSec; // 0x4C(0x4)
	float TimeoutSec; // 0x50(0x4)
	int32_t QuestID; // 0x54(0x4)
	struct FString QuestName; // 0x58(0x10)
	struct FString QuestAwardIcon; // 0x68(0x10)
	struct FName QuestAwardID; // 0x78(0x8)
	struct FText QuestDesc; // 0x80(0x18)
	EBattleFieldQuestState QuestState; // 0x98(0x1)
	uint8_t Pad_0x99[0x3]; // 0x99(0x3)
	float QuestReward; // 0x9C(0x4)
	struct FText QuestConditionDes; // 0xA0(0x18)
	uint8_t bIsOnlyInGame : 1; // 0xB8(0x1), Mask(0x1)
	uint8_t BitPad_0xB8_1 : 7; // 0xB8(0x1)
	uint8_t Pad_0xB9[0x7]; // 0xB9(0x7)
};

// Object: ScriptStruct Breakthrough.BigEventSeqAndLevelConfig
// Size: 0x88 (Inherited: 0x0)
struct FBigEventSeqAndLevelConfig
{
	struct TArray<struct FString> NeedUnloadSubWorlds; // 0x0(0x10)
	struct TArray<struct FString> NeedLoadSubWorlds; // 0x10(0x10)
	struct FString NeedLoadLevel; // 0x20(0x10)
	struct FString NeedLoadLevelMobile; // 0x30(0x10)
	struct FString NeedLoadPRT; // 0x40(0x10)
	struct FString NeedLoadPRTMobile; // 0x50(0x10)
	struct TArray<struct FSoftObjectPath> CoorSequencePath; // 0x60(0x10)
	struct TArray<struct FBigEventQualitySequencePathData> CoorSequencePathMobile; // 0x70(0x10)
	struct FName DisableForbiddenAreaTagName; // 0x80(0x8)
};

// Object: ScriptStruct Breakthrough.BigEventQualitySequencePathData
// Size: 0x20 (Inherited: 0x0)
struct FBigEventQualitySequencePathData
{
	EPerfGearQualityLevel QualityLevel; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct FSoftObjectPath SequencePath; // 0x8(0x18)
};

// Object: ScriptStruct Breakthrough.BreakthroughMapAutoScaleConfigRow
// Size: 0x18 (Inherited: 0x8)
struct FBreakthroughMapAutoScaleConfigRow : FTableRowBase
{
	struct FName MapID; // 0x8(0x8)
	uint8_t bEnable : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	float CoverRange; // 0x14(0x4)
};

// Object: ScriptStruct Breakthrough.CaptureFlagModeFlagInfo
// Size: 0x20 (Inherited: 0x0)
struct FCaptureFlagModeFlagInfo
{
	struct ABattleFlagAnchor* SelfFlagAnchor; // 0x0(0x8)
	struct ABattleFlag* SelfFlag; // 0x8(0x8)
	struct ABattleFlagAnchor* EnemyFlagAnchor; // 0x10(0x8)
	struct ABattleFlag* EnemyFlag; // 0x18(0x8)
};

// Object: ScriptStruct Breakthrough.JobDetailInfoForCaptureFlag
// Size: 0x30 (Inherited: 0x0)
struct FJobDetailInfoForCaptureFlag
{
	struct ADFMAIPlayerController* Controller; // 0x0(0x8)
	float JobTime; // 0x8(0x4)
	struct FVector FlagLocation; // 0xC(0xC)
	struct ABattleFlagAnchor* JobTarget; // 0x18(0x8)
	struct ABattleFlag* BattleFlag; // 0x20(0x8)
	uint8_t Pad_0x28[0x8]; // 0x28(0x8)
};

// Object: ScriptStruct Breakthrough.TargetJobAnchorAiPlayers
// Size: 0x10 (Inherited: 0x0)
struct FTargetJobAnchorAiPlayers
{
	struct TArray<struct ADFMAIPlayerController*> Controllers; // 0x0(0x10)
};

// Object: ScriptStruct Breakthrough.TargetJobAnchorAiCollectInfo
// Size: 0x50 (Inherited: 0x0)
struct FTargetJobAnchorAiCollectInfo
{
	struct TMap<struct AActor*, struct FTargetJobAnchorAiPlayers> JobAnchorAssignMap; // 0x0(0x50)
};

// Object: ScriptStruct Breakthrough.ObjectiveSectorInfoForAi
// Size: 0x98 (Inherited: 0x0)
struct FObjectiveSectorInfoForAi
{
	ESectorAnchorFlagState State; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t AttackCampBotNum; // 0x4(0x4)
	struct TArray<struct ADFMCharacter*> AttackCampBots; // 0x8(0x10)
	int32_t AttackFlankBotNum; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	struct TArray<struct ADFMCharacter*> AttackFlankBots; // 0x20(0x10)
	int32_t DefendCampBotNum; // 0x30(0x4)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
	struct TArray<struct ADFMCharacter*> DefendCampBots; // 0x38(0x10)
	int32_t DefendFlankBotNum; // 0x48(0x4)
	uint8_t Pad_0x4C[0x4]; // 0x4C(0x4)
	struct TArray<struct ADFMCharacter*> DefendFlankBots; // 0x50(0x10)
	int32_t AttackNumInSector; // 0x60(0x4)
	int32_t AttackBotNumInSector; // 0x64(0x4)
	struct TArray<struct ADFMCharacter*> AttackBotsInSector; // 0x68(0x10)
	int32_t DefendNumInSector; // 0x78(0x4)
	int32_t DefendBotNumInSector; // 0x7C(0x4)
	struct TArray<struct ADFMCharacter*> DefendBotsInSector; // 0x80(0x10)
	int32_t Priority; // 0x90(0x4)
	uint8_t Pad_0x94[0x4]; // 0x94(0x4)
};

// Object: ScriptStruct Breakthrough.SpawnTypeRealtimeVehiclesModifyInfo
// Size: 0x58 (Inherited: 0x0)
struct FSpawnTypeRealtimeVehiclesModifyInfo
{
	uint8_t Pad_0x0[0x58]; // 0x0(0x58)
};

// Object: ScriptStruct Breakthrough.RealtimeVehicleModifyInfo
// Size: 0x58 (Inherited: 0x0)
struct FRealtimeVehicleModifyInfo
{
	uint8_t Pad_0x0[0x58]; // 0x0(0x58)
};

// Object: ScriptStruct Breakthrough.RealtimeVehiclePartModifyInfo
// Size: 0x10 (Inherited: 0x0)
struct FRealtimeVehiclePartModifyInfo
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct Breakthrough.VehicleSceneWeaponGameplayState
// Size: 0x10 (Inherited: 0x0)
struct FVehicleSceneWeaponGameplayState
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct Breakthrough.VehicleSceneWeaponGameplayInfo
// Size: 0x18 (Inherited: 0x0)
struct FVehicleSceneWeaponGameplayInfo
{
	uint8_t Pad_0x0[0x18]; // 0x0(0x18)
};

// Object: ScriptStruct Breakthrough.CommanderModeVotePlayerInfo
// Size: 0x20 (Inherited: 0x0)
struct FCommanderModeVotePlayerInfo
{
	uint8_t Pad_0x0[0x20]; // 0x0(0x20)
};

// Object: ScriptStruct Breakthrough.CommanderModePlayerInfo
// Size: 0x30 (Inherited: 0x0)
struct FCommanderModePlayerInfo
{
	uint8_t Pad_0x0[0x30]; // 0x0(0x30)
};

// Object: ScriptStruct Breakthrough.BreakthroughSceneWeaponInfo
// Size: 0x8 (Inherited: 0x0)
struct FBreakthroughSceneWeaponInfo
{
	int32_t SceneWeaponUsingNum; // 0x0(0x4)
	float SceneWeaponUsingTime; // 0x4(0x4)
};

// Object: ScriptStruct Breakthrough.SectorKillInfo
// Size: 0x10 (Inherited: 0x0)
struct FSectorKillInfo
{
	int32_t SectorID; // 0x0(0x4)
	int32_t CampId; // 0x4(0x4)
	uint8_t bKillerIsAI : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t bKilledIsAI : 1; // 0x9(0x1), Mask(0x1)
	uint8_t BitPad_0x9_1 : 7; // 0x9(0x1)
	uint8_t Pad_0xA[0x2]; // 0xA(0x2)
	int32_t KillerBodyStatus; // 0xC(0x4)
};

// Object: ScriptStruct Breakthrough.BreakthroughModeTgLogs
// Size: 0x48 (Inherited: 0x0)
struct FBreakthroughModeTgLogs
{
	int32_t SectorID; // 0x0(0x4)
	int32_t CampId; // 0x4(0x4)
	int32_t SectorCostTime; // 0x8(0x4)
	int32_t ScoreMost; // 0xC(0x4)
	int32_t Scoreleast; // 0x10(0x4)
	int32_t ScoreAverage; // 0x14(0x4)
	int32_t AddLeftVotes; // 0x18(0x4)
	int32_t CurLeftVotes; // 0x1C(0x4)
	int32_t StrikeBackStartTime; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct FString SectorActiveTime; // 0x28(0x10)
	struct FString SectorAnchorFirstEntryTime; // 0x38(0x10)
};

// Object: ScriptStruct Breakthrough.BattleRankSkillInfo
// Size: 0x28 (Inherited: 0x0)
struct FBattleRankSkillInfo
{
	int32_t SectorID; // 0x0(0x4)
	int32_t CampId; // 0x4(0x4)
	int32_t SkillId; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	uint64_t UseSkillPlayerId; // 0x10(0x8)
	int32_t SkillUsingNum; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	uint64_t VehicleId; // 0x20(0x8)
};

// Object: ScriptStruct Breakthrough.PlayerSwitchArmItemInfo
// Size: 0x18 (Inherited: 0x0)
struct FPlayerSwitchArmItemInfo
{
	uint64_t ExpertId; // 0x0(0x8)
	uint64_t ArmItemID; // 0x8(0x8)
	int32_t SwitchNum; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct Breakthrough.RoundRedeployTLogInfo
// Size: 0x30 (Inherited: 0x0)
struct FRoundRedeployTLogInfo
{
	struct FString EnterFirstDeployViewTime; // 0x0(0x10)
	struct FString BeginFirstDeployTime; // 0x10(0x10)
	struct FString FirstOpenDeployViewTime; // 0x20(0x10)
};

// Object: ScriptStruct Breakthrough.OnePlayerOneSectorData
// Size: 0x30 (Inherited: 0x0)
struct FOnePlayerOneSectorData
{
	int32_t InIntData; // 0x0(0x4)
	int32_t InIntData1; // 0x4(0x4)
	float InFloatData; // 0x8(0x4)
	float InFloatData1; // 0xC(0x4)
	uint64_t InUint64Data; // 0x10(0x8)
	uint64_t InUint64Data1; // 0x18(0x8)
	struct FName InNameData; // 0x20(0x8)
	uint8_t InBoolData : 1; // 0x28(0x1), Mask(0x1)
	uint8_t BitPad_0x28_1 : 7; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
};

// Object: ScriptStruct Breakthrough.OnePlayerOneSectorTLogInfo
// Size: 0x320 (Inherited: 0x0)
struct FOnePlayerOneSectorTLogInfo
{
	float BackpackStayTime; // 0x0(0x4)
	int32_t Score; // 0x4(0x4)
	int32_t SpawnRebornFlagNum; // 0x8(0x4)
	int32_t TeammateRebornOnMyRebornFlagNum; // 0xC(0x4)
	uint8_t bHalfJoinGame : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t bTeamIntoGame : 1; // 0x11(0x1), Mask(0x1)
	uint8_t BitPad_0x11_1 : 7; // 0x11(0x1)
	uint8_t Pad_0x12[0x2]; // 0x12(0x2)
	uint32_t MarkingTotalCount; // 0x14(0x4)
	uint32_t MarkingLocationCount; // 0x18(0x4)
	float RedeployStayTime; // 0x1C(0x4)
	float SwitchHeroStayTime; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct TMap<struct FName, int32_t> EnterSectorNumMap; // 0x28(0x50)
	struct TMap<struct FName, float> EnterSectorTimeMap; // 0x78(0x50)
	struct TMap<struct FName, float> JoinSectorTimeMap; // 0xC8(0x50)
	struct TMap<struct FName, int32_t> KillNumInSectorMap; // 0x118(0x50)
	struct TMap<struct FName, int32_t> DeathNumInSectorMap; // 0x168(0x50)
	struct TMap<int32_t, int32_t> BattleSupportUseNumMap; // 0x1B8(0x50)
	struct TMap<int32_t, int32_t> BattleSupportAssistNumMap; // 0x208(0x50)
	struct TMap<int32_t, int32_t> BattleSupportKillNumMap; // 0x258(0x50)
	struct TMap<int32_t, int32_t> BattleSupportCostScoreMap; // 0x2A8(0x50)
	struct FString ChristmasAmmoInteractorTimes; // 0x2F8(0x10)
	struct FString ArknightsAmmoInteractorTimes; // 0x308(0x10)
	uint8_t Pad_0x318[0x8]; // 0x318(0x8)
};

// Object: ScriptStruct Breakthrough.RescueTLogInfo
// Size: 0x38 (Inherited: 0x0)
struct FRescueTLogInfo
{
	int32_t ImpendingDeathSectorID; // 0x0(0x4)
	uint8_t bIsSuccess : 1; // 0x4(0x1), Mask(0x1)
	uint8_t BitPad_0x4_1 : 7; // 0x4(0x1)
	uint8_t bImpendingDeathInAnchor : 1; // 0x5(0x1), Mask(0x1)
	uint8_t BitPad_0x5_1 : 7; // 0x5(0x1)
	uint8_t Pad_0x6[0x2]; // 0x6(0x2)
	struct FVector ImpendingDeathLocation; // 0x8(0xC)
	uint8_t bRescued : 1; // 0x14(0x1), Mask(0x1)
	uint8_t BitPad_0x14_1 : 7; // 0x14(0x1)
	ERescueFailureReason RescueFailureReason; // 0x15(0x1)
	uint8_t Pad_0x16[0x2]; // 0x16(0x2)
	uint64_t RescuePlayerUin; // 0x18(0x8)
	float RequestRescueStartTime; // 0x20(0x4)
	float RequestRescueEndTime; // 0x24(0x4)
	uint32_t RequestRescueCount; // 0x28(0x4)
	uint32_t ResponseRescueCount; // 0x2C(0x4)
	float DeathTime; // 0x30(0x4)
	float AbandonTime; // 0x34(0x4)
};

// Object: ScriptStruct Breakthrough.MidWithdrawalTLogInfo
// Size: 0x24 (Inherited: 0x0)
struct FMidWithdrawalTLogInfo
{
	int32_t SectorID; // 0x0(0x4)
	float JoinGameTime; // 0x4(0x4)
	float MidWithdrawalTime; // 0x8(0x4)
	int32_t AttackerLeftVotes; // 0xC(0x4)
	float SectorRemainTime; // 0x10(0x4)
	int32_t TotalKillNum; // 0x14(0x4)
	int32_t TotalDeathNum; // 0x18(0x4)
	int32_t TotalRankScore; // 0x1C(0x4)
	int32_t TeammateNum; // 0x20(0x4)
};

// Object: ScriptStruct Breakthrough.RedeployInfo
// Size: 0x40 (Inherited: 0x0)
struct FRedeployInfo
{
	int32_t SectorID; // 0x0(0x4)
	int32_t CampId; // 0x4(0x4)
	uint64_t RedeployPlayerID; // 0x8(0x8)
	ERebornPositionType RebornPosition; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	int32_t VehicleId; // 0x14(0x4)
	int32_t VehicleCairrierID; // 0x18(0x4)
	int32_t BattleClass; // 0x1C(0x4)
	struct FString SpawnAreaName; // 0x20(0x10)
	struct FString SpawnTeammatePointName; // 0x30(0x10)
};

// Object: ScriptStruct Breakthrough.SectorAnchorBattleInfo
// Size: 0x48 (Inherited: 0x0)
struct FSectorAnchorBattleInfo
{
	int32_t SectorID; // 0x0(0x4)
	int32_t CampId; // 0x4(0x4)
	struct FString AnchorID; // 0x8(0x10)
	ESectorAnchorState SectorAnchorState; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
	int32_t StateChangeTime; // 0x1C(0x4)
	int32_t SectorAnchorBattleTime; // 0x20(0x4)
	float OccupiedPercent; // 0x24(0x4)
	int32_t Camp0InAnchor; // 0x28(0x4)
	int32_t Camp1InAnchor; // 0x2C(0x4)
	int32_t AttackerLeftVotes; // 0x30(0x4)
	float BalanceValue; // 0x34(0x4)
	uint8_t IsConcentratedFireSectorAnchor : 1; // 0x38(0x1), Mask(0x1)
	uint8_t BitPad_0x38_1 : 7; // 0x38(0x1)
	uint8_t Pad_0x39[0x3]; // 0x39(0x3)
	int32_t OwnerCamp; // 0x3C(0x4)
	int32_t OwnerForceType; // 0x40(0x4)
	uint8_t Pad_0x44[0x4]; // 0x44(0x4)
};

// Object: ScriptStruct Breakthrough.KillFeedbackEvent
// Size: 0x60 (Inherited: 0x0)
struct FKillFeedbackEvent
{
	EScoreName ScoreName; // 0x0(0x4)
	int32_t Score; // 0x4(0x4)
	struct FSoftObjectPath Sprite; // 0x8(0x18)
	struct FLinearColor SpriteColor; // 0x20(0x10)
	struct FText Desc; // 0x30(0x18)
	struct FString Audio; // 0x48(0x10)
	int32_t Distance; // 0x58(0x4)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
};

// Object: ScriptStruct Breakthrough.TipsInterruptInfo
// Size: 0x18 (Inherited: 0x0)
struct FTipsInterruptInfo
{
	EBreakthroughTipType Type; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct FTimerHandle TipsTimerHandle_PC; // 0x8(0x8)
	float TipHaveShowTime; // 0x10(0x4)
	float TipMustShowTime; // 0x14(0x4)
};

// Object: ScriptStruct Breakthrough.BreakthroughTipInfo
// Size: 0x48 (Inherited: 0x0)
struct FBreakthroughTipInfo
{
	EBreakthroughTipType Type; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float TriggerTime; // 0x4(0x4)
	uint64_t PlayerUin; // 0x8(0x8)
	int32_t PlayerCamp; // 0x10(0x4)
	int32_t CurDominantCamp; // 0x14(0x4)
	struct FName CapturePointName; // 0x18(0x8)
	int32_t PlayerTeam; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct FString CustomParameters; // 0x28(0x10)
	struct TArray<struct AActor*> CustomActors; // 0x38(0x10)
};

// Object: ScriptStruct Breakthrough.BreakthroughNarrativeTipsDataRow
// Size: 0x18 (Inherited: 0x8)
struct FBreakthroughNarrativeTipsDataRow : FTableRowBase
{
	EBreakthroughNarrativeTipTriggerType TriggerType; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	int32_t TriggerTypeSectorSerialNum; // 0xC(0x4)
	int32_t AutoTriggerReservedId; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct Breakthrough.BreakthroughTipsTagRow
// Size: 0x20 (Inherited: 0x8)
struct FBreakthroughTipsTagRow : FTableRowBase
{
	struct FName MapNotifyTipsTag; // 0x8(0x8)
	struct TArray<struct FMapNotifyTipsDataConfig> MapNotifyTipsDataConfigs; // 0x10(0x10)
};

// Object: ScriptStruct Breakthrough.MapNotifyTipsDataConfig
// Size: 0x188 (Inherited: 0x0)
struct FMapNotifyTipsDataConfig
{
	EBreakthroughTipType Type; // 0x0(0x1)
	uint8_t AutoTriggerReservedId; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	int32_t Order; // 0x4(0x4)
	float Intervals; // 0x8(0x4)
	uint8_t bCanInterruptSameGroup : 1; // 0xC(0x1), Mask(0x1)
	uint8_t BitPad_0xC_1 : 7; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	struct FName InterruptGroupName; // 0x10(0x8)
	float VOPlayIntervals; // 0x18(0x4)
	int32_t ValidDuration; // 0x1C(0x4)
	int32_t ValidShowDuration; // 0x20(0x4)
	float ShowDuration; // 0x24(0x4)
	ENotifyListener Listener; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
	struct TArray<struct FText> Texts; // 0x30(0x10)
	EContentType ContentType; // 0x40(0x1)
	uint8_t Pad_0x41[0x7]; // 0x41(0x7)
	struct TArray<struct FText> SubTexts; // 0x48(0x10)
	EContentType SubContentType; // 0x58(0x1)
	uint8_t Pad_0x59[0x7]; // 0x59(0x7)
	struct FString AudioStateGroup; // 0x60(0x10)
	struct TArray<int32_t> MapType; // 0x70(0x10)
	struct TArray<EDFMGamePlayMode> GamePlayMode; // 0x80(0x10)
	struct TArray<EDFMGamePlaySubMode> GamePlaySubMode; // 0x90(0x10)
	ETipColorType ColorType; // 0xA0(0x1)
	ETipLevelType StrongLevelType; // 0xA1(0x1)
	EStrongTipsViewType StrongTipsViewType; // 0xA2(0x1)
	EWeakTipsViewType WeakTipsViewType; // 0xA3(0x1)
	int32_t RandomPlayCount; // 0xA4(0x4)
	struct TArray<struct TSoftObjectPtr<UGPAudioEventAsset>> OffenceAudioEvents; // 0xA8(0x10)
	struct TArray<struct TSoftObjectPtr<UGPAudioEventAsset>> DefenceAudioEvents; // 0xB8(0x10)
	struct TSoftObjectPtr<UObject> IconAsset; // 0xC8(0x28)
	struct TArray<struct FText> SpeakerNameTexts; // 0xF0(0x10)
	float XForCompare; // 0x100(0x4)
	uint8_t Pad_0x104[0x4]; // 0x104(0x4)
	struct TSoftObjectPtr<UGPAudioEventAsset> ImmediateAudioEvent; // 0x108(0x28)
	struct TSoftObjectPtr<UGPAudioEventAsset> BGMAudioEvent; // 0x130(0x28)
	struct TSoftObjectPtr<UGPAudioEventAsset> StopBGMAudioEvent; // 0x158(0x28)
	uint8_t bShowCountDown : 1; // 0x180(0x1), Mask(0x1)
	uint8_t BitPad_0x180_1 : 7; // 0x180(0x1)
	uint8_t Pad_0x181[0x7]; // 0x181(0x7)
};

// Object: ScriptStruct Breakthrough.BreakthroughTipsExtraDataRow
// Size: 0x20 (Inherited: 0x8)
struct FBreakthroughTipsExtraDataRow : FTableRowBase
{
	int32_t MapID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TArray<struct FMapNotifyTipsDataConfig> MapNotifyTipsDataConfigs; // 0x10(0x10)
};

// Object: ScriptStruct Breakthrough.BreakthroughTipsDataRow
// Size: 0x208 (Inherited: 0x80)
struct FBreakthroughTipsDataRow : FAssetPakerPakPolicyRow
{
	EBreakthroughTipType Type; // 0x80(0x1)
	uint8_t AutoTriggerReservedId; // 0x81(0x1)
	uint8_t Pad_0x82[0x2]; // 0x82(0x2)
	int32_t Order; // 0x84(0x4)
	float Intervals; // 0x88(0x4)
	uint8_t bCanInterruptSameGroup : 1; // 0x8C(0x1), Mask(0x1)
	uint8_t BitPad_0x8C_1 : 7; // 0x8C(0x1)
	uint8_t Pad_0x8D[0x3]; // 0x8D(0x3)
	struct FName InterruptGroupName; // 0x90(0x8)
	float VOPlayIntervals; // 0x98(0x4)
	int32_t ValidDuration; // 0x9C(0x4)
	int32_t ValidShowDuration; // 0xA0(0x4)
	float ShowDuration; // 0xA4(0x4)
	ENotifyListener Listener; // 0xA8(0x1)
	uint8_t Pad_0xA9[0x7]; // 0xA9(0x7)
	struct TArray<struct FText> Texts; // 0xB0(0x10)
	EContentType ContentType; // 0xC0(0x1)
	uint8_t Pad_0xC1[0x7]; // 0xC1(0x7)
	struct TArray<struct FText> SubTexts; // 0xC8(0x10)
	EContentType SubContentType; // 0xD8(0x1)
	uint8_t Pad_0xD9[0x7]; // 0xD9(0x7)
	struct FString AudioStateGroup; // 0xE0(0x10)
	struct TArray<int32_t> MapType; // 0xF0(0x10)
	struct TArray<EDFMGamePlayMode> GamePlayMode; // 0x100(0x10)
	struct TArray<EDFMGamePlaySubMode> GamePlaySubMode; // 0x110(0x10)
	ETipColorType ColorType; // 0x120(0x1)
	ETipLevelType StrongLevelType; // 0x121(0x1)
	EStrongTipsViewType StrongTipsViewType; // 0x122(0x1)
	EWeakTipsViewType WeakTipsViewType; // 0x123(0x1)
	int32_t RandomPlayCount; // 0x124(0x4)
	struct TArray<struct TSoftObjectPtr<UGPAudioEventAsset>> OffenceAudioEvents; // 0x128(0x10)
	struct TArray<struct TSoftObjectPtr<UGPAudioEventAsset>> DefenceAudioEvents; // 0x138(0x10)
	struct TSoftObjectPtr<UObject> IconAsset; // 0x148(0x28)
	struct TArray<struct FText> SpeakerNameTexts; // 0x170(0x10)
	float XForCompare; // 0x180(0x4)
	uint8_t Pad_0x184[0x4]; // 0x184(0x4)
	struct TSoftObjectPtr<UGPAudioEventAsset> ImmediateAudioEvent; // 0x188(0x28)
	struct TSoftObjectPtr<UGPAudioEventAsset> BGMAudioEvent; // 0x1B0(0x28)
	struct TSoftObjectPtr<UGPAudioEventAsset> StopBGMAudioEvent; // 0x1D8(0x28)
	uint8_t bShowCountDown : 1; // 0x200(0x1), Mask(0x1)
	uint8_t BitPad_0x200_1 : 7; // 0x200(0x1)
	uint8_t Pad_0x201[0x7]; // 0x201(0x7)
};

// Object: ScriptStruct Breakthrough.CommanderRankSkillTipInfo
// Size: 0x8 (Inherited: 0x0)
struct FCommanderRankSkillTipInfo
{
	int32_t SkillId; // 0x0(0x4)
	EBreakthroughTipType TipType; // 0x4(0x1)
	EBreakthroughUIIconType IconType; // 0x5(0x1)
	uint8_t Pad_0x6[0x2]; // 0x6(0x2)
};

// Object: ScriptStruct Breakthrough.RankSkillTipInfo
// Size: 0x8 (Inherited: 0x0)
struct FRankSkillTipInfo
{
	int32_t SkillId; // 0x0(0x4)
	EBreakthroughTipType TipType; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
};

// Object: ScriptStruct Breakthrough.BattleSupportTipsInfo
// Size: 0x38 (Inherited: 0x0)
struct FBattleSupportTipsInfo
{
	uint8_t bShowTips : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct FText ShowTipsText; // 0x8(0x18)
	struct FText StateTipsText; // 0x20(0x18)
};

// Object: ScriptStruct Breakthrough.TacticalConquestEvolutionRebornFlow
// Size: 0xC (Inherited: 0x0)
struct FTacticalConquestEvolutionRebornFlow
{
	int32_t EnterRedeployTimes; // 0x0(0x4)
	int32_t DirectRedeployTimes; // 0x4(0x4)
	int32_t AutoRedeployTimes; // 0x8(0x4)
};

// Object: ScriptStruct Breakthrough.RedeployOnFirePlayerInfo
// Size: 0x28 (Inherited: 0x18)
struct FRedeployOnFirePlayerInfo : FRedeployNormalPlayerInfo
{
	float FireBeginTime; // 0x14(0x4)
	struct FVector_NetQuantize Location; // 0x18(0xC)
};

// Object: ScriptStruct Breakthrough.AttachPositionToWeaponTypes
// Size: 0x18 (Inherited: 0x0)
struct FAttachPositionToWeaponTypes
{
	EAttachPosition AttachPosition; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<EWeaponItemType> WeaponItemTypes; // 0x8(0x10)
};

// Object: ScriptStruct Breakthrough.RedeployPointHubItemColorConfig
// Size: 0x70 (Inherited: 0x0)
struct FRedeployPointHubItemColorConfig
{
	struct FLinearColor BGImageColor; // 0x0(0x10)
	struct FLinearColor IconImageColor; // 0x10(0x10)
	struct FLinearColor SecondIconImageColor; // 0x20(0x10)
	struct FLinearColor NameTextColor; // 0x30(0x10)
	struct FLinearColor AvailableNumTextColor; // 0x40(0x10)
	struct FLinearColor VerticalLineImageColor; // 0x50(0x10)
	struct FLinearColor HorizontalLineImageColor; // 0x60(0x10)
};

// Object: ScriptStruct Breakthrough.RedeployVehicleVolatileInfo
// Size: 0x14 (Inherited: 0x0)
struct FRedeployVehicleVolatileInfo
{
	uint32_t VehicleNetGUID; // 0x0(0x4)
	struct FVector_NetQuantize Location; // 0x4(0xC)
	uint16_t Rotation; // 0x10(0x2)
	uint8_t IsBattle : 1; // 0x12(0x1), Mask(0x1)
	uint8_t BitPad_0x12_1 : 7; // 0x12(0x1)
	uint8_t Pad_0x13[0x1]; // 0x13(0x1)
};

// Object: ScriptStruct Breakthrough.RedeployPlayerVolatileInfo
// Size: 0x14 (Inherited: 0x0)
struct FRedeployPlayerVolatileInfo
{
	uint32_t PlayerNetGUID; // 0x0(0x4)
	struct FVector_NetQuantize Location; // 0x4(0xC)
	uint16_t Rotation; // 0x10(0x2)
	uint8_t Pad_0x12[0x2]; // 0x12(0x2)
};

// Object: ScriptStruct Breakthrough.AttackReformTLogInfo
// Size: 0x20 (Inherited: 0x0)
struct FAttackReformTLogInfo
{
	int32_t UseSkillTimeStamp; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<int32_t> WaveCount; // 0x8(0x10)
	int32_t BenefitCount; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct Breakthrough.FastRedeployTLogInfo
// Size: 0xC (Inherited: 0x0)
struct FFastRedeployTLogInfo
{
	int32_t UseSkillTimeStamp; // 0x0(0x4)
	int32_t Score; // 0x4(0x4)
	int32_t BenefitCount; // 0x8(0x4)
};

// Object: ScriptStruct Breakthrough.AdminPanelTeamStat
// Size: 0x10 (Inherited: 0x0)
struct FAdminPanelTeamStat
{
	struct TArray<struct FAdminPanelPlayerStatItem> TeamStat; // 0x0(0x10)
};

// Object: ScriptStruct Breakthrough.AdminPanelPlayerStatItem
// Size: 0x68 (Inherited: 0x0)
struct FAdminPanelPlayerStatItem
{
	struct ADFMPlayerState* PlayerState; // 0x0(0x8)
	struct FPlayerStatItem PlayerStat; // 0x8(0x60)
};

// Object: ScriptStruct Breakthrough.TipsBroadcastHudData
// Size: 0x38 (Inherited: 0x0)
struct FTipsBroadcastHudData
{
	struct TSoftObjectPtr<UObject> IconAsset; // 0x0(0x28)
	struct TArray<struct FText> SpeakerNameTexts; // 0x28(0x10)
};

// Object: ScriptStruct Breakthrough.TipsBroadCastData
// Size: 0x38 (Inherited: 0x0)
struct FTipsBroadCastData
{
	struct TSoftObjectPtr<UObject> IconAsset; // 0x0(0x28)
	struct TArray<struct FText> SpeakerNameTexts; // 0x28(0x10)
};

// Object: ScriptStruct Breakthrough.BroadcastUIItemInfo
// Size: 0x10 (Inherited: 0x0)
struct FBroadcastUIItemInfo
{
	int32_t ShowTipsIndex; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct UBreakthroughTipsWeakBroadcastView* UIItem; // 0x8(0x8)
};

// Object: ScriptStruct Breakthrough.ChangeableStatusConfigRow
// Size: 0x68 (Inherited: 0x10)
struct FChangeableStatusConfigRow : FDescRowBase
{
	EChangeableStatusType Type; // 0x10(0x1)
	uint8_t bIsJudgeModeWhemUseCode : 1; // 0x11(0x1), Mask(0x1)
	uint8_t BitPad_0x11_1 : 7; // 0x11(0x1)
	uint8_t Pad_0x12[0x6]; // 0x12(0x6)
	struct TArray<EDFMGamePlayMode> Modes; // 0x18(0x10)
	struct TArray<EDFMGamePlaySubMode> SubModes; // 0x28(0x10)
	struct TArray<uint64_t> EventItems; // 0x38(0x10)
	struct TArray<int32_t> HolidayEventItems; // 0x48(0x10)
	struct TArray<struct FChangeableTimeItemConfig> TimeBuckets; // 0x58(0x10)
};

// Object: ScriptStruct Breakthrough.ChangeableTimeItemConfig
// Size: 0x10 (Inherited: 0x0)
struct FChangeableTimeItemConfig
{
	struct FDateTime StartTime; // 0x0(0x8)
	struct FDateTime EndTime; // 0x8(0x8)
};

// Object: ScriptStruct Breakthrough.CollapseBigEventData
// Size: 0x1B8 (Inherited: 0x0)
struct FCollapseBigEventData
{
	struct FVector2D FirstTimeInterval; // 0x0(0x8)
	struct FVector2D TimeInterval; // 0x8(0x8)
	struct FVector2D TimeIntervalAfterBigEvent; // 0x10(0x8)
	struct FVector2D BigEventDelayTimeInterval; // 0x18(0x8)
	float SafeTimeInterval; // 0x20(0x4)
	float WeightMidEarthquakeTrigger; // 0x24(0x4)
	int32_t MidEarthquakeTimeToBig; // 0x28(0x4)
	int32_t MidEarthquakeTimeToSmallEvent; // 0x2C(0x4)
	struct TArray<struct FName> SectorIDToTriggerSmallEvents; // 0x30(0x10)
	float SmallEarthquakePreTime; // 0x40(0x4)
	float SmallEarthquakeGoingTime; // 0x44(0x4)
	float MidEarthquakePreTime; // 0x48(0x4)
	float MidEarthquakeGoingTime; // 0x4C(0x4)
	float BigEarthquakePreTime; // 0x50(0x4)
	float BigEarthquakeGoingTime; // 0x54(0x4)
	float MidEarthquakeBreakRatioInBox; // 0x58(0x4)
	float BigEarthquakeBreakRatioInBox; // 0x5C(0x4)
	struct TMap<struct FName, struct FName> SectorHighValueBreakableItemTags; // 0x60(0x50)
	float MidEarthquakeBreakRatioInTag; // 0xB0(0x4)
	float BigEarthquakeBreakRatioInTag; // 0xB4(0x4)
	struct FVector2D MidEarthquakeFirstBreakTimeInterval; // 0xB8(0x8)
	struct FVector2D BigEarthquakeFirstBreakTimeInterval; // 0xC0(0x8)
	float MidEarthquakeSecondBreakRatio; // 0xC8(0x4)
	float BigEarthquakeSecondBreakRatio; // 0xCC(0x4)
	struct FVector2D MidEarthquakeSecondBreakTimeInterval; // 0xD0(0x8)
	struct FVector2D BigEarthquakeSecondBreakTimeInterval; // 0xD8(0x8)
	float SmallPreEarthquakeBuildingEffectRatio; // 0xE0(0x4)
	float MidPreEarthquakeBuildingEffectRatio; // 0xE4(0x4)
	float BigPreEarthquakeBuildingEffectRatio; // 0xE8(0x4)
	float SmallDistToSelectPlayPreEarthquakeBuildingEffect; // 0xEC(0x4)
	float MidDistToSelectPlayPreEarthquakeBuildingEffect; // 0xF0(0x4)
	float BigDistToSelectPlayPreEarthquakeBuildingEffect; // 0xF4(0x4)
	uint8_t bIsEnable1PWindEffectInEarthquake : 1; // 0xF8(0x1), Mask(0x1)
	uint8_t BitPad_0xF8_1 : 7; // 0xF8(0x1)
	uint8_t Pad_0xF9[0x7]; // 0xF9(0x7)
	struct FSoftClassPath WindFieldActorClassSoftPath; // 0x100(0x18)
	struct FVector WindHitPosOffsetInSmall; // 0x118(0xC)
	struct FVector WindHitPosOffsetInMid; // 0x124(0xC)
	struct FVector WindHitPosOffsetInBig; // 0x130(0xC)
	struct FVector WindPropertyInSmall; // 0x13C(0xC)
	struct FVector WindPropertyInMid; // 0x148(0xC)
	struct FVector WindPropertyInBig; // 0x154(0xC)
	float WindToMaxStrenthTimeInSmall; // 0x160(0x4)
	float WindToMaxStrenthTimeInMid; // 0x164(0x4)
	float WindToMaxStrenthTimeInBig; // 0x168(0x4)
	float WindToMinStrenthTimeInSmall; // 0x16C(0x4)
	float WindToMinStrenthTimeInMid; // 0x170(0x4)
	float WindToMinStrenthTimeInBig; // 0x174(0x4)
	struct UCameraShake* PreBigEarthquakeCameraShake; // 0x178(0x8)
	float PreBigEarthquakeCameraShakeScale; // 0x180(0x4)
	struct FVector WindHitPosOffsetInBigPre; // 0x184(0xC)
	struct FVector WindPropertyInBigPre; // 0x190(0xC)
	float WindToMaxStrenthTimeInBigPre; // 0x19C(0x4)
	float WindToMinStrenthTimeInBigPre; // 0x1A0(0x4)
	float S2BigEarthquakingBroadcastTipDelayTime; // 0x1A4(0x4)
	float SmallPreEarthquakeBuildingSelectRatio; // 0x1A8(0x4)
	float MidPreEarthquakeBuildingSelectRatio; // 0x1AC(0x4)
	float BigPreEarthquakeBuildingSelectRatio; // 0x1B0(0x4)
	uint8_t Pad_0x1B4[0x4]; // 0x1B4(0x4)
};

// Object: ScriptStruct Breakthrough.AllBrokenActorsInSector
// Size: 0x10 (Inherited: 0x0)
struct FAllBrokenActorsInSector
{
	struct TArray<struct TSoftObjectPtr<ABreakableItemBase>> BrokenActorList; // 0x0(0x10)
};

// Object: ScriptStruct Breakthrough.DesSocketEarthquakeFXData
// Size: 0x50 (Inherited: 0x0)
struct FDesSocketEarthquakeFXData
{
	struct FName ParticleIDOverride; // 0x0(0x8)
	uint8_t Pad_0x8[0x8]; // 0x8(0x8)
	struct FTransform Transform; // 0x10(0x30)
	EPerfGearQualityLevel LowestQuality; // 0x40(0x1)
	uint8_t Pad_0x41[0xF]; // 0x41(0xF)
};

// Object: ScriptStruct Breakthrough.OverloadPointInfo
// Size: 0x10 (Inherited: 0x0)
struct FOverloadPointInfo
{
	uint8_t bHasActivate : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct UConquestTopBarOverloadPointItemView* OverloadPoint; // 0x8(0x8)
};

// Object: ScriptStruct Breakthrough.BreakthroughDamageEventDataRow
// Size: 0x110 (Inherited: 0x8)
struct FBreakthroughDamageEventDataRow : FTableRowBase
{
	int32_t MapID; // 0x8(0x4)
	int32_t EventTriggerTimes; // 0xC(0x4)
	float EventDelayTime; // 0x10(0x4)
	float EventDuration; // 0x14(0x4)
	int32_t AfterBigEventFightBackTime; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	struct TMap<int32_t, int32_t> AfterBigEventVoteRatioFightBackTimeMap; // 0x20(0x50)
	int32_t IsAfterBigEventForceRebornOuter; // 0x70(0x4)
	int32_t IsAfterBigEventCoorAnchorOccupy; // 0x74(0x4)
	int32_t IsAfterBigEventRemoveCoorAnchor; // 0x78(0x4)
	EBigeventCoorAnchorPerformMode CoorAnchorPerformMode; // 0x7C(0x1)
	uint8_t Pad_0x7D[0x3]; // 0x7D(0x3)
	struct TMap<uint64_t, int32_t> LegalAttackerValueIds; // 0x80(0x50)
	uint8_t bIsUpdateSectorAnchorActiveStateAfterBigevent : 1; // 0xD0(0x1), Mask(0x1)
	uint8_t BitPad_0xD0_1 : 7; // 0xD0(0x1)
	uint8_t Pad_0xD1[0x7]; // 0xD1(0x7)
	struct FString SectorIDAfterBigeventUpdateSectorAnchorActiveState; // 0xD8(0x10)
	struct TArray<uint8_t> ActiveListAfterBigeventUpdateSectorAnchorActiveState; // 0xE8(0x10)
	struct TArray<int32_t> ActivateCampListAfterBigeventUpdateSectorAnchorActiveState; // 0xF8(0x10)
	uint8_t bWhetherExtendFightBackTime : 1; // 0x108(0x1), Mask(0x1)
	uint8_t BitPad_0x108_1 : 7; // 0x108(0x1)
	uint8_t Pad_0x109[0x3]; // 0x109(0x3)
	float ExtendFightBackTime; // 0x10C(0x4)
};

// Object: ScriptStruct Breakthrough.FestivalItemConfigRow
// Size: 0xE0 (Inherited: 0x8)
struct FFestivalItemConfigRow : FTableRowBase
{
	EBattleFieldMapFutureTag MapFeatureTag; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	int32_t Priority; // 0xC(0x4)
	struct TSoftObjectPtr<UStaticMesh> ItemMesh; // 0x10(0x28)
	uint8_t Pad_0x38[0x8]; // 0x38(0x8)
	struct FTransform NewMeshTransformOffset; // 0x40(0x30)
	struct FName DropEffectId; // 0x70(0x8)
	struct TSoftObjectPtr<UMaterialInterface> ItemMaterial; // 0x78(0x28)
	struct TSoftObjectPtr<UPaperSprite> TopBarIconSprite; // 0xA0(0x28)
	int32_t PlayerWidgetType; // 0xC8(0x4)
	EScoreName PickUpScoreName; // 0xCC(0x4)
	int32_t MaxSpeedBuffID; // 0xD0(0x4)
	int32_t MaxHealthBuffID; // 0xD4(0x4)
	uint8_t Pad_0xD8[0x8]; // 0xD8(0x8)
};

// Object: ScriptStruct Breakthrough.FreeBuildFortificationRepairData
// Size: 0x14 (Inherited: 0x0)
struct FFreeBuildFortificationRepairData
{
	uint8_t Pad_0x0[0x14]; // 0x0(0x14)
};

// Object: ScriptStruct Breakthrough.PendingSpawnInfo
// Size: 0x2 (Inherited: 0x0)
struct FPendingSpawnInfo
{
	uint8_t bPendingSpawn : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bHasSpawn : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
};

// Object: ScriptStruct Breakthrough.BuildPercentInfo
// Size: 0x10 (Inherited: 0x0)
struct FBuildPercentInfo
{
	float CachedBuildPercent; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct ACHARACTER* CachedBuildCharacter; // 0x8(0x8)
};

// Object: ScriptStruct Breakthrough.SubRegionFortificationInfo
// Size: 0x10 (Inherited: 0x0)
struct FSubRegionFortificationInfo
{
	struct TArray<struct AActor*> SubRegionFortificationArr; // 0x0(0x10)
};

// Object: ScriptStruct Breakthrough.RankSkillReleaseNumData
// Size: 0x18 (Inherited: 0x0)
struct FRankSkillReleaseNumData
{
	int32_t RankSkillId; // 0x0(0x4)
	int32_t RankCampId; // 0x4(0x4)
	uint8_t LastReleasedState : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	int32_t ReleaseTotalNum; // 0xC(0x4)
	int32_t ReleaseSuccessNum; // 0x10(0x4)
	int32_t ReleaseScoreCost; // 0x14(0x4)
};

// Object: ScriptStruct Breakthrough.RankSkillDynamicData
// Size: 0xC (Inherited: 0x0)
struct FRankSkillDynamicData
{
	int32_t RankSkillId; // 0x0(0x4)
	int32_t RankCampId; // 0x4(0x4)
	float LastRealeaseRankSkillTime; // 0x8(0x4)
};

// Object: ScriptStruct Breakthrough.ElectionItem
// Size: 0x10 (Inherited: 0x0)
struct FElectionItem
{
	struct ADFMPlayerState* PS; // 0x0(0x8)
	int32_t ItemIndex; // 0x8(0x4)
	int32_t CurrentVoteNum; // 0xC(0x4)
};

// Object: ScriptStruct Breakthrough.RankSkillRecord
// Size: 0x18 (Inherited: 0x0)
struct FRankSkillRecord
{
	int32_t SkillId; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FRankSkillPlayerRecord> RankSkillPlayerRecordArr; // 0x8(0x10)
};

// Object: ScriptStruct Breakthrough.RankSkillPlayerRecord
// Size: 0x48 (Inherited: 0x0)
struct FRankSkillPlayerRecord
{
	uint64_t PlayerUin; // 0x0(0x8)
	int32_t UseNum; // 0x8(0x4)
	int32_t CampId; // 0xC(0x4)
	int32_t TeamID; // 0x10(0x4)
	int32_t UsingNum; // 0x14(0x4)
	int32_t KillEventSkillNum; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	struct TArray<int64_t> KillEventSkillRecord; // 0x20(0x10)
	int32_t DamageEventSkillNum; // 0x30(0x4)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
	struct TArray<int64_t> DamageEventSkillRecord; // 0x38(0x10)
};

// Object: ScriptStruct Breakthrough.VehicleNumInfo
// Size: 0x8 (Inherited: 0x0)
struct FVehicleNumInfo
{
	int32_t VehicleId; // 0x0(0x4)
	int32_t VehicleNum; // 0x4(0x4)
};

// Object: ScriptStruct Breakthrough.BattlefieldGlobalBuffConfig
// Size: 0x20 (Inherited: 0x8)
struct FBattlefieldGlobalBuffConfig : FTableRowBase
{
	struct FName MapGlobalBuffsSettingTag; // 0x8(0x8)
	struct TArray<struct FGlobalBuff> GlobalBuffs; // 0x10(0x10)
};

// Object: ScriptStruct Breakthrough.GlobalBuff
// Size: 0x18 (Inherited: 0x8)
struct FGlobalBuff : FTableRowBase
{
	int32_t BuffId; // 0x8(0x4)
	float DeployBuffDelay; // 0xC(0x4)
	float ReviveBuffDelay; // 0x10(0x4)
	uint8_t PendingDeathBuffRemoval : 1; // 0x14(0x1), Mask(0x1)
	uint8_t BitPad_0x14_1 : 7; // 0x14(0x1)
	uint8_t DeathBuffRemoval : 1; // 0x15(0x1), Mask(0x1)
	uint8_t BitPad_0x15_1 : 7; // 0x15(0x1)
	uint8_t Pad_0x16[0x2]; // 0x16(0x2)
};

// Object: ScriptStruct Breakthrough.VehiclePartStoreHUDViewOneTabCheckedData
// Size: 0x58 (Inherited: 0x0)
struct FVehiclePartStoreHUDViewOneTabCheckedData
{
	int32_t UITabIndex; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TMap<uint64_t, struct FVehicleModifyRequestData> CheckedItemModifyRequestDataMap; // 0x8(0x50)
};

// Object: ScriptStruct Breakthrough.RedEnvelopeLevelRange
// Size: 0x8 (Inherited: 0x0)
struct FRedEnvelopeLevelRange
{
	int32_t MinCount; // 0x0(0x4)
	int32_t MaxCount; // 0x4(0x4)
};

// Object: ScriptStruct Breakthrough.RedeployQuadListInfo
// Size: 0x80 (Inherited: 0x0)
struct FRedeployQuadListInfo
{
	struct UWidget* ReDeployPointPanel; // 0x0(0x8)
	struct UWidget* MarkerWidget; // 0x8(0x8)
	int8_t IconType; // 0x10(0x1)
	uint8_t Pad_0x11[0x7]; // 0x11(0x7)
	struct FSoftObjectPath IconPath; // 0x18(0x18)
	struct FVector2D IconSize; // 0x30(0x8)
	struct FSoftObjectPath SecondIconPath; // 0x38(0x18)
	struct FVector2D SecondIconSize; // 0x50(0x8)
	struct FString TextOverIcon; // 0x58(0x10)
	struct FString Name; // 0x68(0x10)
	uint8_t Selected : 1; // 0x78(0x1), Mask(0x1)
	uint8_t BitPad_0x78_1 : 7; // 0x78(0x1)
	int8_t ColorType; // 0x79(0x1)
	uint8_t Pad_0x7A[0x6]; // 0x7A(0x6)
};

// Object: ScriptStruct Breakthrough.RedeployMarkerInfoRow
// Size: 0x28 (Inherited: 0x10)
struct FRedeployMarkerInfoRow : FDescRowBase
{
	ERedeployMarkerType RedeployMarkerType; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	int32_t ZOrder; // 0x14(0x4)
	int32_t AutoSelectPriority; // 0x18(0x4)
	int32_t FirstDeployAttackerAutoSelectPriority; // 0x1C(0x4)
	int32_t FirstDeployDefenderAutoSelectPriority; // 0x20(0x4)
	int32_t SelectQuadSizeType; // 0x24(0x4)
};

// Object: ScriptStruct Breakthrough.RedeployMarkerPool
// Size: 0x10 (Inherited: 0x0)
struct FRedeployMarkerPool
{
	struct TArray<struct URedeployMarkerBaseWidget*> Widgets; // 0x0(0x10)
};

// Object: ScriptStruct Breakthrough.FrameTask
// Size: 0x10 (Inherited: 0x0)
struct FFrameTask
{
	uint64_t ItemID; // 0x0(0x8)
	struct URedeployChooseItemGroupView* ParentWidget; // 0x8(0x8)
};

// Object: ScriptStruct Breakthrough.RedeployStoreTypeToWeaponTypes
// Size: 0x18 (Inherited: 0x0)
struct FRedeployStoreTypeToWeaponTypes
{
	ERedeployStoreType RedeployStoreType; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct TArray<EWeaponItemType> WeaponItemTypes; // 0x8(0x10)
};

// Object: ScriptStruct Breakthrough.FadingDirectionConfigRow
// Size: 0x18 (Inherited: 0x8)
struct FFadingDirectionConfigRow : FTableRowBase
{
	struct FName BreakthroughMapName; // 0x8(0x8)
	uint8_t bIsVertical : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t Pad_0x11[0x7]; // 0x11(0x7)
};

// Object: ScriptStruct Breakthrough.VehicleSpawnerState
// Size: 0x18 (Inherited: 0x0)
struct FVehicleSpawnerState
{
	struct ABreakthroughVehicleSpawner* VehicleSpawner; // 0x0(0x8)
	int32_t VehicleId; // 0x8(0x4)
	float CDProgress; // 0xC(0x4)
	uint8_t IsSpawnedAlive : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t IsLocked : 1; // 0x11(0x1), Mask(0x1)
	uint8_t BitPad_0x11_1 : 7; // 0x11(0x1)
	uint8_t Pad_0x12[0x6]; // 0x12(0x6)
};

// Object: Class Breakthrough.AirDropHudController
// Size: 0x88 (Inherited: 0x80)
struct UAirDropHudController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UAirDropHudController, "AirDropHudController")

	struct UAirDropHudView* AirDropHudView; // 0x80(0x8)

	// Object: Function Breakthrough.AirDropHudController.OnRaiseWatchControlAction
	// Flags: [Final|Native|Protected]
	// Offset: 0xf9399a4
	// Params: [ Num(1) Size(0x1) ]
	void OnRaiseWatchControlAction(uint8_t RaiseWatchControlActionType);
};

// Object: Class Breakthrough.AirDropHudView
// Size: 0x450 (Inherited: 0x400)
struct UAirDropHudView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UAirDropHudView, "AirDropHudView")

	struct UDFTextBlock* PlayerScoreText; // 0x400(0x8)
	struct UDFTextBlock* DFTextBlock_92; // 0x408(0x8)
	struct UDFWaterfallScrollView* DFWaterfallScrollView_52; // 0x410(0x8)
	struct TArray<struct FClientDropVehicleInfo> ClientDropVehicleInfoArray; // 0x418(0x10)
	uint8_t Pad_0x428[0x28]; // 0x428(0x28)

	// Object: Function Breakthrough.AirDropHudView.UpdateCombatVehicleCountHintBoxVisibility
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb0ba8
	// Params: [ Num(1) Size(0x4) ]
	void UpdateCombatVehicleCountHintBoxVisibility(int32_t CampId);

	// Object: Function Breakthrough.AirDropHudView.OnRefreshData
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0x14eb0b94
	// Params: [ Num(0) Size(0x0) ]
	void OnRefreshData();

	// Object: Function Breakthrough.AirDropHudView.OnRaiseWatchControlAction
	// Flags: [Final|Native|Protected]
	// Offset: 0xf9871a4
	// Params: [ Num(1) Size(0x1) ]
	void OnRaiseWatchControlAction(uint8_t RaiseWatchControlActionType);

	// Object: Function Breakthrough.AirDropHudView.OnFadeOutEnd
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb0b80
	// Params: [ Num(0) Size(0x0) ]
	void OnFadeOutEnd();

	// Object: Function Breakthrough.AirDropHudView.OnCloseBtnClick
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14eb0b6c
	// Params: [ Num(0) Size(0x0) ]
	void OnCloseBtnClick();

	// Object: Function Breakthrough.AirDropHudView.BP_OnRefreshData
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_OnRefreshData();

	// Object: Function Breakthrough.AirDropHudView.BP_FadeOut
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	float BP_FadeOut();
};

// Object: Class Breakthrough.AirDropMainView
// Size: 0x448 (Inherited: 0x3F0)
struct UAirDropMainView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UAirDropMainView, "AirDropMainView")

	struct UDFTextBlock* PlayerScoreText; // 0x3F0(0x8)
	struct UDFTextBlock* DFTextBlock_92; // 0x3F8(0x8)
	struct UDFWaterfallScrollView* DFWaterfallScrollView_52; // 0x400(0x8)
	struct TArray<struct FClientDropVehicleInfo> ClientDropVehicleInfoArray; // 0x408(0x10)
	uint8_t Pad_0x418[0x24]; // 0x418(0x24)
	float RefreshDeltaTime; // 0x43C(0x4)
	uint8_t Pad_0x440[0x8]; // 0x440(0x8)

	// Object: Function Breakthrough.AirDropMainView.UpdateInWater
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb0da4
	// Params: [ Num(0) Size(0x0) ]
	void UpdateInWater();

	// Object: Function Breakthrough.AirDropMainView.OnRefreshData
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0x14eb0d90
	// Params: [ Num(0) Size(0x0) ]
	void OnRefreshData();

	// Object: Function Breakthrough.AirDropMainView.OnRaiseWatchControlAction
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb0cec
	// Params: [ Num(1) Size(0x1) ]
	void OnRaiseWatchControlAction(uint8_t RaiseWatchControlActionType);

	// Object: Function Breakthrough.AirDropMainView.OnFadeOutEnd
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb0cd8
	// Params: [ Num(0) Size(0x0) ]
	void OnFadeOutEnd();

	// Object: Function Breakthrough.AirDropMainView.OnCloseBtnClick
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14eb0cc4
	// Params: [ Num(0) Size(0x0) ]
	void OnCloseBtnClick();

	// Object: Function Breakthrough.AirDropMainView.BP_OnRefreshData
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_OnRefreshData();

	// Object: Function Breakthrough.AirDropMainView.BP_FadeOut
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	float BP_FadeOut();
};

// Object: Class Breakthrough.AnchorSpawnArea
// Size: 0x468 (Inherited: 0x370)
struct AAnchorSpawnArea : AActor
{
	DEFINE_UE_CLASS_HELPERS(AAnchorSpawnArea, "AnchorSpawnArea")

	struct USceneComponent* SceneComponent; // 0x370(0x8)
	struct USplineAreaComponent* SectorSplineAreaComponent; // 0x378(0x8)
	struct UArrowComponent* ArrowComponent; // 0x380(0x8)
	struct TArray<struct USceneComponent*> PosCandiates; // 0x388(0x10)
	uint8_t Pad_0x398[0x4]; // 0x398(0x4)
	float NavDetectTop; // 0x39C(0x4)
	float NavDetectBottom; // 0x3A0(0x4)
	uint8_t bUseFixedPos : 1; // 0x3A4(0x1), Mask(0x1)
	uint8_t BitPad_0x3A4_1 : 7; // 0x3A4(0x1)
	uint8_t bConfigDedicateRebornConfig : 1; // 0x3A5(0x1), Mask(0x1)
	uint8_t BitPad_0x3A5_1 : 7; // 0x3A5(0x1)
	uint8_t Pad_0x3A6[0x2]; // 0x3A6(0x2)
	struct FName SpawnAreaID; // 0x3A8(0x8)
	struct TMap<EEstimateName, struct FEstimateNameScore> SectorAnchorEstimateNames; // 0x3B0(0x50)
	float SectorAnchorEstimateOffest; // 0x400(0x4)
	float SectorAnchorEnterDangerousPlayerAliveTimeLimit; // 0x404(0x4)
	float SectorAnchorDangerousSpawnAreaAdditionalWeight; // 0x408(0x4)
	float SectorAnchorChooseSafeSpawnAreaWeightThreshold; // 0x40C(0x4)
	uint8_t bIsUseDeathInfoOfNearWhenCalcRebronEstimate : 1; // 0x410(0x1), Mask(0x1)
	uint8_t BitPad_0x410_1 : 7; // 0x410(0x1)
	uint8_t Pad_0x411[0x3]; // 0x411(0x3)
	float WeightOfDeathInfoScore; // 0x414(0x4)
	float MaxDistanceOfEffectiveDeathWhenCalcRebronEstimate; // 0x418(0x4)
	float MaxTimeOfEffectiveDeathWhenCalcRebronEstimate; // 0x41C(0x4)
	float DangerousDuration; // 0x420(0x4)
	float EnterDangerousTime; // 0x424(0x4)
	float PointBaseForLastEnemyReborneTime; // 0x428(0x4)
	float Camp0LastRebornTime; // 0x42C(0x4)
	float Camp1LastRebornTime; // 0x430(0x4)
	uint8_t bIsSafeRebornPoint : 1; // 0x434(0x1), Mask(0x1)
	uint8_t BitPad_0x434_1 : 7; // 0x434(0x1)
	uint8_t Pad_0x435[0x3]; // 0x435(0x3)
	int32_t PlayerCampDistribution; // 0x438(0x4)
	float DetectHeight; // 0x43C(0x4)
	uint8_t Pad_0x440[0x18]; // 0x440(0x18)
	struct UAreaActorsSubsystem* AreaActorsSubsystem; // 0x458(0x8)
	uint8_t Pad_0x460[0x8]; // 0x460(0x8)

	// Object: Function Breakthrough.AnchorSpawnArea.SetDangerous
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14eb0f88
	// Params: [ Num(1) Size(0x4) ]
	void SetDangerous(float RebornTime);

	// Object: Function Breakthrough.AnchorSpawnArea.OnDsBeginMatchReqReceived
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb0f74
	// Params: [ Num(0) Size(0x0) ]
	void OnDsBeginMatchReqReceived();

	// Object: Function Breakthrough.AnchorSpawnArea.LoadDataFromRebornConfigTable
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb0f60
	// Params: [ Num(0) Size(0x0) ]
	void LoadDataFromRebornConfigTable();

	// Object: Function Breakthrough.AnchorSpawnArea.IsDangerous
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14eb0f28
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsDangerous();

	// Object: Function Breakthrough.AnchorSpawnArea.GetLastEnemyTime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14eb0e7c
	// Params: [ Num(2) Size(0x8) ]
	float GetLastEnemyTime(int32_t CurCamp);

	// Object: Function Breakthrough.AnchorSpawnArea.CheckRebornIsInRebornArea
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x14eb0dc0
	// Params: [ Num(2) Size(0xD) ]
	uint8_t CheckRebornIsInRebornArea(const struct FVector& WorldLocation);
};

// Object: Class Breakthrough.AnchorSpawnArea_HotFixActor
// Size: 0x538 (Inherited: 0x418)
struct AAnchorSpawnArea_HotFixActor : AGPHotFixActorBase
{
	DEFINE_UE_CLASS_HELPERS(AAnchorSpawnArea_HotFixActor, "AnchorSpawnArea_HotFixActor")

	struct TSoftObjectPtr<AAnchorSpawnArea> HotFixTargetActorSoftObjectPtr; // 0x418(0x28)
	struct TSoftObjectPtr<AAnchorSpawnArea> HotFixAddActorSoftObjectPtr; // 0x440(0x28)
	struct TSoftObjectPtr<AAnchorSpawnArea> HotFixDeleteActorSoftObjectPtr; // 0x468(0x28)
	struct TArray<struct USceneComponent*> PosCandiates; // 0x490(0x10)
	float NavDetectTop; // 0x4A0(0x4)
	float NavDetectBottom; // 0x4A4(0x4)
	uint8_t bUseFixedPos : 1; // 0x4A8(0x1), Mask(0x1)
	uint8_t BitPad_0x4A8_1 : 7; // 0x4A8(0x1)
	uint8_t bConfigDedicateRebornConfig : 1; // 0x4A9(0x1), Mask(0x1)
	uint8_t BitPad_0x4A9_1 : 7; // 0x4A9(0x1)
	uint8_t Pad_0x4AA[0x2]; // 0x4AA(0x2)
	struct FName SpawnAreaID; // 0x4AC(0x8)
	uint8_t Pad_0x4B4[0x4]; // 0x4B4(0x4)
	struct TMap<EEstimateName, struct FEstimateNameScore> SectorAnchorEstimateNames; // 0x4B8(0x50)
	float SectorAnchorEstimateOffest; // 0x508(0x4)
	float SectorAnchorEnterDangerousPlayerAliveTimeLimit; // 0x50C(0x4)
	float SectorAnchorDangerousSpawnAreaAdditionalWeight; // 0x510(0x4)
	float SectorAnchorChooseSafeSpawnAreaWeightThreshold; // 0x514(0x4)
	uint8_t bIsUseDeathInfoOfNearWhenCalcRebronEstimate : 1; // 0x518(0x1), Mask(0x1)
	uint8_t BitPad_0x518_1 : 7; // 0x518(0x1)
	uint8_t Pad_0x519[0x3]; // 0x519(0x3)
	float WeightOfDeathInfoScore; // 0x51C(0x4)
	float MaxDistanceOfEffectiveDeathWhenCalcRebronEstimate; // 0x520(0x4)
	float MaxTimeOfEffectiveDeathWhenCalcRebronEstimate; // 0x524(0x4)
	float DangerousDuration; // 0x528(0x4)
	float PointBaseForLastEnemyReborneTime; // 0x52C(0x4)
	uint8_t bIsSafeRebornPoint : 1; // 0x530(0x1), Mask(0x1)
	uint8_t BitPad_0x530_1 : 7; // 0x530(0x1)
	uint8_t Pad_0x531[0x3]; // 0x531(0x3)
	float DetectHeight; // 0x534(0x4)
};

// Object: Class Breakthrough.AreaActorsSubsystem
// Size: 0x50 (Inherited: 0x30)
struct UAreaActorsSubsystem : UWorldSubsystem
{
	DEFINE_UE_CLASS_HELPERS(UAreaActorsSubsystem, "AreaActorsSubsystem")

	uint8_t Pad_0x30[0x10]; // 0x30(0x10)
	struct TArray<struct FAreaActorInfo> AreaActors; // 0x40(0x10)
};

// Object: Class Breakthrough.AreaQueryInEditor
// Size: 0x370 (Inherited: 0x370)
struct AAreaQueryInEditor : AActor
{
	DEFINE_UE_CLASS_HELPERS(AAreaQueryInEditor, "AreaQueryInEditor")
};

// Object: Class Breakthrough.BattleCampSector
// Size: 0x528 (Inherited: 0x370)
struct ABattleCampSector : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABattleCampSector, "BattleCampSector")

	uint8_t Pad_0x370[0x10]; // 0x370(0x10)
	int32_t OwnerCamp; // 0x380(0x4)
	uint8_t Pad_0x384[0x4]; // 0x384(0x4)
	struct USceneComponent* SceneComponent; // 0x388(0x8)
	struct USceneComponent* CachedMarkerComponent; // 0x390(0x8)
	struct USplineAreaComponent* SectorSplineAreaComponent; // 0x398(0x8)
	struct USplineAreaComponent* HeightSectorSplineAreaComponent; // 0x3A0(0x8)
	struct USplineAreaComponent* DisplaySectorSplineAreaComponent; // 0x3A8(0x8)
	float DetectHeight; // 0x3B0(0x4)
	uint32_t SerialNumber; // 0x3B4(0x4)
	uint8_t IsActive : 1; // 0x3B8(0x1), Mask(0x1)
	uint8_t BitPad_0x3B8_1 : 7; // 0x3B8(0x1)
	uint8_t NeedAreaActive : 1; // 0x3B9(0x1), Mask(0x1)
	uint8_t BitPad_0x3B9_1 : 7; // 0x3B9(0x1)
	uint8_t bShowMapSplineArea : 1; // 0x3BA(0x1), Mask(0x1)
	uint8_t BitPad_0x3BA_1 : 7; // 0x3BA(0x1)
	uint8_t bNeedShowMapSplineArea : 1; // 0x3BB(0x1), Mask(0x1)
	uint8_t BitPad_0x3BB_1 : 7; // 0x3BB(0x1)
	uint8_t bUseDisplaySectorSplineArea : 1; // 0x3BC(0x1), Mask(0x1)
	uint8_t BitPad_0x3BC_1 : 7; // 0x3BC(0x1)
	uint8_t bGlobalStageUseDisplaySectorSplineArea : 1; // 0x3BD(0x1), Mask(0x1)
	uint8_t BitPad_0x3BD_1 : 7; // 0x3BD(0x1)
	uint8_t bZoomStageUseDisplaySectorSplineArea : 1; // 0x3BE(0x1), Mask(0x1)
	uint8_t BitPad_0x3BE_1 : 7; // 0x3BE(0x1)
	uint8_t Pad_0x3BF[0x1]; // 0x3BF(0x1)
	struct TArray<int32_t> SpawnersVehicleIDList; // 0x3C0(0x10)
	struct TSet<struct TWeakObjectPtr<struct ADFMCharacter>> InnerCharacters; // 0x3D0(0x50)
	struct TSet<struct TWeakObjectPtr<struct ADFMCharacter>> ForbiddenRefCharacters; // 0x420(0x50)
	struct TArray<struct AAnchorSpawnArea*> SpawnAreas; // 0x470(0x10)
	struct TArray<struct TSoftObjectPtr<ASpawnAreaHub>> OriginSpawnAreaHubs; // 0x480(0x10)
	struct TArray<struct FSpawnAreaHubGroup> SpawnAreaHubsAlterGroups; // 0x490(0x10)
	int32_t CampSpawnAreaType; // 0x4A0(0x4)
	uint8_t Pad_0x4A4[0x4]; // 0x4A4(0x4)
	struct TArray<struct TSoftObjectPtr<ASpawnAreaHub>> SpawnAreaHubs; // 0x4A8(0x10)
	struct TArray<struct AVehicleAutoSpawner*> IceLandAutoSpawners; // 0x4B8(0x10)
	struct TArray<EAnimVehicleType> VehicleTypes; // 0x4C8(0x10)
	struct FLinearColor MapMaskID; // 0x4D8(0x10)
	struct TArray<struct ABattleSectorTrigger*> TriggerAreas; // 0x4E8(0x10)
	struct FTimerHandle TimerHandleCollectVehicleSpawnerStatus; // 0x4F8(0x8)
	struct ABattleSectorBase* OwnerSector; // 0x500(0x8)
	struct FMulticastInlineDelegate OnBattleCampSectorActiveChanged; // 0x508(0x10)
	struct FMulticastInlineDelegate OnBattleCampSectorNeedAreaActive; // 0x518(0x10)

	// Object: Function Breakthrough.BattleCampSector.SetOwnerSector
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb1b3c
	// Params: [ Num(1) Size(0x8) ]
	void SetOwnerSector(struct ABattleSectorBase* InOwnerSector);

	// Object: Function Breakthrough.BattleCampSector.SetConfigVehicleSpawnCD
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb1b28
	// Params: [ Num(0) Size(0x0) ]
	void SetConfigVehicleSpawnCD();

	// Object: Function Breakthrough.BattleCampSector.OnVehicleSpawnerVehicleIDChange
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb1a84
	// Params: [ Num(1) Size(0x8) ]
	void OnVehicleSpawnerVehicleIDChange(struct AVehicleSpawner* TargetSpawner);

	// Object: Function Breakthrough.BattleCampSector.OnServerLeftVotes
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb19e0
	// Params: [ Num(1) Size(0x4) ]
	void OnServerLeftVotes(int32_t LeftVotes);

	// Object: Function Breakthrough.BattleCampSector.OnRep_SpawnersVehicleIDList
	// Flags: [Final|Native|Public]
	// Offset: 0xffbf2cc
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_SpawnersVehicleIDList();

	// Object: Function Breakthrough.BattleCampSector.OnRep_NeedAreaActive
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb19cc
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_NeedAreaActive();

	// Object: Function Breakthrough.BattleCampSector.OnRep_IsActive
	// Flags: [Final|Native|Public]
	// Offset: 0xfa14120
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_IsActive();

	// Object: Function Breakthrough.BattleCampSector.OnRep_CampSpawnAreaType
	// Flags: [Final|Native|Public]
	// Offset: 0x10170b54
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_CampSpawnAreaType();

	// Object: Function Breakthrough.BattleCampSector.OnOverlapEnd
	// Flags: [Native|Public]
	// Offset: 0x14eb1870
	// Params: [ Num(4) Size(0x1C) ]
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex);

	// Object: Function Breakthrough.BattleCampSector.OnOverlapBegin
	// Flags: [Native|Public|HasOutParms]
	// Offset: 0x14eb1670
	// Params: [ Num(6) Size(0xA8) ]
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, uint8_t bFromSweep, const struct FHitResult& SweepResult);

	// Object: Function Breakthrough.BattleCampSector.OnCampSectorTrigger
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb1594
	// Params: [ Num(2) Size(0x10) ]
	void OnCampSectorTrigger(struct ABattleSectorTrigger* TriggerArea, struct ADFMCharacter* CHARACTER);

	// Object: Function Breakthrough.BattleCampSector.OnBattleFieldBigEventStageChanged
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb14b4
	// Params: [ Num(2) Size(0x10) ]
	void OnBattleFieldBigEventStageChanged(int32_t InCurStage, struct AActor* InAnchor);

	// Object: Function Breakthrough.BattleCampSector.GetZoomStageDisplaySectorSplineArea
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14eb1480
	// Params: [ Num(1) Size(0x8) ]
	struct USplineAreaComponent* GetZoomStageDisplaySectorSplineArea();

	// Object: Function Breakthrough.BattleCampSector.GetSpawnAreas
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x14eb1370
	// Params: [ Num(2) Size(0x20) ]
	void GetSpawnAreas(const struct TArray<struct TSoftObjectPtr<ASpawnAreaHub>>& InSpawnAreas, struct TArray<struct ASpawnAreaHub*>& OutSpawnAreas);

	// Object: Function Breakthrough.BattleCampSector.GetSpawnAreaHub
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb1220
	// Params: [ Num(2) Size(0x30) ]
	struct ASpawnAreaHub* GetSpawnAreaHub(struct TSoftObjectPtr<ASpawnAreaHub> InSpawnAreaHud);

	// Object: Function Breakthrough.BattleCampSector.GetGlobalStageDisplaySectorSplineArea
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14eb11ec
	// Params: [ Num(1) Size(0x8) ]
	struct USplineAreaComponent* GetGlobalStageDisplaySectorSplineArea();

	// Object: Function Breakthrough.BattleCampSector.GetDisplaySectorSplineArea
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14eb11b8
	// Params: [ Num(1) Size(0x8) ]
	struct USplineAreaComponent* GetDisplaySectorSplineArea();

	// Object: Function Breakthrough.BattleCampSector.GetAvailableSpawnAreaHub
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb1184
	// Params: [ Num(1) Size(0x8) ]
	struct ASpawnAreaHub* GetAvailableSpawnAreaHub();
};

// Object: Class Breakthrough.BattleExtraSafeAre
// Size: 0x3E0 (Inherited: 0x370)
struct ABattleExtraSafeAre : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABattleExtraSafeAre, "BattleExtraSafeAre")

	struct USceneComponent* SceneComponent; // 0x370(0x8)
	struct USplineAreaComponent* SectorSplineAreaComponent; // 0x378(0x8)
	int32_t Camp; // 0x380(0x4)
	float DetectHeight; // 0x384(0x4)
	uint8_t bIsUsedInAI : 1; // 0x388(0x1), Mask(0x1)
	uint8_t BitPad_0x388_1 : 7; // 0x388(0x1)
	uint8_t bIsIgnoreEnemyArea : 1; // 0x389(0x1), Mask(0x1)
	uint8_t BitPad_0x389_1 : 7; // 0x389(0x1)
	uint8_t bIsIgnoreForbiddenArea : 1; // 0x38A(0x1), Mask(0x1)
	uint8_t BitPad_0x38A_1 : 7; // 0x38A(0x1)
	uint8_t Pad_0x38B[0x5]; // 0x38B(0x5)
	struct TSet<struct TWeakObjectPtr<struct ADFMCharacter>> InnerCharacters; // 0x390(0x50)

	// Object: Function Breakthrough.BattleExtraSafeAre.OnOverlapEnd
	// Flags: [Native|Public]
	// Offset: 0x14eb1e48
	// Params: [ Num(4) Size(0x1C) ]
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex);

	// Object: Function Breakthrough.BattleExtraSafeAre.OnOverlapBegin
	// Flags: [Native|Public|HasOutParms]
	// Offset: 0x14eb1c48
	// Params: [ Num(6) Size(0xA8) ]
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, uint8_t bFromSweep, const struct FHitResult& SweepResult);
};

// Object: Class Breakthrough.BattleFeildFortificationInterActorMarkerItem
// Size: 0x600 (Inherited: 0x5F0)
struct UBattleFeildFortificationInterActorMarkerItem : UGPInterActorMarkerItem
{
	DEFINE_UE_CLASS_HELPERS(UBattleFeildFortificationInterActorMarkerItem, "BattleFeildFortificationInterActorMarkerItem")

	struct AFortificationProxy* FortificationProxyActor; // 0x5E8(0x8)
	uint8_t Pad_0x5F8[0x8]; // 0x5F8(0x8)
};

// Object: Class Breakthrough.BattleFeildFortificationInterActorMarkerWidget
// Size: 0x7D0 (Inherited: 0x7B0)
struct UBattleFeildFortificationInterActorMarkerWidget : UGameMarkerBaseWidget
{
	DEFINE_UE_CLASS_HELPERS(UBattleFeildFortificationInterActorMarkerWidget, "BattleFeildFortificationInterActorMarkerWidget")

	uint8_t Pad_0x7B0[0x8]; // 0x7B0(0x8)
	struct UBattleFeildFortificationInterActorMarkerItem* FortificationInterActorMarkerItem; // 0x7B8(0x8)
	struct UFortificationCommonMarkerWidget* FortificationCommonMarkerWidget; // 0x7C0(0x8)
	uint8_t Pad_0x7C8[0x8]; // 0x7C8(0x8)
};

// Object: Class Breakthrough.BattleFieldCampSectorMarkerItem
// Size: 0x480 (Inherited: 0x460)
struct UBattleFieldCampSectorMarkerItem : UGPMarkerItemBase
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldCampSectorMarkerItem, "BattleFieldCampSectorMarkerItem")

	uint8_t Pad_0x460[0x8]; // 0x460(0x8)
	float CampSectorMarkerExistTime; // 0x468(0x4)
	uint8_t Pad_0x46C[0x4]; // 0x46C(0x4)
	struct ASpawnAreaHub* MarkedSpawnAreaHub; // 0x470(0x8)
	uint8_t Pad_0x478[0x8]; // 0x478(0x8)

	// Object: Function Breakthrough.BattleFieldCampSectorMarkerItem.OnCampSectorMarkerShowed
	// Flags: [Final|Native|Private]
	// Offset: 0x14eb2008
	// Params: [ Num(0) Size(0x0) ]
	void OnCampSectorMarkerShowed();

	// Object: Function Breakthrough.BattleFieldCampSectorMarkerItem.OnAfterRedeploy
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb1ff4
	// Params: [ Num(0) Size(0x0) ]
	void OnAfterRedeploy();
};

// Object: Class Breakthrough.BattleFieldCampSectorMarkerWidget
// Size: 0x7D0 (Inherited: 0x7B0)
struct UBattleFieldCampSectorMarkerWidget : UGameMarkerBaseWidget
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldCampSectorMarkerWidget, "BattleFieldCampSectorMarkerWidget")

	struct UBattleFieldCampSectorMarkerItem* BattleFieldCampSectorMarkerItem; // 0x7B0(0x8)
	struct UDFMImage* CampBg; // 0x7B8(0x8)
	struct UDFMImage* CampIcon; // 0x7C0(0x8)
	uint8_t Pad_0x7C8[0x8]; // 0x7C8(0x8)
};

// Object: Class Breakthrough.BattleFieldCampSectorMassMarkerWidget
// Size: 0x858 (Inherited: 0x848)
struct UBattleFieldCampSectorMassMarkerWidget : UDFMassMarkerBaseWidget
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldCampSectorMassMarkerWidget, "BattleFieldCampSectorMassMarkerWidget")

	struct UDFMImage* CampBg; // 0x848(0x8)
	struct UDFMImage* CampIcon; // 0x850(0x8)
};

// Object: Class Breakthrough.BattleFieldCommanderDataComponent
// Size: 0x258 (Inherited: 0xF8)
struct UBattleFieldCommanderDataComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldCommanderDataComponent, "BattleFieldCommanderDataComponent")

	int32_t Camp0CommanderRequestCountDown; // 0xF8(0x4)
	int32_t Camp1CommanderRequestCountDown; // 0xFC(0x4)
	int32_t TeamConstructCompletionFlag; // 0x100(0x4)
	uint8_t Pad_0x104[0x4]; // 0x104(0x4)
	struct TArray<uint64_t> CommanderChannelVoiceAuthority; // 0x108(0x10)
	uint8_t Pad_0x118[0x10]; // 0x118(0x10)
	struct ADFMPlayerState* Camp0CommanderPlayerState; // 0x128(0x8)
	struct ADFMPlayerState* Camp1CommanderPlayerState; // 0x130(0x8)
	struct TArray<struct ADFMPlayerState*> TeamLeaderArray; // 0x138(0x10)
	struct TArray<int32_t> InfactionArray; // 0x148(0x10)
	struct TArray<struct FTeamLeaderImpeachItem> TeamLeaderImpeachArray; // 0x158(0x10)
	struct TArray<struct FTeamConstructArrayItem> TeamConstructArray; // 0x168(0x10)
	struct TArray<int32_t> TeamConstructTemplateArray; // 0x178(0x10)
	uint8_t Pad_0x188[0x18]; // 0x188(0x18)
	struct FMulticastInlineDelegate OnNewChatMessageSend; // 0x1A0(0x10)
	struct TMap<int32_t, struct FText> TeamNameMap; // 0x1B0(0x50)
	int32_t FastRedeploySkillId; // 0x200(0x4)
	float FastRedeployDuration; // 0x204(0x4)
	float FastRedeployReduceCD; // 0x208(0x4)
	int32_t AttackReformSkillId; // 0x20C(0x4)
	struct TArray<int32_t> AttackReformStageDuration; // 0x210(0x10)
	int32_t AttackReformFirstValidTime; // 0x220(0x4)
	int32_t AttackReformDisplayOffsetTime; // 0x224(0x4)
	int32_t AttackReformRedeployOffsetTime; // 0x228(0x4)
	int32_t InfactionCountDown; // 0x22C(0x4)
	int32_t ImpeachRequestCoolDown; // 0x230(0x4)
	float ImpeachRequestDuration; // 0x234(0x4)
	int32_t CommanderRequestCoolDown; // 0x238(0x4)
	int32_t CampTotalNum; // 0x23C(0x4)
	struct TArray<float> WorkRankRequiredRate; // 0x240(0x10)
	uint8_t bVehicleTrackedHighlight : 1; // 0x250(0x1), Mask(0x1)
	uint8_t BitPad_0x250_1 : 7; // 0x250(0x1)
	uint8_t Pad_0x251[0x7]; // 0x251(0x7)

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.RequestVote
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb4c64
	// Params: [ Num(2) Size(0x9) ]
	void RequestVote(struct ADFMPlayerState* CurPS, uint8_t bAccept);

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.RequestImpeach
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb4b38
	// Params: [ Num(3) Size(0xA) ]
	void RequestImpeach(struct ADFMPlayerState* CurPS, uint8_t bForce, uint8_t bCommander);

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.RegisterMember
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb4a94
	// Params: [ Num(1) Size(0x8) ]
	void RegisterMember(struct ADFMPlayerState* InDFMPlayerState);

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.ReconstructTeamLeaderArray
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb4a80
	// Params: [ Num(0) Size(0x0) ]
	void ReconstructTeamLeaderArray();

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnServerMicStateChanged
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb49dc
	// Params: [ Num(1) Size(0x8) ]
	void OnServerMicStateChanged(struct AGPPlayerState* MicPlayerState);

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnRepTeamLeaderImpeachArray
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb49c8
	// Params: [ Num(0) Size(0x0) ]
	void OnRepTeamLeaderImpeachArray();

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnRepTeamConstructTemplateArray
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb49b4
	// Params: [ Num(0) Size(0x0) ]
	void OnRepTeamConstructTemplateArray();

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnRepTeamConstructCompletionFlag
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb49a0
	// Params: [ Num(0) Size(0x0) ]
	void OnRepTeamConstructCompletionFlag();

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnRepTeamConstructArray
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb498c
	// Params: [ Num(0) Size(0x0) ]
	void OnRepTeamConstructArray();

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnRepInfactionArray
	// Flags: [Final|Native|Protected]
	// Offset: 0xf778f34
	// Params: [ Num(0) Size(0x0) ]
	void OnRepInfactionArray();

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnRepCommanderChannelVoiceAuthority
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb4978
	// Params: [ Num(0) Size(0x0) ]
	void OnRepCommanderChannelVoiceAuthority();

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnRep_TeamLeaderArray
	// Flags: [Final|Native|Protected]
	// Offset: 0x10ac0034
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_TeamLeaderArray();

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnRep_Camp1CommanderPlayerState
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb4964
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_Camp1CommanderPlayerState();

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnRep_Camp0CommanderPlayerState
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb4950
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_Camp0CommanderPlayerState();

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnPlayerMarking
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0x14eb47f8
	// Params: [ Num(4) Size(0x1C) ]
	void OnPlayerMarking(uint64_t PlayerUin, int32_t OperationType, struct FVector MarkLocation, int32_t MarkingType);

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnImpeachCountDown
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb47e4
	// Params: [ Num(0) Size(0x0) ]
	void OnImpeachCountDown();

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnImpeachButtonClicked
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb47d0
	// Params: [ Num(0) Size(0x0) ]
	void OnImpeachButtonClicked();

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnCommanderPanelOperate
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb46b8
	// Params: [ Num(3) Size(0x18) ]
	void OnCommanderPanelOperate(int32_t OperationId, uint64_t CasterUin, uint64_t OperateUin);

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.OnClientChatInfoGet
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb45a8
	// Params: [ Num(1) Size(0x20) ]
	void OnClientChatInfoGet(struct FElectionChatInfo ElectionChatInfo);

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.GetTeamIdByIndex
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb44c4
	// Params: [ Num(3) Size(0xC) ]
	int32_t GetTeamIdByIndex(int32_t Index, int32_t Camp);

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.GetCommanderCharacter
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb4418
	// Params: [ Num(2) Size(0x10) ]
	struct ADFMPlayerState* GetCommanderCharacter(int32_t Camp);

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.GetAttackReformTotalTime
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb43e4
	// Params: [ Num(1) Size(0x4) ]
	float GetAttackReformTotalTime();

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.GetAttackReformStatus
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x14eb4174
	// Params: [ Num(8) Size(0x1A) ]
	uint8_t GetAttackReformStatus(int32_t Camp, float& OutReformTime, int32_t& OutReformStage, float& OutNextReformTime, float& OutCountingDown, float QueryTime, uint8_t bCheckEarlyTime);

	// Object: Function Breakthrough.BattleFieldCommanderDataComponent.BPGetTeamNameByTeamId
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb405c
	// Params: [ Num(2) Size(0x20) ]
	struct FText BPGetTeamNameByTeamId(int32_t InTeamId);
};

// Object: Class Breakthrough.BattleFieldCommanderOrdersComponent
// Size: 0x300 (Inherited: 0xF8)
struct UBattleFieldCommanderOrdersComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldCommanderOrdersComponent, "BattleFieldCommanderOrdersComponent")

	struct TMap<struct ADFMVehicleBase*, struct FVehicleThreatInfo> VehicleThreatValueMap; // 0xF8(0x50)
	struct TMap<ECampType, struct FCommanderVehicleThreatInfo> HighThreatVehicleMap; // 0x148(0x50)
	struct UCurveFloat* HideScoreToThreatRatioCurve; // 0x198(0x8)
	struct UCurveFloat* HideScoreToBalanceScoreRatioCurve; // 0x1A0(0x8)
	struct ABattleSectorAnchor* AttackerConcentratedFireSectorAnchor; // 0x1A8(0x8)
	int32_t AttackerConcentratedFireAnchorCampId; // 0x1B0(0x4)
	uint8_t Pad_0x1B4[0x4]; // 0x1B4(0x4)
	struct AGPCharacter* AttackerConcentratedFireAnchorCharacter; // 0x1B8(0x8)
	float AttackerConcentratedFireSectorAnchorRecordTime; // 0x1C0(0x4)
	uint8_t Pad_0x1C4[0x4]; // 0x1C4(0x4)
	struct ABattleSectorAnchor* DefenderConcentratedFireSectorAnchor; // 0x1C8(0x8)
	int32_t DefenderConcentratedFireAnchorCampId; // 0x1D0(0x4)
	uint8_t Pad_0x1D4[0x4]; // 0x1D4(0x4)
	struct AGPCharacter* DefenderConcentratedFireAnchorCharacter; // 0x1D8(0x8)
	float DefenderConcentratedFireSectorAnchorRecordTime; // 0x1E0(0x4)
	uint8_t Pad_0x1E4[0x24]; // 0x1E4(0x24)
	int32_t HighValueAnchorSkillId; // 0x208(0x4)
	int32_t HighThreatVehicleSkillId; // 0x20C(0x4)
	uint8_t Pad_0x210[0xF0]; // 0x210(0xF0)

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.VehicleDiedAddScore
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb5f6c
	// Params: [ Num(2) Size(0x10) ]
	void VehicleDiedAddScore(struct ADFMVehicleBase* Vehicle, struct AGPCharacter* AttackerCharacter);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.StartAttackReformProcess
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb5ec8
	// Params: [ Num(1) Size(0x1) ]
	void StartAttackReformProcess(ECampType InCampType);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnVehicleTakeDamage
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x14eb5dcc
	// Params: [ Num(2) Size(0x8A8) ]
	void OnVehicleTakeDamage(struct AActor* InActor, const struct FDamageResultInfo& DamageResultInfo);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnVehicleSpawned
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb5d28
	// Params: [ Num(1) Size(0x8) ]
	void OnVehicleSpawned(struct AActor* Vehicle);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnVehicleDied
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb5c84
	// Params: [ Num(1) Size(0x8) ]
	void OnVehicleDied(struct AActor* Vehicle);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnSectorOccupied
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb5be0
	// Params: [ Num(1) Size(0x4) ]
	void OnSectorOccupied(int32_t ActiveID);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnSectorAnchorOccupied
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb5b00
	// Params: [ Num(2) Size(0xC) ]
	void OnSectorAnchorOccupied(struct AActor* InActor, int32_t OccupyCampId);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnSectorActive
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb5a5c
	// Params: [ Num(1) Size(0x4) ]
	void OnSectorActive(int32_t ActiveID);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnGetOnVehicle
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb5944
	// Params: [ Num(3) Size(0x18) ]
	void OnGetOnVehicle(struct AActor* CHARACTER, struct AActor* Vehicle, struct FName Seat);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnFastRedeployCountDownTimer
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb58a0
	// Params: [ Num(1) Size(0x1) ]
	void OnFastRedeployCountDownTimer(ECampType InCampType);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnCamp1HighValueAnchorCountDownTimer
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb588c
	// Params: [ Num(0) Size(0x0) ]
	void OnCamp1HighValueAnchorCountDownTimer();

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnCamp1HighThreatVehicleCountDownTimer
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb5878
	// Params: [ Num(0) Size(0x0) ]
	void OnCamp1HighThreatVehicleCountDownTimer();

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnCamp0HighValueAnchorCountDownTimer
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb5864
	// Params: [ Num(0) Size(0x0) ]
	void OnCamp0HighValueAnchorCountDownTimer();

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnCamp0HighThreatVehicleCountDownTimer
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb5850
	// Params: [ Num(0) Size(0x0) ]
	void OnCamp0HighThreatVehicleCountDownTimer();

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnBreakthroughRankSkillUsed
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb56fc
	// Params: [ Num(4) Size(0x18) ]
	void OnBreakthroughRankSkillUsed(struct ADFMCharacter* CHARACTER, int32_t SkillId, int32_t CurrentCostScore, uint64_t VehicleId);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.OnAttackReformCountDownTimer
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb561c
	// Params: [ Num(2) Size(0x8) ]
	void OnAttackReformCountDownTimer(ECampType InCampType, int32_t CurrentStage);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.IsHighThreatVehicle
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb556c
	// Params: [ Num(2) Size(0x9) ]
	uint8_t IsHighThreatVehicle(struct AGPVehicleBase* Vehicle);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.HighTreatVehicleClearScore
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb5414
	// Params: [ Num(4) Size(0x11) ]
	void HighTreatVehicleClearScore(int32_t VehicleId, int32_t VehicleCamp, struct AGPCharacter* Commander, ECampType CommanderCamp);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.GetHideScore
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb53e0
	// Params: [ Num(1) Size(0x4) ]
	float GetHideScore();

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.GetConcentratedFireSectorAnchorScoreMultiplier
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb52f8
	// Params: [ Num(3) Size(0x10) ]
	float GetConcentratedFireSectorAnchorScoreMultiplier(struct ABattleSectorAnchor* InSectorAnchor, ECampType InCampType);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.GetBalanceScore
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb52c4
	// Params: [ Num(1) Size(0x4) ]
	float GetBalanceScore();

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.DefenderFailConcentratedFireTask
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb52b0
	// Params: [ Num(0) Size(0x0) ]
	void DefenderFailConcentratedFireTask();

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.DefenderCompleteConcentratedFireTask
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb529c
	// Params: [ Num(0) Size(0x0) ]
	void DefenderCompleteConcentratedFireTask();

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.CreateFastRedeployCountDownTimer
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb51f8
	// Params: [ Num(1) Size(0x1) ]
	void CreateFastRedeployCountDownTimer(ECampType InCampType);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.CompleteConcentratedFireTask
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb5154
	// Params: [ Num(1) Size(0x1) ]
	void CompleteConcentratedFireTask(ECampType CampType);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.CancelFastRedeployCountDownTimer
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb50b0
	// Params: [ Num(1) Size(0x1) ]
	void CancelFastRedeployCountDownTimer(ECampType InCampType);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.BroadCastSetConcentratedFireSectorAnchor
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb4f94
	// Params: [ Num(3) Size(0x10) ]
	void BroadCastSetConcentratedFireSectorAnchor(struct ABattleSectorAnchor* InConcentratedFireSectorAnchor, ECampType InCampType, float BehaviorScoreMultiplier);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.BroadCastCancelConcentratedFireSectorAnchor
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb4e78
	// Params: [ Num(3) Size(0x10) ]
	void BroadCastCancelConcentratedFireSectorAnchor(struct ABattleSectorAnchor* InConcentratedFireSectorAnchor, ECampType InCampType, float BehaviorScoreMultiplier);

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.AttackerFailConcentratedFireTask
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb4e64
	// Params: [ Num(0) Size(0x0) ]
	void AttackerFailConcentratedFireTask();

	// Object: Function Breakthrough.BattleFieldCommanderOrdersComponent.AttackerCompleteConcentratedFireTask
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb4e50
	// Params: [ Num(0) Size(0x0) ]
	void AttackerCompleteConcentratedFireTask();
};

// Object: Class Breakthrough.BattleFieldCommanderSkillComponent
// Size: 0x108 (Inherited: 0xF8)
struct UBattleFieldCommanderSkillComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldCommanderSkillComponent, "BattleFieldCommanderSkillComponent")

	int32_t FastRedeploySkillId; // 0xF8(0x4)
	int32_t CommanderCommumicationSkillID; // 0xFC(0x4)
	int32_t AttackReformSkillId; // 0x100(0x4)
	uint8_t Pad_0x104[0x4]; // 0x104(0x4)

	// Object: Function Breakthrough.BattleFieldCommanderSkillComponent.ClientWantUseSkillForAnyIdentity
	// Flags: [Net|NetReliableNative|Event|Public|NetServer]
	// Offset: 0x14eb6514
	// Params: [ Num(1) Size(0x4) ]
	void ClientWantUseSkillForAnyIdentity(int32_t SkillId);

	// Object: Function Breakthrough.BattleFieldCommanderSkillComponent.ClientWantUseNormalCommanderSkill
	// Flags: [Net|NetReliableNative|Event|Public|NetServer]
	// Offset: 0x14eb642c
	// Params: [ Num(2) Size(0x5) ]
	void ClientWantUseNormalCommanderSkill(int32_t SkillId, uint8_t CommanderRankSkillType);

	// Object: Function Breakthrough.BattleFieldCommanderSkillComponent.ClientWantUseCommanderSkill
	// Flags: [Net|NetReliableNative|Event|Public|NetServer]
	// Offset: 0x14eb6308
	// Params: [ Num(3) Size(0xD) ]
	void ClientWantUseCommanderSkill(struct AActor* InMaringActor, int32_t SkillId, uint8_t CommanderRankSkillType);

	// Object: Function Breakthrough.BattleFieldCommanderSkillComponent.ClientCannotUseCommanderSkill
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0x14eb6220
	// Params: [ Num(2) Size(0x5) ]
	void ClientCannotUseCommanderSkill(int32_t SkillId, ESkillUIState InSkillState);
};

// Object: Class Breakthrough.BattleFieldCommanderSkillController
// Size: 0x88 (Inherited: 0x80)
struct UBattleFieldCommanderSkillController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldCommanderSkillController, "BattleFieldCommanderSkillController")

	struct UBattleFieldCommanderSkillView* BattleFieldCommanderSkillView; // 0x80(0x8)
};

// Object: Class Breakthrough.BattleFieldCommanderSkillItem
// Size: 0x5E8 (Inherited: 0x3F0)
struct UBattleFieldCommanderSkillItem : URankSkillBase
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldCommanderSkillItem, "BattleFieldCommanderSkillItem")

	struct UDFTextBlock* SkillNameText; // 0x3F0(0x8)
	struct UDFTextBlock* SkillDetailText; // 0x3F8(0x8)
	struct UDFTextBlock* PlayerScoreText; // 0x400(0x8)
	struct UDFTextBlock* CDTimeText; // 0x408(0x8)
	struct UDFImage* SkillImg; // 0x410(0x8)
	struct UDFNamedSlot* DFNamedSlot_Marker; // 0x418(0x8)
	struct UDFButton* DFButton_30; // 0x420(0x8)
	struct UDFRichTextBlock* DFRichTextBlock_Tips; // 0x428(0x8)
	struct UBreakthroughSectorAnchorProgress* WBP_TipsPro_OccupyPoint; // 0x430(0x8)
	struct UUserWidget* CommonKeyIconBoxText; // 0x438(0x8)
	struct UDFRichTextBlock* ZoomText; // 0x440(0x8)
	struct UImage* IconImage; // 0x448(0x8)
	struct UImage* DFImage_176; // 0x450(0x8)
	struct UImage* DFImage_Arrows; // 0x458(0x8)
	struct FRankSkillInfo RankSkillInfo; // 0x460(0x78)
	uint8_t Pad_0x4D8[0x10]; // 0x4D8(0x10)
	struct AActor* MarkingActor; // 0x4E8(0x8)
	uint8_t Pad_0x4F0[0x8]; // 0x4F0(0x8)
	float BattleSupportTipsShowDuration; // 0x4F8(0x4)
	uint8_t Pad_0x4FC[0x4]; // 0x4FC(0x4)
	struct FText ScoreNotEnough; // 0x500(0x18)
	struct FText CooldownText; // 0x518(0x18)
	struct FText MarkingAnchorText; // 0x530(0x18)
	struct FText MarkingVehicleText; // 0x548(0x18)
	struct FText MarkingAnchorRichText; // 0x560(0x18)
	struct FText MarkingVehicleRichText; // 0x578(0x18)
	struct FText MarkingAnchorKeyText; // 0x590(0x18)
	struct FText MarkingVehiclKeyText; // 0x5A8(0x18)
	int32_t HighValueAnchorSkillId; // 0x5C0(0x4)
	int32_t HighThreatVehicleSkillId; // 0x5C4(0x4)
	struct FName CommanderSkillPanelConfigName; // 0x5C8(0x8)
	struct UUserWidget* MarkerPointClass; // 0x5D0(0x8)
	struct FName CommonKeyIconBoxName; // 0x5D8(0x8)
	struct FName ZoomTextName; // 0x5E0(0x8)

	// Object: Function Breakthrough.BattleFieldCommanderSkillItem.OnRankSkillInCampCD
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb65e8
	// Params: [ Num(1) Size(0x4) ]
	void OnRankSkillInCampCD(int32_t RankSkillId);

	// Object: Function Breakthrough.BattleFieldCommanderSkillItem.OnItemClicked
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb65d4
	// Params: [ Num(0) Size(0x0) ]
	void OnItemClicked();
};

// Object: Class Breakthrough.BattleFieldCommanderSkillMainView
// Size: 0x490 (Inherited: 0x3F0)
struct UBattleFieldCommanderSkillMainView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldCommanderSkillMainView, "BattleFieldCommanderSkillMainView")

	struct UDFTextBlock* SkillNameText; // 0x3F0(0x8)
	struct UDFTextBlock* SkillDetailText; // 0x3F8(0x8)
	struct UDFHorizontalBox* DFHorizontalBox_CommanderSkill; // 0x400(0x8)
	struct UDFTextBlock* PlayerScoreText; // 0x408(0x8)
	struct UUserWidget* CommonButtonClose; // 0x410(0x8)
	struct UDFWaterfallScrollView* DFWaterfallScrollView_52; // 0x418(0x8)
	struct FName DisplayInputActionName_Exit; // 0x420(0x8)
	uint8_t Pad_0x428[0x8]; // 0x428(0x8)
	struct TArray<struct UBattleFieldCommanderSkillItem*> CommanderSkillItems; // 0x430(0x10)
	uint8_t Pad_0x440[0x8]; // 0x440(0x8)
	struct TArray<struct FRankSkillInfo> CommanderSkillInfos; // 0x448(0x10)
	uint8_t Pad_0x458[0x8]; // 0x458(0x8)
	struct UUserWidget* CommanderSkillItemClass; // 0x460(0x8)
	float SkillStateRefreshDeltaTime; // 0x468(0x4)
	uint8_t bHideInWater : 1; // 0x46C(0x1), Mask(0x1)
	uint8_t BitPad_0x46C_1 : 7; // 0x46C(0x1)
	uint8_t Pad_0x46D[0x3]; // 0x46D(0x3)
	struct AGameState_Breakthrough* GameState; // 0x470(0x8)
	struct UDFMBattleFieldSystem* BattleFieldSystem; // 0x478(0x8)
	struct ADFMPlayerState* LocalPlayerState; // 0x480(0x8)
	struct UBattleFieldCommanderRankSkillTableManager* BattleFieldCommanderRankSkillTableManager; // 0x488(0x8)

	// Object: Function Breakthrough.BattleFieldCommanderSkillMainView.UpdateInWater
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb8d88
	// Params: [ Num(0) Size(0x0) ]
	void UpdateInWater();

	// Object: Function Breakthrough.BattleFieldCommanderSkillMainView.OnTeamIdentityReplicate
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb8ce4
	// Params: [ Num(1) Size(0x8) ]
	void OnTeamIdentityReplicate(struct AGPPlayerState* InPlayerState);

	// Object: Function Breakthrough.BattleFieldCommanderSkillMainView.OnRefreshData
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0x14eb8cd0
	// Params: [ Num(0) Size(0x0) ]
	void OnRefreshData();

	// Object: Function Breakthrough.BattleFieldCommanderSkillMainView.OnRaiseWatchControlAction
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb8c2c
	// Params: [ Num(1) Size(0x1) ]
	void OnRaiseWatchControlAction(uint8_t RaiseWatchControlActionType);

	// Object: Function Breakthrough.BattleFieldCommanderSkillMainView.OnInputTypeChanged
	// Flags: [Final|Native|Private]
	// Offset: 0x14eb8b88
	// Params: [ Num(1) Size(0x1) ]
	void OnInputTypeChanged(EGPInputType NewInputType);

	// Object: Function Breakthrough.BattleFieldCommanderSkillMainView.OnHighThreatOrFireSectorAnchorStateChange
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb8b74
	// Params: [ Num(0) Size(0x0) ]
	void OnHighThreatOrFireSectorAnchorStateChange();

	// Object: Function Breakthrough.BattleFieldCommanderSkillMainView.OnHandleCloseBtnClick
	// Flags: [Final|Native|Private|BlueprintCallable]
	// Offset: 0x14eb8ac8
	// Params: [ Num(1) Size(0x1) ]
	void OnHandleCloseBtnClick(uint8_t bImmediately);

	// Object: Function Breakthrough.BattleFieldCommanderSkillMainView.OnFadeOutEnd
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb8ab4
	// Params: [ Num(0) Size(0x0) ]
	void OnFadeOutEnd();

	// Object: Function Breakthrough.BattleFieldCommanderSkillMainView.OnCloseBtnClick
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14eb8aa0
	// Params: [ Num(0) Size(0x0) ]
	void OnCloseBtnClick();

	// Object: Function Breakthrough.BattleFieldCommanderSkillMainView.OnClientRedeployStateChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb89fc
	// Params: [ Num(1) Size(0x4) ]
	void OnClientRedeployStateChanged(ERedeployStateFuture InRedeployState);

	// Object: Function Breakthrough.BattleFieldCommanderSkillMainView.OnBattleFeildCommanderSkillViewClose
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb89e8
	// Params: [ Num(0) Size(0x0) ]
	void OnBattleFeildCommanderSkillViewClose();

	// Object: Function Breakthrough.BattleFieldCommanderSkillMainView.BP_OnRefreshData
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_OnRefreshData();

	// Object: Function Breakthrough.BattleFieldCommanderSkillMainView.BP_FadeOut
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	float BP_FadeOut();
};

// Object: Class Breakthrough.BattleFieldCommanderSkillView
// Size: 0x4A0 (Inherited: 0x400)
struct UBattleFieldCommanderSkillView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldCommanderSkillView, "BattleFieldCommanderSkillView")

	struct UDFTextBlock* SkillNameText; // 0x400(0x8)
	struct UDFTextBlock* SkillDetailText; // 0x408(0x8)
	struct UDFHorizontalBox* DFHorizontalBox_CommanderSkill; // 0x410(0x8)
	struct UDFTextBlock* PlayerScoreText; // 0x418(0x8)
	struct UUserWidget* CommonButtonClose; // 0x420(0x8)
	struct UDFWaterfallScrollView* DFWaterfallScrollView_52; // 0x428(0x8)
	struct FName DisplayInputActionName_Exit; // 0x430(0x8)
	uint8_t Pad_0x438[0x8]; // 0x438(0x8)
	struct TArray<struct UBattleFieldCommanderSkillItem*> CommanderSkillItems; // 0x440(0x10)
	uint8_t Pad_0x450[0x8]; // 0x450(0x8)
	struct TArray<struct FRankSkillInfo> CommanderSkillInfos; // 0x458(0x10)
	uint8_t Pad_0x468[0x8]; // 0x468(0x8)
	struct UUserWidget* CommanderSkillItemClass; // 0x470(0x8)
	float SkillStateRefreshDeltaTime; // 0x478(0x4)
	uint8_t bHideInWater : 1; // 0x47C(0x1), Mask(0x1)
	uint8_t BitPad_0x47C_1 : 7; // 0x47C(0x1)
	uint8_t Pad_0x47D[0x3]; // 0x47D(0x3)
	struct AGameState_Breakthrough* GameState; // 0x480(0x8)
	struct UDFMBattleFieldSystem* BattleFieldSystem; // 0x488(0x8)
	struct ADFMPlayerState* LocalPlayerState; // 0x490(0x8)
	struct UBattleFieldCommanderRankSkillTableManager* BattleFieldCommanderRankSkillTableManager; // 0x498(0x8)

	// Object: Function Breakthrough.BattleFieldCommanderSkillView.UpdateInWater
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb915c
	// Params: [ Num(0) Size(0x0) ]
	void UpdateInWater();

	// Object: Function Breakthrough.BattleFieldCommanderSkillView.OnTeamIdentityReplicate
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb90b8
	// Params: [ Num(1) Size(0x8) ]
	void OnTeamIdentityReplicate(struct AGPPlayerState* InPlayerState);

	// Object: Function Breakthrough.BattleFieldCommanderSkillView.OnRefreshData
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0x14eb90a4
	// Params: [ Num(0) Size(0x0) ]
	void OnRefreshData();

	// Object: Function Breakthrough.BattleFieldCommanderSkillView.OnRaiseWatchControlAction
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb9000
	// Params: [ Num(1) Size(0x1) ]
	void OnRaiseWatchControlAction(uint8_t RaiseWatchControlActionType);

	// Object: Function Breakthrough.BattleFieldCommanderSkillView.OnInputTypeChanged
	// Flags: [Final|Native|Private]
	// Offset: 0x14eb8f5c
	// Params: [ Num(1) Size(0x1) ]
	void OnInputTypeChanged(EGPInputType NewInputType);

	// Object: Function Breakthrough.BattleFieldCommanderSkillView.OnHighThreatOrFireSectorAnchorStateChange
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb8f48
	// Params: [ Num(0) Size(0x0) ]
	void OnHighThreatOrFireSectorAnchorStateChange();

	// Object: Function Breakthrough.BattleFieldCommanderSkillView.OnHandleCloseBtnClick
	// Flags: [Final|Native|Private|BlueprintCallable]
	// Offset: 0x14eb8e9c
	// Params: [ Num(1) Size(0x1) ]
	void OnHandleCloseBtnClick(uint8_t bImmediately);

	// Object: Function Breakthrough.BattleFieldCommanderSkillView.OnFadeOutEnd
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb8e88
	// Params: [ Num(0) Size(0x0) ]
	void OnFadeOutEnd();

	// Object: Function Breakthrough.BattleFieldCommanderSkillView.OnCloseBtnClick
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14eb8e74
	// Params: [ Num(0) Size(0x0) ]
	void OnCloseBtnClick();

	// Object: Function Breakthrough.BattleFieldCommanderSkillView.OnClientRedeployStateChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb8dd0
	// Params: [ Num(1) Size(0x4) ]
	void OnClientRedeployStateChanged(ERedeployStateFuture InRedeployState);

	// Object: Function Breakthrough.BattleFieldCommanderSkillView.OnBattleFeildCommanderSkillViewClose
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eb8dbc
	// Params: [ Num(0) Size(0x0) ]
	void OnBattleFeildCommanderSkillViewClose();

	// Object: Function Breakthrough.BattleFieldCommanderSkillView.BP_OnRefreshData
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_OnRefreshData();

	// Object: Function Breakthrough.BattleFieldCommanderSkillView.BP_FadeOut
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	float BP_FadeOut();
};

// Object: Class Breakthrough.BreakthroughBalanceDataTableManager
// Size: 0xB8 (Inherited: 0x30)
struct UBreakthroughBalanceDataTableManager : UDataTableSystemManagerBase
{
	DEFINE_UE_CLASS_HELPERS(UBreakthroughBalanceDataTableManager, "BreakthroughBalanceDataTableManager")

	uint8_t Pad_0x30[0x78]; // 0x30(0x78)
	struct TArray<struct UCurveFloat*> CurveAssets; // 0xA8(0x10)

	// Object: Function Breakthrough.BreakthroughBalanceDataTableManager.OnCurveDataLoadComplete
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb9470
	// Params: [ Num(1) Size(0x10) ]
	void OnCurveDataLoadComplete(struct TArray<struct FSoftObjectPath> Assets);

	// Object: Function Breakthrough.BreakthroughBalanceDataTableManager.GetOcuupyStatusSpeedCurve
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb9314
	// Params: [ Num(5) Size(0x20) ]
	struct UCurveFloat* GetOcuupyStatusSpeedCurve(struct UWorld* InWorld, int32_t InMapID, int32_t InSectorID, int32_t InCampId);

	// Object: Function Breakthrough.BreakthroughBalanceDataTableManager.GetBalanceDataRow
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x14eb9190
	// Params: [ Num(3) Size(0x78) ]
	void GetBalanceDataRow(struct UWorld* InWorld, int32_t InMapID, struct FBreakthroughBalanceDataRow& OutRow);
};

// Object: Class Breakthrough.ConquestBalanceDataTableManager
// Size: 0x310 (Inherited: 0x30)
struct UConquestBalanceDataTableManager : UDataTableSystemManagerBase
{
	DEFINE_UE_CLASS_HELPERS(UConquestBalanceDataTableManager, "ConquestBalanceDataTableManager")

	uint8_t Pad_0x30[0x2D0]; // 0x30(0x2D0)
	struct TArray<struct UCurveFloat*> CurveAssets; // 0x300(0x10)

	// Object: Function Breakthrough.ConquestBalanceDataTableManager.OnCurveDataLoadComplete
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb9910
	// Params: [ Num(1) Size(0x10) ]
	void OnCurveDataLoadComplete(struct TArray<struct FSoftObjectPath> Assets);

	// Object: Function Breakthrough.ConquestBalanceDataTableManager.GetOcuupyStatusSpeedCurve
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb97b4
	// Params: [ Num(5) Size(0x20) ]
	struct UCurveFloat* GetOcuupyStatusSpeedCurve(struct UWorld* InWorld, int32_t InMapID, int32_t InSectorID, int32_t InCampId);

	// Object: Function Breakthrough.ConquestBalanceDataTableManager.GetBalanceDataRow
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x14eb9548
	// Params: [ Num(3) Size(0x2D0) ]
	void GetBalanceDataRow(struct UWorld* InWorld, int32_t InMapID, struct FConquestBalanceDataRow& OutRow);
};

// Object: Class Breakthrough.RedeployCommanderConfigManager
// Size: 0x40 (Inherited: 0x30)
struct URedeployCommanderConfigManager : UDataTableSystemManagerBase
{
	DEFINE_UE_CLASS_HELPERS(URedeployCommanderConfigManager, "RedeployCommanderConfigManager")

	uint8_t Pad_0x30[0x10]; // 0x30(0x10)
};

// Object: Class Breakthrough.MapGemGameSettingManager
// Size: 0x40 (Inherited: 0x30)
struct UMapGemGameSettingManager : UDataTableSystemManagerBase
{
	DEFINE_UE_CLASS_HELPERS(UMapGemGameSettingManager, "MapGemGameSettingManager")

	uint8_t Pad_0x30[0x10]; // 0x30(0x10)
};

// Object: Class Breakthrough.BattleFieldDeduceComponent
// Size: 0x2C0 (Inherited: 0xF8)
struct UBattleFieldDeduceComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldDeduceComponent, "BattleFieldDeduceComponent")

	uint8_t Pad_0xF8[0x130]; // 0xF8(0x130)
	struct TMap<uint32_t, struct AGPSequenceActor*> SequenceActorPool; // 0x228(0x50)
	uint8_t Pad_0x278[0x8]; // 0x278(0x8)
	struct ABattleSectorBase* HasActivedSector; // 0x280(0x8)
	uint8_t Pad_0x288[0x38]; // 0x288(0x38)

	// Object: Function Breakthrough.BattleFieldDeduceComponent.OnPlayGlobalDeduceDelay
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb9f28
	// Params: [ Num(1) Size(0x4) ]
	void OnPlayGlobalDeduceDelay(int32_t InIndex);

	// Object: Function Breakthrough.BattleFieldDeduceComponent.OnPlayDeduceDelay
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb9e84
	// Params: [ Num(1) Size(0x4) ]
	void OnPlayDeduceDelay(int32_t InIndex);

	// Object: Function Breakthrough.BattleFieldDeduceComponent.OnDeduceDataLoadComplete
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0x14eb9d78
	// Params: [ Num(2) Size(0x19) ]
	void OnDeduceDataLoadComplete(const struct FSoftObjectPath& Asset, uint8_t bNeedLoop);

	// Object: Function Breakthrough.BattleFieldDeduceComponent.OnClientIsTransitioning
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb9c90
	// Params: [ Num(2) Size(0x5) ]
	void OnClientIsTransitioning(float InTransTime, uint8_t InIsTransitioning);

	// Object: Function Breakthrough.BattleFieldDeduceComponent.OnClientCurStageChanged
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb9bec
	// Params: [ Num(1) Size(0x4) ]
	void OnClientCurStageChanged(int32_t InCurStage);

	// Object: Function Breakthrough.BattleFieldDeduceComponent.OnClientCamp1ScoreChanged
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb9b48
	// Params: [ Num(1) Size(0x4) ]
	void OnClientCamp1ScoreChanged(int32_t InCamp1Score);

	// Object: Function Breakthrough.BattleFieldDeduceComponent.OnClientCamp0ScoreChanged
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb9aa4
	// Params: [ Num(1) Size(0x4) ]
	void OnClientCamp0ScoreChanged(int32_t InCamp0Score);

	// Object: Function Breakthrough.BattleFieldDeduceComponent.OnClientBattleFieldSectorActiveChanged
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb9a00
	// Params: [ Num(1) Size(0x8) ]
	void OnClientBattleFieldSectorActiveChanged(struct AActor* InSectorActor);
};

// Object: Class Breakthrough.BattleFieldDynamicLayoutComponent
// Size: 0x1A0 (Inherited: 0xF8)
struct UBattleFieldDynamicLayoutComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldDynamicLayoutComponent, "BattleFieldDynamicLayoutComponent")

	int32_t CurrentDynamicLayoutId; // 0xF8(0x4)
	uint8_t Pad_0xFC[0x54]; // 0xFC(0x54)
	struct TMap<int32_t, struct FBattleFieldDynamicLayoutRow> DynamicLayoutRowMap; // 0x150(0x50)
};

// Object: Class Breakthrough.BattleFieldElevator
// Size: 0x5F8 (Inherited: 0x5C8)
struct ABattleFieldElevator : AInteractor_Elevator
{
	DEFINE_UE_CLASS_HELPERS(ABattleFieldElevator, "BattleFieldElevator")

	struct UGPAudioEventAsset* ElevatorMovingEndAudio; // 0x5C8(0x8)
	float PlayElevatorMovingUpEndAudioTime; // 0x5D0(0x4)
	float PlayElevatorMovingDownEndAudioTime; // 0x5D4(0x4)
	uint8_t Pad_0x5D8[0x8]; // 0x5D8(0x8)
	struct UGPAudioEventAsset* ElevatorBellDownAudio; // 0x5E0(0x8)
	float PlayElevatorBellUpAudioTime; // 0x5E8(0x4)
	float PlayElevatorBellDownAudioTime; // 0x5EC(0x4)
	uint8_t Pad_0x5F0[0x8]; // 0x5F0(0x8)

	// Object: Function Breakthrough.BattleFieldElevator.OnPlayElevatorMovingEndAudioTimerHandle
	// Flags: [Final|Native|Public]
	// Offset: 0x14eba00c
	// Params: [ Num(0) Size(0x0) ]
	void OnPlayElevatorMovingEndAudioTimerHandle();

	// Object: Function Breakthrough.BattleFieldElevator.OnPlayElevatorBellDownAudioTimerHandle
	// Flags: [Final|Native|Public]
	// Offset: 0x14eb9ff8
	// Params: [ Num(0) Size(0x0) ]
	void OnPlayElevatorBellDownAudioTimerHandle();
};

// Object: Class Breakthrough.BattleSectorExtraManager
// Size: 0x40 (Inherited: 0x30)
struct UBattleSectorExtraManager : UDataTableSystemManagerBase
{
	DEFINE_UE_CLASS_HELPERS(UBattleSectorExtraManager, "BattleSectorExtraManager")

	uint8_t Pad_0x30[0x10]; // 0x30(0x10)
};

// Object: Class Breakthrough.BattleFieldHighThreatVehicleManager
// Size: 0x40 (Inherited: 0x30)
struct UBattleFieldHighThreatVehicleManager : UDataTableSystemManagerBase
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldHighThreatVehicleManager, "BattleFieldHighThreatVehicleManager")

	uint8_t Pad_0x30[0x10]; // 0x30(0x10)
};

// Object: Class Breakthrough.BattleConcentratedFireManager
// Size: 0x40 (Inherited: 0x30)
struct UBattleConcentratedFireManager : UDataTableSystemManagerBase
{
	DEFINE_UE_CLASS_HELPERS(UBattleConcentratedFireManager, "BattleConcentratedFireManager")

	uint8_t Pad_0x30[0x10]; // 0x30(0x10)
};

// Object: Class Breakthrough.BattleSectorConcentratedFireManager
// Size: 0x40 (Inherited: 0x30)
struct UBattleSectorConcentratedFireManager : UDataTableSystemManagerBase
{
	DEFINE_UE_CLASS_HELPERS(UBattleSectorConcentratedFireManager, "BattleSectorConcentratedFireManager")

	uint8_t Pad_0x30[0x10]; // 0x30(0x10)
};

// Object: Class Breakthrough.BehaviorScoreExtraByTagTableManager
// Size: 0xA8 (Inherited: 0x30)
struct UBehaviorScoreExtraByTagTableManager : UDataTableSystemManagerBase
{
	DEFINE_UE_CLASS_HELPERS(UBehaviorScoreExtraByTagTableManager, "BehaviorScoreExtraByTagTableManager")

	uint8_t Pad_0x30[0x78]; // 0x30(0x78)
};

// Object: Class Breakthrough.BattleFieldFreeBuildFortificationProxyItem
// Size: 0x5E8 (Inherited: 0x3F0)
struct UBattleFieldFreeBuildFortificationProxyItem : URankSkillBase
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldFreeBuildFortificationProxyItem, "BattleFieldFreeBuildFortificationProxyItem")

	struct UDFTextBlock* SkillNameText; // 0x3F0(0x8)
	struct UDFTextBlock* SkillDetailText; // 0x3F8(0x8)
	struct UDFTextBlock* PlayerScoreText; // 0x400(0x8)
	struct UDFTextBlock* CDTimeText; // 0x408(0x8)
	struct UDFImage* SkillImg; // 0x410(0x8)
	struct UDFNamedSlot* DFNamedSlot_Marker; // 0x418(0x8)
	struct UDFButton* DFButton_30; // 0x420(0x8)
	struct UDFRichTextBlock* DFRichTextBlock_Tips; // 0x428(0x8)
	struct UBreakthroughSectorAnchorProgress* WBP_TipsPro_OccupyPoint; // 0x430(0x8)
	struct UUserWidget* CommonKeyIconBoxText; // 0x438(0x8)
	struct UDFRichTextBlock* ZoomText; // 0x440(0x8)
	struct UImage* IconImage; // 0x448(0x8)
	struct UImage* DFImage_176; // 0x450(0x8)
	struct UImage* DFImage_Arrows; // 0x458(0x8)
	struct FRankSkillInfo RankSkillInfo; // 0x460(0x78)
	uint8_t Pad_0x4D8[0x8]; // 0x4D8(0x8)
	int32_t FreeBuildSkillID; // 0x4E0(0x4)
	uint8_t Pad_0x4E4[0x4]; // 0x4E4(0x4)
	struct AActor* MarkingActor; // 0x4E8(0x8)
	uint8_t Pad_0x4F0[0x8]; // 0x4F0(0x8)
	float BattleSupportTipsShowDuration; // 0x4F8(0x4)
	uint8_t Pad_0x4FC[0x4]; // 0x4FC(0x4)
	struct FText ScoreNotEnough; // 0x500(0x18)
	struct FText CooldownText; // 0x518(0x18)
	struct FText MarkingAnchorText; // 0x530(0x18)
	struct FText MarkingVehicleText; // 0x548(0x18)
	struct FText MarkingAnchorRichText; // 0x560(0x18)
	struct FText MarkingVehicleRichText; // 0x578(0x18)
	struct FText MarkingAnchorKeyText; // 0x590(0x18)
	struct FText MarkingVehiclKeyText; // 0x5A8(0x18)
	int32_t HighValueAnchorSkillId; // 0x5C0(0x4)
	int32_t HighThreatVehicleSkillId; // 0x5C4(0x4)
	struct FName CommanderSkillPanelConfigName; // 0x5C8(0x8)
	struct UUserWidget* MarkerPointClass; // 0x5D0(0x8)
	struct FName CommonKeyIconBoxName; // 0x5D8(0x8)
	struct FName ZoomTextName; // 0x5E0(0x8)

	// Object: Function Breakthrough.BattleFieldFreeBuildFortificationProxyItem.OnRankSkillInCampCD
	// Flags: [Final|Native|Public]
	// Offset: 0x14eba078
	// Params: [ Num(1) Size(0x4) ]
	void OnRankSkillInCampCD(int32_t RankSkillId);

	// Object: Function Breakthrough.BattleFieldFreeBuildFortificationProxyItem.OnItemClicked
	// Flags: [Final|Native|Public]
	// Offset: 0x14eba064
	// Params: [ Num(0) Size(0x0) ]
	void OnItemClicked();
};

// Object: Class Breakthrough.BattleFieldFreeBuildInterActorMarkerWidget
// Size: 0x910 (Inherited: 0x900)
struct UBattleFieldFreeBuildInterActorMarkerWidget : UInterActorMarkerWidget
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldFreeBuildInterActorMarkerWidget, "BattleFieldFreeBuildInterActorMarkerWidget")

	uint8_t Pad_0x900[0x8]; // 0x900(0x8)
	struct UBattleFieldFreeFortificationInterActorMarkerItem* FortificationMarkerItem; // 0x908(0x8)
};

// Object: Class Breakthrough.BattleFieldFreeBuildInterActorMassMarkerWidget
// Size: 0xA20 (Inherited: 0xA08)
struct UBattleFieldFreeBuildInterActorMassMarkerWidget : UInterActorMassMarkerWidget
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldFreeBuildInterActorMassMarkerWidget, "BattleFieldFreeBuildInterActorMassMarkerWidget")

	uint8_t Pad_0xA08[0x8]; // 0xA08(0x8)
	struct AFortificationProxy* FortificationProxy; // 0xA10(0x8)
	uint8_t Pad_0xA18[0x8]; // 0xA18(0x8)
};

// Object: Class Breakthrough.BattleFieldFreeBuildSkillComponent
// Size: 0xF8 (Inherited: 0xF8)
struct UBattleFieldFreeBuildSkillComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldFreeBuildSkillComponent, "BattleFieldFreeBuildSkillComponent")
};

// Object: Class Breakthrough.BattleFieldFreeBuildSkillMainView
// Size: 0x508 (Inherited: 0x3F0)
struct UBattleFieldFreeBuildSkillMainView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldFreeBuildSkillMainView, "BattleFieldFreeBuildSkillMainView")

	struct UDFTextBlock* SkillNameText; // 0x3F0(0x8)
	struct UDFTextBlock* SkillDetailText; // 0x3F8(0x8)
	struct UDFHorizontalBox* DFHorizontalBox_FortificationSkill; // 0x400(0x8)
	struct UDFTextBlock* PlayerScoreText; // 0x408(0x8)
	struct UUserWidget* CommonButtonClose; // 0x410(0x8)
	struct UDFTextBlock* AvailableNumText; // 0x418(0x8)
	struct FName AvailableNumTextWidgetName; // 0x420(0x8)
	struct UDFImage* IdentityIconImage; // 0x428(0x8)
	struct FName IdentityIconImageWidgetName; // 0x430(0x8)
	struct UDFTipsAnchor* PhaseSelectTipHoverAnchorWidget; // 0x438(0x8)
	struct FName PhaseSelectTipHoverAnchorWidgetName; // 0x440(0x8)
	struct FName DisplayInputActionName_Exit; // 0x448(0x8)
	int32_t DisplayInputActionHandle_Exit; // 0x450(0x4)
	struct FName DisplayInputActionName_Tips; // 0x454(0x8)
	int32_t DisplayInputActionHandle_Tips; // 0x45C(0x4)
	uint8_t bIsShowTips : 1; // 0x460(0x1), Mask(0x1)
	uint8_t BitPad_0x460_1 : 7; // 0x460(0x1)
	uint8_t Pad_0x461[0x7]; // 0x461(0x7)
	struct TArray<struct UBattleFieldFreeBuildFortificationProxyItem*> FortificationProxyItems; // 0x468(0x10)
	uint8_t Pad_0x478[0x8]; // 0x478(0x8)
	struct TArray<struct FRankSkillInfo> CommanderSkillInfos; // 0x480(0x10)
	uint8_t Pad_0x490[0x8]; // 0x490(0x8)
	struct UUserWidget* FortificationProxyItemClass; // 0x498(0x8)
	float SkillStateRefreshDeltaTime; // 0x4A0(0x4)
	uint8_t bHideInWater : 1; // 0x4A4(0x1), Mask(0x1)
	uint8_t BitPad_0x4A4_1 : 7; // 0x4A4(0x1)
	uint8_t Pad_0x4A5[0x3]; // 0x4A5(0x3)
	struct TMap<ETeamIdentity, struct FSoftObjectPath> IdentityIconMap; // 0x4A8(0x50)
	int32_t FreeBuildSkillID; // 0x4F8(0x4)
	uint8_t Pad_0x4FC[0xC]; // 0x4FC(0xC)

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.UpdateSkillUIState
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eba774
	// Params: [ Num(1) Size(0x4) ]
	void UpdateSkillUIState(float InDeltaTime);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.UpdateInWater
	// Flags: [Final|Native|Public]
	// Offset: 0x14eba760
	// Params: [ Num(0) Size(0x0) ]
	void UpdateInWater();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.UpdateAvailableNum
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eba74c
	// Params: [ Num(0) Size(0x0) ]
	void UpdateAvailableNum();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.ShowTips
	// Flags: [Final|Native|Private|BlueprintCallable]
	// Offset: 0x14eba738
	// Params: [ Num(0) Size(0x0) ]
	void ShowTips();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.RefreshScore
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eba724
	// Params: [ Num(0) Size(0x0) ]
	void RefreshScore();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.RefreshIdentityIcon
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eba710
	// Params: [ Num(0) Size(0x0) ]
	void RefreshIdentityIcon();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.OnUnhoverTipsOpen
	// Flags: [Final|Native|Public]
	// Offset: 0x14eba66c
	// Params: [ Num(1) Size(0x1) ]
	void OnUnhoverTipsOpen(ETipsTriggerReason TriggerReason);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.OnTeamIdentityReplicate
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eba5c8
	// Params: [ Num(1) Size(0x8) ]
	void OnTeamIdentityReplicate(struct AGPPlayerState* InPlayerState);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.OnInputTypeChanged
	// Flags: [Final|Native|Private]
	// Offset: 0x14eba524
	// Params: [ Num(1) Size(0x1) ]
	void OnInputTypeChanged(EGPInputType NewInputType);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.OnHoverTipsOpen
	// Flags: [Final|Native|Public]
	// Offset: 0x14eba480
	// Params: [ Num(1) Size(0x1) ]
	void OnHoverTipsOpen(ETipsTriggerReason TriggerReason);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.OnHighThreatOrFireSectorAnchorStateChange
	// Flags: [Final|Native|Public]
	// Offset: 0x14eba46c
	// Params: [ Num(0) Size(0x0) ]
	void OnHighThreatOrFireSectorAnchorStateChange();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.OnHandleCloseBtnClick
	// Flags: [Final|Native|Private|BlueprintCallable]
	// Offset: 0x14eba3c0
	// Params: [ Num(1) Size(0x1) ]
	void OnHandleCloseBtnClick(uint8_t bImmediately);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.OnCloseBtnClick
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14eba3ac
	// Params: [ Num(0) Size(0x0) ]
	void OnCloseBtnClick();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.OnClientRedeployStateChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eba308
	// Params: [ Num(1) Size(0x4) ]
	void OnClientRedeployStateChanged(ERedeployStateFuture InRedeployState);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.OnBattleFeildCommanderSkillViewClose
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eba2f4
	// Params: [ Num(0) Size(0x0) ]
	void OnBattleFeildCommanderSkillViewClose();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.InitInfo
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eba2e0
	// Params: [ Num(0) Size(0x0) ]
	void InitInfo();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.InitDelegates
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eba234
	// Params: [ Num(1) Size(0x1) ]
	void InitDelegates(uint8_t bInit);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.InitCommanderSkillItem
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eba220
	// Params: [ Num(0) Size(0x0) ]
	void InitCommanderSkillItem();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.HideTips
	// Flags: [Final|Native|Private|BlueprintCallable]
	// Offset: 0x14eba20c
	// Params: [ Num(0) Size(0x0) ]
	void HideTips();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.GamepadSwitchShowTips
	// Flags: [Final|Native|Private]
	// Offset: 0x14eba1f8
	// Params: [ Num(0) Size(0x0) ]
	void GamepadSwitchShowTips();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.BP_OnRefreshData
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_OnRefreshData();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainView.BP_FadeOut
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	float BP_FadeOut();
};

// Object: Class Breakthrough.BattleFieldFreeBuildSkillMainViewController
// Size: 0x88 (Inherited: 0x80)
struct UBattleFieldFreeBuildSkillMainViewController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldFreeBuildSkillMainViewController, "BattleFieldFreeBuildSkillMainViewController")

	struct UBattleFieldFreeBuildSkillMainViewFramework* BattleFieldFreeBuildSkillMainView; // 0x80(0x8)
};

// Object: Class Breakthrough.BattleFieldFreeBuildSkillMainViewFramework
// Size: 0x518 (Inherited: 0x400)
struct UBattleFieldFreeBuildSkillMainViewFramework : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldFreeBuildSkillMainViewFramework, "BattleFieldFreeBuildSkillMainViewFramework")

	struct UDFTextBlock* SkillNameText; // 0x400(0x8)
	struct UDFTextBlock* SkillDetailText; // 0x408(0x8)
	struct UDFHorizontalBox* DFHorizontalBox_FortificationSkill; // 0x410(0x8)
	struct UDFTextBlock* PlayerScoreText; // 0x418(0x8)
	struct UUserWidget* CommonButtonClose; // 0x420(0x8)
	struct UDFTextBlock* AvailableNumText; // 0x428(0x8)
	struct FName AvailableNumTextWidgetName; // 0x430(0x8)
	struct UDFImage* IdentityIconImage; // 0x438(0x8)
	struct FName IdentityIconImageWidgetName; // 0x440(0x8)
	struct UDFTipsAnchor* PhaseSelectTipHoverAnchorWidget; // 0x448(0x8)
	struct FName PhaseSelectTipHoverAnchorWidgetName; // 0x450(0x8)
	struct FName DisplayInputActionName_Exit; // 0x458(0x8)
	int32_t DisplayInputActionHandle_Exit; // 0x460(0x4)
	struct FName DisplayInputActionName_Tips; // 0x464(0x8)
	int32_t DisplayInputActionHandle_Tips; // 0x46C(0x4)
	uint8_t bIsShowTips : 1; // 0x470(0x1), Mask(0x1)
	uint8_t BitPad_0x470_1 : 7; // 0x470(0x1)
	uint8_t Pad_0x471[0x7]; // 0x471(0x7)
	struct TArray<struct UBattleFieldFreeBuildFortificationProxyItem*> FortificationProxyItems; // 0x478(0x10)
	uint8_t Pad_0x488[0x8]; // 0x488(0x8)
	struct TArray<struct FRankSkillInfo> CommanderSkillInfos; // 0x490(0x10)
	uint8_t Pad_0x4A0[0x8]; // 0x4A0(0x8)
	struct UUserWidget* FortificationProxyItemClass; // 0x4A8(0x8)
	float SkillStateRefreshDeltaTime; // 0x4B0(0x4)
	uint8_t bHideInWater : 1; // 0x4B4(0x1), Mask(0x1)
	uint8_t BitPad_0x4B4_1 : 7; // 0x4B4(0x1)
	uint8_t Pad_0x4B5[0x3]; // 0x4B5(0x3)
	struct TMap<ETeamIdentity, struct FSoftObjectPath> IdentityIconMap; // 0x4B8(0x50)
	int32_t FreeBuildSkillID; // 0x508(0x4)
	uint8_t Pad_0x50C[0xC]; // 0x50C(0xC)

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.UpdateSkillUIState
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd400
	// Params: [ Num(1) Size(0x4) ]
	void UpdateSkillUIState(float InDeltaTime);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.UpdateInWater
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd3ec
	// Params: [ Num(0) Size(0x0) ]
	void UpdateInWater();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.UpdateAvailableNum
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd3d8
	// Params: [ Num(0) Size(0x0) ]
	void UpdateAvailableNum();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.ShowTips
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ebd3c4
	// Params: [ Num(0) Size(0x0) ]
	void ShowTips();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.RefreshScore
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd3b0
	// Params: [ Num(0) Size(0x0) ]
	void RefreshScore();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.RefreshIdentityIcon
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd39c
	// Params: [ Num(0) Size(0x0) ]
	void RefreshIdentityIcon();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.OnUnhoverTipsOpen
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd2f8
	// Params: [ Num(1) Size(0x1) ]
	void OnUnhoverTipsOpen(ETipsTriggerReason TriggerReason);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.OnTeamIdentityReplicate
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd254
	// Params: [ Num(1) Size(0x8) ]
	void OnTeamIdentityReplicate(struct AGPPlayerState* InPlayerState);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.OnHoverTipsOpen
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd1b0
	// Params: [ Num(1) Size(0x1) ]
	void OnHoverTipsOpen(ETipsTriggerReason TriggerReason);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.OnHighThreatOrFireSectorAnchorStateChange
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd19c
	// Params: [ Num(0) Size(0x0) ]
	void OnHighThreatOrFireSectorAnchorStateChange();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.OnHandleCloseBtnClick
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ebd0f0
	// Params: [ Num(1) Size(0x1) ]
	void OnHandleCloseBtnClick(uint8_t bImmediately);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.OnCloseBtnClick
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ebd0dc
	// Params: [ Num(0) Size(0x0) ]
	void OnCloseBtnClick();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.OnClientRedeployStateChanged
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd038
	// Params: [ Num(1) Size(0x4) ]
	void OnClientRedeployStateChanged(ERedeployStateFuture InRedeployState);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.OnBattleFeildCommanderSkillViewClose
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd024
	// Params: [ Num(0) Size(0x0) ]
	void OnBattleFeildCommanderSkillViewClose();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.InitInfo
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd010
	// Params: [ Num(0) Size(0x0) ]
	void InitInfo();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.InitDelegates
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebcf64
	// Params: [ Num(1) Size(0x1) ]
	void InitDelegates(uint8_t bInit);

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.InitCommanderSkillItem
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebcf50
	// Params: [ Num(0) Size(0x0) ]
	void InitCommanderSkillItem();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.HideTips
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ebcf3c
	// Params: [ Num(0) Size(0x0) ]
	void HideTips();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.GamepadSwitchShowTips
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebcf28
	// Params: [ Num(0) Size(0x0) ]
	void GamepadSwitchShowTips();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.BP_OnRefreshData
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_OnRefreshData();

	// Object: Function Breakthrough.BattleFieldFreeBuildSkillMainViewFramework.BP_FadeOut
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	float BP_FadeOut();
};

// Object: Class Breakthrough.BattleFieldFreeFortificationInterActorMarkerItem
// Size: 0x600 (Inherited: 0x5F0)
struct UBattleFieldFreeFortificationInterActorMarkerItem : UGPInterActorMarkerItem
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldFreeFortificationInterActorMarkerItem, "BattleFieldFreeFortificationInterActorMarkerItem")

	struct AFortificationProxy* FortificationProxy; // 0x5F0(0x8)
	uint8_t Pad_0x5F8[0x8]; // 0x5F8(0x8)
};

// Object: Class Breakthrough.BattleFieldMarkingRoulette
// Size: 0x570 (Inherited: 0x480)
struct UBattleFieldMarkingRoulette : UDFControllerRouletteBase
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldMarkingRoulette, "BattleFieldMarkingRoulette")

	struct UGPInputMarkingLogic* MarkingLogic; // 0x480(0x8)
	uint8_t bPressedCancelRouletteInCurPressing : 1; // 0x488(0x1), Mask(0x1)
	uint8_t BitPad_0x488_1 : 7; // 0x488(0x1)
	uint8_t Pad_0x489[0x7]; // 0x489(0x7)
	struct TArray<struct FBattleFieldMarkingItemData> MarkingItemArray; // 0x490(0x10)
	struct TArray<struct FString> MarkingItemDetailArray; // 0x4A0(0x10)
	struct TArray<struct UBattleFieldMarkingRouletteItem*> MarkingRouletteItemWidgets; // 0x4B0(0x10)
	uint8_t Pad_0x4C0[0x8]; // 0x4C0(0x8)
	struct UCommonRouletteView* CommonRoulette; // 0x4C8(0x8)
	struct UCommonRouletteInfoView* CommonRouletteInfo_HD; // 0x4D0(0x8)
	struct UCommonRouletteInfoView* CommonRouletteInfo_Moblie; // 0x4D8(0x8)
	struct UWidget* HBoxSwitchRouletteKeyIcon_Gamepad; // 0x4E0(0x8)
	struct TMap<ETeamIdentity, struct FBattleFieldMarkingItemArray> Items; // 0x4E8(0x50)
	struct FText CancelSelect; // 0x538(0x18)
	int32_t MaxRouletteNum; // 0x550(0x4)
	float TacticalMarkingTransparency; // 0x554(0x4)
	struct TArray<int32_t> TacticalMarkingSpecialSort; // 0x558(0x10)
	uint8_t Pad_0x568[0x8]; // 0x568(0x8)

	// Object: Function Breakthrough.BattleFieldMarkingRoulette.SendSpeakVO
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x14ebd754
	// Params: [ Num(1) Size(0x78) ]
	void SendSpeakVO(const struct FBattleFieldMarkingItemData& InVOName);

	// Object: Function Breakthrough.BattleFieldMarkingRoulette.SendChatText
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ebd6a8
	// Params: [ Num(1) Size(0x10) ]
	void SendChatText(struct FString InChatString);

	// Object: Function Breakthrough.BattleFieldMarkingRoulette.SendBubbleMarker
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ebd604
	// Params: [ Num(1) Size(0x1) ]
	void SendBubbleMarker(EQuickChatMarkingItemType QuickChatItemType);

	// Object: Function Breakthrough.BattleFieldMarkingRoulette.OnUseCurrentRouletteItemGamepad
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd5f0
	// Params: [ Num(0) Size(0x0) ]
	void OnUseCurrentRouletteItemGamepad();

	// Object: Function Breakthrough.BattleFieldMarkingRoulette.OnTeamIdentityReplicate
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ebd54c
	// Params: [ Num(1) Size(0x8) ]
	void OnTeamIdentityReplicate(struct AGPPlayerState* InPlayerState);

	// Object: Function Breakthrough.BattleFieldMarkingRoulette.OnMarkingBtnUp
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd538
	// Params: [ Num(0) Size(0x0) ]
	void OnMarkingBtnUp();

	// Object: Function Breakthrough.BattleFieldMarkingRoulette.OnMarkingBtnDown
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd524
	// Params: [ Num(0) Size(0x0) ]
	void OnMarkingBtnDown();

	// Object: Function Breakthrough.BattleFieldMarkingRoulette.OnGameHudStateChangedFunc
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ebd510
	// Params: [ Num(0) Size(0x0) ]
	void OnGameHudStateChangedFunc();

	// Object: Function Breakthrough.BattleFieldMarkingRoulette.OnCancelMarkingRouletteBtnDown
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd4fc
	// Params: [ Num(0) Size(0x0) ]
	void OnCancelMarkingRouletteBtnDown();

	// Object: Function Breakthrough.BattleFieldMarkingRoulette.CloseMarkingWithoutSelection
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebd4e8
	// Params: [ Num(0) Size(0x0) ]
	void CloseMarkingWithoutSelection();
};

// Object: Class Breakthrough.BattleFieldMarkingRouletteHudView
// Size: 0x508 (Inherited: 0x418)
struct UBattleFieldMarkingRouletteHudView : UCommonRouletteBaseView
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldMarkingRouletteHudView, "BattleFieldMarkingRouletteHudView")

	struct UGPInputMarkingLogic* MarkingLogic; // 0x418(0x8)
	uint8_t bPressedCancelRouletteInCurPressing : 1; // 0x420(0x1), Mask(0x1)
	uint8_t BitPad_0x420_1 : 7; // 0x420(0x1)
	uint8_t Pad_0x421[0x7]; // 0x421(0x7)
	struct TArray<struct FBattleFieldMarkingItemData> MarkingItemArray; // 0x428(0x10)
	struct TArray<struct FString> MarkingItemDetailArray; // 0x438(0x10)
	struct TArray<struct UBattleFieldMarkingRouletteItem*> MarkingRouletteItemWidgets; // 0x448(0x10)
	uint8_t Pad_0x458[0x8]; // 0x458(0x8)
	struct UCommonRouletteBaseView_UI* CommonRoulette; // 0x460(0x8)
	struct UCommonRouletteBaseView_UIInfo* CommonRouletteInfo_HD; // 0x468(0x8)
	struct UCommonRouletteBaseView_UIInfo* CommonRouletteInfo_Moblie; // 0x470(0x8)
	struct UWidget* HBoxSwitchRouletteKeyIcon_Gamepad; // 0x478(0x8)
	struct TMap<ETeamIdentity, struct FBattleFieldMarkingItemArray> Items; // 0x480(0x50)
	struct FText CancelSelect; // 0x4D0(0x18)
	int32_t MaxRouletteNum; // 0x4E8(0x4)
	float TacticalMarkingTransparency; // 0x4EC(0x4)
	struct TArray<int32_t> TacticalMarkingSpecialSort; // 0x4F0(0x10)
	uint8_t Pad_0x500[0x8]; // 0x500(0x8)

	// Object: Function Breakthrough.BattleFieldMarkingRouletteHudView.SendSpeakVO
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x14ebdc2c
	// Params: [ Num(1) Size(0x78) ]
	void SendSpeakVO(const struct FBattleFieldMarkingItemData& InVOName);

	// Object: Function Breakthrough.BattleFieldMarkingRouletteHudView.SendChatText
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ebdb80
	// Params: [ Num(1) Size(0x10) ]
	void SendChatText(struct FString InChatString);

	// Object: Function Breakthrough.BattleFieldMarkingRouletteHudView.SendBubbleMarker
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ebdadc
	// Params: [ Num(1) Size(0x1) ]
	void SendBubbleMarker(EQuickChatMarkingItemType QuickChatItemType);

	// Object: Function Breakthrough.BattleFieldMarkingRouletteHudView.OnTeamIdentityReplicate
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebda38
	// Params: [ Num(1) Size(0x8) ]
	void OnTeamIdentityReplicate(struct AGPPlayerState* InPlayerState);

	// Object: Function Breakthrough.BattleFieldMarkingRouletteHudView.OnGameHudStateChangedFunc
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ebda24
	// Params: [ Num(0) Size(0x0) ]
	void OnGameHudStateChangedFunc();
};

// Object: Class Breakthrough.BattleFieldMarkingRouletteItem
// Size: 0x308 (Inherited: 0x2F8)
struct UBattleFieldMarkingRouletteItem : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldMarkingRouletteItem, "BattleFieldMarkingRouletteItem")

	struct UDFImage* InnerImage; // 0x2F8(0x8)
	struct UDFTextBlock* InnerTextBlock; // 0x300(0x8)

	// Object: Function Breakthrough.BattleFieldMarkingRouletteItem.SetContentImageColor
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0x14ebe000
	// Params: [ Num(1) Size(0x10) ]
	void SetContentImageColor(struct FLinearColor SlateColor);

	// Object: Function Breakthrough.BattleFieldMarkingRouletteItem.InitContent
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x14ebdde4
	// Params: [ Num(2) Size(0x30) ]
	void InitContent(struct FSoftObjectPath InImagePath, struct FText InText);
};

// Object: Class Breakthrough.BattleFieldMarkingRouletteViewController
// Size: 0x150 (Inherited: 0x100)
struct UBattleFieldMarkingRouletteViewController : UCommonRouletteBaseViewController
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldMarkingRouletteViewController, "BattleFieldMarkingRouletteViewController")

	struct UBattleFieldMarkingRouletteHudView* MarkingRouletteView; // 0x100(0x8)
	uint8_t Pad_0x108[0x8]; // 0x108(0x8)
	struct UGPInputMarkingLogic* MarkingLogic; // 0x110(0x8)
	EMarkingLocationType SelectedType; // 0x118(0x1)
	uint8_t bPressedCancelRouletteInCurPressing : 1; // 0x119(0x1), Mask(0x1)
	uint8_t BitPad_0x119_1 : 7; // 0x119(0x1)
	uint8_t Pad_0x11A[0x6]; // 0x11A(0x6)
	struct TArray<struct FBattleFieldMarkingItemData> MarkingItemArray; // 0x120(0x10)
	struct TArray<struct FString> MarkingItemDetailArray; // 0x130(0x10)
	struct TArray<struct UBattleFieldMarkingRouletteItem*> MarkingRouletteItemWidgets; // 0x140(0x10)

	// Object: Function Breakthrough.BattleFieldMarkingRouletteViewController.OnUseCurrentRouletteItemGamepad
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe1a0
	// Params: [ Num(0) Size(0x0) ]
	void OnUseCurrentRouletteItemGamepad();

	// Object: Function Breakthrough.BattleFieldMarkingRouletteViewController.OnTeamIdentityReplicate
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe0fc
	// Params: [ Num(1) Size(0x8) ]
	void OnTeamIdentityReplicate(struct AGPPlayerState* InPlayerState);

	// Object: Function Breakthrough.BattleFieldMarkingRouletteViewController.OnMarkingBtnUp
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe0e8
	// Params: [ Num(0) Size(0x0) ]
	void OnMarkingBtnUp();

	// Object: Function Breakthrough.BattleFieldMarkingRouletteViewController.OnMarkingBtnDown
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe0d4
	// Params: [ Num(0) Size(0x0) ]
	void OnMarkingBtnDown();

	// Object: Function Breakthrough.BattleFieldMarkingRouletteViewController.OnCancelMarkingRouletteBtnDown
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe0c0
	// Params: [ Num(0) Size(0x0) ]
	void OnCancelMarkingRouletteBtnDown();

	// Object: Function Breakthrough.BattleFieldMarkingRouletteViewController.CloseMarkingWithoutSelection
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe0ac
	// Params: [ Num(0) Size(0x0) ]
	void CloseMarkingWithoutSelection();
};

// Object: Class Breakthrough.BattleFieldOrdersComponent
// Size: 0x1E8 (Inherited: 0xF8)
struct UBattleFieldOrdersComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldOrdersComponent, "BattleFieldOrdersComponent")

	struct TMap<struct ADFMVehicleBase*, struct FVehicleThreatInfo> VehicleThreatValueMap; // 0xF8(0x50)
	struct FTimerHandle CheckHighThreatVehicleTimerHandle; // 0x148(0x8)
	struct FTimerHandle CheckHighThreatVehicleDelayWhenLastDieTimerHandle; // 0x150(0x8)
	struct TMap<ECampType, struct ADFMVehicleBase*> HighThreatVehicleMap; // 0x158(0x50)
	struct UCurveFloat* HideScoreToThreatRatioCurve; // 0x1A8(0x8)
	struct FTimerHandle CheckrConcentratedFireSectorAnchorDelayTimerHandle; // 0x1B0(0x8)
	struct FTimerHandle CheckrConcentratedFireSectorAnchorTimerHandle; // 0x1B8(0x8)
	struct UCurveFloat* HideScoreToBalanceScoreRatioCurve; // 0x1C0(0x8)
	struct ABattleSectorAnchor* AttackerConcentratedFireSectorAnchor; // 0x1C8(0x8)
	float AttackerConcentratedFireSectorAnchorRecordTime; // 0x1D0(0x4)
	uint8_t Pad_0x1D4[0x4]; // 0x1D4(0x4)
	struct ABattleSectorAnchor* DefenderConcentratedFireSectorAnchor; // 0x1D8(0x8)
	float DefenderConcentratedFireSectorAnchorRecordTime; // 0x1E0(0x4)
	uint8_t Pad_0x1E4[0x4]; // 0x1E4(0x4)

	// Object: Function Breakthrough.BattleFieldOrdersComponent.VehicleDiedAddScore
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebef50
	// Params: [ Num(2) Size(0x10) ]
	void VehicleDiedAddScore(struct ADFMVehicleBase* Vehicle, struct AGPCharacter* AttackerCharacter);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.SwitchDefenderConcentratedFireSectorAnchor
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebef3c
	// Params: [ Num(0) Size(0x0) ]
	void SwitchDefenderConcentratedFireSectorAnchor();

	// Object: Function Breakthrough.BattleFieldOrdersComponent.OnVehicleTakeDamage
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x14ebee40
	// Params: [ Num(2) Size(0x8A8) ]
	void OnVehicleTakeDamage(struct AActor* InActor, const struct FDamageResultInfo& DamageResultInfo);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.OnVehicleSpawned
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebed9c
	// Params: [ Num(1) Size(0x8) ]
	void OnVehicleSpawned(struct AActor* Vehicle);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.OnVehicleDied
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebecf8
	// Params: [ Num(1) Size(0x8) ]
	void OnVehicleDied(struct AActor* Vehicle);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.OnSectorAnchorOccupied
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebec18
	// Params: [ Num(2) Size(0xC) ]
	void OnSectorAnchorOccupied(struct AActor* InActor, int32_t OccupyCampId);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.OnSectorActive
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebeb74
	// Params: [ Num(1) Size(0x4) ]
	void OnSectorActive(int32_t ActiveID);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.OnGetOnVehicle
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebea5c
	// Params: [ Num(3) Size(0x18) ]
	void OnGetOnVehicle(struct AActor* CHARACTER, struct AActor* Vehicle, struct FName Seat);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.OnDsBeginMatchReqReceived
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebea48
	// Params: [ Num(0) Size(0x0) ]
	void OnDsBeginMatchReqReceived();

	// Object: Function Breakthrough.BattleFieldOrdersComponent.OnCharacterAddBehaviorScore
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe968
	// Params: [ Num(2) Size(0xC) ]
	void OnCharacterAddBehaviorScore(struct AGPCharacter* CHARACTER, int32_t InScore);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.IsHighThreatVehicle
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe8b8
	// Params: [ Num(2) Size(0x9) ]
	uint8_t IsHighThreatVehicle(struct AGPVehicleBase* Vehicle);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.GetHighThreatVehicleInfo
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe7d0
	// Params: [ Num(3) Size(0x1C) ]
	struct FHighThreatVehicleInfo GetHighThreatVehicleInfo(struct ADFMVehicleBase* Vehicle, ECampType CampType);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.GetHideScore
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe79c
	// Params: [ Num(1) Size(0x4) ]
	float GetHideScore();

	// Object: Function Breakthrough.BattleFieldOrdersComponent.GetConcentratedFireSectorAnchorScoreMultiplier
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe6b4
	// Params: [ Num(3) Size(0x10) ]
	float GetConcentratedFireSectorAnchorScoreMultiplier(struct ABattleSectorAnchor* InSectorAnchor, ECampType InCampType);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.GetBalanceScore
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe680
	// Params: [ Num(1) Size(0x4) ]
	float GetBalanceScore();

	// Object: Function Breakthrough.BattleFieldOrdersComponent.FindConcentratedFireSectorAnchor
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe5d4
	// Params: [ Num(2) Size(0x10) ]
	struct ABattleSectorAnchor* FindConcentratedFireSectorAnchor(struct ABattleSectorBase* CurSector);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.DefenderCompleteConcentratedFireTask
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe5c0
	// Params: [ Num(0) Size(0x0) ]
	void DefenderCompleteConcentratedFireTask();

	// Object: Function Breakthrough.BattleFieldOrdersComponent.CreateCheckrConcentratedFireSectorAnchorTimer
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe5ac
	// Params: [ Num(0) Size(0x0) ]
	void CreateCheckrConcentratedFireSectorAnchorTimer();

	// Object: Function Breakthrough.BattleFieldOrdersComponent.CreateCheckHighThreatVehicleTimer
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe598
	// Params: [ Num(0) Size(0x0) ]
	void CreateCheckHighThreatVehicleTimer();

	// Object: Function Breakthrough.BattleFieldOrdersComponent.CreateCheckHighThreatVehicleDelayWhenLastDieTimer
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe584
	// Params: [ Num(0) Size(0x0) ]
	void CreateCheckHighThreatVehicleDelayWhenLastDieTimer();

	// Object: Function Breakthrough.BattleFieldOrdersComponent.CompleteConcentratedFireTask
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe4e0
	// Params: [ Num(1) Size(0x1) ]
	void CompleteConcentratedFireTask(ECampType CampType);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.CheckrConcentratedFireSectorAnchor
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe4cc
	// Params: [ Num(0) Size(0x0) ]
	void CheckrConcentratedFireSectorAnchor();

	// Object: Function Breakthrough.BattleFieldOrdersComponent.CheckHighThreatVehicleByCamp
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe428
	// Params: [ Num(1) Size(0x1) ]
	void CheckHighThreatVehicleByCamp(ECampType CampType);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.CheckHighThreatVehicle
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe414
	// Params: [ Num(0) Size(0x0) ]
	void CheckHighThreatVehicle();

	// Object: Function Breakthrough.BattleFieldOrdersComponent.BroadCastSetConcentratedFireSectorAnchor
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe2f8
	// Params: [ Num(3) Size(0x10) ]
	void BroadCastSetConcentratedFireSectorAnchor(struct ABattleSectorAnchor* InConcentratedFireSectorAnchor, ECampType InCampType, float BehaviorScoreMultiplier);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.BroadCastCancelConcentratedFireSectorAnchor
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe1dc
	// Params: [ Num(3) Size(0x10) ]
	void BroadCastCancelConcentratedFireSectorAnchor(struct ABattleSectorAnchor* InConcentratedFireSectorAnchor, ECampType InCampType, float BehaviorScoreMultiplier);

	// Object: Function Breakthrough.BattleFieldOrdersComponent.AttackerCompleteConcentratedFireTask
	// Flags: [Final|Native|Public]
	// Offset: 0x14ebe1c8
	// Params: [ Num(0) Size(0x0) ]
	void AttackerCompleteConcentratedFireTask();
};

// Object: Class Breakthrough.BattleFieldQuestTipHUDView
// Size: 0x848 (Inherited: 0x3F0)
struct UBattleFieldQuestTipHUDView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldQuestTipHUDView, "BattleFieldQuestTipHUDView")

	struct UUserWidget* QuestTargetUpdate; // 0x3F0(0x8)
	struct UBaseUIView* WBP_QuestPrompts_New; // 0x3F8(0x8)
	struct UDFTextBlock* TextBlock_QuestStateText; // 0x400(0x8)
	struct URichTextBlock* TextBlock_QuestName; // 0x408(0x8)
	struct UUserWidget* WBP_CommonItemTemplate; // 0x410(0x8)
	struct UDFImage* Image_AwardIcon; // 0x418(0x8)
	struct UDFSizeBox* SizeBox_NPC_PC; // 0x420(0x8)
	struct UDFImage* NPC_IconImg_Mobile; // 0x428(0x8)
	struct UCanvasPanel* VoicePan_Mobile; // 0x430(0x8)
	struct UDFCanvasPanel* QuestCondition_Panel; // 0x438(0x8)
	struct URichTextBlock* Condition_RichTextBlock_Desc; // 0x440(0x8)
	struct UDFImage* DFImage_306; // 0x448(0x8)
	struct UDFImage* DFImage_3; // 0x450(0x8)
	struct UUserWidget* WBP_TopBarHD_InputSummary; // 0x458(0x8)
	struct UImage* ObjectiveUpdateIconImg; // 0x460(0x8)
	struct URichTextBlock* ObjectiveDescRichText; // 0x468(0x8)
	struct UDFTextBlock* DFTextBlock_Progress; // 0x470(0x8)
	struct UDFProgressBar* DFProgressBar_225; // 0x478(0x8)
	struct UDFTextBlock* DFTextBlock_Time; // 0x480(0x8)
	struct UDFSizeBox* QuestObjectivePromptsPanel; // 0x488(0x8)
	struct UDFScaleBox* CommonItemTemplate_BottomTextBox; // 0x490(0x8)
	struct UImage* QuestNullIconPath_Image; // 0x498(0x8)
	struct FName QuestTargetUpdateName; // 0x4A0(0x8)
	struct FName QuestPromptsName; // 0x4A8(0x8)
	struct FName WBP_CommonItemTemplate_Name; // 0x4B0(0x8)
	struct FName AwardIconSlotCompName; // 0x4B8(0x8)
	struct FName AwardIconName; // 0x4C0(0x8)
	struct FName TextBlock_QuestStateText_Name; // 0x4C8(0x8)
	struct FName TextBlock_QuestName_Name; // 0x4D0(0x8)
	struct FName SizeBox_NPC_PC_Name; // 0x4D8(0x8)
	struct FName NPC_IconImg_Mobile_Name; // 0x4E0(0x8)
	struct FName VoicePan_Mobile_Name; // 0x4E8(0x8)
	struct FName QuestCondition_Panel_Name; // 0x4F0(0x8)
	struct FName DFImage_306_Name; // 0x4F8(0x8)
	struct FName DFImage_3_Name; // 0x500(0x8)
	struct FName WBP_TopBarHD_InputSummary_Name; // 0x508(0x8)
	struct FName ObjectiveUpdateIconImg_Name; // 0x510(0x8)
	struct FName ObjectiveDescRichText_Name; // 0x518(0x8)
	struct FName DFTextBlock_Progress_Name; // 0x520(0x8)
	struct FName DFProgressBar_225_Name; // 0x528(0x8)
	struct FName DFTextBlock_Time_Name; // 0x530(0x8)
	struct FName QuestObjectivePromptsPanel_Name; // 0x538(0x8)
	struct FName CommonItemTemplate_BottomTextBox_Name; // 0x540(0x8)
	struct FName QuestNullIconPath_Image_Name; // 0x548(0x8)
	struct FName QuestPrompts_ConditionBox_Nmae; // 0x550(0x8)
	struct FName Condition_RichTextBlock_Desc_Name; // 0x558(0x8)
	struct FName FailStateTextStyleIdx; // 0x560(0x8)
	struct FName SuccesStateTextStyleIdx; // 0x568(0x8)
	struct FLinearColor DFImage_306_Color0; // 0x570(0x10)
	struct FLinearColor DFImage_306_Color1; // 0x580(0x10)
	struct FLinearColor DFImage_3_Color0; // 0x590(0x10)
	struct FLinearColor DFImage_3_Color1; // 0x5A0(0x10)
	uint8_t bIsOnlyBroadCastComplete : 1; // 0x5B0(0x1), Mask(0x1)
	uint8_t BitPad_0x5B0_1 : 7; // 0x5B0(0x1)
	uint8_t bIsEnableRequiredCountLess : 1; // 0x5B1(0x1), Mask(0x1)
	uint8_t BitPad_0x5B1_1 : 7; // 0x5B1(0x1)
	uint8_t Pad_0x5B2[0x2]; // 0x5B2(0x2)
	float NumberOfOnlyRequiredCountLess; // 0x5B4(0x4)
	uint8_t bIsEnableOnlyToPercentage : 1; // 0x5B8(0x1), Mask(0x1)
	uint8_t BitPad_0x5B8_1 : 7; // 0x5B8(0x1)
	uint8_t Pad_0x5B9[0x3]; // 0x5B9(0x3)
	float PercentageOfOnlyCountTo; // 0x5BC(0x4)
	struct FText QuestSuccessText; // 0x5C0(0x18)
	struct FText QuestFailText; // 0x5D8(0x18)
	struct FName QuestPromptsAutoInAnima; // 0x5F0(0x8)
	struct FName QuestPromptsAutoOutAnima; // 0x5F8(0x8)
	struct FName QuestTargetInAnima; // 0x600(0x8)
	struct FName QuestTargetOutAnima; // 0x608(0x8)
	struct FName QuestTargetCompletedAnima; // 0x610(0x8)
	float ShowTimeOfQuestPrompts; // 0x618(0x4)
	float RefreshTimeOfTime; // 0x61C(0x4)
	float ShowTimeOfQuestTarget; // 0x620(0x4)
	float ProgUpdateAnimTime; // 0x624(0x4)
	float RefreshTimeOfProgDynamicEffect; // 0x628(0x4)
	uint8_t Pad_0x62C[0x4]; // 0x62C(0x4)
	struct FString Quest_AudioEvtName_Show; // 0x630(0x10)
	struct FString Objection_AudioEvtName_Show; // 0x640(0x10)
	struct FString Objection_AudioEvtName_Completed; // 0x650(0x10)
	struct FString Objection_AudioEvtName_ProgUpdate; // 0x660(0x10)
	uint8_t Pad_0x670[0x28]; // 0x670(0x28)
	uint8_t bCanPlayAnim : 1; // 0x698(0x1), Mask(0x1)
	uint8_t BitPad_0x698_1 : 7; // 0x698(0x1)
	uint8_t bCanPlayQuestTipHD : 1; // 0x699(0x1), Mask(0x1)
	uint8_t BitPad_0x699_1 : 7; // 0x699(0x1)
	uint8_t bCanInterrupt : 1; // 0x69A(0x1), Mask(0x1)
	uint8_t BitPad_0x69A_1 : 7; // 0x69A(0x1)
	uint8_t Pad_0x69B[0x15]; // 0x69B(0x15)
	struct TArray<struct FBattleFieldQuestObjectiveTipData> ObjectiveTipDataArr; // 0x6B0(0x10)
	struct FBattleFieldQuestObjectiveTipData LastShowObjectiveTipData; // 0x6C0(0xC0)
	uint8_t bHasShowedInitQuest : 1; // 0x780(0x1), Mask(0x1)
	uint8_t BitPad_0x780_1 : 7; // 0x780(0x1)
	uint8_t Pad_0x781[0x27]; // 0x781(0x27)
	struct TMap<struct FName, struct UWidgetAnimation*> AnimationsMap_QuestTarget; // 0x7A8(0x50)
	struct TMap<struct FName, struct UWidgetAnimation*> AnimationsMap_QuestPrompts; // 0x7F8(0x50)

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.UpdateText
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x14ec1ba4
	// Params: [ Num(4) Size(0x50) ]
	void UpdateText(int32_t TitleType, const struct FText& TitleText, const struct FText& ProgressText, const struct FText& DescText);

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.UpdateQuestProgress
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec1ac4
	// Params: [ Num(2) Size(0x9) ]
	void UpdateQuestProgress(int64_t UpdateQuestId, uint8_t QuestState);

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.UpdateQuestObjectiveProgress
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec1970
	// Params: [ Num(4) Size(0x12) ]
	void UpdateQuestObjectiveProgress(int64_t UpdateQuestId, int64_t UpdateObjectiveId, uint8_t ObjectiveState, uint8_t ObjType);

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.StartHideQuestPrompts
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec195c
	// Params: [ Num(0) Size(0x0) ]
	void StartHideQuestPrompts();

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.QuestTargetStartIn
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec18b0
	// Params: [ Num(1) Size(0x1) ]
	void QuestTargetStartIn(uint8_t bIsIn);

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.QuestTargetOut
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec189c
	// Params: [ Num(0) Size(0x0) ]
	void QuestTargetOut();

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.QuestObjectiveInterruptHD
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec17f8
	// Params: [ Num(1) Size(0x1) ]
	void QuestObjectiveInterruptHD(EBattleFieldQuestObjectionState ObjState);

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.QuestObjectiveCountDown
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec1754
	// Params: [ Num(1) Size(0x4) ]
	void QuestObjectiveCountDown(float TimeoutSec);

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.PlayQuestUpdateAnim
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x14ec14e0
	// Params: [ Num(6) Size(0x49) ]
	void PlayQuestUpdateAnim(struct FString QuestName, const struct FName& QuestAwardID, struct FString AwardIconPath, EBattleFieldQuestState QuestState, const struct FText& QuestConditionDes, uint8_t bIsOnlyInGameQuest);

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.PlayQuestObjectiveUpdateAnim
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec1400
	// Params: [ Num(2) Size(0x8) ]
	void PlayQuestObjectiveUpdateAnim(EBattleFieldQuestObjectionState ObjState, int32_t TitleType);

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.PlayProgDynamicEffect
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec13ec
	// Params: [ Num(0) Size(0x0) ]
	void PlayProgDynamicEffect();

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.NotifyClientMatchStart
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec13d8
	// Params: [ Num(0) Size(0x0) ]
	void NotifyClientMatchStart();

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.InformTimerInfo
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec1334
	// Params: [ Num(1) Size(0x4) ]
	void InformTimerInfo(float TimeoutSec);

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.BP_SetQuestPromptsReadyIDNone
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_SetQuestPromptsReadyIDNone();

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.BP_SetObjectShowType
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetObjectShowType(int32_t Type);

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.BP_SetObjectShowColorType
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetObjectShowColorType(int32_t Type);

	// Object: Function Breakthrough.BattleFieldQuestTipHUDView.ActiveProgTimer
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec1320
	// Params: [ Num(0) Size(0x0) ]
	void ActiveProgTimer();
};

// Object: Class Breakthrough.BattleFieldRankSkillBackground
// Size: 0x360 (Inherited: 0x2F8)
struct UBattleFieldRankSkillBackground : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldRankSkillBackground, "BattleFieldRankSkillBackground")

	uint8_t Pad_0x2F8[0x8]; // 0x2F8(0x8)
	struct UDFImage* SkillBg1; // 0x300(0x8)
	struct UDFImage* SkillBg2; // 0x308(0x8)
	struct TMap<ERankSkillBackgroundUIStyle, struct FRankSkillBackgroundUIInfo> RankSkillBackgroundImageMap; // 0x310(0x50)

	// Object: Function Breakthrough.BattleFieldRankSkillBackground.UpdateUIDegree
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec207c
	// Params: [ Num(1) Size(0x4) ]
	void UpdateUIDegree(float InDegree);

	// Object: Function Breakthrough.BattleFieldRankSkillBackground.SetRankSkillBackgroudUIState
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec1fd8
	// Params: [ Num(1) Size(0x1) ]
	void SetRankSkillBackgroudUIState(ESkillUIState InUIStyle);

	// Object: Function Breakthrough.BattleFieldRankSkillBackground.SetIsSelected
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec1f2c
	// Params: [ Num(1) Size(0x1) ]
	void SetIsSelected(uint8_t InIsSelected);
};

// Object: Class Breakthrough.BattleFieldTeamPlayerVoiceBubbleWidget
// Size: 0x308 (Inherited: 0x2F8)
struct UBattleFieldTeamPlayerVoiceBubbleWidget : UDFMTeamPlayerVoiceBubbleWidget
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldTeamPlayerVoiceBubbleWidget, "BattleFieldTeamPlayerVoiceBubbleWidget")

	struct UDFImage* DFImage_CommanderIcon; // 0x2F8(0x8)
	struct UDFTextBlock* DFTextBlock_TeamName; // 0x300(0x8)
};

// Object: Class Breakthrough.BattleFieldTeamPlayerVoiceView
// Size: 0x380 (Inherited: 0x2F8)
struct UBattleFieldTeamPlayerVoiceView : UDFMTeamPlayerVoiceView
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldTeamPlayerVoiceView, "BattleFieldTeamPlayerVoiceView")

	struct TMap<uint64_t, struct UBattleFieldTeamPlayerVoiceBubbleWidget*> CacheTeamPlayerVoiceBubbleWidgets; // 0x2F8(0x50)
	uint8_t Pad_0x348[0x8]; // 0x348(0x8)
	struct UDFHorizontalBox* DFHorizontalBoxMic; // 0x350(0x8)
	struct UCanvasPanel* TalkingCanvas; // 0x358(0x8)
	struct UWidgetAnimation* WBP_TeamStatus_CampBubble_in; // 0x360(0x8)
	struct UWidgetAnimation* WBP_TeamStatus_CampBubble_loop; // 0x368(0x8)
	struct UWidgetAnimation* WBP_TeamStatus_CampBubble_out; // 0x370(0x8)
	struct UUserWidget* TeamPlayerVoiceBubbleWidgetClass; // 0x378(0x8)

	// Object: Function Breakthrough.BattleFieldTeamPlayerVoiceView.OnGVoiceRoomMemberSpeakStateChange
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec2140
	// Params: [ Num(4) Size(0x29) ]
	void OnGVoiceRoomMemberSpeakStateChange(struct FString RoomName, int32_t RoomChannel, struct FString OpenId, uint8_t IsSpeaking);
};

// Object: Class Breakthrough.BattleFieldTestView
// Size: 0x408 (Inherited: 0x3F0)
struct UBattleFieldTestView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldTestView, "BattleFieldTestView")

	uint8_t Pad_0x3F0[0x8]; // 0x3F0(0x8)
	struct UDFTextBlock* TextBlock_1; // 0x3F8(0x8)
	struct UDFTextBlock* TextBlock_2; // 0x400(0x8)
};

// Object: Class Breakthrough.BattleFieldTopBarTextFXWidget
// Size: 0x318 (Inherited: 0x2F8)
struct UBattleFieldTopBarTextFXWidget : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldTopBarTextFXWidget, "BattleFieldTopBarTextFXWidget")

	struct UImage* Image_light_FX; // 0x2F8(0x8)
	struct UImage* Image_light_FX2; // 0x300(0x8)
	struct UImage* Image_light_FX_1; // 0x308(0x8)
	struct UWidgetAnimation* Anima_highLight; // 0x310(0x8)
};

// Object: Class Breakthrough.BattleFieldTopBarTextWidget
// Size: 0x3E0 (Inherited: 0x2F8)
struct UBattleFieldTopBarTextWidget : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldTopBarTextWidget, "BattleFieldTopBarTextWidget")

	struct UTextBlock* ScrollText_Votes; // 0x2F8(0x8)
	struct UTextBlock* Text_AddVotes; // 0x300(0x8)
	struct UDFImage* ScoreIconImage; // 0x308(0x8)
	struct UDFImage* DFImage_light_fx; // 0x310(0x8)
	struct UCanvasPanel* ScrollTextCanvasPanel; // 0x318(0x8)
	struct UWidgetAnimation* Anima_normal; // 0x320(0x8)
	struct UWidgetAnimation* Anima_special; // 0x328(0x8)
	struct UWidgetAnimation* Anima_out; // 0x330(0x8)
	struct TArray<struct FConquestTopBarScoreInfo> ConquestTopBarScoreInfos; // 0x338(0x10)
	uint8_t Pad_0x348[0x10]; // 0x348(0x10)
	struct TMap<EConquestTopBarScoreType, struct UPaperSprite*> ScoreIconColorMap; // 0x358(0x50)
	float ScoreIconShowCD; // 0x3A8(0x4)
	uint8_t Pad_0x3AC[0x4]; // 0x3AC(0x4)
	struct UUserWidget* ScoreEffectWidgetClass; // 0x3B0(0x8)
	struct FAnchorData ScoreEffectWidgetAnchor; // 0x3B8(0x28)

	// Object: Function Breakthrough.BattleFieldTopBarTextWidget.OnAnimationEnd
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec2370
	// Params: [ Num(0) Size(0x0) ]
	void OnAnimationEnd();
};

// Object: Class Breakthrough.BattleFlag
// Size: 0x6A8 (Inherited: 0x370)
struct ABattleFlag : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABattleFlag, "BattleFlag")

	uint8_t Pad_0x370[0x18]; // 0x370(0x18)
	struct USceneComponent* SceneComponent; // 0x388(0x8)
	struct USkeletalMeshComponent* FlagSMComponent; // 0x390(0x8)
	struct AActor* CenterActor; // 0x398(0x8)
	struct FText Name; // 0x3A0(0x18)
	struct FName NameInIcon; // 0x3B8(0x8)
	uint8_t Pad_0x3C0[0x10]; // 0x3C0(0x10)
	struct FMulticastInlineDelegate OnClientOnBattleFlagUpdated; // 0x3D0(0x10)
	int32_t OwnerCamp; // 0x3E0(0x4)
	uint8_t Pad_0x3E4[0x4]; // 0x3E4(0x4)
	struct ADFMCharacter* CaptureCharacter; // 0x3E8(0x8)
	EBattleFlagState CurFlagState; // 0x3F0(0x1)
	uint8_t Pad_0x3F1[0x3]; // 0x3F1(0x3)
	float RefreshFlagCD; // 0x3F4(0x4)
	float DroppedBackTime; // 0x3F8(0x4)
	float CaptureFlagLimitTime; // 0x3FC(0x4)
	float CaptureFlagOccupyAnchorBackFactor; // 0x400(0x4)
	float RadiusOfCheckConvoyFlag; // 0x404(0x4)
	uint8_t bIsAddConvoyFlaScoreForHolder : 1; // 0x408(0x1), Mask(0x1)
	uint8_t BitPad_0x408_1 : 7; // 0x408(0x1)
	uint8_t Pad_0x409[0x3]; // 0x409(0x3)
	float BaselineTimeForOneShipment; // 0x40C(0x4)
	float CheckNearbyTimeInterval; // 0x410(0x4)
	float CapturedFlagEndTime; // 0x414(0x4)
	float RefreshFlagCoolingTime; // 0x418(0x4)
	float CoolingStartTime; // 0x41C(0x4)
	float DroppedCoolingTime; // 0x420(0x4)
	float DisappearTime; // 0x424(0x4)
	struct FVector DroppedLocation; // 0x428(0xC)
	uint8_t Pad_0x434[0xAC]; // 0x434(0xAC)
	struct ADFMCharacter* NearestToFlagAnchorCharacter; // 0x4E0(0x8)
	uint8_t Pad_0x4E8[0x58]; // 0x4E8(0x58)
	struct UBreakthroughStatisticsComponent* StatisticsComponent; // 0x540(0x8)
	uint8_t Pad_0x548[0x1]; // 0x548(0x1)
	uint8_t bHasSentRecaptureTip : 1; // 0x549(0x1), Mask(0x1)
	uint8_t BitPad_0x549_1 : 7; // 0x549(0x1)
	uint8_t Pad_0x54A[0x6]; // 0x54A(0x6)
	struct TMap<int32_t, struct UMaterialInterface*> FlagMaterials_Mobile; // 0x550(0x50)
	struct TMap<int32_t, struct UMaterialInterface*> FlagMaterials_PC; // 0x5A0(0x50)
	float FlagInteractTime; // 0x5F0(0x4)
	struct FRotator OriginRotator; // 0x5F4(0xC)
	struct FName CharacterSocketName; // 0x600(0x8)
	struct FVector CharacterRelativeLocation; // 0x608(0xC)
	struct FName VehicleSocketName; // 0x614(0x8)
	uint8_t Pad_0x61C[0x4]; // 0x61C(0x4)
	struct TMap<int32_t, struct FVector> VehicleRelativeLocationMap; // 0x620(0x50)
	float FlagRayTraceDistance; // 0x670(0x4)
	struct FVector NavExtent; // 0x674(0xC)
	int32_t RadiusNum; // 0x680(0x4)
	int32_t AngleNum; // 0x684(0x4)
	float RadiusDelta; // 0x688(0x4)
	float OffsetToGround; // 0x68C(0x4)
	uint8_t bIsRayAfterNav : 1; // 0x690(0x1), Mask(0x1)
	uint8_t BitPad_0x690_1 : 7; // 0x690(0x1)
	uint8_t Pad_0x691[0x3]; // 0x691(0x3)
	float FlagRayTraceDistanceAfterNav; // 0x694(0x4)
	EGPMarkerClassType MarkerClassMarker; // 0x698(0x1)
	EBattleFieldGameModeMarkerType FlagMarker; // 0x699(0x1)
	uint8_t Pad_0x69A[0x6]; // 0x69A(0x6)
	struct ABattleSectorAnchor* DroppedSectorAnchor; // 0x6A0(0x8)

	// Object: Function Breakthrough.BattleFlag.RefreshFlagStyle
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec2a1c
	// Params: [ Num(0) Size(0x0) ]
	void RefreshFlagStyle();

	// Object: Function Breakthrough.BattleFlag.OnSectorAnchorCampChanged
	// Flags: [Final|Native|Private]
	// Offset: 0x14ec293c
	// Params: [ Num(2) Size(0x10) ]
	void OnSectorAnchorCampChanged(int32_t CampId, struct ABattleSectorAnchor* OccupiedAnchor);

	// Object: Function Breakthrough.BattleFlag.OnRep_RefreshFlagCoolingTime
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec2928
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_RefreshFlagCoolingTime();

	// Object: Function Breakthrough.BattleFlag.OnRep_FlagState
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec2884
	// Params: [ Num(1) Size(0x1) ]
	void OnRep_FlagState(EBattleFlagState OldFlagState);

	// Object: Function Breakthrough.BattleFlag.OnRep_DroppedLocation
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec2870
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_DroppedLocation();

	// Object: Function Breakthrough.BattleFlag.OnRep_DroppedCoolingTime
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec285c
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_DroppedCoolingTime();

	// Object: Function Breakthrough.BattleFlag.OnRep_DisappearTime
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec2848
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_DisappearTime();

	// Object: Function Breakthrough.BattleFlag.OnRep_CoolingStartTime
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec2834
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_CoolingStartTime();

	// Object: Function Breakthrough.BattleFlag.OnRep_CapturedFlagEndTime
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec2820
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_CapturedFlagEndTime();

	// Object: Function Breakthrough.BattleFlag.OnRep_CaptureCharacter
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec280c
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_CaptureCharacter();

	// Object: Function Breakthrough.BattleFlag.OnGameStateBegin
	// Flags: [Final|Native|Private]
	// Offset: 0x14ec27f8
	// Params: [ Num(0) Size(0x0) ]
	void OnGameStateBegin();

	// Object: Function Breakthrough.BattleFlag.OnExitCaptureFlagStartAction
	// Flags: [Final|Native|Private]
	// Offset: 0x14ec2718
	// Params: [ Num(2) Size(0xC) ]
	void OnExitCaptureFlagStartAction(struct AActor* ExitCharacter, float InRemainTime);

	// Object: Function Breakthrough.BattleFlag.OnExitCaptureFlagHoldAction
	// Flags: [Final|Native|Private]
	// Offset: 0x14ec2674
	// Params: [ Num(1) Size(0x8) ]
	void OnExitCaptureFlagHoldAction(struct AActor* ExitCharacter);

	// Object: Function Breakthrough.BattleFlag.OnEnterCaptureFlagStartAction
	// Flags: [Final|Native|Private]
	// Offset: 0x14ec2594
	// Params: [ Num(2) Size(0xC) ]
	void OnEnterCaptureFlagStartAction(struct AActor* EnterCharacter, float InRemainTime);

	// Object: Function Breakthrough.BattleFlag.OnEnterCaptureFlagHoldAction
	// Flags: [Final|Native|Private]
	// Offset: 0x14ec24f0
	// Params: [ Num(1) Size(0x8) ]
	void OnEnterCaptureFlagHoldAction(struct AActor* EnterCharacter);

	// Object: Function Breakthrough.BattleFlag.OnCaptureFlagCharacterEnterOrExitVehicle
	// Flags: [Final|Native|Private]
	// Offset: 0x14ec2408
	// Params: [ Num(2) Size(0x9) ]
	void OnCaptureFlagCharacterEnterOrExitVehicle(struct ACHARACTER* InCaptureFlagCharacter, uint8_t bIsEnter);

	// Object: Function Breakthrough.BattleFlag.InitDroppedSectorAnchor
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec23f4
	// Params: [ Num(0) Size(0x0) ]
	void InitDroppedSectorAnchor();
};

// Object: Class Breakthrough.BattleFlagAnchor
// Size: 0x400 (Inherited: 0x370)
struct ABattleFlagAnchor : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABattleFlagAnchor, "BattleFlagAnchor")

	uint8_t Pad_0x370[0x18]; // 0x370(0x18)
	struct USceneComponent* SceneComponent; // 0x388(0x8)
	struct AActor* CenterActor; // 0x390(0x8)
	struct USplineAreaComponent* SectorSplineAreaComponent; // 0x398(0x8)
	struct FText Name; // 0x3A0(0x18)
	struct FName NameInIcon; // 0x3B8(0x8)
	uint8_t Pad_0x3C0[0x10]; // 0x3C0(0x10)
	uint8_t bShowMapSplineArea : 1; // 0x3D0(0x1), Mask(0x1)
	uint8_t BitPad_0x3D0_1 : 7; // 0x3D0(0x1)
	uint8_t Pad_0x3D1[0x3]; // 0x3D1(0x3)
	int32_t OwnerCamp; // 0x3D4(0x4)
	struct ABattleFlag* OwnFlagActor; // 0x3D8(0x8)
	struct ABattleFlag* EnemyFlagActor; // 0x3E0(0x8)
	float DetectHeight; // 0x3E8(0x4)
	uint8_t Pad_0x3EC[0x4]; // 0x3EC(0x4)
	struct UBreakthroughStatisticsComponent* StatisticsComponent; // 0x3F0(0x8)
	uint8_t Pad_0x3F8[0x4]; // 0x3F8(0x4)
	EGPMarkerClassType MarkerClassMarker; // 0x3FC(0x1)
	EBattleFieldGameModeMarkerType FlagBaseMarker; // 0x3FD(0x1)
	uint8_t Pad_0x3FE[0x2]; // 0x3FE(0x2)
};

// Object: Class Breakthrough.BattleFlagHUDView
// Size: 0x498 (Inherited: 0x468)
struct UBattleFlagHUDView : UMapItemHUDView
{
	DEFINE_UE_CLASS_HELPERS(UBattleFlagHUDView, "BattleFlagHUDView")

	struct FLinearColor MyCampLinearColor; // 0x468(0x10)
	struct FLinearColor EnemyCampLinearColor; // 0x478(0x10)
	struct UMarkerCircleWidget* WBP_ScreenMarkerMission_CaptureFlag_Circle; // 0x488(0x8)
	struct ABattleFlag* BattleFlag; // 0x490(0x8)
};

// Object: Class Breakthrough.BattleFlagViewController
// Size: 0x2C0 (Inherited: 0x2B0)
struct UBattleFlagViewController : UMapIconViewController
{
	DEFINE_UE_CLASS_HELPERS(UBattleFlagViewController, "BattleFlagViewController")

	struct ABattleFlag* BattleFlag; // 0x2A8(0x8)
	struct AActor* WhereIsFlag; // 0x2B0(0x8)

	// Object: Function Breakthrough.BattleFlagViewController.OnClientOnBattleFlagUpdated
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec4f44
	// Params: [ Num(1) Size(0x8) ]
	void OnClientOnBattleFlagUpdated(struct AActor* InBattleFlag);
};

// Object: Class Breakthrough.BattleRedPacketAreaBase
// Size: 0x390 (Inherited: 0x370)
struct ABattleRedPacketAreaBase : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABattleRedPacketAreaBase, "BattleRedPacketAreaBase")

	struct USceneComponent* SceneComponent; // 0x370(0x8)
	struct TArray<struct AActor*> RedPacketAnchorArray; // 0x378(0x10)
	struct FName FireWorksEffectId; // 0x388(0x8)

	// Object: Function Breakthrough.BattleRedPacketAreaBase.RefreshRedPacketAnchor
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec50bc
	// Params: [ Num(2) Size(0x10) ]
	void RefreshRedPacketAnchor(int32_t RefreshRedPacketTDMCount, struct ARedEnvelopeManager* RedEnvelopeManager);

	// Object: Function Breakthrough.BattleRedPacketAreaBase.NetMulticastShowFireWorks
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Public]
	// Offset: 0x14ec50a0
	// Params: [ Num(0) Size(0x0) ]
	void NetMulticastShowFireWorks();
};

// Object: Class Breakthrough.BattleRouteGenerator
// Size: 0x5B8 (Inherited: 0x370)
struct ABattleRouteGenerator : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABattleRouteGenerator, "BattleRouteGenerator")

	struct FVector ProjectExt; // 0x370(0xC)
	uint8_t bDrawDebugLine : 1; // 0x37C(0x1), Mask(0x1)
	uint8_t BitPad_0x37C_1 : 7; // 0x37C(0x1)
	uint8_t bDrawResultLine : 1; // 0x37D(0x1), Mask(0x1)
	uint8_t BitPad_0x37D_1 : 7; // 0x37D(0x1)
	uint8_t Pad_0x37E[0x12]; // 0x37E(0x12)
	float AnchorExpandDist1; // 0x390(0x4)
	float AnchorExpandDist2; // 0x394(0x4)
	int32_t AnchorPathLimitCount; // 0x398(0x4)
	uint8_t AnchorPathCloseSet : 1; // 0x39C(0x1), Mask(0x1)
	uint8_t BitPad_0x39C_1 : 7; // 0x39C(0x1)
	uint8_t Pad_0x39D[0x3]; // 0x39D(0x3)
	int32_t AnchorPathCloseGatherCount; // 0x3A0(0x4)
	float AnchorPathGatherForceDist; // 0x3A4(0x4)
	float AnchorPathGatherPathDist; // 0x3A8(0x4)
	float AnchorPathGatherMaxDist; // 0x3AC(0x4)
	struct TSoftObjectPtr<ABattleSectorAnchor> TestAnchor; // 0x3B0(0x28)
	uint8_t BrokenActorBlock : 1; // 0x3D8(0x1), Mask(0x1)
	uint8_t BitPad_0x3D8_1 : 7; // 0x3D8(0x1)
	uint8_t DisableDeepWaterNav : 1; // 0x3D9(0x1), Mask(0x1)
	uint8_t BitPad_0x3D9_1 : 7; // 0x3D9(0x1)
	uint8_t Pad_0x3DA[0x2]; // 0x3DA(0x2)
	float GridCellWidth; // 0x3DC(0x4)
	float GridCellProjFailDist; // 0x3E0(0x4)
	float GridCellConnectZDist; // 0x3E4(0x4)
	float GridCellConnectSweepZOffset; // 0x3E8(0x4)
	float GridCellConnectSweepSphereRaiuds; // 0x3EC(0x4)
	float GridCellDebugBoundExpend; // 0x3F0(0x4)
	uint8_t GridCellPortalOnlyCheckCenter : 1; // 0x3F4(0x1), Mask(0x1)
	uint8_t BitPad_0x3F4_1 : 7; // 0x3F4(0x1)
	uint8_t GridCellPortalReduceOpen : 1; // 0x3F5(0x1), Mask(0x1)
	uint8_t BitPad_0x3F5_1 : 7; // 0x3F5(0x1)
	uint8_t Pad_0x3F6[0x2]; // 0x3F6(0x2)
	float GridCellPortalReduceFuncRaidusOffset; // 0x3F8(0x4)
	uint8_t GridCellPortalReduceFuncExcludeMinRaidus : 1; // 0x3FC(0x1), Mask(0x1)
	uint8_t BitPad_0x3FC_1 : 7; // 0x3FC(0x1)
	uint8_t GridCellPortalReduceFuncExcludeMaxRaidus : 1; // 0x3FD(0x1), Mask(0x1)
	uint8_t BitPad_0x3FD_1 : 7; // 0x3FD(0x1)
	uint8_t GridCellPortalReduceFuncPathDist : 1; // 0x3FE(0x1), Mask(0x1)
	uint8_t BitPad_0x3FE_1 : 7; // 0x3FE(0x1)
	uint8_t GridCellPortalReduceFuncPathDistWithSaveSmall : 1; // 0x3FF(0x1), Mask(0x1)
	uint8_t BitPad_0x3FF_1 : 7; // 0x3FF(0x1)
	float GridCellPortal2DMinDist; // 0x400(0x4)
	float GridCellPortalPathMinDist; // 0x404(0x4)
	int32_t GridCellPortalVertCheckLenDiff; // 0x408(0x4)
	uint8_t GridReduceRouteCornerGenRoutePoint : 1; // 0x40C(0x1), Mask(0x1)
	uint8_t BitPad_0x40C_1 : 7; // 0x40C(0x1)
	uint8_t Pad_0x40D[0x3]; // 0x40D(0x3)
	float GridReduceRouteCorner2DMinDist; // 0x410(0x4)
	float GridReduceRouteCornerPathMinDist; // 0x414(0x4)
	float GridReduceRoutePortal2DMinDist; // 0x418(0x4)
	float GridReduceRoutePortalPathMinDist; // 0x41C(0x4)
	float GridReduceRouteZDiffDist; // 0x420(0x4)
	uint8_t DrawGridCell : 1; // 0x424(0x1), Mask(0x1)
	uint8_t BitPad_0x424_1 : 7; // 0x424(0x1)
	uint8_t DrawGridCellConnect : 1; // 0x425(0x1), Mask(0x1)
	uint8_t BitPad_0x425_1 : 7; // 0x425(0x1)
	uint8_t DrawGridCellCorner : 1; // 0x426(0x1), Mask(0x1)
	uint8_t BitPad_0x426_1 : 7; // 0x426(0x1)
	uint8_t DrawGridCellPortalPath : 1; // 0x427(0x1), Mask(0x1)
	uint8_t BitPad_0x427_1 : 7; // 0x427(0x1)
	uint8_t DrawGridCellPortalData : 1; // 0x428(0x1), Mask(0x1)
	uint8_t BitPad_0x428_1 : 7; // 0x428(0x1)
	uint8_t DrawGridCellRemoteRoute : 1; // 0x429(0x1), Mask(0x1)
	uint8_t BitPad_0x429_1 : 7; // 0x429(0x1)
	uint8_t DrawGridCandicateRoute : 1; // 0x42A(0x1), Mask(0x1)
	uint8_t BitPad_0x42A_1 : 7; // 0x42A(0x1)
	uint8_t GridCellMatchFlip : 1; // 0x42B(0x1), Mask(0x1)
	uint8_t BitPad_0x42B_1 : 7; // 0x42B(0x1)
	float RouteLinkMaxDist; // 0x42C(0x4)
	float RouteLinkYawCheckRange; // 0x430(0x4)
	float RouteLinkDropPathLenScale; // 0x434(0x4)
	float RouteLinkSimilarDropYaw; // 0x438(0x4)
	float RouteLinkSimilarSegMinDist; // 0x43C(0x4)
	uint8_t DoGenBattleRoutePoints : 1; // 0x440(0x1), Mask(0x1)
	uint8_t BitPad_0x440_1 : 7; // 0x440(0x1)
	uint8_t Pad_0x441[0x7]; // 0x441(0x7)
	struct TArray<struct FString> ProfileTemplateVals; // 0x448(0x10)
	uint8_t Pad_0x458[0x30]; // 0x458(0x30)
	struct UObject* BattleRouteWayPointClass; // 0x488(0x8)
	struct TArray<struct ABattleRoutePoint*> GenBattleRoutePoints; // 0x490(0x10)
	uint8_t Pad_0x4A0[0xF0]; // 0x4A0(0xF0)
	struct ARecastNavMesh* RecastNavMesh; // 0x590(0x8)
	uint8_t Pad_0x598[0x10]; // 0x598(0x10)
	struct ANavExtendAgent* NavExtendAgent; // 0x5A8(0x8)
	uint8_t Pad_0x5B0[0x8]; // 0x5B0(0x8)

	// Object: Function Breakthrough.BattleRouteGenerator.TestGridSerialize
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec52d0
	// Params: [ Num(0) Size(0x0) ]
	void TestGridSerialize();

	// Object: Function Breakthrough.BattleRouteGenerator.StartGenerator
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec52bc
	// Params: [ Num(0) Size(0x0) ]
	void StartGenerator();

	// Object: Function Breakthrough.BattleRouteGenerator.StartGenBaseRoute
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec52a8
	// Params: [ Num(0) Size(0x0) ]
	void StartGenBaseRoute();

	// Object: Function Breakthrough.BattleRouteGenerator.ClearDrawDebug
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5294
	// Params: [ Num(0) Size(0x0) ]
	void ClearDrawDebug();

	// Object: Function Breakthrough.BattleRouteGenerator.ClearAllSectorPoint
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5280
	// Params: [ Num(0) Size(0x0) ]
	void ClearAllSectorPoint();

	// Object: Function Breakthrough.BattleRouteGenerator.ClearAllRouteWayPoint
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec526c
	// Params: [ Num(0) Size(0x0) ]
	void ClearAllRouteWayPoint();

	// Object: Function Breakthrough.BattleRouteGenerator.ClearAllFlankPoint
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5258
	// Params: [ Num(0) Size(0x0) ]
	void ClearAllFlankPoint();
};

// Object: Class Breakthrough.BattleSectorAnchor
// Size: 0x928 (Inherited: 0x370)
struct ABattleSectorAnchor : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABattleSectorAnchor, "BattleSectorAnchor")

	uint8_t Pad_0x370[0x30]; // 0x370(0x30)
	struct USceneComponent* SceneComponent; // 0x3A0(0x8)
	struct AActor* CenterActor; // 0x3A8(0x8)
	struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>> Camp0InnerSpawnAreas; // 0x3B0(0x10)
	struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>> Camp0OuterSpawnAreas; // 0x3C0(0x10)
	struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>> Camp1InnerSpawnAreas; // 0x3D0(0x10)
	struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>> Camp1OuterSpawnAreas; // 0x3E0(0x10)
	struct TArray<struct FAnchorSpawnAreaGroup> Camp0InnerSpawnAreasAlterGroups; // 0x3F0(0x10)
	struct TArray<struct FAnchorSpawnAreaGroup> Camp0OuterSpawnAreasAlterGroups; // 0x400(0x10)
	struct TArray<struct FAnchorSpawnAreaGroup> Camp1InnerSpawnAreasAlterGroups; // 0x410(0x10)
	struct TArray<struct FAnchorSpawnAreaGroup> Camp1OuterSpawnAreasAlterGroups; // 0x420(0x10)
	struct TArray<struct FAnchorSpawnAreaGroup> GuaranteedRebornAreasAlterGroups; // 0x430(0x10)
	struct TArray<float> SpawnAreaAlterScoreList; // 0x440(0x10)
	uint8_t Pad_0x450[0x8]; // 0x450(0x8)
	struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>> GuaranteedRebornAreas; // 0x458(0x10)
	struct USplineAreaComponent* SectorSplineAreaComponent; // 0x468(0x8)
	struct FText Name; // 0x470(0x18)
	struct FName NameInIcon; // 0x488(0x8)
	uint8_t Pad_0x490[0x20]; // 0x490(0x20)
	uint8_t bShowMapSplineArea : 1; // 0x4B0(0x1), Mask(0x1)
	uint8_t BitPad_0x4B0_1 : 7; // 0x4B0(0x1)
	uint8_t Pad_0x4B1[0x3]; // 0x4B1(0x3)
	float Camp0OccupySpeedFactor; // 0x4B4(0x4)
	float Camp1OccupySpeedFactor; // 0x4B8(0x4)
	float AbsMaxOccupyVal; // 0x4BC(0x4)
	float CurOccupyVal; // 0x4C0(0x4)
	uint8_t Pad_0x4C4[0x4]; // 0x4C4(0x4)
	float AttackerOccupyComparison; // 0x4C8(0x4)
	float DetectHeight; // 0x4CC(0x4)
	float OccupySpeedMultiplier; // 0x4D0(0x4)
	float StickToTheGoalNeedKeepInSeconds; // 0x4D4(0x4)
	float StickToTheGoalNeedEnemyIn; // 0x4D8(0x4)
	float StickToTheGoalTickRate; // 0x4DC(0x4)
	uint8_t Pad_0x4E0[0x8]; // 0x4E0(0x8)
	int32_t DefaultOwnerCamp; // 0x4E8(0x4)
	uint8_t Pad_0x4EC[0x8]; // 0x4EC(0x8)
	int32_t OwnerCamp; // 0x4F4(0x4)
	int32_t SerialNumber; // 0x4F8(0x4)
	uint8_t IsActive : 1; // 0x4FC(0x1), Mask(0x1)
	uint8_t BitPad_0x4FC_1 : 7; // 0x4FC(0x1)
	uint8_t Pad_0x4FD[0x3]; // 0x4FD(0x3)
	int32_t Camp0CharactersNum; // 0x500(0x4)
	int32_t Camp1CharactersNum; // 0x504(0x4)
	int32_t IsBigEventHappening; // 0x508(0x4)
	uint8_t IsLocked : 1; // 0x50C(0x1), Mask(0x1)
	uint8_t BitPad_0x50C_1 : 7; // 0x50C(0x1)
	uint8_t Pad_0x50D[0x3]; // 0x50D(0x3)
	int32_t AnchorLockedTime; // 0x510(0x4)
	uint8_t Pad_0x514[0x4]; // 0x514(0x4)
	struct UCurveFloat* DistanceCurve; // 0x518(0x8)
	struct UCurveFloat* DeltaScoreCurve; // 0x520(0x8)
	struct ABattleSectorBase* OwnerSector; // 0x528(0x8)
	int32_t ReDeployAutoSelectPriority; // 0x530(0x4)
	uint8_t bShowCapMarker : 1; // 0x534(0x1), Mask(0x1)
	uint8_t BitPad_0x534_1 : 7; // 0x534(0x1)
	uint8_t Pad_0x535[0x3]; // 0x535(0x3)
	struct FVector2D TopbarPosition; // 0x538(0x8)
	struct ASpawnAreaHub* Camp0SpawnAreaHub; // 0x540(0x8)
	struct ASpawnAreaHub* Camp1SpawnAreaHub; // 0x548(0x8)
	struct FTimerHandle TimerHandleCollectVehicleSpawnerStatus; // 0x550(0x8)
	uint8_t IsConcentratedFireSectorAnchor : 1; // 0x558(0x1), Mask(0x1)
	uint8_t BitPad_0x558_1 : 7; // 0x558(0x1)
	uint8_t bCamp0OuterSpawnAreasEnemyIn : 1; // 0x559(0x1), Mask(0x1)
	uint8_t BitPad_0x559_1 : 7; // 0x559(0x1)
	uint8_t bCamp1OuterSpawnAreasEnemyIn : 1; // 0x55A(0x1), Mask(0x1)
	uint8_t BitPad_0x55A_1 : 7; // 0x55A(0x1)
	uint8_t bUseSplineAreaComponentAsOuterRebornArea : 1; // 0x55B(0x1), Mask(0x1)
	uint8_t BitPad_0x55B_1 : 7; // 0x55B(0x1)
	float ZOffsetOfcharacterWhenCalcNavDistOfSpawnArea; // 0x55C(0x4)
	uint8_t Pad_0x560[0x1A8]; // 0x560(0x1A8)
	struct UBreakthroughStatisticsComponent* StatisticsComponent; // 0x708(0x8)
	uint8_t Pad_0x710[0x18]; // 0x710(0x18)
	struct TArray<struct ADFMAIPlayerController*> DefendingAIList; // 0x728(0x10)
	uint8_t bCanBeMarkedByPlayer : 1; // 0x738(0x1), Mask(0x1)
	uint8_t BitPad_0x738_1 : 7; // 0x738(0x1)
	EBattleFieldGameModeMarkerType PlayerMarkingType; // 0x739(0x1)
	uint8_t Pad_0x73A[0x6]; // 0x73A(0x6)
	struct FMulticastInlineDelegate OnClientOnSectorAnchorUpdated; // 0x740(0x10)
	uint8_t bIsFirstTimeEntryAnchor : 1; // 0x750(0x1), Mask(0x1)
	uint8_t BitPad_0x750_1 : 7; // 0x750(0x1)
	uint8_t bUseRebornSplineArea : 1; // 0x751(0x1), Mask(0x1)
	uint8_t BitPad_0x751_1 : 7; // 0x751(0x1)
	uint8_t Pad_0x752[0x6]; // 0x752(0x6)
	struct USplineAreaComponent* SectorRebornSplineAreaComponent; // 0x758(0x8)
	struct TSet<struct TWeakObjectPtr<struct ADFMCharacter>> RebornSplineAreaInnerCharacters; // 0x760(0x50)
	struct TMap<struct TWeakObjectPtr<struct ADFMCharacter>, float> RebornSplineAreaCamp0Characters; // 0x7B0(0x50)
	struct TMap<struct TWeakObjectPtr<struct ADFMCharacter>, float> RebornSplineAreaCamp1Characters; // 0x800(0x50)
	uint8_t Pad_0x850[0x10]; // 0x850(0x10)
	float NoCharacterTime; // 0x860(0x4)
	float CollectionSectorDataInterval; // 0x864(0x4)
	struct TMap<uint64_t, struct FPlayerInAnchorTimeInfo> EntryTimeMap; // 0x868(0x50)
	uint8_t Pad_0x8B8[0xC]; // 0x8B8(0xC)
	float MiniMapEnableEdgeTracingDistance; // 0x8C4(0x4)
	uint8_t Pad_0x8C8[0x30]; // 0x8C8(0x30)
	struct UCurveFloat* OcuupyStatusSpeedCurve; // 0x8F8(0x8)
	uint8_t Pad_0x900[0x20]; // 0x900(0x20)
	struct ABattleFlag* OwnerBattleFlag; // 0x920(0x8)

	// Object: Function Breakthrough.BattleSectorAnchor.UpdateSpawnAreaInnerOutterState
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x14ec6850
	// Params: [ Num(2) Size(0x11) ]
	void UpdateSpawnAreaInnerOutterState(const struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>>& SpawnAreas, uint8_t bIsInner);

	// Object: Function Breakthrough.BattleSectorAnchor.UpdatePlayerInAnchorState
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec67a4
	// Params: [ Num(1) Size(0x1) ]
	void UpdatePlayerInAnchorState(uint8_t InIsPlayerOccupyingAnchor);

	// Object: Function Breakthrough.BattleSectorAnchor.UpdateOuterSpawnAreasEnemyIn
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec6790
	// Params: [ Num(0) Size(0x0) ]
	void UpdateOuterSpawnAreasEnemyIn();

	// Object: Function Breakthrough.BattleSectorAnchor.UpdateMarkerShow
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec677c
	// Params: [ Num(0) Size(0x0) ]
	void UpdateMarkerShow();

	// Object: Function Breakthrough.BattleSectorAnchor.UpdateCaptureProgressScoreFeedback
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec66d8
	// Params: [ Num(1) Size(0x4) ]
	void UpdateCaptureProgressScoreFeedback(float DeltaOccupyVal);

	// Object: Function Breakthrough.BattleSectorAnchor.TickStickToTheGoal
	// Flags: [Native|Public]
	// Offset: 0x14ec662c
	// Params: [ Num(1) Size(0x4) ]
	void TickStickToTheGoal(float DeltaTime);

	// Object: Function Breakthrough.BattleSectorAnchor.TickOccupyValHalfJoin
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec6550
	// Params: [ Num(2) Size(0x8) ]
	void TickOccupyValHalfJoin(float DeltaTime, float OldOccupyVal);

	// Object: Function Breakthrough.BattleSectorAnchor.StartBigEventWithAutoEnd
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec63c0
	// Params: [ Num(5) Size(0x11) ]
	void StartBigEventWithAutoEnd(float InBigEventDuration, int32_t InIsForceOuter, int32_t InIsRemoveAnchor, int32_t InIsAfterBigEventCoorAnchorOccupy, EBigeventCoorAnchorPerformMode CoorAnchorPerformMode);

	// Object: Function Breakthrough.BattleSectorAnchor.ShowNeutralAndTargetScoreFeedback
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec631c
	// Params: [ Num(1) Size(0x1) ]
	void ShowNeutralAndTargetScoreFeedback(ECampType CampType);

	// Object: Function Breakthrough.BattleSectorAnchor.ShowCapturedScoreFeedback
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec6278
	// Params: [ Num(1) Size(0x1) ]
	void ShowCapturedScoreFeedback(ECampType CampType);

	// Object: Function Breakthrough.BattleSectorAnchor.SetOwnerSector
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec61d4
	// Params: [ Num(1) Size(0x8) ]
	void SetOwnerSector(struct ABattleSectorBase* InOwnerSector);

	// Object: Function Breakthrough.BattleSectorAnchor.SetConfigVehicleSpawnCD
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x14ec6084
	// Params: [ Num(1) Size(0x58) ]
	void SetConfigVehicleSpawnCD(const struct FBattleSectorDefines& BRDataRow);

	// Object: Function Breakthrough.BattleSectorAnchor.SetConcentratedFireSectorAnchor
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5f9c
	// Params: [ Num(2) Size(0x2) ]
	void SetConcentratedFireSectorAnchor(uint8_t InIsConcentratedFireSectorAnchor, ECampType InCampType);

	// Object: Function Breakthrough.BattleSectorAnchor.RevertBigEvent
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5f88
	// Params: [ Num(0) Size(0x0) ]
	void RevertBigEvent();

	// Object: Function Breakthrough.BattleSectorAnchor.OnSetOwnerCamp
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void OnSetOwnerCamp();

	// Object: Function Breakthrough.BattleSectorAnchor.OnServerLeftVotes
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5ee4
	// Params: [ Num(1) Size(0x4) ]
	void OnServerLeftVotes(int32_t LeftVotes);

	// Object: Function Breakthrough.BattleSectorAnchor.OnRep_OwnerCamp
	// Flags: [Native|Public]
	// Offset: 0x14ec5ec8
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_OwnerCamp();

	// Object: Function Breakthrough.BattleSectorAnchor.OnRep_IsBigEventHappening
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5eb4
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_IsBigEventHappening();

	// Object: Function Breakthrough.BattleSectorAnchor.OnRep_IsActive
	// Flags: [Final|Native|Public]
	// Offset: 0xfc8c5a0
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_IsActive();

	// Object: Function Breakthrough.BattleSectorAnchor.OnRep_InCharacterNumChange
	// Flags: [Final|Native|Public]
	// Offset: 0xee9d0b0
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_InCharacterNumChange();

	// Object: Function Breakthrough.BattleSectorAnchor.OnRep_CurOccupyVal
	// Flags: [Final|Native|Public]
	// Offset: 0xee9f710
	// Params: [ Num(1) Size(0x4) ]
	void OnRep_CurOccupyVal(float OldValue);

	// Object: Function Breakthrough.BattleSectorAnchor.OnRep_Camp1OuterSpawnAreasEnemyIn
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5ea0
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_Camp1OuterSpawnAreasEnemyIn();

	// Object: Function Breakthrough.BattleSectorAnchor.OnRep_Camp0OuterSpawnAreasEnemyIn
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5e8c
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_Camp0OuterSpawnAreasEnemyIn();

	// Object: Function Breakthrough.BattleSectorAnchor.OnOverlapEnd
	// Flags: [Native|Protected]
	// Offset: 0x14ec5d30
	// Params: [ Num(4) Size(0x1C) ]
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex);

	// Object: Function Breakthrough.BattleSectorAnchor.OnOverlapBegin
	// Flags: [Native|Protected|HasOutParms]
	// Offset: 0x14ec5b30
	// Params: [ Num(6) Size(0xA8) ]
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, uint8_t bFromSweep, const struct FHitResult& SweepResult);

	// Object: Function Breakthrough.BattleSectorAnchor.OnMarkerReload
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec5b1c
	// Params: [ Num(0) Size(0x0) ]
	void OnMarkerReload();

	// Object: Function Breakthrough.BattleSectorAnchor.OnDsBeginMatchReqReceived
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec5b08
	// Params: [ Num(0) Size(0x0) ]
	void OnDsBeginMatchReqReceived();

	// Object: Function Breakthrough.BattleSectorAnchor.OnDeactivate
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5af4
	// Params: [ Num(0) Size(0x0) ]
	void OnDeactivate();

	// Object: Function Breakthrough.BattleSectorAnchor.onActivate
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5ae0
	// Params: [ Num(0) Size(0x0) ]
	void onActivate();

	// Object: Function Breakthrough.BattleSectorAnchor.NotifyAttackerFirstEnter
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5acc
	// Params: [ Num(0) Size(0x0) ]
	void NotifyAttackerFirstEnter();

	// Object: Function Breakthrough.BattleSectorAnchor.MulticastOccupyStatusChanged
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable]
	// Offset: 0xf778d1c
	// Params: [ Num(2) Size(0x8) ]
	void MulticastOccupyStatusChanged(int32_t OccupyCampId, int32_t BetterCamp);

	// Object: Function Breakthrough.BattleSectorAnchor.IsInBattle
	// Flags: [Native|Public]
	// Offset: 0x14ec5a8c
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsInBattle();

	// Object: Function Breakthrough.BattleSectorAnchor.GetCurrentOwnerCamp
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5a58
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetCurrentOwnerCamp();

	// Object: Function Breakthrough.BattleSectorAnchor.GetCurrentOccupyPercent
	// Flags: [Native|Public]
	// Offset: 0x14ec5a1c
	// Params: [ Num(1) Size(0x4) ]
	float GetCurrentOccupyPercent();

	// Object: Function Breakthrough.BattleSectorAnchor.GetCurOccupyVal
	// Flags: [Native|Public]
	// Offset: 0x14ec59e0
	// Params: [ Num(1) Size(0x4) ]
	float GetCurOccupyVal();

	// Object: Function Breakthrough.BattleSectorAnchor.GetConcentratedFireSectorAnchorScoreMultiplier
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5934
	// Params: [ Num(2) Size(0x8) ]
	float GetConcentratedFireSectorAnchorScoreMultiplier(ECampType InCampType);

	// Object: Function Breakthrough.BattleSectorAnchor.GetCampAnchorSpawnAreas
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x14ec5824
	// Params: [ Num(2) Size(0x20) ]
	void GetCampAnchorSpawnAreas(const struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>>& InAnchorSpawnAreas, struct TArray<struct AAnchorSpawnArea*>& OutAnchorSpawnAreas);

	// Object: Function Breakthrough.BattleSectorAnchor.GetAliveCamp1CharactersNum
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec57f0
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetAliveCamp1CharactersNum();

	// Object: Function Breakthrough.BattleSectorAnchor.GetAliveCamp0CharactersNum
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec57bc
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetAliveCamp0CharactersNum();

	// Object: Function Breakthrough.BattleSectorAnchor.CollectVehicleSpawnerStatus
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec57a8
	// Params: [ Num(0) Size(0x0) ]
	void CollectVehicleSpawnerStatus();

	// Object: Function Breakthrough.BattleSectorAnchor.CollectionSectorData
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5794
	// Params: [ Num(0) Size(0x0) ]
	void CollectionSectorData();

	// Object: Function Breakthrough.BattleSectorAnchor.CheckRebornIsInRebornArea
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x14ec56d0
	// Params: [ Num(2) Size(0xD) ]
	uint8_t CheckRebornIsInRebornArea(const struct FVector& WorldLocation);

	// Object: Function Breakthrough.BattleSectorAnchor.CheckFriendlySmokeScore
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec562c
	// Params: [ Num(1) Size(0x8) ]
	void CheckFriendlySmokeScore(struct ADFMCharacter* CharacterCaptureProgressInYourSmoke);

	// Object: Function Breakthrough.BattleSectorAnchor.CheckBlastShieldScore
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5588
	// Params: [ Num(1) Size(0x8) ]
	void CheckBlastShieldScore(struct ADFMCharacter* CHARACTER);

	// Object: Function Breakthrough.BattleSectorAnchor.AutoEndAndRevertBigEvent
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec5574
	// Params: [ Num(0) Size(0x0) ]
	void AutoEndAndRevertBigEvent();
};

// Object: Class Breakthrough.BattleSectorAnchor_HotFixActor
// Size: 0x5E8 (Inherited: 0x418)
struct ABattleSectorAnchor_HotFixActor : AGPHotFixActorBase
{
	DEFINE_UE_CLASS_HELPERS(ABattleSectorAnchor_HotFixActor, "BattleSectorAnchor_HotFixActor")

	struct TSoftObjectPtr<ABattleSectorAnchor> HotFixTargetActorSoftObjectPtr; // 0x418(0x28)
	struct TSoftObjectPtr<ABattleSectorAnchor> HotFixAddActorSoftObjectPtr; // 0x440(0x28)
	struct TSoftObjectPtr<ABattleSectorAnchor> HotFixDeleteActorSoftObjectPtr; // 0x468(0x28)
	struct AActor* CenterActor; // 0x490(0x8)
	struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>> Camp0InnerSpawnAreas; // 0x498(0x10)
	struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>> Camp0OuterSpawnAreas; // 0x4A8(0x10)
	struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>> Camp1InnerSpawnAreas; // 0x4B8(0x10)
	struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>> Camp1OuterSpawnAreas; // 0x4C8(0x10)
	struct TArray<struct FAnchorSpawnAreaGroup> Camp0InnerSpawnAreasAlterGroups; // 0x4D8(0x10)
	struct TArray<struct FAnchorSpawnAreaGroup> Camp0OuterSpawnAreasAlterGroups; // 0x4E8(0x10)
	struct TArray<struct FAnchorSpawnAreaGroup> Camp1InnerSpawnAreasAlterGroups; // 0x4F8(0x10)
	struct TArray<struct FAnchorSpawnAreaGroup> Camp1OuterSpawnAreasAlterGroups; // 0x508(0x10)
	struct TArray<struct FAnchorSpawnAreaGroup> GuaranteedRebornAreasAlterGroups; // 0x518(0x10)
	struct TArray<float> SpawnAreaAlterScoreList; // 0x528(0x10)
	struct TArray<struct TSoftObjectPtr<AAnchorSpawnArea>> GuaranteedRebornAreas; // 0x538(0x10)
	struct USplineAreaComponent* SectorSplineAreaComponent; // 0x548(0x8)
	struct FText Name; // 0x550(0x18)
	struct FName NameInIcon; // 0x568(0x8)
	uint8_t bShowMapSplineArea : 1; // 0x570(0x1), Mask(0x1)
	uint8_t BitPad_0x570_1 : 7; // 0x570(0x1)
	uint8_t Pad_0x571[0x3]; // 0x571(0x3)
	float Camp0OccupySpeedFactor; // 0x574(0x4)
	float Camp1OccupySpeedFactor; // 0x578(0x4)
	float AbsMaxOccupyVal; // 0x57C(0x4)
	float DetectHeight; // 0x580(0x4)
	float OccupySpeedMultiplier; // 0x584(0x4)
	float StickToTheGoalNeedKeepInSeconds; // 0x588(0x4)
	float StickToTheGoalNeedEnemyIn; // 0x58C(0x4)
	float StickToTheGoalTickRate; // 0x590(0x4)
	int32_t DefaultOwnerCamp; // 0x594(0x4)
	struct UCurveFloat* DistanceCurve; // 0x598(0x8)
	struct UCurveFloat* DeltaScoreCurve; // 0x5A0(0x8)
	int32_t ReDeployAutoSelectPriority; // 0x5A8(0x4)
	struct FVector2D TopbarPosition; // 0x5AC(0x8)
	uint8_t Pad_0x5B4[0x4]; // 0x5B4(0x4)
	struct ASpawnAreaHub* Camp0SpawnAreaHub; // 0x5B8(0x8)
	struct ASpawnAreaHub* Camp1SpawnAreaHub; // 0x5C0(0x8)
	uint8_t bUseSplineAreaComponentAsOuterRebornArea : 1; // 0x5C8(0x1), Mask(0x1)
	uint8_t BitPad_0x5C8_1 : 7; // 0x5C8(0x1)
	uint8_t Pad_0x5C9[0x3]; // 0x5C9(0x3)
	float ZOffsetOfcharacterWhenCalcNavDistOfSpawnArea; // 0x5CC(0x4)
	uint8_t bUseRebornSplineArea : 1; // 0x5D0(0x1), Mask(0x1)
	uint8_t BitPad_0x5D0_1 : 7; // 0x5D0(0x1)
	uint8_t Pad_0x5D1[0x7]; // 0x5D1(0x7)
	struct USplineAreaComponent* SectorRebornSplineAreaComponent; // 0x5D8(0x8)
	float CollectionSectorDataInterval; // 0x5E0(0x4)
	float MiniMapEnableEdgeTracingDistance; // 0x5E4(0x4)
};

// Object: Class Breakthrough.BattleSectorAnchorMultiCamp
// Size: 0x950 (Inherited: 0x928)
struct ABattleSectorAnchorMultiCamp : ABattleSectorAnchor
{
	DEFINE_UE_CLASS_HELPERS(ABattleSectorAnchorMultiCamp, "BattleSectorAnchorMultiCamp")

	struct TArray<struct FCampOccupyConfig> CampOccupyConfigArray; // 0x928(0x10)
	uint8_t Pad_0x938[0x10]; // 0x938(0x10)
	int32_t DominantCamp; // 0x948(0x4)
	float DominantOccupyProgress; // 0x94C(0x4)
};

// Object: Class Breakthrough.BattleSectorBase
// Size: 0x638 (Inherited: 0x370)
struct ABattleSectorBase : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABattleSectorBase, "BattleSectorBase")

	uint8_t Pad_0x370[0x20]; // 0x370(0x20)
	struct FName SectorID; // 0x390(0x8)
	uint8_t Pad_0x398[0x8]; // 0x398(0x8)
	struct FText SectorName; // 0x3A0(0x18)
	float CommanderTransTime; // 0x3B8(0x4)
	int32_t AddVoteNum; // 0x3BC(0x4)
	int32_t SerialNumber; // 0x3C0(0x4)
	int32_t BonusVotes; // 0x3C4(0x4)
	uint32_t MatchDuration; // 0x3C8(0x4)
	uint8_t IsInFightBack : 1; // 0x3CC(0x1), Mask(0x1)
	uint8_t BitPad_0x3CC_1 : 7; // 0x3CC(0x1)
	uint8_t Pad_0x3CD[0x3]; // 0x3CD(0x3)
	int32_t OccupyCampId; // 0x3D0(0x4)
	uint8_t bUseExtraArea : 1; // 0x3D4(0x1), Mask(0x1)
	uint8_t BitPad_0x3D4_1 : 7; // 0x3D4(0x1)
	uint8_t bUseDisplaySectorSplineArea : 1; // 0x3D5(0x1), Mask(0x1)
	uint8_t BitPad_0x3D5_1 : 7; // 0x3D5(0x1)
	uint8_t bGlobalStageUseDisplaySectorSplineArea : 1; // 0x3D6(0x1), Mask(0x1)
	uint8_t BitPad_0x3D6_1 : 7; // 0x3D6(0x1)
	uint8_t bZoomStageUseDisplaySectorSplineArea : 1; // 0x3D7(0x1), Mask(0x1)
	uint8_t BitPad_0x3D7_1 : 7; // 0x3D7(0x1)
	struct FSoftObjectPath BackImg; // 0x3D8(0x18)
	uint8_t bCanEffectByBigEvent : 1; // 0x3F0(0x1), Mask(0x1)
	uint8_t BitPad_0x3F0_1 : 7; // 0x3F0(0x1)
	uint8_t Pad_0x3F1[0x7]; // 0x3F1(0x7)
	struct ACustomLayoutActor* CustomLayoutActor; // 0x3F8(0x8)
	uint8_t bUseBigEventEffectSplineArea : 1; // 0x400(0x1), Mask(0x1)
	uint8_t BitPad_0x400_1 : 7; // 0x400(0x1)
	uint8_t Pad_0x401[0x17]; // 0x401(0x17)
	uint8_t bActived : 1; // 0x418(0x1), Mask(0x1)
	uint8_t BitPad_0x418_1 : 7; // 0x418(0x1)
	uint8_t Pad_0x419[0x7]; // 0x419(0x7)
	struct USceneComponent* SceneComponent; // 0x420(0x8)
	struct TArray<struct TSoftObjectPtr<ABattleSectorAnchor>> SectorAnchors; // 0x428(0x10)
	struct TArray<uint8_t> SectorAnchorsActiveList; // 0x438(0x10)
	struct TArray<struct ABattleCampSector*> CampSectors; // 0x448(0x10)
	struct TArray<struct ABattleSectorVehicle*> VehicleSectors; // 0x458(0x10)
	struct UCurveFloat* TicketRewardCurve; // 0x468(0x8)
	struct TArray<EAnimVehicleType> VehicleTypes; // 0x470(0x10)
	struct USplineAreaComponent* SectorSplineAreaComponent; // 0x480(0x8)
	struct USplineAreaComponent* ExtraSectorSplineAreaComponent; // 0x488(0x8)
	struct USplineAreaComponent* DisplaySectorSplineAreaComponent; // 0x490(0x8)
	int32_t DefenderInSectorNum; // 0x498(0x4)
	float ActivateTime; // 0x49C(0x4)
	struct TSet<struct TWeakObjectPtr<struct ADFMCharacter>> InnerCharacters; // 0x4A0(0x50)
	struct FLinearColor MapMaskID; // 0x4F0(0x10)
	struct TSoftObjectPtr<AActor> BP_RedeployFog; // 0x500(0x28)
	uint8_t Pad_0x528[0x18]; // 0x528(0x18)
	struct TSet<struct TWeakObjectPtr<struct ADFMCharacter>> Camp1TransCharacters; // 0x540(0x50)
	uint8_t Pad_0x590[0x3C]; // 0x590(0x3C)
	float SectorChangeRemainTime; // 0x5CC(0x4)
	struct ABattleSectorBase* BackupSector; // 0x5D0(0x8)
	int32_t bIsBigEventBackupSector; // 0x5D8(0x4)
	uint8_t Pad_0x5DC[0xC]; // 0x5DC(0xC)
	int32_t CurHardPointIndex; // 0x5E8(0x4)
	int32_t NextHardPointIndex; // 0x5EC(0x4)
	int32_t TeamOccupyIntervalScore; // 0x5F0(0x4)
	float TeamOccupyInterval; // 0x5F4(0x4)
	struct TArray<struct FHardPointConfig> HardPointsArray; // 0x5F8(0x10)
	float CurHardPointDuration; // 0x608(0x4)
	float ActiveCountdownTime; // 0x60C(0x4)
	uint8_t bIsFirstHardPointAnchor : 1; // 0x610(0x1), Mask(0x1)
	uint8_t BitPad_0x610_1 : 7; // 0x610(0x1)
	uint8_t bIsPreHardPointAnchor : 1; // 0x611(0x1), Mask(0x1)
	uint8_t BitPad_0x611_1 : 7; // 0x611(0x1)
	uint8_t Pad_0x612[0x2]; // 0x612(0x2)
	float HardPointAnchorStartTime; // 0x614(0x4)
	float LeftHardPointTime; // 0x618(0x4)
	uint8_t Pad_0x61C[0x4]; // 0x61C(0x4)
	struct ABattleSectorHardPoint* CurrentActiveHardPoint; // 0x620(0x8)
	struct ABattleSectorHardPoint* CurrentPreActiveHardPoint; // 0x628(0x8)
	uint8_t bIsAlternativeSector : 1; // 0x630(0x1), Mask(0x1)
	uint8_t BitPad_0x630_1 : 7; // 0x630(0x1)
	uint8_t Pad_0x631[0x7]; // 0x631(0x7)

	// Object: Function Breakthrough.BattleSectorBase.SetConfigVehicleSpawnCD
	// Flags: [Final|Native|Private|HasOutParms]
	// Offset: 0x14ec9c68
	// Params: [ Num(1) Size(0x58) ]
	void SetConfigVehicleSpawnCD(const struct FBattleSectorDefines& BRDataRow);

	// Object: Function Breakthrough.BattleSectorBase.PreActiveHardPointFunc
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec9c54
	// Params: [ Num(0) Size(0x0) ]
	void PreActiveHardPointFunc();

	// Object: Function Breakthrough.BattleSectorBase.OnServerAfterRedeployCharacterShow
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec9bb0
	// Params: [ Num(1) Size(0x8) ]
	void OnServerAfterRedeployCharacterShow(uint64_t PlayerUin);

	// Object: Function Breakthrough.BattleSectorBase.OnRep_SectorAnchorsActiveList
	// Flags: [Final|Native|Public]
	// Offset: 0x10652eec
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_SectorAnchorsActiveList();

	// Object: Function Breakthrough.BattleSectorBase.OnRep_OccupyCampId
	// Flags: [Final|Native|Public]
	// Offset: 0xfa14470
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_OccupyCampId();

	// Object: Function Breakthrough.BattleSectorBase.OnRep_bUseBigEventEffectSplineArea
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec9b9c
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_bUseBigEventEffectSplineArea();

	// Object: Function Breakthrough.BattleSectorBase.OnRep_bActived
	// Flags: [Final|Native|Public]
	// Offset: 0x108fd868
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_bActived();

	// Object: Function Breakthrough.BattleSectorBase.OnRedeployStateChanged
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec9af8
	// Params: [ Num(1) Size(0x4) ]
	void OnRedeployStateChanged(int32_t InRedeployState);

	// Object: Function Breakthrough.BattleSectorBase.OnPlayerEntered
	// Flags: [Native|Public]
	// Offset: 0x14ec9a4c
	// Params: [ Num(1) Size(0x8) ]
	void OnPlayerEntered(struct ADFMCharacter* CHARACTER);

	// Object: Function Breakthrough.BattleSectorBase.OnOverlapEnd
	// Flags: [Native|Public]
	// Offset: 0x14ec98f0
	// Params: [ Num(4) Size(0x1C) ]
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex);

	// Object: Function Breakthrough.BattleSectorBase.OnOverlapBegin
	// Flags: [Native|Public|HasOutParms]
	// Offset: 0x14ec96f0
	// Params: [ Num(6) Size(0xA8) ]
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, uint8_t bFromSweep, const struct FHitResult& SweepResult);

	// Object: Function Breakthrough.BattleSectorBase.OnOccupySectorBegin
	// Flags: [Native|Public]
	// Offset: 0x14ec9644
	// Params: [ Num(1) Size(0x8) ]
	void OnOccupySectorBegin(struct ABattleSectorAnchor* OccupiedAnchor);

	// Object: Function Breakthrough.BattleSectorBase.OnIcelandBigEventCloseCampSector
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec9630
	// Params: [ Num(0) Size(0x0) ]
	void OnIcelandBigEventCloseCampSector();

	// Object: Function Breakthrough.BattleSectorBase.OnDsBeginMatchReqReceived
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec961c
	// Params: [ Num(0) Size(0x0) ]
	void OnDsBeginMatchReqReceived();

	// Object: Function Breakthrough.BattleSectorBase.MulticastStartBigEventBackUpSector
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable]
	// Offset: 0x14ec9600
	// Params: [ Num(0) Size(0x0) ]
	void MulticastStartBigEventBackUpSector();

	// Object: Function Breakthrough.BattleSectorBase.MulticastOnSectorDeactivate
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable]
	// Offset: 0x14ec95e4
	// Params: [ Num(0) Size(0x0) ]
	void MulticastOnSectorDeactivate();

	// Object: Function Breakthrough.BattleSectorBase.MulticastOnSectorActivate
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable]
	// Offset: 0x14ec95c8
	// Params: [ Num(0) Size(0x0) ]
	void MulticastOnSectorActivate();

	// Object: Function Breakthrough.BattleSectorBase.IsSelfOccupy
	// Flags: [Native|Public]
	// Offset: 0x14ec9588
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsSelfOccupy();

	// Object: Function Breakthrough.BattleSectorBase.InitHardPointTable
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec9574
	// Params: [ Num(0) Size(0x0) ]
	void InitHardPointTable();

	// Object: Function Breakthrough.BattleSectorBase.HasSectorAnchor
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec9480
	// Params: [ Num(3) Size(0xA) ]
	uint8_t HasSectorAnchor(struct ABattleSectorAnchor* InSectorAnchor, uint8_t bIsOnlyActive);

	// Object: Function Breakthrough.BattleSectorBase.GetZoomStageDisplaySectorSplineArea
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ec944c
	// Params: [ Num(1) Size(0x8) ]
	struct USplineAreaComponent* GetZoomStageDisplaySectorSplineArea();

	// Object: Function Breakthrough.BattleSectorBase.GetSectorAnchors
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x14ec934c
	// Params: [ Num(2) Size(0x11) ]
	void GetSectorAnchors(struct TArray<struct ABattleSectorAnchor*>& OutSectorAnchorsArray, uint8_t bIsOnlyActive);

	// Object: Function Breakthrough.BattleSectorBase.GetSectorAnchorNumByCampAfterBigEvent
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec92a0
	// Params: [ Num(2) Size(0x8) ]
	uint32_t GetSectorAnchorNumByCampAfterBigEvent(int32_t InCampId);

	// Object: Function Breakthrough.BattleSectorBase.GetSectorAnchorNumByCamp
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec91f4
	// Params: [ Num(2) Size(0x8) ]
	uint32_t GetSectorAnchorNumByCamp(int32_t InCampId);

	// Object: Function Breakthrough.BattleSectorBase.GetSectorAnchorNum
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec9140
	// Params: [ Num(2) Size(0x8) ]
	uint32_t GetSectorAnchorNum(uint8_t bIsOnlyActive);

	// Object: Function Breakthrough.BattleSectorBase.GetSectorAnchorIsFirstTimeEntry
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec9108
	// Params: [ Num(1) Size(0x1) ]
	uint8_t GetSectorAnchorIsFirstTimeEntry();

	// Object: Function Breakthrough.BattleSectorBase.GetSectorAnchorIndex
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec9018
	// Params: [ Num(3) Size(0x10) ]
	int32_t GetSectorAnchorIndex(struct ABattleSectorAnchor* InSectorAnchor, uint8_t bIsOnlyActive);

	// Object: Function Breakthrough.BattleSectorBase.GetSectorAnchorBySoftClassPtr
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec8ec4
	// Params: [ Num(2) Size(0x30) ]
	struct ABattleSectorAnchor* GetSectorAnchorBySoftClassPtr(struct TSoftObjectPtr<ABattleSectorAnchor> InSectorAnchor);

	// Object: Function Breakthrough.BattleSectorBase.GetSectorAnchorByIndex
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec8e18
	// Params: [ Num(2) Size(0x10) ]
	struct ABattleSectorAnchor* GetSectorAnchorByIndex(int32_t Index);

	// Object: Function Breakthrough.BattleSectorBase.GetOffenceAnchorCount
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec8de4
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetOffenceAnchorCount();

	// Object: Function Breakthrough.BattleSectorBase.GetGlobalStageDisplaySectorSplineArea
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ec8db0
	// Params: [ Num(1) Size(0x8) ]
	struct USplineAreaComponent* GetGlobalStageDisplaySectorSplineArea();

	// Object: Function Breakthrough.BattleSectorBase.GetDisplaySectorSplineArea
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ec8d7c
	// Params: [ Num(1) Size(0x8) ]
	struct USplineAreaComponent* GetDisplaySectorSplineArea();

	// Object: Function Breakthrough.BattleSectorBase.GetDefenceAnchorCount
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec8d48
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetDefenceAnchorCount();

	// Object: Function Breakthrough.BattleSectorBase.GetCharacterSectorAnchor
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec8c58
	// Params: [ Num(3) Size(0x18) ]
	struct ABattleSectorAnchor* GetCharacterSectorAnchor(struct ADFMCharacter* InCharacter, uint8_t bIsOnlyActive);

	// Object: Function Breakthrough.BattleSectorBase.GetAverageOccupiedProgress
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec8c24
	// Params: [ Num(1) Size(0x4) ]
	float GetAverageOccupiedProgress();

	// Object: Function Breakthrough.BattleSectorBase.GetActiveSpanTime
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec8bf0
	// Params: [ Num(1) Size(0x4) ]
	float GetActiveSpanTime();

	// Object: Function Breakthrough.BattleSectorBase.GetActiveSectorAnchorByIndex
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec8b44
	// Params: [ Num(2) Size(0x10) ]
	struct ABattleSectorAnchor* GetActiveSectorAnchorByIndex(int32_t Index);

	// Object: Function Breakthrough.BattleSectorBase.GetActiveCountdownTime
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec8b10
	// Params: [ Num(1) Size(0x4) ]
	float GetActiveCountdownTime();

	// Object: Function Breakthrough.BattleSectorBase.CollectionSectorData
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ec8afc
	// Params: [ Num(0) Size(0x0) ]
	void CollectionSectorData();

	// Object: Function Breakthrough.BattleSectorBase.CheckIsQualifiedByCharacter
	// Flags: [Native|Public|Const]
	// Offset: 0x14ec8a44
	// Params: [ Num(2) Size(0x9) ]
	uint8_t CheckIsQualifiedByCharacter(struct ACHARACTER* CHARACTER);

	// Object: Function Breakthrough.BattleSectorBase.CheckHardPointAnchor
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec89a0
	// Params: [ Num(1) Size(0x1) ]
	void CheckHardPointAnchor(EBreakthroughStage InStage);

	// Object: Function Breakthrough.BattleSectorBase.CharacterIsIn
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec88f0
	// Params: [ Num(2) Size(0x9) ]
	uint8_t CharacterIsIn(struct ADFMCharacter* CHARACTER);

	// Object: Function Breakthrough.BattleSectorBase.ActiveHardPointFunc
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec88dc
	// Params: [ Num(0) Size(0x0) ]
	void ActiveHardPointFunc();

	// Object: Function Breakthrough.BattleSectorBase.ActiveHardPointAnchorStatus
	// Flags: [Final|Native|Public]
	// Offset: 0x14ec87fc
	// Params: [ Num(2) Size(0x5) ]
	void ActiveHardPointAnchorStatus(int32_t AnchorIndex, EHardPointStatus Status);
};

// Object: Class Breakthrough.BattleSectorBase_HotFixActor
// Size: 0x568 (Inherited: 0x418)
struct ABattleSectorBase_HotFixActor : AGPHotFixActorBase
{
	DEFINE_UE_CLASS_HELPERS(ABattleSectorBase_HotFixActor, "BattleSectorBase_HotFixActor")

	struct TSoftObjectPtr<ABattleSectorBase> HotFixTargetActorSoftObjectPtr; // 0x418(0x28)
	struct TSoftObjectPtr<ABattleSectorBase> HotFixAddActorSoftObjectPtr; // 0x440(0x28)
	struct TSoftObjectPtr<ABattleSectorBase> HotFixDeleteActorSoftObjectPtr; // 0x468(0x28)
	uint8_t bUseExtraArea : 1; // 0x490(0x1), Mask(0x1)
	uint8_t BitPad_0x490_1 : 7; // 0x490(0x1)
	uint8_t bUseDisplaySectorSplineArea : 1; // 0x491(0x1), Mask(0x1)
	uint8_t BitPad_0x491_1 : 7; // 0x491(0x1)
	uint8_t bGlobalStageUseDisplaySectorSplineArea : 1; // 0x492(0x1), Mask(0x1)
	uint8_t BitPad_0x492_1 : 7; // 0x492(0x1)
	uint8_t bZoomStageUseDisplaySectorSplineArea : 1; // 0x493(0x1), Mask(0x1)
	uint8_t BitPad_0x493_1 : 7; // 0x493(0x1)
	uint8_t Pad_0x494[0x4]; // 0x494(0x4)
	struct FSoftObjectPath BackImg; // 0x498(0x18)
	uint8_t bCanEffectByBigEvent : 1; // 0x4B0(0x1), Mask(0x1)
	uint8_t BitPad_0x4B0_1 : 7; // 0x4B0(0x1)
	uint8_t Pad_0x4B1[0x7]; // 0x4B1(0x7)
	struct ACustomLayoutActor* CustomLayoutActor; // 0x4B8(0x8)
	struct TArray<struct TSoftObjectPtr<ABattleSectorAnchor>> SectorAnchors; // 0x4C0(0x10)
	struct TArray<struct ABattleCampSector*> CampSectors; // 0x4D0(0x10)
	struct TArray<struct ABattleSectorVehicle*> VehicleSectors; // 0x4E0(0x10)
	struct UCurveFloat* TicketRewardCurve; // 0x4F0(0x8)
	struct TArray<EAnimVehicleType> VehicleTypes; // 0x4F8(0x10)
	struct USplineAreaComponent* SectorSplineAreaComponent; // 0x508(0x8)
	struct USplineAreaComponent* ExtraSectorSplineAreaComponent; // 0x510(0x8)
	struct USplineAreaComponent* DisplaySectorSplineAreaComponent; // 0x518(0x8)
	struct FLinearColor MapMaskID; // 0x520(0x10)
	struct TSoftObjectPtr<AActor> BP_RedeployFog; // 0x530(0x28)
	float SectorChangeRemainTime; // 0x558(0x4)
	uint8_t Pad_0x55C[0x4]; // 0x55C(0x4)
	struct ABattleSectorBase* BackupSector; // 0x560(0x8)
};

// Object: Class Breakthrough.BattleSectorHardPoint
// Size: 0xA18 (Inherited: 0x928)
struct ABattleSectorHardPoint : ABattleSectorAnchor
{
	DEFINE_UE_CLASS_HELPERS(ABattleSectorHardPoint, "BattleSectorHardPoint")

	EHardPointStatus CurrentStatus; // 0x928(0x1)
	EHardPointOwnershipStatus CurrentOwnershipStatus; // 0x929(0x1)
	EHardPointOwnershipStatus LastHardPointOwnershipStatus; // 0x92A(0x1)
	uint8_t Pad_0x92B[0x5]; // 0x92B(0x5)
	struct FString NeutralToEnemyOccupyEvtName; // 0x930(0x10)
	struct FString NeutralToFriendlyOccupyEvtName; // 0x940(0x10)
	struct FString OccupyToNeutralEvtName; // 0x950(0x10)
	struct FString OccupyToContestingEvtName; // 0x960(0x10)
	struct TSoftObjectPtr<UGPAudioEventAsset> NeutralToEnemyOccupyAudioEventAsset; // 0x970(0x28)
	struct TSoftObjectPtr<UGPAudioEventAsset> NeutralToFriendlyOccupyAudioEventAsset; // 0x998(0x28)
	struct TSoftObjectPtr<UGPAudioEventAsset> OccupyToNeutralAudioEventAsset; // 0x9C0(0x28)
	struct TSoftObjectPtr<UGPAudioEventAsset> OccupyToContestingAudioEventAsset; // 0x9E8(0x28)
	float SpaceAudioStartDistance; // 0xA10(0x4)
	EHardPointOwnershipStatus LocalLastHardPointOwnershipStatus; // 0xA14(0x1)
	uint8_t bFirstChange : 1; // 0xA15(0x1), Mask(0x1)
	uint8_t BitPad_0xA15_1 : 7; // 0xA15(0x1)
	uint8_t bIsChangeStatus : 1; // 0xA16(0x1), Mask(0x1)
	uint8_t BitPad_0xA16_1 : 7; // 0xA16(0x1)
	EHardPointOwnershipStatus ChangeStatusHardPointOwnerCamp; // 0xA17(0x1)

	// Object: Function Breakthrough.BattleSectorHardPoint.SetStatus
	// Flags: [Final|Native|Public]
	// Offset: 0x14ecd42c
	// Params: [ Num(1) Size(0x1) ]
	void SetStatus(EHardPointStatus Status);

	// Object: Function Breakthrough.BattleSectorHardPoint.SetChangeStatusHardPointOwnerCamp
	// Flags: [Final|Native|Public]
	// Offset: 0x14ecd388
	// Params: [ Num(1) Size(0x1) ]
	void SetChangeStatusHardPointOwnerCamp(EHardPointOwnershipStatus InChangeStatusHardPointOwnerCamp);

	// Object: Function Breakthrough.BattleSectorHardPoint.OnSetLineShowOrHide
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void OnSetLineShowOrHide();

	// Object: Function Breakthrough.BattleSectorHardPoint.OnRep_LastHardPointOwnershipStatus
	// Flags: [Final|Native|Public]
	// Offset: 0x14ecd374
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_LastHardPointOwnershipStatus();

	// Object: Function Breakthrough.BattleSectorHardPoint.OnRep_CurrentStatus
	// Flags: [Final|Native|Public]
	// Offset: 0x14ecd360
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_CurrentStatus();

	// Object: Function Breakthrough.BattleSectorHardPoint.OnRep_CurrentOwnershipStatus
	// Flags: [Final|Native|Public]
	// Offset: 0x14ecd34c
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_CurrentOwnershipStatus();

	// Object: Function Breakthrough.BattleSectorHardPoint.HardPointStatusHandler
	// Flags: [Final|Native|Public]
	// Offset: 0x14ecd26c
	// Params: [ Num(2) Size(0x9) ]
	void HardPointStatusHandler(struct AActor* Actor, EHardPointStatus Status);

	// Object: Function Breakthrough.BattleSectorHardPoint.HardPointSpaceAudioPlay
	// Flags: [Final|Native|Public]
	// Offset: 0x14ecd1c8
	// Params: [ Num(1) Size(0x4) ]
	void HardPointSpaceAudioPlay(int32_t Type);
};

// Object: Class Breakthrough.BattleSectorTrigger
// Size: 0x3F0 (Inherited: 0x370)
struct ABattleSectorTrigger : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABattleSectorTrigger, "BattleSectorTrigger")

	struct USceneComponent* SceneComponent; // 0x370(0x8)
	struct USplineAreaComponent* SectorSplineAreaComponent; // 0x378(0x8)
	uint8_t Pad_0x380[0x18]; // 0x380(0x18)
	struct TSet<struct TWeakObjectPtr<struct ADFMCharacter>> InnerCharacters; // 0x398(0x50)
	uint8_t Pad_0x3E8[0x8]; // 0x3E8(0x8)

	// Object: Function Breakthrough.BattleSectorTrigger.OnOverlapEnd
	// Flags: [Native|Public]
	// Offset: 0x14ecd6f0
	// Params: [ Num(4) Size(0x1C) ]
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex);

	// Object: Function Breakthrough.BattleSectorTrigger.OnOverlapBegin
	// Flags: [Native|Public|HasOutParms]
	// Offset: 0x14ecd4f0
	// Params: [ Num(6) Size(0xA8) ]
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, uint8_t bFromSweep, const struct FHitResult& SweepResult);
};

// Object: Class Breakthrough.BattleSectorVehicle
// Size: 0x400 (Inherited: 0x370)
struct ABattleSectorVehicle : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABattleSectorVehicle, "BattleSectorVehicle")

	int32_t OwnerCamp; // 0x370(0x4)
	uint8_t Pad_0x374[0x4]; // 0x374(0x4)
	struct USceneComponent* SceneComponent; // 0x378(0x8)
	struct USplineAreaComponent* SectorSplineAreaComponent; // 0x380(0x8)
	uint8_t IsActive : 1; // 0x388(0x1), Mask(0x1)
	uint8_t BitPad_0x388_1 : 7; // 0x388(0x1)
	uint8_t Pad_0x389[0x7]; // 0x389(0x7)
	struct TSet<struct TWeakObjectPtr<struct ADFMCharacter>> InnerCharacters; // 0x390(0x50)
	struct FLinearColor MapMaskID; // 0x3E0(0x10)
	struct TArray<EAnimVehicleType> VehicleTypes; // 0x3F0(0x10)

	// Object: Function Breakthrough.BattleSectorVehicle.OnRep_IsActive
	// Flags: [Final|Native|Public]
	// Offset: 0x107a25bc
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_IsActive();

	// Object: Function Breakthrough.BattleSectorVehicle.OnOverlapEnd
	// Flags: [Native|Public]
	// Offset: 0x14ecdb14
	// Params: [ Num(4) Size(0x1C) ]
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex);

	// Object: Function Breakthrough.BattleSectorVehicle.OnOverlapBegin
	// Flags: [Native|Public|HasOutParms]
	// Offset: 0x14ecd914
	// Params: [ Num(6) Size(0xA8) ]
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, uint8_t bFromSweep, const struct FHitResult& SweepResult);
};

// Object: Class Breakthrough.BattleTransitionExtraSafeArea
// Size: 0x3F0 (Inherited: 0x370)
struct ABattleTransitionExtraSafeArea : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABattleTransitionExtraSafeArea, "BattleTransitionExtraSafeArea")

	struct USceneComponent* SceneComponent; // 0x370(0x8)
	struct USplineAreaComponent* SectorSplineAreaComponent; // 0x378(0x8)
	struct ABattleSectorBase* BindBattleSectorBase; // 0x380(0x8)
	int32_t Camp; // 0x388(0x4)
	float DetectHeight; // 0x38C(0x4)
	uint8_t bIsUsedInAI : 1; // 0x390(0x1), Mask(0x1)
	uint8_t BitPad_0x390_1 : 7; // 0x390(0x1)
	uint8_t Pad_0x391[0x7]; // 0x391(0x7)
	struct TSet<struct TWeakObjectPtr<struct ADFMCharacter>> InnerCharacters; // 0x398(0x50)
	uint8_t bIsActive : 1; // 0x3E8(0x1), Mask(0x1)
	uint8_t BitPad_0x3E8_1 : 7; // 0x3E8(0x1)
	uint8_t Pad_0x3E9[0x7]; // 0x3E9(0x7)

	// Object: Function Breakthrough.BattleTransitionExtraSafeArea.OnSectorTransEnd
	// Flags: [Final|Native|Public]
	// Offset: 0x14ece214
	// Params: [ Num(1) Size(0x4) ]
	void OnSectorTransEnd(int32_t ActiveSector);

	// Object: Function Breakthrough.BattleTransitionExtraSafeArea.OnSectorTransBegin
	// Flags: [Final|Native|Public]
	// Offset: 0x14ece170
	// Params: [ Num(1) Size(0x4) ]
	void OnSectorTransBegin(int32_t ActiveSector);

	// Object: Function Breakthrough.BattleTransitionExtraSafeArea.OnOverlapEnd
	// Flags: [Native|Public]
	// Offset: 0x14ece014
	// Params: [ Num(4) Size(0x1C) ]
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex);

	// Object: Function Breakthrough.BattleTransitionExtraSafeArea.OnOverlapBegin
	// Flags: [Native|Public|HasOutParms]
	// Offset: 0x14ecde14
	// Params: [ Num(6) Size(0xA8) ]
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, uint8_t bFromSweep, const struct FHitResult& SweepResult);

	// Object: Function Breakthrough.BattleTransitionExtraSafeArea.CheckWorldLocationInsideSpline2D
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0x14ecdd58
	// Params: [ Num(2) Size(0xD) ]
	uint8_t CheckWorldLocationInsideSpline2D(const struct FVector& WorldLocation);

	// Object: Function Breakthrough.BattleTransitionExtraSafeArea.CheckPlayerIn
	// Flags: [Final|Native|Public]
	// Offset: 0x14ecdd44
	// Params: [ Num(0) Size(0x0) ]
	void CheckPlayerIn();
};

// Object: Class Breakthrough.BFHudDataCenter
// Size: 0x158 (Inherited: 0x70)
struct UBFHudDataCenter : UGPHudDataCenter
{
	DEFINE_UE_CLASS_HELPERS(UBFHudDataCenter, "BFHudDataCenter")

	struct FBattleFieldBroadcastTipInfo IconStrongBroadcastTipInfo; // 0x70(0x70)
	struct FBattleFieldBroadcastTipInfo OrderItemBroadcastTipInfo; // 0xE0(0x70)
	uint8_t Pad_0x150[0x8]; // 0x150(0x8)
};

// Object: Class Breakthrough.BFMapAndTaskTabViewController
// Size: 0x88 (Inherited: 0x80)
struct UBFMapAndTaskTabViewController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UBFMapAndTaskTabViewController, "BFMapAndTaskTabViewController")

	struct UBFMapAndTaskTabViewFramework* BFMapAndTaskTabViewFramework; // 0x80(0x8)

	// Object: Function Breakthrough.BFMapAndTaskTabViewController.OnGameStateCurStageChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ece3a0
	// Params: [ Num(1) Size(0x4) ]
	void OnGameStateCurStageChanged(int32_t iValue);

	// Object: Function Breakthrough.BFMapAndTaskTabViewController.OnGameHudStateChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ece2fc
	// Params: [ Num(1) Size(0x8) ]
	void OnGameHudStateChanged(struct UHudManager* InHudManager);
};

// Object: Class Breakthrough.BFMapAndTaskTabViewFramework
// Size: 0x470 (Inherited: 0x400)
struct UBFMapAndTaskTabViewFramework : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBFMapAndTaskTabViewFramework, "BFMapAndTaskTabViewFramework")

	struct UDFCommonTabWidget* TabGroupTopBox; // 0x400(0x8)
	struct UDFCommonTabNavigatorBase* CommonTabNavigator; // 0x408(0x8)
	struct FName CommonTabNavigator_HD; // 0x410(0x8)
	struct FName TabGroupTopBoxName_HD; // 0x418(0x8)
	struct FText MapTextContent; // 0x420(0x18)
	struct FText RedeployTextContent; // 0x438(0x18)
	struct FName TabGroupTopBoxName; // 0x450(0x8)
	struct UPaperSprite* MapImageContent; // 0x458(0x8)
	struct UPaperSprite* RedeployImageContent; // 0x460(0x8)
	uint8_t Pad_0x468[0x8]; // 0x468(0x8)

	// Object: Function Breakthrough.BFMapAndTaskTabViewFramework.OnTabIndexChanged
	// Flags: [Final|Native|Public]
	// Offset: 0x14ece4bc
	// Params: [ Num(2) Size(0x8) ]
	void OnTabIndexChanged(int32_t CurTabIndex, int32_t LastTabIndex);

	// Object: Function Breakthrough.BFMapAndTaskTabViewFramework.BP_SetMapOrDeployType
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetMapOrDeployType(int32_t Type);
};

// Object: Class Breakthrough.BFQuestTipHUDViewController
// Size: 0xD0 (Inherited: 0x80)
struct UBFQuestTipHUDViewController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UBFQuestTipHUDViewController, "BFQuestTipHUDViewController")

	uint8_t Pad_0x80[0x18]; // 0x80(0x18)
	struct TArray<struct FBattleFieldQuestObjectiveTipData> CacheObjectiveTipDataArr; // 0x98(0x10)
	struct TArray<struct FBattleFieldQuestObjectiveTipData> CacheLockedObjectiveTipDataArr; // 0xA8(0x10)
	uint8_t Pad_0xB8[0x10]; // 0xB8(0x10)
	struct UBFQuestTipHUDViewFramework* BFQuestTipHUDViewFramework; // 0xC8(0x8)

	// Object: Function Breakthrough.BFQuestTipHUDViewController.UpdateTick
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ece8a4
	// Params: [ Num(0) Size(0x0) ]
	void UpdateTick();

	// Object: Function Breakthrough.BFQuestTipHUDViewController.UpdateQuestProgress
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ece7c4
	// Params: [ Num(2) Size(0x9) ]
	void UpdateQuestProgress(int64_t UpdateQuestId, uint8_t QuestState);

	// Object: Function Breakthrough.BFQuestTipHUDViewController.UpdateQuestObjectiveProgress
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ece670
	// Params: [ Num(4) Size(0x12) ]
	void UpdateQuestObjectiveProgress(int64_t UpdateQuestId, int64_t UpdateObjectiveId, uint8_t ObjectiveState, uint8_t ObjType);

	// Object: Function Breakthrough.BFQuestTipHUDViewController.OnTipLockedStateChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ece5c4
	// Params: [ Num(1) Size(0x1) ]
	void OnTipLockedStateChange(uint8_t bIsLocked);
};

// Object: Class Breakthrough.BFQuestTipHUDViewFramework
// Size: 0x840 (Inherited: 0x400)
struct UBFQuestTipHUDViewFramework : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBFQuestTipHUDViewFramework, "BFQuestTipHUDViewFramework")

	struct UUserWidget* QuestTargetUpdate; // 0x400(0x8)
	struct UUserWidget* WBP_QuestPrompts_New; // 0x408(0x8)
	struct UDFTextBlock* TextBlock_QuestStateText; // 0x410(0x8)
	struct URichTextBlock* TextBlock_QuestName; // 0x418(0x8)
	struct UUserWidget* WBP_CommonItemTemplate; // 0x420(0x8)
	struct UDFImage* Image_AwardIcon; // 0x428(0x8)
	struct UDFSizeBox* SizeBox_NPC_PC; // 0x430(0x8)
	struct UDFImage* NPC_IconImg_Mobile; // 0x438(0x8)
	struct UCanvasPanel* VoicePan_Mobile; // 0x440(0x8)
	struct UDFCanvasPanel* QuestCondition_Panel; // 0x448(0x8)
	struct URichTextBlock* Condition_RichTextBlock_Desc; // 0x450(0x8)
	struct UDFImage* DFImage_306; // 0x458(0x8)
	struct UDFImage* DFImage_3; // 0x460(0x8)
	struct UUserWidget* WBP_TopBarHD_InputSummary; // 0x468(0x8)
	struct UImage* ObjectiveUpdateIconImg; // 0x470(0x8)
	struct URichTextBlock* ObjectiveDescRichText; // 0x478(0x8)
	struct UDFTextBlock* DFTextBlock_Progress; // 0x480(0x8)
	struct UDFProgressBar* DFProgressBar_225; // 0x488(0x8)
	struct UDFTextBlock* DFTextBlock_Time; // 0x490(0x8)
	struct UDFSizeBox* QuestObjectivePromptsPanel; // 0x498(0x8)
	struct UDFScaleBox* CommonItemTemplate_BottomTextBox; // 0x4A0(0x8)
	struct UImage* QuestNullIconPath_Image; // 0x4A8(0x8)
	struct FName QuestTargetUpdateName; // 0x4B0(0x8)
	struct FName QuestPromptsName; // 0x4B8(0x8)
	struct FName WBP_CommonItemTemplate_Name; // 0x4C0(0x8)
	struct FName AwardIconSlotCompName; // 0x4C8(0x8)
	struct FName AwardIconName; // 0x4D0(0x8)
	struct FName TextBlock_QuestStateText_Name; // 0x4D8(0x8)
	struct FName TextBlock_QuestName_Name; // 0x4E0(0x8)
	struct FName SizeBox_NPC_PC_Name; // 0x4E8(0x8)
	struct FName NPC_IconImg_Mobile_Name; // 0x4F0(0x8)
	struct FName VoicePan_Mobile_Name; // 0x4F8(0x8)
	struct FName QuestCondition_Panel_Name; // 0x500(0x8)
	struct FName DFImage_306_Name; // 0x508(0x8)
	struct FName DFImage_3_Name; // 0x510(0x8)
	struct FName WBP_TopBarHD_InputSummary_Name; // 0x518(0x8)
	struct FName ObjectiveUpdateIconImg_Name; // 0x520(0x8)
	struct FName ObjectiveDescRichText_Name; // 0x528(0x8)
	struct FName DFTextBlock_Progress_Name; // 0x530(0x8)
	struct FName DFProgressBar_225_Name; // 0x538(0x8)
	struct FName DFTextBlock_Time_Name; // 0x540(0x8)
	struct FName QuestObjectivePromptsPanel_Name; // 0x548(0x8)
	struct FName CommonItemTemplate_BottomTextBox_Name; // 0x550(0x8)
	struct FName QuestNullIconPath_Image_Name; // 0x558(0x8)
	struct FName QuestPrompts_ConditionBox_Nmae; // 0x560(0x8)
	struct FName Condition_RichTextBlock_Desc_Name; // 0x568(0x8)
	struct FName FailStateTextStyleIdx; // 0x570(0x8)
	struct FName SuccesStateTextStyleIdx; // 0x578(0x8)
	struct FLinearColor DFImage_306_Color0; // 0x580(0x10)
	struct FLinearColor DFImage_306_Color1; // 0x590(0x10)
	struct FLinearColor DFImage_3_Color0; // 0x5A0(0x10)
	struct FLinearColor DFImage_3_Color1; // 0x5B0(0x10)
	float UpdateRate; // 0x5C0(0x4)
	uint8_t bIsOnlyBroadCastComplete : 1; // 0x5C4(0x1), Mask(0x1)
	uint8_t BitPad_0x5C4_1 : 7; // 0x5C4(0x1)
	uint8_t bIsEnableRequiredCountLess : 1; // 0x5C5(0x1), Mask(0x1)
	uint8_t BitPad_0x5C5_1 : 7; // 0x5C5(0x1)
	uint8_t Pad_0x5C6[0x2]; // 0x5C6(0x2)
	float NumberOfOnlyRequiredCountLess; // 0x5C8(0x4)
	uint8_t bIsEnableOnlyToPercentage : 1; // 0x5CC(0x1), Mask(0x1)
	uint8_t BitPad_0x5CC_1 : 7; // 0x5CC(0x1)
	uint8_t Pad_0x5CD[0x3]; // 0x5CD(0x3)
	float PercentageOfOnlyCountTo; // 0x5D0(0x4)
	uint8_t Pad_0x5D4[0x4]; // 0x5D4(0x4)
	struct FText QuestSuccessText; // 0x5D8(0x18)
	struct FText QuestFailText; // 0x5F0(0x18)
	struct FName QuestPromptsAutoInAnima; // 0x608(0x8)
	struct FName QuestPromptsAutoOutAnima; // 0x610(0x8)
	struct FName QuestTargetInAnima; // 0x618(0x8)
	struct FName QuestTargetOutAnima; // 0x620(0x8)
	struct FName QuestTargetCompletedAnima; // 0x628(0x8)
	float ShowTimeOfQuestPrompts; // 0x630(0x4)
	float RefreshTimeOfTime; // 0x634(0x4)
	float ShowTimeOfQuestTarget; // 0x638(0x4)
	float ProgUpdateAnimTime; // 0x63C(0x4)
	float RefreshTimeOfProgDynamicEffect; // 0x640(0x4)
	uint8_t Pad_0x644[0x4]; // 0x644(0x4)
	struct FString Quest_AudioEvtName_Show; // 0x648(0x10)
	struct FString Objection_AudioEvtName_Show; // 0x658(0x10)
	struct FString Objection_AudioEvtName_Completed; // 0x668(0x10)
	struct FString Objection_AudioEvtName_ProgUpdate; // 0x678(0x10)
	uint8_t Pad_0x688[0x28]; // 0x688(0x28)
	uint8_t bCanPlayAnim : 1; // 0x6B0(0x1), Mask(0x1)
	uint8_t BitPad_0x6B0_1 : 7; // 0x6B0(0x1)
	uint8_t bCanPlayQuestTipHD : 1; // 0x6B1(0x1), Mask(0x1)
	uint8_t BitPad_0x6B1_1 : 7; // 0x6B1(0x1)
	uint8_t bCanInterrupt : 1; // 0x6B2(0x1), Mask(0x1)
	uint8_t BitPad_0x6B2_1 : 7; // 0x6B2(0x1)
	uint8_t bTipLocking : 1; // 0x6B3(0x1), Mask(0x1)
	uint8_t BitPad_0x6B3_1 : 7; // 0x6B3(0x1)
	uint8_t Pad_0x6B4[0xC]; // 0x6B4(0xC)
	struct FBattleFieldQuestObjectiveTipData LastShowObjectiveTipData; // 0x6C0(0xC0)
	uint8_t Pad_0x780[0x20]; // 0x780(0x20)
	struct TMap<struct FName, struct UWidgetAnimation*> AnimationsMap_QuestTarget; // 0x7A0(0x50)
	struct TMap<struct FName, struct UWidgetAnimation*> AnimationsMap_QuestPrompts; // 0x7F0(0x50)

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.UpdateText
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x14ecefb4
	// Params: [ Num(4) Size(0x50) ]
	void UpdateText(int32_t TitleType, const struct FText& TitleText, const struct FText& ProgressText, const struct FText& DescText);

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.StartHideQuestPrompts
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ecefa0
	// Params: [ Num(0) Size(0x0) ]
	void StartHideQuestPrompts();

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.QuestTargetStartIn
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eceef4
	// Params: [ Num(1) Size(0x1) ]
	void QuestTargetStartIn(uint8_t bIsIn);

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.QuestTargetOut
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eceee0
	// Params: [ Num(0) Size(0x0) ]
	void QuestTargetOut();

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.QuestObjectiveInterruptHD
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ecee3c
	// Params: [ Num(1) Size(0x1) ]
	void QuestObjectiveInterruptHD(EBattleFieldQuestObjectionState ObjState);

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.QuestObjectiveCountDown
	// Flags: [Final|Native|Protected]
	// Offset: 0x14eced98
	// Params: [ Num(1) Size(0x4) ]
	void QuestObjectiveCountDown(float TimeoutSec);

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.PlayQuestUpdateAnim
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x14eceb24
	// Params: [ Num(6) Size(0x49) ]
	void PlayQuestUpdateAnim(struct FString QuestName, const struct FName& QuestAwardID, struct FString AwardIconPath, EBattleFieldQuestState QuestState, const struct FText& QuestConditionDes, uint8_t bIsOnlyInGameQuest);

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.PlayQuestObjectiveUpdateAnim
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ecea44
	// Params: [ Num(2) Size(0x8) ]
	void PlayQuestObjectiveUpdateAnim(EBattleFieldQuestObjectionState ObjState, int32_t TitleType);

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.PlayProgDynamicEffect
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ecea30
	// Params: [ Num(0) Size(0x0) ]
	void PlayProgDynamicEffect();

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.InformTimerInfo
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ece98c
	// Params: [ Num(1) Size(0x4) ]
	void InformTimerInfo(float TimeoutSec);

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.BP_SetQuestPromptsReadyIDNone
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_SetQuestPromptsReadyIDNone();

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.BP_SetObjectShowType
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetObjectShowType(int32_t Type);

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.BP_SetObjectShowColorType
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetObjectShowColorType(int32_t Type);

	// Object: Function Breakthrough.BFQuestTipHUDViewFramework.ActiveProgTimer
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ece978
	// Params: [ Num(0) Size(0x0) ]
	void ActiveProgTimer();
};

// Object: Class Breakthrough.BFTaskListViewFramework
// Size: 0x558 (Inherited: 0x400)
struct UBFTaskListViewFramework : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBFTaskListViewFramework, "BFTaskListViewFramework")

	struct UDFCommonTabWidget* TaskPanelSubTabGroupTopBox; // 0x400(0x8)
	struct UDFScrollBox* TaskListScrollView; // 0x408(0x8)
	struct UDFNamedSlot* NoAnythingViewSlot; // 0x410(0x8)
	struct UUserWidget* NoAnythingView; // 0x418(0x8)
	struct UDFHDKeyIconBoxTextWidget* WBP_CommonKeyIconBoxText_Close; // 0x420(0x8)
	struct UHDKeyIconBoxWidget* CommonKeyIconBox_Close; // 0x428(0x8)
	struct UDFCommonTabNavigatorBase* WBP_DFTabNavigator; // 0x430(0x8)
	struct UDFButton* Close_Button; // 0x438(0x8)
	struct FName SubTabGroupTopBoxName_HD; // 0x440(0x8)
	struct FName TaskListScrollViewName_HD; // 0x448(0x8)
	struct FName NoAnythingViewSlotName_HD; // 0x450(0x8)
	struct FName CommonKeyIconBox_Close_Name; // 0x458(0x8)
	struct FName WBP_DFTabNavigator_Name; // 0x460(0x8)
	struct FName GamepadDisplayInputActionName_Exit; // 0x468(0x8)
	uint8_t Pad_0x470[0x4]; // 0x470(0x4)
	struct FName SubTabGroupTopBoxName; // 0x474(0x8)
	struct FName TaskListScrollViewName; // 0x47C(0x8)
	struct FName NoAnythingViewSlotName; // 0x484(0x8)
	struct FName Close_Button_BP_Name; // 0x48C(0x8)
	struct FName Close_ButtonName; // 0x494(0x8)
	uint8_t Pad_0x49C[0x4]; // 0x49C(0x4)
	struct UUserWidget* TaskItemClass; // 0x4A0(0x8)
	struct UUserWidget* TaskObjectionItemClass; // 0x4A8(0x8)
	struct UUserWidget* NoAnythingClass; // 0x4B0(0x8)
	struct FText NoAnythingText; // 0x4B8(0x18)
	struct FName RichTextBlock_NoAnythingName; // 0x4D0(0x8)
	uint8_t SwitchToClearTaskHover : 1; // 0x4D8(0x1), Mask(0x1)
	uint8_t BitPad_0x4D8_1 : 7; // 0x4D8(0x1)
	uint8_t Pad_0x4D9[0x7]; // 0x4D9(0x7)
	struct TArray<struct UBreakthroughTaskItemView*> AvailableTaskItemViewList; // 0x4E0(0x10)
	struct TArray<struct UBreakthroughTaskItemView*> UsingTaskItemViewList; // 0x4F0(0x10)
	int32_t PreCreateTaskItemViewNum; // 0x500(0x4)
	uint8_t Pad_0x504[0x4]; // 0x504(0x4)
	struct TArray<struct UBreakthroughObjectionItemView*> AvailableObjectionItemViewList; // 0x508(0x10)
	struct TArray<struct UBreakthroughObjectionItemView*> UsingObjectionItemViewList; // 0x518(0x10)
	int32_t PreCreateObjectionItemViewNum; // 0x528(0x4)
	uint8_t Pad_0x52C[0x4]; // 0x52C(0x4)
	struct TArray<struct FBattleFieldQuest> CurQuestList; // 0x530(0x10)
	struct TArray<struct UBreakthroughTaskItemView*> TaskItemViewArray; // 0x540(0x10)
	uint8_t bPreCreateWidgets : 1; // 0x550(0x1), Mask(0x1)
	uint8_t BitPad_0x550_1 : 7; // 0x550(0x1)
	uint8_t Pad_0x551[0x7]; // 0x551(0x7)

	// Object: Function Breakthrough.BFTaskListViewFramework.RebuildQuestItems
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x14ed1850
	// Params: [ Num(1) Size(0x10) ]
	void RebuildQuestItems(const struct TArray<struct FBattleFieldQuest>& NewQuestList);

	// Object: Function Breakthrough.BFTaskListViewFramework.ProcessQuestItems
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed1818
	// Params: [ Num(1) Size(0x1) ]
	uint8_t ProcessQuestItems();

	// Object: Function Breakthrough.BFTaskListViewFramework.OnTaskListViewUpdate
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed1804
	// Params: [ Num(0) Size(0x0) ]
	void OnTaskListViewUpdate();

	// Object: Function Breakthrough.BFTaskListViewFramework.OnTaskListScrollEnd
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed17f0
	// Params: [ Num(0) Size(0x0) ]
	void OnTaskListScrollEnd();

	// Object: Function Breakthrough.BFTaskListViewFramework.OnTabIndexChanged
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed1714
	// Params: [ Num(2) Size(0x8) ]
	void OnTabIndexChanged(int32_t CurTabIndex, int32_t LastTabIndex);

	// Object: Function Breakthrough.BFTaskListViewFramework.OnGameHudStateChanged
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed1670
	// Params: [ Num(1) Size(0x8) ]
	void OnGameHudStateChanged(struct UHudManager* InHudManager);

	// Object: Function Breakthrough.BFTaskListViewFramework.OnCloseBtnClickedWrap
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed15c4
	// Params: [ Num(1) Size(0x1) ]
	void OnCloseBtnClickedWrap(uint8_t bArg);

	// Object: Function Breakthrough.BFTaskListViewFramework.OnCloseBtnClicked
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed15b0
	// Params: [ Num(0) Size(0x0) ]
	void OnCloseBtnClicked();

	// Object: Function Breakthrough.BFTaskListViewFramework.IsQuestNeedRebuild
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x14ed1200
	// Params: [ Num(4) Size(0x179) ]
	uint8_t IsQuestNeedRebuild(const struct FBattleFieldQuest& NewQuest, const struct FBattleFieldQuest& CurQuest, struct UBreakthroughTaskItemView* TaskItemView);

	// Object: Function Breakthrough.BFTaskListViewFramework.IsQuestItemsNeedRebuild
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x14ed1138
	// Params: [ Num(2) Size(0x11) ]
	uint8_t IsQuestItemsNeedRebuild(const struct TArray<struct FBattleFieldQuest>& NewQuestList);

	// Object: Function Breakthrough.BFTaskListViewFramework.ClearQuestItems
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed1124
	// Params: [ Num(0) Size(0x0) ]
	void ClearQuestItems();

	// Object: Function Breakthrough.BFTaskListViewFramework.BP_SetMapOrDeployType
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetMapOrDeployType(int32_t Type);
};

// Object: Class Breakthrough.BigEventTriggerInterface
// Size: 0x28 (Inherited: 0x28)
struct IBigEventTriggerInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(IBigEventTriggerInterface, "BigEventTriggerInterface")
};

// Object: Class Breakthrough.BigMapBattleMainKey
// Size: 0x320 (Inherited: 0x2F8)
struct UBigMapBattleMainKey : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UBigMapBattleMainKey, "BigMapBattleMainKey")

	struct UHDKeyIconBoxWidget* KeyIcon_Close; // 0x2F8(0x8)
	struct UHDKeyIconBoxWidget* KeyIcon_ReleaseRankSkill; // 0x300(0x8)
	struct FName KeyIcon_ReleaseRankSkillName; // 0x308(0x8)
	struct FName KeyIcon_BattleClassName; // 0x310(0x8)
	uint8_t bCanHDScaleMap : 1; // 0x318(0x1), Mask(0x1)
	uint8_t BitPad_0x318_1 : 7; // 0x318(0x1)
	uint8_t Pad_0x319[0x7]; // 0x319(0x7)

	// Object: Function Breakthrough.BigMapBattleMainKey.BP_InitWidget
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_InitWidget();
};

// Object: Class Breakthrough.BreakthroughMapAutoScaleConfigManager
// Size: 0x40 (Inherited: 0x30)
struct UBreakthroughMapAutoScaleConfigManager : UDataTableSystemManagerBase
{
	DEFINE_UE_CLASS_HELPERS(UBreakthroughMapAutoScaleConfigManager, "BreakthroughMapAutoScaleConfigManager")

	uint8_t Pad_0x30[0x10]; // 0x30(0x10)
};

// Object: Class Breakthrough.BlockWall
// Size: 0x380 (Inherited: 0x380)
struct ABlockWall : AStaticMeshActor
{
	DEFINE_UE_CLASS_HELPERS(ABlockWall, "BlockWall")

	uint8_t bActivateBlock : 1; // 0x37A(0x1), Mask(0x1)

	// Object: Function Breakthrough.BlockWall.OnArenaRoundStateChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed1b34
	// Params: [ Num(0) Size(0x0) ]
	void OnArenaRoundStateChange();

	// Object: Function Breakthrough.BlockWall.HandleOnBlockWallsActivate
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed1a88
	// Params: [ Num(1) Size(0x1) ]
	void HandleOnBlockWallsActivate(uint8_t bActivate);
};

// Object: Class Breakthrough.BreakThroughAISubsystem
// Size: 0xE20 (Inherited: 0xB78)
struct ABreakThroughAISubsystem : APVPAISubsystem
{
	DEFINE_UE_CLASS_HELPERS(ABreakThroughAISubsystem, "BreakThroughAISubsystem")

	float CaptureFlagGameModeFlankDistance; // 0xB78(0x4)
	float CaptureFlagGameModeAiRefreshJobTime; // 0xB7C(0x4)
	float CaptureFlagGameModeAiRefreshJobTimeDev; // 0xB80(0x4)
	uint8_t bTransferBotOnStageBegin : 1; // 0xB84(0x1), Mask(0x1)
	uint8_t BitPad_0xB84_1 : 7; // 0xB84(0x1)
	uint8_t Pad_0xB85[0xB]; // 0xB85(0xB)
	struct TSet<struct ADFMCharacter*> BeingRescued; // 0xB90(0x50)
	uint8_t bIsRetreating : 1; // 0xBE0(0x1), Mask(0x1)
	uint8_t BitPad_0xBE0_1 : 7; // 0xBE0(0x1)
	uint8_t Pad_0xBE1[0x2F]; // 0xBE1(0x2F)
	struct TMap<struct ABattleSectorAnchor*, struct FObjectiveSectorInfoForAi> CacheSectorInfo; // 0xC10(0x50)
	uint8_t Pad_0xC60[0x100]; // 0xC60(0x100)
	struct FTargetJobAnchorAiCollectInfo JobAnchorCollectInfo; // 0xD60(0x50)
	uint8_t Pad_0xDB0[0x70]; // 0xDB0(0x70)

	// Object: Function Breakthrough.BreakThroughAISubsystem.SpawnTestBot
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x14ed44fc
	// Params: [ Num(5) Size(0x28) ]
	struct ADFMCharacter* SpawnTestBot(int32_t Camp, int32_t ArmdedForce, struct FName TemplateName, struct FVector SpawnPos);

	// Object: Function Breakthrough.BreakThroughAISubsystem.ShouldRefreshJobTargetInverval_CaptureFlagMode
	// Flags: [Native|Event|Public|HasOutParms|BlueprintEvent]
	// Offset: 0x14ed4388
	// Params: [ Num(5) Size(0x49) ]
	uint8_t ShouldRefreshJobTargetInverval_CaptureFlagMode(struct ADFMAIPlayerController* Controller, struct ABattleFlagAnchor* FlagAnchor, struct ABattleFlag* BattleFlag, const struct FJobDetailInfoForCaptureFlag& LastJobInfo);

	// Object: Function Breakthrough.BreakThroughAISubsystem.ShouldRefreshJobDetailInverval_CaptureFlagMode
	// Flags: [Native|Event|Public|HasOutParms|BlueprintEvent]
	// Offset: 0x14ed4214
	// Params: [ Num(5) Size(0x49) ]
	uint8_t ShouldRefreshJobDetailInverval_CaptureFlagMode(struct ADFMAIPlayerController* Controller, struct ABattleFlagAnchor* FlagAnchor, struct ABattleFlag* BattleFlag, const struct FJobDetailInfoForCaptureFlag& LastJobInfo);

	// Object: Function Breakthrough.BreakThroughAISubsystem.SelectJobType
	// Flags: [Native|Event|Public|BlueprintEvent]
	// Offset: 0x14ed40ec
	// Params: [ Num(4) Size(0x15) ]
	EPVPAIJobType SelectJobType(struct ADFMAIPlayerController* Controller, struct ABattleSectorAnchor* Sector, int32_t NumCharacterInSector);

	// Object: Function Breakthrough.BreakThroughAISubsystem.SelectJobFlankPoint_CaptureFlagMode
	// Flags: [Native|Event|Public|HasOutParms|BlueprintEvent]
	// Offset: 0x14ed3f70
	// Params: [ Num(5) Size(0x30) ]
	struct ABattleRoutePoint* SelectJobFlankPoint_CaptureFlagMode(struct ADFMAIPlayerController* Controller, struct ABattleFlagAnchor* FlagAnchor, struct ABattleFlag* BattleFlag, const struct TArray<struct ABattleRoutePoint*>& FlankPoints);

	// Object: Function Breakthrough.BreakThroughAISubsystem.SelectJobAnchorTarget_CaptureFlagMode
	// Flags: [Native|Event|Public|HasOutParms|BlueprintEvent]
	// Offset: 0x14ed3e68
	// Params: [ Num(3) Size(0x20) ]
	struct ABattleFlagAnchor* SelectJobAnchorTarget_CaptureFlagMode(struct ADFMAIPlayerController* Controller, const struct TArray<struct ABattleFlagAnchor*>& BattleFlagAnchors);

	// Object: Function Breakthrough.BreakThroughAISubsystem.ResetCampStyle
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ed3d88
	// Params: [ Num(2) Size(0xC) ]
	void ResetCampStyle(ECampType Camp, struct FName PoolName);

	// Object: Function Breakthrough.BreakThroughAISubsystem.ResetCampDifficluty
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ed3ca8
	// Params: [ Num(2) Size(0xC) ]
	void ResetCampDifficluty(ECampType Camp, struct FName PoolName);

	// Object: Function Breakthrough.BreakThroughAISubsystem.OnSectorStageEnd
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed3c04
	// Params: [ Num(1) Size(0x4) ]
	void OnSectorStageEnd(int32_t Index);

	// Object: Function Breakthrough.BreakThroughAISubsystem.OnSectorStageBegin
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed3b60
	// Params: [ Num(1) Size(0x4) ]
	void OnSectorStageBegin(int32_t Index);

	// Object: Function Breakthrough.BreakThroughAISubsystem.OnSectorOccupied
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed3a80
	// Params: [ Num(2) Size(0x10) ]
	void OnSectorOccupied(int32_t BroadVal, struct ABattleSectorAnchor* Sector);

	// Object: Function Breakthrough.BreakThroughAISubsystem.OnSectorAnchorInfoChange
	// Flags: [Native|Event|Public|BlueprintEvent]
	// Offset: 0x14ed39d4
	// Params: [ Num(1) Size(0x8) ]
	void OnSectorAnchorInfoChange(struct ABattleSectorAnchor* SectorAnchor);

	// Object: Function Breakthrough.BreakThroughAISubsystem.OnSectorAnchorFlagChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed3930
	// Params: [ Num(1) Size(0x8) ]
	void OnSectorAnchorFlagChange(struct AActor* SectorAnchor);

	// Object: Function Breakthrough.BreakThroughAISubsystem.OnNewJobAssigned
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ed3818
	// Params: [ Num(3) Size(0x18) ]
	void OnNewJobAssigned(struct ADFMAIPlayerController* Controller, struct AActor* DestAnchor, struct UPVPAIJobs* Job);

	// Object: Function Breakthrough.BreakThroughAISubsystem.OnMoveToJobDone
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed3774
	// Params: [ Num(1) Size(0x8) ]
	void OnMoveToJobDone(struct UPVPAIJobs* Job);

	// Object: Function Breakthrough.BreakThroughAISubsystem.OnHardPointOwnerChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed3694
	// Params: [ Num(2) Size(0x9) ]
	void OnHardPointOwnerChange(struct AActor* Anchor, EHardPointOwnershipStatus Status);

	// Object: Function Breakthrough.BreakThroughAISubsystem.OnHardPointChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed35b4
	// Params: [ Num(2) Size(0x9) ]
	void OnHardPointChange(struct AActor* Anchor, EHardPointStatus Status);

	// Object: Function Breakthrough.BreakThroughAISubsystem.OnCurStageChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed3510
	// Params: [ Num(1) Size(0x4) ]
	void OnCurStageChange(int32_t CurStage);

	// Object: Function Breakthrough.BreakThroughAISubsystem.OnBattleFlagStateChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed3430
	// Params: [ Num(2) Size(0x9) ]
	void OnBattleFlagStateChange(struct AActor* Flag, uint8_t State);

	// Object: Function Breakthrough.BreakThroughAISubsystem.OnBattleFieldBigEventStageChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed3350
	// Params: [ Num(2) Size(0x10) ]
	void OnBattleFieldBigEventStageChanged(int32_t InCurStage, struct AActor* InAnchor);

	// Object: Function Breakthrough.BreakThroughAISubsystem.MarkActor
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ed325c
	// Params: [ Num(3) Size(0xA) ]
	uint8_t MarkActor(struct AActor* Actor, uint8_t OnlyCheck);

	// Object: Function Breakthrough.BreakThroughAISubsystem.IsRetreating
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x14ed3240
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsRetreating();

	// Object: Function Breakthrough.BreakThroughAISubsystem.IsPositionInForbiddenArea
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x14ed3190
	// Params: [ Num(2) Size(0xD) ]
	uint8_t IsPositionInForbiddenArea(struct FVector Position);

	// Object: Function Breakthrough.BreakThroughAISubsystem.IsInsideValidSectorTest
	// Flags: [Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x14ed3098
	// Params: [ Num(3) Size(0x11) ]
	uint8_t IsInsideValidSectorTest(int32_t Camp, const struct FVector& Location);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GiveJobAnchorTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ed2fb0
	// Params: [ Num(3) Size(0x11) ]
	uint8_t GiveJobAnchorTarget(struct ADFMAIPlayerController* Controller, struct AActor* TargetSectorAnchor);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GetSectorScore
	// Flags: [Native|Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x14ed2ec4
	// Params: [ Num(3) Size(0x14) ]
	float GetSectorScore(struct ADFMAIPlayerController* Controller, struct ABattleSectorAnchor* Sector);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GetSectorAnchorFlagState
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ed2e18
	// Params: [ Num(2) Size(0x9) ]
	ESectorAnchorFlagState GetSectorAnchorFlagState(struct ABattleSectorAnchor* Sector);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GetRandomSectorPoint
	// Flags: [Native|Event|Protected|BlueprintEvent]
	// Offset: 0x14ed2d64
	// Params: [ Num(2) Size(0x10) ]
	struct ABattleSectorAnchor* GetRandomSectorPoint(struct ADFMAIPlayerController* Controller);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GetJobAnchorAssignControllerNum
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ed2cb8
	// Params: [ Num(2) Size(0xC) ]
	int32_t GetJobAnchorAssignControllerNum(struct AActor* JobAnchor);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GetCurrJobTargetCaptureFlagAnchor
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ed2c0c
	// Params: [ Num(2) Size(0x10) ]
	struct ABattleFlagAnchor* GetCurrJobTargetCaptureFlagAnchor(struct ADFMAIPlayerController* Controller);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GetCurrJobTargetCaptureFlag
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ed2b60
	// Params: [ Num(2) Size(0x10) ]
	struct ABattleFlag* GetCurrJobTargetCaptureFlag(struct ADFMAIPlayerController* Controller);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GetCharacterInSector
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x14ed28d4
	// Params: [ Num(7) Size(0x38) ]
	void GetCharacterInSector(struct ABattleSectorAnchor* Sector, int32_t& AttackCount, int32_t& AttackBotCount, struct TArray<struct ADFMCharacter*>& AttackBots, int32_t& DefendCount, int32_t& DefendBotCount, struct TArray<struct ADFMCharacter*>& DefendBots);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GetCaptureFlagModeFlagInfo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ed2820
	// Params: [ Num(2) Size(0x28) ]
	struct FCaptureFlagModeFlagInfo GetCaptureFlagModeFlagInfo(struct ADFMAIPlayerController* Controller);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GetCaptureBattleFlagAiPlayerNum
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ed274c
	// Params: [ Num(2) Size(0xC) ]
	int32_t GetCaptureBattleFlagAiPlayerNum(struct AActor* Actor);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GetCacheSectorInfoForAi
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x14ed2594
	// Params: [ Num(4) Size(0xA2) ]
	uint8_t GetCacheSectorInfoForAi(struct ABattleSectorAnchor* Sector, struct FObjectiveSectorInfoForAi& Info, uint8_t ForceRefresh);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GetBreakThroughAISubsystem
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x14ed24f0
	// Params: [ Num(2) Size(0x10) ]
	static struct ABreakThroughAISubsystem* GetBreakThroughAISubsystem(struct UObject* ObjectContext);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GetActiveSectors
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0x14ed2410
	// Params: [ Num(2) Size(0x18) ]
	struct TArray<struct ABattleSectorBase*> GetActiveSectors(ECampType Camp);

	// Object: Function Breakthrough.BreakThroughAISubsystem.GetActiveSectorAnchors
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0x14ed2330
	// Params: [ Num(2) Size(0x18) ]
	struct TArray<struct ABattleSectorAnchor*> GetActiveSectorAnchors(ECampType Camp);

	// Object: Function Breakthrough.BreakThroughAISubsystem.CalcCampJobWeight
	// Flags: [Native|Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x14ed2244
	// Params: [ Num(3) Size(0x14) ]
	float CalcCampJobWeight(struct ADFMAIPlayerController* Controller, struct ABattleSectorAnchor* Sector);

	// Object: Function Breakthrough.BreakThroughAISubsystem.AssignJobDetail
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ed2104
	// Params: [ Num(4) Size(0xB) ]
	uint8_t AssignJobDetail(struct ADFMAIPlayerController* Controller, uint8_t AssignNewTarget, uint8_t DelayAssign);

	// Object: Function Breakthrough.BreakThroughAISubsystem.AssignJobAnchorTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x14ed2010
	// Params: [ Num(3) Size(0xA) ]
	uint8_t AssignJobAnchorTarget(struct ADFMAIPlayerController* Controller, uint8_t AssignDetail);
};

// Object: Class Breakthrough.BreakthroughAnchorMassMarkerWidget
// Size: 0xB88 (Inherited: 0x848)
struct UBreakthroughAnchorMassMarkerWidget : UDFMassMarkerBaseWidget
{
	DEFINE_UE_CLASS_HELPERS(UBreakthroughAnchorMassMarkerWidget, "BreakthroughAnchorMassMarkerWidget")

	uint8_t Pad_0x848[0x8]; // 0x848(0x8)
	struct UBreakthroughSectorAnchorMarkerItem* BreakthroughSectorAnchorMarkerItem; // 0x850(0x8)
	struct ABattleSectorAnchor* OwnerSectorAnchor; // 0x858(0x8)
	struct FString MarkVO_Neutral; // 0x860(0x10)
	struct FString MarkVO_Friend; // 0x870(0x10)
	struct FString MarkVO_Enemy; // 0x880(0x10)
	uint8_t Pad_0x890[0x18]; // 0x890(0x18)
	float TotalMoveTime; // 0x8A8(0x4)
	struct FVector2D BeginPosition; // 0x8AC(0x8)
	uint8_t Pad_0x8B4[0x94]; // 0x8B4(0x94)
	struct UBreakthroughSectorAnchorProgress* SectorOccupypoint; // 0x948(0x8)
	struct UScreenMarkerRipple* MarkerRipple; // 0x950(0x8)
	struct UTextBlock* AnchorStateText; // 0x958(0x8)
	struct UDFRadialImage* LeftRadialImage; // 0x960(0x8)
	struct UDFRadialImage* RightRadialImage; // 0x968(0x8)
	uint8_t Pad_0x970[0x8]; // 0x970(0x8)
	struct UWidgetAnimation* MarkerInAnim; // 0x978(0x8)
	struct UWidgetAnimation* MarkerOutAnim; // 0x980(0x8)
	struct UWidgetAnimation* DistTextInAnim; // 0x988(0x8)
	struct UWidgetAnimation* DistTextOutAnim; // 0x990(0x8)
	struct UWidgetAnimation* CaptureInAnim; // 0x998(0x8)
	struct UWidgetAnimation* CaptureOutAnim; // 0x9A0(0x8)
	struct TArray<struct FText> OffenceAnchorStateTextArr; // 0x9A8(0x10)
	struct TArray<struct FText> DefenceAnchorStateTextArr; // 0x9B8(0x10)
	struct FText BigEventAnchorStateText; // 0x9C8(0x18)
	struct FText LockedAnchorStateText; // 0x9E0(0x18)
	struct FName CampFriendlyType; // 0x9F8(0x8)
	struct FLinearColor CampFriendlyBarColor; // 0xA00(0x10)
	struct FName CampEnemyType; // 0xA10(0x8)
	struct FLinearColor CampEnemyBarColor; // 0xA18(0x10)
	EaseType MarkerEaseType; // 0xA28(0x1)
	uint8_t Pad_0xA29[0x3]; // 0xA29(0x3)
	struct FVector2D OrignalScaleMobile; // 0xA2C(0x8)
	struct FVector2D OrignalScaleHD; // 0xA34(0x8)
	struct FVector2D OneAnchorStartViewScale; // 0xA3C(0x8)
	uint8_t Pad_0xA44[0x4]; // 0xA44(0x4)
	struct TArray<struct FVector2D> TwoAnchorStartViewScale; // 0xA48(0x10)
	struct TArray<struct FVector2D> ThreeAnchorStartViewScale; // 0xA58(0x10)
	struct FVector2D OneAnchorStartViewScaleHD; // 0xA68(0x8)
	struct TArray<struct FVector2D> TwoAnchorStartViewScaleHD; // 0xA70(0x10)
	struct TArray<struct FVector2D> ThreeAnchorStartViewScaleHD; // 0xA80(0x10)
	struct FVector2D HighValueOneAnchorStartViewScale; // 0xA90(0x8)
	struct TArray<struct FVector2D> HighValueTwoAnchorStartViewScale; // 0xA98(0x10)
	struct TArray<struct FVector2D> HighValueThreeAnchorStartViewScale; // 0xAA8(0x10)
	struct FVector2D HighValueOneAnchorStartViewScaleHD; // 0xAB8(0x8)
	struct TArray<struct FVector2D> HighValueTwoAnchorStartViewScaleHD; // 0xAC0(0x10)
	struct TArray<struct FVector2D> HighValueThreeAnchorStartViewScaleHD; // 0xAD0(0x10)
	struct FSectorAnchorMarkerUpdateConfig SectorAnchorMarkerRuleConfigMap; // 0xAE0(0x38)
	struct FSectorAnchorMarkerUpdateConfig SectorAnchorMarkerRuleConfigMapMarking; // 0xB18(0x38)
	struct FSectorAnchorMarkerUpdateConfig HighValueSectorAnchorMarkerRuleConfigMapMarking; // 0xB50(0x38)

	// Object: Function Breakthrough.BreakthroughAnchorMassMarkerWidget.UpdateDropAnim
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7710
	// Params: [ Num(1) Size(0x4) ]
	void UpdateDropAnim(float DeltaTime);

	// Object: Function Breakthrough.BreakthroughAnchorMassMarkerWidget.ShowMarkerUnderTips
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed76fc
	// Params: [ Num(0) Size(0x0) ]
	void ShowMarkerUnderTips();

	// Object: Function Breakthrough.BreakthroughAnchorMassMarkerWidget.SetOccupyNumText
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x14ed7584
	// Params: [ Num(4) Size(0x18) ]
	void SetOccupyNumText(struct UDFTextBlock* InRichTextBlock, const struct FName& InTextType, int32_t InOccupyNum, int32_t& LastOccupyNum);

	// Object: Function Breakthrough.BreakthroughAnchorMassMarkerWidget.PlayMarkerAnim
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7570
	// Params: [ Num(0) Size(0x0) ]
	void PlayMarkerAnim();

	// Object: Function Breakthrough.BreakthroughAnchorMassMarkerWidget.OnTipsInfoNtf
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x14ed73f8
	// Params: [ Num(1) Size(0x70) ]
	void OnTipsInfoNtf(const struct FBattleFieldBroadcastTipInfo& InTipInfo);

	// Object: Function Breakthrough.BreakthroughAnchorMassMarkerWidget.OnClientNotifyCounting
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7354
	// Params: [ Num(1) Size(0x4) ]
	void OnClientNotifyCounting(float InCountingTime);

	// Object: Function Breakthrough.BreakthroughAnchorMassMarkerWidget.OnBreakthroughBroadcastShowMarkerTimerHandleEnd
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7340
	// Params: [ Num(0) Size(0x0) ]
	void OnBreakthroughBroadcastShowMarkerTimerHandleEnd();

	// Object: Function Breakthrough.BreakthroughAnchorMassMarkerWidget.OnBreakthroughBroadcastShowMarker
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x14ed71f4
	// Params: [ Num(3) Size(0x1C) ]
	void OnBreakthroughBroadcastShowMarker(const EBreakthroughBroadcastMarkerType& BreakthroughBroadcastMarkerType, const struct TArray<struct AActor*>& MarkedItems, float ShowTime);

	// Object: Function Breakthrough.BreakthroughAnchorMassMarkerWidget.BP_PlayMarkerAnim
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_PlayMarkerAnim(int32_t InOwnerCamp);
};

// Object: Class Breakthrough.BreakthroughAudioPlayerComponent
// Size: 0x440 (Inherited: 0x440)
struct UBreakthroughAudioPlayerComponent : UBattleFieldAudioPlayerComponent
{
	DEFINE_UE_CLASS_HELPERS(UBreakthroughAudioPlayerComponent, "BreakthroughAudioPlayerComponent")
};

// Object: Class Breakthrough.BreakthroughBattleClassAdvice
// Size: 0x528 (Inherited: 0x460)
struct UBreakthroughBattleClassAdvice : UDFMBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBreakthroughBattleClassAdvice, "BreakthroughBattleClassAdvice")

	struct FName CommonPopWindowWidgetName; // 0x460(0x8)
	struct FName CountWidgetName; // 0x468(0x8)
	struct TArray<struct FName> CountItemWidgetNames; // 0x470(0x10)
	struct FName ConfirmButtonWidgetName; // 0x480(0x8)
	struct FName ResetButtonWidgetName; // 0x488(0x8)
	struct FName DisplayInputActionName_A; // 0x490(0x8)
	struct FName DisplayInputActionName_X; // 0x498(0x8)
	struct FName DisplayInputActionName_B; // 0x4A0(0x8)
	struct FName DisplayInputActionName_Left; // 0x4A8(0x8)
	struct FName DisplayInputActionName_Right; // 0x4B0(0x8)
	struct TArray<struct UDFCommonAddDecSlider*> DragWidgets; // 0x4B8(0x10)
	struct UDFCommonButton* ConfirmButtonWidget; // 0x4C8(0x8)
	struct UDFCommonButton* ResetButtonWidget; // 0x4D0(0x8)
	struct UDFRichTextBlock* CountWidget; // 0x4D8(0x8)
	struct TArray<struct UDFTextBlock*> CountItemWidget; // 0x4E0(0x10)
	struct UDFCommonPopWindow* CommonPopWindowWidget; // 0x4F0(0x8)
	struct UGPUINavigationGroup* NavGroup; // 0x4F8(0x8)
	uint8_t Pad_0x500[0x28]; // 0x500(0x28)

	// Object: Function Breakthrough.BreakthroughBattleClassAdvice.ResetAdviceWrap
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7da8
	// Params: [ Num(1) Size(0x1) ]
	void ResetAdviceWrap(uint8_t Arg);

	// Object: Function Breakthrough.BreakthroughBattleClassAdvice.ResetAdvice
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7d94
	// Params: [ Num(0) Size(0x0) ]
	void ResetAdvice();

	// Object: Function Breakthrough.BreakthroughBattleClassAdvice.OnDragSniper
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7cb8
	// Params: [ Num(2) Size(0x8) ]
	void OnDragSniper(int32_t InCurNum, int32_t InChangeNum);

	// Object: Function Breakthrough.BreakthroughBattleClassAdvice.OnDragMedic
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7bdc
	// Params: [ Num(2) Size(0x8) ]
	void OnDragMedic(int32_t InCurNum, int32_t InChangeNum);

	// Object: Function Breakthrough.BreakthroughBattleClassAdvice.OnDragGunnner
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7b00
	// Params: [ Num(2) Size(0x8) ]
	void OnDragGunnner(int32_t InCurNum, int32_t InChangeNum);

	// Object: Function Breakthrough.BreakthroughBattleClassAdvice.OnDragCQB
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7a24
	// Params: [ Num(2) Size(0x8) ]
	void OnDragCQB(int32_t InCurNum, int32_t InChangeNum);

	// Object: Function Breakthrough.BreakthroughBattleClassAdvice.OnDragBox
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7948
	// Params: [ Num(2) Size(0x8) ]
	void OnDragBox(int32_t Index, int32_t Count);

	// Object: Function Breakthrough.BreakthroughBattleClassAdvice.OnAdvicePublicWrap
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed789c
	// Params: [ Num(1) Size(0x1) ]
	void OnAdvicePublicWrap(uint8_t Arg);

	// Object: Function Breakthrough.BreakthroughBattleClassAdvice.OnAdvicePublic
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7888
	// Params: [ Num(0) Size(0x0) ]
	void OnAdvicePublic();

	// Object: Function Breakthrough.BreakthroughBattleClassAdvice.CloseSelfWrap
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed77dc
	// Params: [ Num(1) Size(0x1) ]
	void CloseSelfWrap(uint8_t Arg);

	// Object: Function Breakthrough.BreakthroughBattleClassAdvice.CloseSelf
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed77c8
	// Params: [ Num(0) Size(0x0) ]
	void CloseSelf();
};

// Object: Class Breakthrough.BreakthroughBattleClassAdviceView
// Size: 0x4C8 (Inherited: 0x400)
struct UBreakthroughBattleClassAdviceView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBreakthroughBattleClassAdviceView, "BreakthroughBattleClassAdviceView")

	struct FName CommonPopWindowWidgetName; // 0x3FC(0x8)
	struct FName CountWidgetName; // 0x404(0x8)
	struct TArray<struct FName> CountItemWidgetNames; // 0x410(0x10)
	struct FName ConfirmButtonWidgetName; // 0x420(0x8)
	struct FName ResetButtonWidgetName; // 0x428(0x8)
	struct FName DisplayInputActionName_A; // 0x430(0x8)
	struct FName DisplayInputActionName_X; // 0x438(0x8)
	struct FName DisplayInputActionName_B; // 0x440(0x8)
	struct FName DisplayInputActionName_Left; // 0x448(0x8)
	struct FName DisplayInputActionName_Right; // 0x450(0x8)
	struct TArray<struct UDFCommonAddDecSlider*> DragWidgets; // 0x458(0x10)
	struct UDFCommonButton* ConfirmButtonWidget; // 0x468(0x8)
	struct UDFCommonButton* ResetButtonWidget; // 0x470(0x8)
	struct UDFRichTextBlock* CountWidget; // 0x478(0x8)
	struct TArray<struct UDFTextBlock*> CountItemWidget; // 0x480(0x10)
	struct UDFCommonPopWindow* CommonPopWindowWidget; // 0x490(0x8)
	struct UGPUINavigationGroup* NavGroup; // 0x498(0x8)
	uint8_t Pad_0x4A0[0x28]; // 0x4A0(0x28)

	// Object: Function Breakthrough.BreakthroughBattleClassAdviceView.ResetAdviceWrap
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed8460
	// Params: [ Num(1) Size(0x1) ]
	void ResetAdviceWrap(uint8_t Arg);

	// Object: Function Breakthrough.BreakthroughBattleClassAdviceView.ResetAdvice
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed844c
	// Params: [ Num(0) Size(0x0) ]
	void ResetAdvice();

	// Object: Function Breakthrough.BreakthroughBattleClassAdviceView.OnDragSniper
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed8370
	// Params: [ Num(2) Size(0x8) ]
	void OnDragSniper(int32_t InCurNum, int32_t InChangeNum);

	// Object: Function Breakthrough.BreakthroughBattleClassAdviceView.OnDragMedic
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed8294
	// Params: [ Num(2) Size(0x8) ]
	void OnDragMedic(int32_t InCurNum, int32_t InChangeNum);

	// Object: Function Breakthrough.BreakthroughBattleClassAdviceView.OnDragGunnner
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed81b8
	// Params: [ Num(2) Size(0x8) ]
	void OnDragGunnner(int32_t InCurNum, int32_t InChangeNum);

	// Object: Function Breakthrough.BreakthroughBattleClassAdviceView.OnDragCQB
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed80dc
	// Params: [ Num(2) Size(0x8) ]
	void OnDragCQB(int32_t InCurNum, int32_t InChangeNum);

	// Object: Function Breakthrough.BreakthroughBattleClassAdviceView.OnDragBox
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed8000
	// Params: [ Num(2) Size(0x8) ]
	void OnDragBox(int32_t Index, int32_t Count);

	// Object: Function Breakthrough.BreakthroughBattleClassAdviceView.OnAdvicePublicWrap
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7f54
	// Params: [ Num(1) Size(0x1) ]
	void OnAdvicePublicWrap(uint8_t Arg);

	// Object: Function Breakthrough.BreakthroughBattleClassAdviceView.OnAdvicePublic
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7f40
	// Params: [ Num(0) Size(0x0) ]
	void OnAdvicePublic();

	// Object: Function Breakthrough.BreakthroughBattleClassAdviceView.CloseSelfWrap
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7e94
	// Params: [ Num(1) Size(0x1) ]
	void CloseSelfWrap(uint8_t Arg);

	// Object: Function Breakthrough.BreakthroughBattleClassAdviceView.CloseSelf
	// Flags: [Final|Native|Public]
	// Offset: 0x14ed7e80
	// Params: [ Num(0) Size(0x0) ]
	void CloseSelf();
};

// Object: Class Breakthrough.BreakthroughBigMapHUDController
// Size: 0x708 (Inherited: 0x4D8)
struct UBreakthroughBigMapHUDController : UBattleFieldMapHUDController
{
	DEFINE_UE_CLASS_HELPERS(UBreakthroughBigMapHUDController, "BreakthroughBigMapHUDController")

	struct TArray<struct USectorAnchorViewController*> SectorAnchorViewControllerArr; // 0x4D8(0x10)
	struct TArray<struct USectorAnchorHardPointViewController*> SectorAnchorHardPointViewControllerArr; // 0x4E8(0x10)
	uint8_t Pad_0x4F8[0x8]; // 0x4F8(0x8)
	struct TArray<struct UFlagAnchorViewController*> FlagAnchorViewControllerArr; // 0x500(0x10)
	struct TArray<struct UBattleFlagViewController*> BattleFlagViewControllerArr; // 0x510(0x10)
	struct TArray<struct UFlagConvoyRangeViewController*> FlagConvoyRangeViewControllerArr; // 0x520(0x10)
	struct AGameState_Breakthrough* GameState_Breakthrough; // 0x530(0x8)
	struct ABattleSectorBase* BattleSectorBase_Breakthrough; // 0x538(0x8)
	uint8_t Pad_0x540[0x20]; // 0x540(0x20)
	struct TArray<struct USectorSplineAreaViewController*> SectorSplineAreaViewControllerArr; // 0x560(0x10)
	struct TMap<int32_t, struct USceneWeaponMapIconViewController*> SceneWeaponViewControllerMap; // 0x570(0x50)
	uint8_t Pad_0x5C0[0x58]; // 0x5C0(0x58)
	struct TMap<int32_t, struct UVehicleMapIconViewController*> VehicleViewControllerMap; // 0x618(0x50)
	uint8_t Pad_0x668[0x58]; // 0x668(0x58)
	struct AGPSceneActorReplicator* GPSceneActorReplicator; // 0x6C0(0x8)
	uint8_t Pad_0x6C8[0x30]; // 0x6C8(0x30)
	struct ABattleFlag* OurBattleFlag; // 0x6F8(0x8)
	struct ABattleFlag* EnemyBattleFlag; // 0x700(0x8)

	// Object: Function Breakthrough.BreakthroughBigMapHUDController.VehicleOnFireInfoUpdate
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed8dc8
	// Params: [ Num(0) Size(0x0) ]
	void VehicleOnFireInfoUpdate();

	// Object: Function Breakthrough.BreakthroughBigMapHUDController.SceneWeaponInfoChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed8ce0
	// Params: [ Num(2) Size(0x10) ]
	void SceneWeaponInfoChanged(uint8_t bIsDS, struct ADFScenceWeaponPawn* InSceneWeapon);

	// Object: Function Breakthrough.BreakthroughBigMapHUDController.OnTeamComponentInfoUpdate
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed8c3c
	// Params: [ Num(1) Size(0x8) ]
	void OnTeamComponentInfoUpdate(struct AActor* InOwnerActor);

	// Object: Function Breakthrough.BreakthroughBigMapHUDController.OnSwitchSeatOnVehicle
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed8ae8
	// Params: [ Num(4) Size(0x20) ]
	void OnSwitchSeatOnVehicle(struct AActor* CHARACTER, struct AActor* Vehicle, struct FName OldSeat, struct FName NewSeat);

	// Object: Function Breakthrough.BreakthroughBigMapHUDController.OnSectorActived
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed8a44
	// Params: [ Num(1) Size(0x8) ]
	void OnSectorActived(struct AActor* Actor);

	// Object: Function Breakthrough.BreakthroughBigMapHUDController.OnSceneWeaponOnFireInfoUpdate
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x14ed8988
	// Params: [ Num(1) Size(0x10) ]
	void OnSceneWeaponOnFireInfoUpdate(const struct TArray<struct FSceneWeaponOnFireInfo>& SceneWeaponOnFireInfos);

	// Object: Function Breakthrough.BreakthroughBigMapHUDController.OnPlayerUnitMarkingInfoArrayChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed8974
	// Params: [ Num(0) Size(0x0) ]
	void OnPlayerUnitMarkingInfoArrayChange();

	// Object: Function Breakthrough.BreakthroughBigMapHUDController.OnPlayerGetOnVehicle
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed885c
	// Params: [ Num(3) Size(0x18) ]
	void OnPlayerGetOnVehicle(struct AActor* CHARACTER, struct AActor* Vehicle, struct FName Seat);

	// Object: Function Breakthrough.BreakthroughBigMapHUDController.OnPlayerGetOffVehicle
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed8780
	// Params: [ Num(2) Size(0x10) ]
	void OnPlayerGetOffVehicle(struct AActor* CHARACTER, struct AActor* Vehicle);

	// Object: Function Breakthrough.BreakthroughBigMapHUDController.OnHoldFlagOwnerActorChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x14ed876c
	// Params: [ Num(0) Size(0x0) ]
	void OnHoldFlagOwnerActorChange();

