#pragma once

#include "../CoreUObject_classes.hpp"
#include "AIModule.hpp"
#include "AvatarSystem.hpp"
#include "DFMGameHud.hpp"
#include "DFMGameplay.hpp"
#include "DFMGlobalDefines.hpp"
#include "DFMVehicle.hpp"
#include "Engine.hpp"
#include "GPAudioRuntime.hpp"
#include "GPDeformable.hpp"
#include "GPGameHud.hpp"
#include "GPGameplay.hpp"
#include "GPGlobalDefines.hpp"
#include "GPResource.hpp"
#include "GPWeaponRuntime.hpp"
#include "GameCore.hpp"
#include "GameplayTags.hpp"

namespace SDK
{

// Package: DFMAbility
// Enums: 43
// Structs: 166
// Classes: 419

struct AAIController;
struct AAbilityWeaponThrowableBullet;
struct AActor;
struct AAssembleWeaponActor;
struct ABreakableItemBase;
struct ACHARACTER;
struct AController;
struct ADFMAICharacter;
struct ADFMAIController;
struct ADFMCharacter;
struct ADFMSkillSmokeActor;
struct ADFMVehicleBase;
struct ADFMWaterRippleEffect;
struct AGPCharacter;
struct AGPCharacterBase;
struct AGPDeformableSmokeEmitActor;
struct AGPPlayerCameraManager;
struct AGPPreviewLineActor;
struct AGPUASActor;
struct AGPVehicleBase;
struct AGPWeaponBulletBase;
struct AGPWeaponBulletThrowableProjectile;
struct AInteractorBaseProxy;
struct AItemPreviewActor;
struct APawn;
struct APlayerCommanderFakeAIController;
struct APlayerController;
struct ARankSkillPreviewPlacementActor;
struct ASkillSubsystem;
struct AWaterDataAssetsStreamer;
struct AWeaponBase;
enum class EAbilityNodeExcuteType : uint8_t;
enum class EAbilityStateFlag : uint8_t;

struct UQA_AbilitySetVaultHeightTypeLimit;
struct UQA_AbilityShowDetectorMap;
struct UQA_AbilityShowDetectorMapEx;
struct UQA_AbilityShowPanel;
struct UQA_AbilityShowTips;
struct UQA_AbilityKeyTips;
struct UQA_AbilitySkillConflictID;
struct UQA_AbilitySkillUIEvent;
struct UQA_AbilitySoundVisualizationNotify;
struct UQA_AbilitySpawnActor;
struct UQA_AbilityNotifySpawnActor;
struct UQA_AbilityStaminaChange;
struct UQA_AbilitySwithLeftWeapon;
struct UQA_AbilitySwithWeapon;
struct UQA_AbilityTrigger;
struct UQA_AbilityEnableUseTogether;
struct UQA_AbilityCastSkill;
struct UQA_AbilityHookSkill;
struct UQA_AbilityUseSupportPack;
struct UQA_AbilityWantCharacterSpeak;
struct UQA_AbilityWeaponProjectileActor;
struct ARebornFlag;
struct ARankSkillRebornFlag;
struct ADFMRemoteControlledVehicle;
struct URemoteVehicleMarkSelfBuffEntity;
struct ARopeTest;
struct USayyidCrossbowCrossHairHudController;
struct USayyidCrossbowCrossHairHudView;
struct USayyidCrossbowCrossHairUIController;
struct USayyidCrossbowCrossHairUIView;
struct USayyidCrossbowDataComponentAnim;
struct USayyidCrossbowFuncComponent;
struct ASayyidFireArrowProjectile;
struct USpiderAnimInstance;
struct ASpiderBase;
struct USpiderMovementComponent;
struct USpiderNetCueHandle;
struct ASpiderNetProjectile;
struct USpiderQueryFilter_WorldQuery;
struct ASpiderSentryHive;
struct USpiderMarkBuffEntity;
struct ASpyExposeActor;
struct USpyExposeCueHandler;
struct UStunGrenadeMovementComponent;
struct ATestChainHookTakerActor;
struct UThreatDetectionCueHandler;
struct UThrowBlockingAnimInstance;
struct UThrowBlockingPartComponent;
struct UThrowBlockingPreviewPartComponent;
struct AThrowBlockingPreviewActor;
struct AThrowSpawnHelper;
struct UWeaponBindHUDFuncComponent;
struct AWeaponBulletBuff;
struct AWeaponBulletArrow;
struct AWeaponBulletAbilityFireArrow;
struct AWeaponBulletAbilitySayyidFireArrow;
struct AWeaponBulletPenetratingSniper;
struct AWeaponBulletProxSensorArrow;
struct AWeaponBulletSupport;
struct UWeaponFireModeBionicBirdParams;
struct UWeaponFireModeBionicBird;
struct UWeaponFireModeBionicSpyParams;
struct UWeaponFireModeBionicSpy;
struct UWeaponFireModeParamsPlacementDetector;
struct UWeaponFireModePlacementDetector;
struct UWeaponFireModeSpiderParams;
struct UWeaponFireModeSpider;
struct UWeaponFireModeSupport;
struct UWeaponFireModeSupportPack;
struct UWeaponFireModeParamsSuppressionMinePlacement;
struct UWeaponFireModeSuppressionMinePlacement;
struct UWeaponFireModeSwarmsParams;
struct UWeaponFireModeSwarms;
struct UWeaponFireModeParamsThrowableSpawnSmokeUAS;
struct UWeaponFireModeThrowableSpawnSmokeUAS;
struct UWeaponFireModeParamsThrowBlocking;
struct UWeaponFireModeThrowBlocking;
struct UWeaponFuncComponentZoyaSwarmsItem;
struct UWeaponThrowableDataComponentBubble;
struct UWeaponThrowBunkerDataComponentAnim;
struct UWeaponThrowMineDataComponentAnim;
struct AZoyaSwarmsActor;
struct UZoyaSwarmsItemAnimInstance;
struct AZoyaSwarmsPreviewActor;
struct AZoyaSwarmsWeapon;

// Object: Enum DFMAbility.ESpiderMoveMode
enum class ESpiderMoveMode : uint8_t
{
	MOVE_None = 0,
	MOVE_Walking = 1,
	MOVE_Falling = 2,
	MOVE_Climbing = 3,
	MOVE_MAX = 4
};

// Object: Enum DFMAbility.EAIADSWeaponEvent
enum class EAIADSWeaponEvent : uint8_t
{
	Default = 0,
	TurnStart = 1,
	TurnEnd = 2,
	Fire = 3,
	EAIADSWeaponEvent_MAX = 4
};

// Object: Enum DFMAbility.EAIADSState
enum class EAIADSState : uint8_t
{
	Full = 0,
	NotEmpty = 1,
	Empty = 2,
	EAIADSState_MAX = 3
};

// Object: Enum DFMAbility.EAIADSChargeType
enum class EAIADSChargeType : uint8_t
{
	CDCharging = 0,
	CDCharging2 = 1,
	ContinuousCharging = 2,
	EAIADSChargeType_MAX = 3
};

// Object: Enum DFMAbility.ECallAICombatStyle
enum class ECallAICombatStyle : uint8_t
{
	Prudent = 0,
	Assault = 1,
	ECallAICombatStyle_MAX = 2
};

// Object: Enum DFMAbility.ECallAIType
enum class ECallAIType : uint8_t
{
	Rifleman = 0,
	MachineGunner = 1,
	Shielder = 2,
	Flamethrower = 3,
	ECallAIType_MAX = 4
};

// Object: Enum DFMAbility.EBionicSpyCastResult
enum class EBionicSpyCastResult : uint8_t
{
	Success = 0,
	NoTarget = 1,
	TargetDead = 2,
	TargetEscaped = 3,
	OtherError = 4,
	Discovered = 5,
	EBionicSpyCastResult_MAX = 6
};

// Object: Enum DFMAbility.EAbilityVoxelDiffuseType
enum class EAbilityVoxelDiffuseType : uint8_t
{
	DFS = 0,
	BFS = 1,
	CylinderBFS = 2,
	EAbilityVoxelDiffuseType_MAX = 3
};

// Object: Enum DFMAbility.EAbilityVoxelCheckType
enum class EAbilityVoxelCheckType : uint8_t
{
	AABB = 0,
	Sphere = 1,
	Cylinder = 2,
	OBB = 3,
	EAbilityVoxelCheckType_MAX = 4
};

// Object: Enum DFMAbility.EFrozenAppearancePhase
enum class EFrozenAppearancePhase : uint8_t
{
	None = 0,
	CreatingRT = 1,
	WritingVoxelData = 2,
	ApplyingToMaterial = 3,
	RewritingVoxelData = 4,
	Completed = 5,
	EFrozenAppearancePhase_MAX = 6
};

// Object: Enum DFMAbility.ETouchWaterSurfaceEvent
enum class ETouchWaterSurfaceEvent : uint8_t
{
	None = 0,
	EnterWaterSurface = 1,
	LeaveWaterSurface = 2,
	ETouchWaterSurfaceEvent_MAX = 3
};

// Object: Enum DFMAbility.EWaterState
enum class EWaterState : uint8_t
{
	OnGround = 0,
	UnderWater = 1,
	AboveWater = 2,
	EWaterState_MAX = 3
};

// Object: Enum DFMAbility.EWaterEffectTriggerType
enum class EWaterEffectTriggerType : uint8_t
{
	None = 0,
	EnterWaterSurface = 1,
	LeaveWaterSurface = 2,
	UnderWater = 3,
	AboveWater = 4,
	Max = 5
};

// Object: Enum DFMAbility.EArtilleryShellDropMethod
enum class EArtilleryShellDropMethod : uint8_t
{
	RANDOM = 0,
	ORDER = 1,
	EArtilleryShellDropMethod_MAX = 2
};

// Object: Enum DFMAbility.EChainHookCheckEndType
enum class EChainHookCheckEndType : uint8_t
{
	None = 0,
	ActorLocation = 1,
	HitLocation = 2,
	ClientBindLocation = 3,
	PawnViewLocation = 4,
	EChainHookCheckEndType_MAX = 5
};

// Object: Enum DFMAbility.EChainHookCheckStartType
enum class EChainHookCheckStartType : uint8_t
{
	None = 0,
	ActorLocation = 1,
	PawnViewLocation = 2,
	GrenadeStartLocation = 3,
	WeaponSocket = 4,
	EChainHookCheckStartType_MAX = 5
};

// Object: Enum DFMAbility.EBattleFieldPropType
enum class EBattleFieldPropType : uint8_t
{
	None = 0,
	ADS = 1,
	RebornFlag = 2,
	Bunker = 3,
	MedicalBox = 4,
	AmmoBox = 5,
	AntiTankMine = 6,
	ClayMoreMine = 7,
	FlameThrowerArea = 8,
	ElectricShock = 9,
	SonarDevice = 10,
	EBattleFieldPropType_MAX = 11
};

// Object: Enum DFMAbility.EAbilityDetectorTriggerType
enum class EAbilityDetectorTriggerType : uint8_t
{
	None = 0,
	Recycle = 1,
	ManualActive = 2,
	Both = 3,
	EAbilityDetectorTriggerType_MAX = 4
};

// Object: Enum DFMAbility.EDiffuseAreaCellCheckState
enum class EDiffuseAreaCellCheckState : uint8_t
{
	Default = 0,
	Failed = 1,
	Success = 2,
	EDiffuseAreaCellCheckState_MAX = 3
};

// Object: Enum DFMAbility.EDiffuseAreaCellDiffuseType
enum class EDiffuseAreaCellDiffuseType : uint8_t
{
	Default = 0,
	X = 1,
	Nx = 2,
	Y = 3,
	Ny = 4,
	EDiffuseAreaCellDiffuseType_MAX = 5
};

// Object: Enum DFMAbility.EDiffuseAreaType
enum class EDiffuseAreaType : uint8_t
{
	None = 0,
	Incendiary = 1,
	BarbedWire = 2,
	EDiffuseAreaType_MAX = 3
};

// Object: Enum DFMAbility.EAbilityLevelActorType
enum class EAbilityLevelActorType : uint8_t
{
	ENone = 0,
	EADS = 1,
	ERebornFlag = 2,
	EBunker = 3,
	EAbilityLevelActorType_MAX = 4
};

// Object: Enum DFMAbility.EVehicleBehaviorForbit
enum class EVehicleBehaviorForbit : uint8_t
{
	None = 0,
	Move = 1,
	Jump = 2,
	Boom = 4,
	TurnRate = 8,
	LookUpTurnRate = 16,
	EVehicleBehaviorForbit_MAX = 17
};

// Object: Enum DFMAbility.EDFMAbilityCastFailedReason
enum class EDFMAbilityCastFailedReason : uint8_t
{
	inCooldown = 0,
	StateFailed = 1,
	Disable = 2,
	Forbit = 3,
	CampNum = 4,
	Score = 5,
	TeamNum = 6,
	Sector = 7,
	EDFMAbilityCastFailedReason_MAX = 8
};

// Object: Enum DFMAbility.EAbilitySmokeActorDetectionStage
enum class EAbilitySmokeActorDetectionStage : uint8_t
{
	DetectionStage_None = 0,
	DetectionStage_Course = 1,
	DetectionStage_Voxel = 2,
	DetectionStage_MAX = 3
};

// Object: Enum DFMAbility.ESmokeWallUASStage
enum class ESmokeWallUASStage : uint8_t
{
	UASStage_None = 0,
	UASStage_Equip = 1,
	UASStage_Idle = 2,
	UASStage_Fly = 3,
	UASStage_MAX = 4
};

// Object: Enum DFMAbility.EAIPatrolPointType
enum class EAIPatrolPointType : uint8_t
{
	None = 0,
	PathPoint = 1,
	SubPoint = 2,
	Path = 3,
	Section = 4,
	EAIPatrolPointType_MAX = 5
};

// Object: Enum DFMAbility.ECallDogState
enum class ECallDogState : uint8_t
{
	None = 0,
	Spawn = 1,
	Idle = 2,
	Interact = 3,
	Attack = 4,
	Hurt = 5,
	Despawn = 6,
	ECallDogState_MAX = 7
};

// Object: Enum DFMAbility.EVehicleBoss04FireMode
enum class EVehicleBoss04FireMode : uint8_t
{
	Default = 0,
	MachineGun = 1,
	StingerMissile = 2,
	EVehicleBoss04FireMode_MAX = 3
};

// Object: Enum DFMAbility.EVehicleBoss04WeaponType
enum class EVehicleBoss04WeaponType : uint8_t
{
	None = 0,
	MachineGun = 1,
	StingerMissle = 2,
	EVehicleBoss04WeaponType_MAX = 3
};

// Object: Enum DFMAbility.EStunGrenadeMovementState
enum class EStunGrenadeMovementState : uint8_t
{
	None = 0,
	NormalFly = 1,
	FoundTargetAndChangeVelocityAngle = 2,
	MoveToTarget = 3,
	MoveToTargetHitWall = 4,
	EStunGrenadeMovementState_MAX = 5
};

// Object: Enum DFMAbility.ENitrogenAppearancePhase
enum class ENitrogenAppearancePhase : uint8_t
{
	None = 0,
	WaitingForVoxelData = 1,
	LoadingAppearanceBlueprint = 2,
	SpawningAppearanceActor = 3,
	Completed = 4,
	ENitrogenAppearancePhase_MAX = 5
};

// Object: Enum DFMAbility.EAudioRoleType
enum class EAudioRoleType : uint8_t
{
	ET_ALL = 0,
	EE_1P = 1,
	EE_3P = 2,
	EAudioRoleType_MAX = 3
};

// Object: Enum DFMAbility.ERopeTriggerType
enum class ERopeTriggerType : uint8_t
{
	RopeToggle = 0,
	RopeStart = 1,
	RopeEnd = 2,
	RopeBeginEnd = 3,
	RopeNoBeginToEnd = 4,
	RopeMove = 5,
	RopeRescue = 6,
	RopeClearRescue = 7,
	RopeLeaveHanging = 8,
	RopeRecordPressMove = 9,
	RopeRecordHitMove = 10,
	ClearRope = 11,
	ERopeTriggerType_MAX = 12
};

// Object: Enum DFMAbility.EAbilitySwithWeaponType
enum class EAbilitySwithWeaponType : uint8_t
{
	DefaultWeapon = 0,
	MainWeapon = 1,
	MeleeWeapon = 2,
	EmptyHand = 3,
	LastUsedWeapon = 4,
	NextWeapon = 5,
	PreWeapon = 6,
	PositionWeapon = 7,
	AnyWeapon = 8,
	LastThenAnyUsedWeapon = 9,
	LastUsedWeaponOrEmpty = 10,
	SkillWeapon = 11,
	SkillEnd = 12,
	EAbilitySwithWeaponType_MAX = 13
};

// Object: Enum DFMAbility.ERebornFlagType
enum class ERebornFlagType : uint8_t
{
	EAbility = 0,
	EVehicle = 1,
	ERankSkill = 2,
	ERebornFlagType_MAX = 3
};

// Object: Enum DFMAbility.EVehicleDestroyReason
enum class EVehicleDestroyReason : uint8_t
{
	EVehicleDestroyReason_None = 0,
	EVehicleDestroyReason_OutOfControlRange = 1,
	EVehicleDestroyReason_OutOfControlTime = 2,
	EVehicleDestroyReason_UnderWater = 3,
	EVehicleDestroyReason_DriveCrash = 4,
	EVehicleDestroyReason_HpEmptyOnControl = 5,
	EVehicleDestroyReason_HpEmptyExitInXSeconds = 6,
	EVehicleDestroyReason_Max = 7
};

// Object: Enum DFMAbility.ESpiderAttackMode
enum class ESpiderAttackMode : uint8_t
{
	SpiderAttackMode_Projectile = 0,
	SpiderAttackMode_Explode = 1,
	SpiderAttackMode_MAX = 2
};

// Object: Enum DFMAbility.ESpiderState
enum class ESpiderState : uint8_t
{
	SpiderState_Sleep = 0,
	SpiderState_Awake = 1,
	SpiderState_Detect = 2,
	SpiderState_Follow = 3,
	SpiderState_ReadyAttack = 4,
	SpiderState_Attack = 5,
	SpiderState_ReadyDestroyed = 6,
	SpiderState_Max = 7
};

// Object: Enum DFMAbility.ESpiderControlMode
enum class ESpiderControlMode : uint8_t
{
	None = 0,
	Server = 1,
	ClientSimulate = 2,
	ESpiderControlMode_MAX = 3
};

// Object: Enum DFMAbility.FThreatDetectionCheckResult
enum class EFThreatDetectionCheckResult : uint8_t
{
	BaseCheckFailed = 0,
	AngleCheckFailed = 1,
	BlockCheckFailed = 2,
	Pass = 3,
	FThreatDetectionCheckResult_MAX = 4
};

// Object: Enum DFMAbility.EThrowBlockingPartState
enum class EThrowBlockingPartState : uint8_t
{
	Initial = 0,
	Spawn = 1,
	Normal = 2,
	Damaged = 3,
	Destroyed = 4,
	EThrowBlockingPartState_MAX = 5
};

// Object: Enum DFMAbility.EThrowBlockingExpansionType
enum class EThrowBlockingExpansionType : uint8_t
{
	FullyExpanded = 0,
	OnGround = 1,
	OnWall = 2,
	EThrowBlockingExpansionType_MAX = 3
};

// Object: ScriptStruct DFMAbility.SubTrailFX
// Size: 0x30 (Inherited: 0x0)
struct FSubTrailFX
{
	uint8_t Pad_0x0[0x20]; // 0x0(0x20)
	struct UFXResourceContainerComponent* FXContainer; // 0x20(0x8)
	uint8_t Pad_0x28[0x8]; // 0x28(0x8)
};

// Object: ScriptStruct DFMAbility.AIADSWeaponEffectData
// Size: 0x20 (Inherited: 0x0)
struct FAIADSWeaponEffectData
{
	float MaxTrailPow; // 0x0(0x4)
	float SmokeLifeMin; // 0x4(0x4)
	float SmokeLifeMax; // 0x8(0x4)
	uint8_t bUseBulletTracer : 1; // 0xC(0x1), Mask(0x1)
	uint8_t BitPad_0xC_1 : 7; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	float BulletTraceTimePer5000; // 0x10(0x4)
	struct FVector MuzzleFlashScaleBase; // 0x14(0xC)
};

// Object: ScriptStruct DFMAbility.CallAIStatusInfo
// Size: 0x30 (Inherited: 0x0)
struct FCallAIStatusInfo
{
	struct TArray<struct FCallAIUnitInfo> AIUnits; // 0x0(0x10)
	ECallAICombatStyle CombatStyle; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	float SkillDuration; // 0x14(0x4)
	float MaxDuration; // 0x18(0x4)
	uint8_t bIsActive : 1; // 0x1C(0x1), Mask(0x1)
	uint8_t BitPad_0x1C_1 : 7; // 0x1C(0x1)
	uint8_t Pad_0x1D[0x3]; // 0x1D(0x3)
	float SkillStartTime; // 0x20(0x4)
	uint8_t bAnyAIGuard : 1; // 0x24(0x1), Mask(0x1)
	uint8_t BitPad_0x24_1 : 7; // 0x24(0x1)
	uint8_t Pad_0x25[0x3]; // 0x25(0x3)
	float RecallKeyLongPressedProgress; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct DFMAbility.CallAIUnitInfo
// Size: 0x3 (Inherited: 0x0)
struct FCallAIUnitInfo
{
	ECallAIType AIType; // 0x0(0x1)
	uint8_t Count; // 0x1(0x1)
	uint8_t MaxCount; // 0x2(0x1)
};

// Object: ScriptStruct DFMAbility.EnemyPlayerInfo
// Size: 0x10 (Inherited: 0x0)
struct FEnemyPlayerInfo
{
	struct ADFMCharacter* PlayerCharacter; // 0x0(0x8)
	uint8_t Pad_0x8[0x8]; // 0x8(0x8)
};

// Object: ScriptStruct DFMAbility.CallAI2SpawnContext
// Size: 0x48 (Inherited: 0x0)
struct FCallAI2SpawnContext
{
	struct TArray<struct UEnvQuery*> LoadedBasePointEQSList; // 0x0(0x10)
	struct UEnvQuery* SpawnPointEnvQuery; // 0x10(0x8)
	uint8_t Pad_0x18[0x28]; // 0x18(0x28)
	struct AActor* SpawnPointQuerier; // 0x40(0x8)
};

// Object: ScriptStruct DFMAbility.PendingExitAI
// Size: 0x10 (Inherited: 0x0)
struct FPendingExitAI
{
	struct AAIController* Controller; // 0x0(0x8)
	uint8_t Pad_0x8[0x8]; // 0x8(0x8)
};

// Object: ScriptStruct DFMAbility.CallAIConfigElem
// Size: 0xA0 (Inherited: 0x0)
struct FCallAIConfigElem
{
	ECallAIType AIType; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct TSoftObjectPtr<UDataTable> NpcTemplateTable; // 0x8(0x28)
	struct FName npcName; // 0x30(0x8)
	int32_t CountPerEnemy; // 0x38(0x4)
	int32_t CountPerEnemyTeam; // 0x3C(0x4)
	int32_t MaxCount; // 0x40(0x4)
	int32_t MinCount; // 0x44(0x4)
	float CapsuleRadiusScale; // 0x48(0x4)
	uint8_t Pad_0x4C[0x4]; // 0x4C(0x4)
	struct TSoftObjectPtr<UEnvQuery> SpawnPositionEnvQuery; // 0x50(0x28)
	struct TSoftObjectPtr<UDataTable> SpeakConfig; // 0x78(0x28)
};

// Object: ScriptStruct DFMAbility.AISpawnInfo
// Size: 0x130 (Inherited: 0x0)
struct FAISpawnInfo
{
	struct FCallAIConfigElem Config; // 0x0(0xA0)
	struct UEnvQuery* SpawnPositionEnvQuery; // 0xA0(0x8)
	struct FAINpcSelector NpcSelector; // 0xA8(0x88)
};

// Object: ScriptStruct DFMAbility.CallAIConfig
// Size: 0x10 (Inherited: 0x0)
struct FCallAIConfig
{
	struct TArray<struct FCallAIConfigElem> CallAIList; // 0x0(0x10)
};

// Object: ScriptStruct DFMAbility.WayPointConstraint
// Size: 0x10 (Inherited: 0x0)
struct FWayPointConstraint
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct DFMAbility.PathSegmentConstraint
// Size: 0xC (Inherited: 0x0)
struct FPathSegmentConstraint
{
	uint8_t Pad_0x0[0xC]; // 0x0(0xC)
};

// Object: ScriptStruct DFMAbility.BendingConstraint
// Size: 0x14 (Inherited: 0x0)
struct FBendingConstraint
{
	uint8_t Pad_0x0[0x14]; // 0x0(0x14)
};

// Object: ScriptStruct DFMAbility.DistanceConstraint
// Size: 0x10 (Inherited: 0x0)
struct FDistanceConstraint
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct DFMAbility.AttachRopeNode
// Size: 0x4C (Inherited: 0x0)
struct FAttachRopeNode
{
	struct FVector Position; // 0x0(0xC)
	struct FVector PreviousPosition; // 0xC(0xC)
	struct FVector PredictedPosition; // 0x18(0xC)
	float Mass; // 0x24(0x4)
	float InverseMass; // 0x28(0x4)
	float InverseDistanceContraintMass; // 0x2C(0x4)
	struct FVector Velocity; // 0x30(0xC)
	struct FVector ExternalForce; // 0x3C(0xC)
	uint8_t bIsFixed : 1; // 0x48(0x1), Mask(0x1)
	uint8_t BitPad_0x48_1 : 7; // 0x48(0x1)
	uint8_t Pad_0x49[0x3]; // 0x49(0x3)
};

// Object: ScriptStruct DFMAbility.AttachRopeConfig
// Size: 0x20 (Inherited: 0x0)
struct FAttachRopeConfig
{
	uint8_t bEnablePhysics : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t NumSegments; // 0x4(0x4)
	float RopeLegth; // 0x8(0x4)
	int32_t NumSides; // 0xC(0x4)
	int32_t SolverIterations; // 0x10(0x4)
	float SegmentStiffness; // 0x14(0x4)
	float WayPointStiffness; // 0x18(0x4)
	float SegmentMaxScale; // 0x1C(0x4)
};

// Object: ScriptStruct DFMAbility.ConflictZoneServerData
// Size: 0x30 (Inherited: 0x0)
struct FConflictZoneServerData
{
	uint8_t Pad_0x0[0x30]; // 0x0(0x30)
};

// Object: ScriptStruct DFMAbility.SpySwitchMapData
// Size: 0x8 (Inherited: 0x0)
struct FSpySwitchMapData
{
	int32_t MapID; // 0x0(0x4)
	float MaxDistance; // 0x4(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityMineAnimInstanceProxy
// Size: 0x7B0 (Inherited: 0x7A0)
struct FAbilityMineAnimInstanceProxy : FAnimInstanceProxy
{
	struct ADFMAbilitySuppressionMine* SuppressionMine; // 0x798(0x8)
	uint8_t bIsActivate : 1; // 0x7A0(0x1), Mask(0x1)
	uint8_t bIsExplode : 1; // 0x7A1(0x1), Mask(0x1)
	uint8_t BitPad_0x7A8_2 : 6; // 0x7A8(0x1)
	uint8_t Pad_0x7A9[0x7]; // 0x7A9(0x7)
};

// Object: ScriptStruct DFMAbility.WaterEffectBroadcastMsg
// Size: 0x8 (Inherited: 0x0)
struct FWaterEffectBroadcastMsg
{
	EWaterState WaterState; // 0x0(0x1)
	EWaterState NewWaterState; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	float LastWaterHeight; // 0x4(0x4)
};

// Object: ScriptStruct DFMAbility.WaterEffectFX
// Size: 0x48 (Inherited: 0x0)
struct FWaterEffectFX
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
	struct USceneComponent* AttachComponent; // 0x10(0x8)
	uint8_t Pad_0x18[0x8]; // 0x18(0x8)
	struct UFXResourceContainerComponent* FXComp; // 0x20(0x8)
	struct ADFMWaterRippleEffect* RippleEffect; // 0x28(0x8)
	struct UDFMInteractiveWaterComponent* InteractiveWaterComponent; // 0x30(0x8)
	uint8_t Pad_0x38[0x10]; // 0x38(0x10)
};

// Object: ScriptStruct DFMAbility.ProjectileExplodeInfo
// Size: 0x18 (Inherited: 0x0)
struct FProjectileExplodeInfo
{
	struct FVector HitProjectilePosition; // 0x0(0xC)
	struct FName ProjectileName; // 0xC(0x8)
	uint8_t HasProcessed : 1; // 0x14(0x1), Mask(0x1)
	uint8_t BitPad_0x14_1 : 7; // 0x14(0x1)
	uint8_t Pad_0x15[0x3]; // 0x15(0x3)
};

// Object: ScriptStruct DFMAbility.AlertMarkConfig
// Size: 0x14 (Inherited: 0x0)
struct FAlertMarkConfig
{
	float MarkerDuration_L1; // 0x0(0x4)
	float MarkerDuration_L2; // 0x4(0x4)
	float MarkerDuration_L3; // 0x8(0x4)
	float MarkerMinDistance; // 0xC(0x4)
	float MarkerIconRadius; // 0x10(0x4)
};

// Object: ScriptStruct DFMAbility.CallAICharacterInfo
// Size: 0x20 (Inherited: 0x0)
struct FCallAICharacterInfo
{
	struct ADFMAICharacter* AICharacter; // 0x0(0x8)
	struct FString AIName; // 0x8(0x10)
	ECallAIType AIType; // 0x18(0x1)
	uint8_t Pad_0x19[0x7]; // 0x19(0x7)
};

// Object: ScriptStruct DFMAbility.AIAlertSubtitleInfo
// Size: 0x60 (Inherited: 0x0)
struct FAIAlertSubtitleInfo
{
	struct FString SpeakerName; // 0x0(0x10)
	struct FString NonePOISubtitle; // 0x10(0x10)
	struct FString POISubtitleFormatString; // 0x20(0x10)
	struct FString POIName; // 0x30(0x10)
	float SubtitleDuration; // 0x40(0x4)
	uint8_t SubtitlePriority; // 0x44(0x1)
	uint8_t bOverrideSamePriority : 1; // 0x45(0x1), Mask(0x1)
	uint8_t BitPad_0x45_1 : 7; // 0x45(0x1)
	uint8_t bPlayVO : 1; // 0x46(0x1), Mask(0x1)
	uint8_t BitPad_0x46_1 : 7; // 0x46(0x1)
	uint8_t Pad_0x47[0x1]; // 0x47(0x1)
	struct UGPAudioEventAsset* VOEvent; // 0x48(0x8)
	float MaxPlayVODistance; // 0x50(0x4)
	struct FVector AlertLocation; // 0x54(0xC)
};

// Object: ScriptStruct DFMAbility.AIAlertInfo
// Size: 0x30 (Inherited: 0x0)
struct FAIAlertInfo
{
	struct ADFMAICharacter* AICharacter; // 0x0(0x8)
	struct ADFMCharacter* DetectedEnemy; // 0x8(0x8)
	uint8_t Pad_0x10[0x10]; // 0x10(0x10)
	struct FString EnemyPOIName; // 0x20(0x10)
};

// Object: ScriptStruct DFMAbility.ArtilleryShellHitFXSurfaceAttribute
// Size: 0x20 (Inherited: 0x0)
struct FArtilleryShellHitFXSurfaceAttribute
{
	struct TArray<EPhysicalSurface> SurfaceTypes; // 0x0(0x10)
	struct TArray<struct FName> HitEffectIds; // 0x10(0x10)
};

// Object: ScriptStruct DFMAbility.ArtilleryShellMovementParameter
// Size: 0x48 (Inherited: 0x0)
struct FArtilleryShellMovementParameter
{
	int32_t SkillId; // 0x0(0x4)
	int32_t SkillEntityID; // 0x4(0x4)
	struct FVector Destination; // 0x8(0xC)
	float Distance; // 0x14(0x4)
	struct FVector Direction; // 0x18(0xC)
	float Accelerate; // 0x24(0x4)
	float Time; // 0x28(0x4)
	float FireTime; // 0x2C(0x4)
	struct AGPCharacter* MakerInstigator; // 0x30(0x8)
	int32_t CampId; // 0x38(0x4)
	struct FVector RebasedDestination; // 0x3C(0xC)
};

// Object: ScriptStruct DFMAbility.BreakthroughEventRange
// Size: 0x8 (Inherited: 0x0)
struct FBreakthroughEventRange
{
	int32_t Max; // 0x0(0x4)
	int32_t Min; // 0x4(0x4)
};

// Object: ScriptStruct DFMAbility.BionicBirdAnimInstanceProxy
// Size: 0x7C0 (Inherited: 0x7A0)
struct FBionicBirdAnimInstanceProxy : FAnimInstanceProxy
{
	struct FVector Velocity; // 0x798(0xC)
	struct FVector MoveInput; // 0x7A4(0xC)
	float Pitch; // 0x7B0(0x4)
	float Roll; // 0x7B4(0x4)
};

// Object: ScriptStruct DFMAbility.BionicBirdMarkingJoint
// Size: 0x10 (Inherited: 0x0)
struct FBionicBirdMarkingJoint
{
	struct FName SocketName; // 0x0(0x8)
	int32_t ParentIndex; // 0x8(0x4)
	float size; // 0xC(0x4)
};

// Object: ScriptStruct DFMAbility.BionicBirdMarkingAnimInstanceProxy
// Size: 0x7D0 (Inherited: 0x7A0)
struct FBionicBirdMarkingAnimInstanceProxy : FAnimInstanceProxy
{
	struct FPoseSnapshot TargetCharacterSnapshot; // 0x798(0x38)
};

// Object: ScriptStruct DFMAbility.BuffForbiddenData
// Size: 0x38 (Inherited: 0x0)
struct FBuffForbiddenData
{
	struct TArray<ECharacterStateMask> LockAbility; // 0x0(0x10)
	EFSMForbidReason LockReason; // 0x10(0x1)
	uint8_t bCancelWeaponOperate : 1; // 0x11(0x1), Mask(0x1)
	uint8_t BitPad_0x11_1 : 7; // 0x11(0x1)
	EWeaponCancelCurrentStateReason CancelReason; // 0x12(0x1)
	uint8_t bStopLooting : 1; // 0x13(0x1), Mask(0x1)
	uint8_t BitPad_0x13_1 : 7; // 0x13(0x1)
	uint8_t bStopUseItem : 1; // 0x14(0x1), Mask(0x1)
	uint8_t BitPad_0x14_1 : 7; // 0x14(0x1)
	uint8_t bStopRescue : 1; // 0x15(0x1), Mask(0x1)
	uint8_t BitPad_0x15_1 : 7; // 0x15(0x1)
	uint8_t bCrowdControl : 1; // 0x16(0x1), Mask(0x1)
	uint8_t BitPad_0x16_1 : 7; // 0x16(0x1)
	uint8_t bKnockBackAI : 1; // 0x17(0x1), Mask(0x1)
	uint8_t BitPad_0x17_1 : 7; // 0x17(0x1)
	uint8_t bBreakCurrentSkill : 1; // 0x18(0x1), Mask(0x1)
	uint8_t BitPad_0x18_1 : 7; // 0x18(0x1)
	uint8_t bBreakFirefighting : 1; // 0x19(0x1), Mask(0x1)
	uint8_t BitPad_0x19_1 : 7; // 0x19(0x1)
	uint8_t bBreakClimbLadder : 1; // 0x1A(0x1), Mask(0x1)
	uint8_t BitPad_0x1A_1 : 7; // 0x1A(0x1)
	uint8_t bBreakSlide : 1; // 0x1B(0x1), Mask(0x1)
	uint8_t BitPad_0x1B_1 : 7; // 0x1B(0x1)
	uint8_t bBreakInteracting : 1; // 0x1C(0x1), Mask(0x1)
	uint8_t BitPad_0x1C_1 : 7; // 0x1C(0x1)
	uint8_t bBreakHighValueItemInspect : 1; // 0x1D(0x1), Mask(0x1)
	uint8_t BitPad_0x1D_1 : 7; // 0x1D(0x1)
	uint8_t Pad_0x1E[0x2]; // 0x1E(0x2)
	struct AActor* MakerActor; // 0x20(0x8)
	struct AGPCharacter* Target; // 0x28(0x8)
	uint8_t Pad_0x30[0x8]; // 0x30(0x8)
};

// Object: ScriptStruct DFMAbility.C203MarkData
// Size: 0x38 (Inherited: 0x0)
struct FC203MarkData
{
	struct TArray<EBuffGameRole> AllGameRoles; // 0x0(0x10)
	float MapMarkEnemyTime; // 0x10(0x4)
	float CheckCD; // 0x14(0x4)
	float MarkTargetCD; // 0x18(0x4)
	float MaxDistance; // 0x1C(0x4)
	float MaxAngle; // 0x20(0x4)
	float MaxNotRenderTime; // 0x24(0x4)
	uint8_t bCheckSilenceZone : 1; // 0x28(0x1), Mask(0x1)
	uint8_t BitPad_0x28_1 : 7; // 0x28(0x1)
	uint8_t bCheckBlock : 1; // 0x29(0x1), Mask(0x1)
	uint8_t BitPad_0x29_1 : 7; // 0x29(0x1)
	uint8_t bCheckExitState : 1; // 0x2A(0x1), Mask(0x1)
	uint8_t BitPad_0x2A_1 : 7; // 0x2A(0x1)
	uint8_t bDoubleSidedCheck : 1; // 0x2B(0x1), Mask(0x1)
	uint8_t BitPad_0x2B_1 : 7; // 0x2B(0x1)
	ECollisionChannel BlockCheckChannel; // 0x2C(0x1)
	uint8_t bUesC203Mark : 1; // 0x2D(0x1), Mask(0x1)
	uint8_t BitPad_0x2D_1 : 7; // 0x2D(0x1)
	uint8_t bUseMarkLockCountDown : 1; // 0x2E(0x1), Mask(0x1)
	uint8_t BitPad_0x2E_1 : 7; // 0x2E(0x1)
	uint8_t Pad_0x2F[0x1]; // 0x2F(0x1)
	float MarkLockCountDownCheckCD; // 0x30(0x4)
	int32_t BaseMarkBuffID; // 0x34(0x4)
};

// Object: ScriptStruct DFMAbility.C204InterferenceAnimInstanceProxy
// Size: 0x7A0 (Inherited: 0x7A0)
struct FC204InterferenceAnimInstanceProxy : FAnimInstanceProxy
{
	uint8_t bPreFire : 1; // 0x798(0x1), Mask(0x1)
	uint8_t bExplode : 1; // 0x799(0x1), Mask(0x1)
};

// Object: ScriptStruct DFMAbility.C501FightTargetCandidate
// Size: 0x30 (Inherited: 0x0)
struct FC501FightTargetCandidate
{
	struct TWeakObjectPtr<struct ADFMCharacter> TargetCharacter; // 0x0(0x8)
	float FirstSeenTime; // 0x8(0x4)
	float LastSeenTime; // 0xC(0x4)
	uint8_t bInSight : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	float DistanceScore; // 0x14(0x4)
	float DirectionScore; // 0x18(0x4)
	float TypeScore; // 0x1C(0x4)
	float StickinessScore; // 0x20(0x4)
	float VisionScore; // 0x24(0x4)
	float BroadcastedTargetScore; // 0x28(0x4)
	float FinalScore; // 0x2C(0x4)
};

// Object: ScriptStruct DFMAbility.AIFollowSlot
// Size: 0xC (Inherited: 0x0)
struct FAIFollowSlot
{
	uint8_t Pad_0x0[0xC]; // 0x0(0xC)
};

// Object: ScriptStruct DFMAbility.CallAIInfoPanelViewLogic
// Size: 0x50 (Inherited: 0x0)
struct FCallAIInfoPanelViewLogic
{
	struct UObject* WorldContextObject; // 0x0(0x8)
	uint8_t Pad_0x8[0x18]; // 0x8(0x18)
	struct FCallAIStatusInfo CurrentStatusInfo; // 0x20(0x30)
};

// Object: ScriptStruct DFMAbility.CallDogFightTargetCandidate
// Size: 0x30 (Inherited: 0x0)
struct FCallDogFightTargetCandidate
{
	struct TWeakObjectPtr<struct ADFMCharacter> TargetCharacter; // 0x0(0x8)
	float FirstSeenTime; // 0x8(0x4)
	float LastSeenTime; // 0xC(0x4)
	uint8_t bInSight : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	float DistanceScore; // 0x14(0x4)
	float DirectionScore; // 0x18(0x4)
	float TypeScore; // 0x1C(0x4)
	float StickinessScore; // 0x20(0x4)
	float VisionScore; // 0x24(0x4)
	float BroadcastedTargetScore; // 0x28(0x4)
	float FinalScore; // 0x2C(0x4)
};

// Object: ScriptStruct DFMAbility.ChainHookAnimInstanceProxy
// Size: 0x7A0 (Inherited: 0x7A0)
struct FChainHookAnimInstanceProxy : FAnimInstanceProxy
{
	uint8_t bIsShowHook : 1; // 0x798(0x1), Mask(0x1)
};

// Object: ScriptStruct DFMAbility.ChainHookBendCheckData
// Size: 0x2 (Inherited: 0x0)
struct FChainHookBendCheckData
{
	EChainHookCheckStartType StartType; // 0x0(0x1)
	EChainHookCheckEndType EndType; // 0x1(0x1)
};

// Object: ScriptStruct DFMAbility.ChainHookRoleData
// Size: 0x30 (Inherited: 0x0)
struct FChainHookRoleData
{
	uint8_t bIsSupportHD : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bIsSupportMobile : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t Pad_0x2[0x6]; // 0x2(0x6)
	struct TArray<EBuffGameRole> AllGameRoles; // 0x8(0x10)
	int32_t PullBackDelayBuffID; // 0x18(0x4)
	int32_t PullBackDelayHookedBuffID; // 0x1C(0x4)
	float PullBackDelay; // 0x20(0x4)
	float HitOtherPullBackDelay; // 0x24(0x4)
	float HitBoxMaxHP; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct DFMAbility.ChainHookRopePoint
// Size: 0x30 (Inherited: 0x0)
struct FChainHookRopePoint
{
	struct FVector Location; // 0x0(0xC)
	struct FVector Target; // 0xC(0xC)
	struct FVector Normal; // 0x18(0xC)
	struct FVector Tangent; // 0x24(0xC)
};

// Object: ScriptStruct DFMAbility.ChainHookItemAnimInstanceProxy
// Size: 0x7D0 (Inherited: 0x7A0)
struct FChainHookItemAnimInstanceProxy : FAnimInstanceProxy
{
	uint8_t bIsFPP : 1; // 0x798(0x1), Mask(0x1)
	EChainHookState HookState; // 0x799(0x1)
	struct FVector StartLocation; // 0x79C(0xC)
	struct FVector HookLocation; // 0x7A8(0xC)
	uint8_t bIsBend : 1; // 0x7B4(0x1), Mask(0x1)
	struct FVector BendLocation; // 0x7B8(0xC)
	uint8_t BitPad_0x7C5_2 : 6; // 0x7C5(0x1)
	uint8_t Pad_0x7C6[0xA]; // 0x7C6(0xA)
};

// Object: ScriptStruct DFMAbility.AbilityBarbedWireAreaData
// Size: 0x28 (Inherited: 0x0)
struct FAbilityBarbedWireAreaData
{
	struct TArray<EBuffGameRole> AllGameRoles; // 0x0(0x10)
	int32_t MaxCount; // 0x10(0x4)
	float LeftTime; // 0x14(0x4)
	float CenterHP; // 0x18(0x4)
	float MinDestroyCellNum; // 0x1C(0x4)
	float MaxTakeRadialDamage; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
};

// Object: ScriptStruct DFMAbility.DFMAbilityBarbedWireTarget
// Size: 0x18 (Inherited: 0x0)
struct FDFMAbilityBarbedWireTarget
{
	uint8_t bIsNeedCheck : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bIsPassCheck : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t bIsCurrInArea : 1; // 0x2(0x1), Mask(0x1)
	uint8_t BitPad_0x2_1 : 7; // 0x2(0x1)
	uint8_t bIsLastInArea : 1; // 0x3(0x1), Mask(0x1)
	uint8_t BitPad_0x3_1 : 7; // 0x3(0x1)
	struct FVector LastCheckLocation; // 0x4(0xC)
	struct TWeakObjectPtr<struct AGPCharacter> Target; // 0x10(0x8)
};

// Object: ScriptStruct DFMAbility.DFMAbilityBaseBoxCD
// Size: 0x10 (Inherited: 0x0)
struct FDFMAbilityBaseBoxCD
{
	int64_t Uin; // 0x0(0x8)
	float CD; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityBlackBorad_ItemPreview
// Size: 0x30 (Inherited: 0x1)
struct FAbilityBlackBorad_ItemPreview : FAbilityFragment
{
	uint8_t IsValid : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	struct FVector Position; // 0x4(0xC)
	struct FVector ServerPosition; // 0x10(0xC)
	struct FRotator Rot; // 0x1C(0xC)
	struct AItemPreviewActor* PreviewActor; // 0x28(0x8)
};

// Object: ScriptStruct DFMAbility.AbilityBlackBorad_LineTrace
// Size: 0x50 (Inherited: 0x1)
struct FAbilityBlackBorad_LineTrace : FAbilityFragment
{
	struct TMap<int32_t, struct FHitResult> HitResult; // 0x0(0x50)
};

// Object: ScriptStruct DFMAbility.AbilitySkeletalMeshData
// Size: 0x14 (Inherited: 0x0)
struct FAbilitySkeletalMeshData
{
	struct TWeakObjectPtr<struct UGPSkeletalMeshComponent> WeakMesh; // 0x0(0x8)
	struct TWeakObjectPtr<struct UGPSkeletalMeshComponent> WeakTPPMesh; // 0x8(0x8)
	uint8_t Pad_0x10[0x1]; // 0x10(0x1)
	uint8_t IsBindMesh : 1; // 0x11(0x1), Mask(0x1)
	uint8_t BitPad_0x11_1 : 7; // 0x11(0x1)
	uint8_t bAddToRoot : 1; // 0x12(0x1), Mask(0x1)
	uint8_t BitPad_0x12_1 : 7; // 0x12(0x1)
	uint8_t Pad_0x13[0x1]; // 0x13(0x1)
};

// Object: ScriptStruct DFMAbility.AbilityBlackBorad_AttachMesh
// Size: 0x90 (Inherited: 0x1)
struct FAbilityBlackBorad_AttachMesh : FAbilityFragment
{
	struct TMap<struct FName, struct FAbilitySkeletalMeshData> ItemMesh; // 0x0(0x50)
	struct TWeakObjectPtr<struct UGPSkeletalMeshComponent> WeakBindMesh; // 0x50(0x8)
	struct TWeakObjectPtr<struct UGPSkeletalMeshComponent> WeakBindMeshParent; // 0x58(0x8)
	struct FVector BindPos; // 0x60(0xC)
	uint8_t Pad_0x6D[0x3]; // 0x6D(0x3)
	struct FQuat BindRot; // 0x70(0x10)
	struct FName BindMeshName; // 0x80(0x8)
	uint8_t ForwardHitResult : 1; // 0x88(0x1), Mask(0x1)
	uint8_t BitPad_0x88_1 : 7; // 0x88(0x1)
	uint8_t Pad_0x89[0x7]; // 0x89(0x7)
};

// Object: ScriptStruct DFMAbility.AbilityAttachMeshData
// Size: 0x38 (Inherited: 0x0)
struct FAbilityAttachMeshData
{
	struct UGPSkeletalMeshComponent* ItemMesh; // 0x0(0x8)
	struct FVector Dir; // 0x8(0xC)
	struct FVector Right; // 0x14(0xC)
	struct FVector Up; // 0x20(0xC)
	struct FVector pos; // 0x2C(0xC)
};

// Object: ScriptStruct DFMAbility.AbilityBlackBorad_EngineerData
// Size: 0x38 (Inherited: 0x0)
struct FAbilityBlackBorad_EngineerData
{
	struct TWeakObjectPtr<struct AActor> Vehicle; // 0x0(0x8)
	struct TArray<struct TWeakObjectPtr<struct AActor>> RecycleBunkers; // 0x8(0x10)
	struct TArray<struct TWeakObjectPtr<struct AActor>> ActiveBunkers; // 0x18(0x10)
	struct APawn* OwnerPawn; // 0x28(0x8)
	ESkillUISlot EngineerOverrideSkillUISlot; // 0x30(0x1)
	uint8_t bSkillUISlotOverrided : 1; // 0x31(0x1), Mask(0x1)
	uint8_t BitPad_0x31_1 : 7; // 0x31(0x1)
	uint8_t Pad_0x32[0x6]; // 0x32(0x6)
};

// Object: ScriptStruct DFMAbility.AbilityNotifyCommondData
// Size: 0x10 (Inherited: 0x0)
struct FAbilityNotifyCommondData
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct DFMAbility.AbilityBlackBorad_SpawnActor
// Size: 0xE8 (Inherited: 0x1)
struct FAbilityBlackBorad_SpawnActor : FAbilityFragment
{
	struct TArray<struct FSystemSpawnActorData> ActorData; // 0x0(0x10)
	struct TMap<int32_t, struct FAbilityNotifyCommondData> NotifyCommonds; // 0x10(0x50)
	struct FHitResult HitResult; // 0x60(0x88)
};

// Object: ScriptStruct DFMAbility.SystemSpawnActorData
// Size: 0x18 (Inherited: 0x0)
struct FSystemSpawnActorData
{
	struct AActor* Actor; // 0x0(0x8)
	struct TWeakObjectPtr<struct AActor> ActorRef; // 0x8(0x8)
	uint8_t ClearWhenRemove : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t ClearWhenDie : 1; // 0x11(0x1), Mask(0x1)
	uint8_t BitPad_0x11_1 : 7; // 0x11(0x1)
	uint8_t Pad_0x12[0x6]; // 0x12(0x6)
};

// Object: ScriptStruct DFMAbility.AbilityBlackBorad_NotifyCommond
// Size: 0x50 (Inherited: 0x1)
struct FAbilityBlackBorad_NotifyCommond : FAbilityFragment
{
	struct TMap<int32_t, struct FAbilityNotifyCommondData> NotifyCommonds; // 0x0(0x50)
};

// Object: ScriptStruct DFMAbility.C204InterferenceData
// Size: 0x98 (Inherited: 0x0)
struct FC204InterferenceData
{
	float AirExplodeTime; // 0x0(0x4)
	float BounceExplodeTime; // 0x4(0x4)
	float DestroyTime; // 0x8(0x4)
	float DetectRange; // 0xC(0x4)
	uint8_t bEnableMarkEnemy : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	float MarkTime; // 0x14(0x4)
	struct FName ExplosionFXName; // 0x18(0x8)
	struct FName RangeFXName; // 0x20(0x8)
	struct FName ChangeUpFXName; // 0x28(0x8)
	struct FName DestroyFXName; // 0x30(0x8)
	struct FName DestroyFXNameWater; // 0x38(0x8)
	struct TSoftClassPtr<struct UC204InterferenceAnimInstance*> AnimInst; // 0x40(0x28)
	int32_t EMPScoreName; // 0x68(0x4)
	uint8_t Pad_0x6C[0x4]; // 0x6C(0x4)
	uint64_t EMPScoreUID; // 0x70(0x8)
	struct FString HitVoice; // 0x78(0x10)
	float PlayHitVoiceInterval; // 0x88(0x4)
	struct FName CountDownAudioName; // 0x8C(0x8)
	float CountDownAudioPlayTime; // 0x94(0x4)
};

// Object: ScriptStruct DFMAbility.SonarDeviceConfig
// Size: 0xF0 (Inherited: 0x0)
struct FSonarDeviceConfig
{
	uint8_t bNeedAutoAttachToSurface : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float AttachToSurfaceDis; // 0x4(0x4)
	EDFMGamePlayMode GamePlayMode; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
	struct TArray<EAudioListenerType> AudioListenTypeList; // 0x10(0x10)
	struct TArray<struct FAudioListenerItemData> AudioListenList; // 0x20(0x10)
	int32_t ScanTimes; // 0x30(0x4)
	float ScanInterval; // 0x34(0x4)
	float ScanTimeSeconds; // 0x38(0x4)
	float PreScanTimeSeconds; // 0x3C(0x4)
	float ScanRefreshInterval; // 0x40(0x4)
	float IconLifeTime; // 0x44(0x4)
	float ScanDegrees; // 0x48(0x4)
	float ScanRadius; // 0x4C(0x4)
	uint8_t bHearing : 1; // 0x50(0x1), Mask(0x1)
	uint8_t BitPad_0x50_1 : 7; // 0x50(0x1)
	uint8_t Pad_0x51[0x3]; // 0x51(0x3)
	float TeammateShowHudDistance; // 0x54(0x4)
	struct FName ScanEffectName; // 0x58(0x8)
	struct FName ScanDeviceEffectName; // 0x60(0x8)
	struct FName SilenceDeviceEffectName; // 0x68(0x8)
	float TranslucencySortDistance; // 0x70(0x4)
	uint8_t bUseGeneralMarker : 1; // 0x74(0x1), Mask(0x1)
	uint8_t BitPad_0x74_1 : 7; // 0x74(0x1)
	uint8_t Pad_0x75[0x3]; // 0x75(0x3)
	uint32_t EnterRangeBuffID; // 0x78(0x4)
	uint32_t ScanCountBuffID; // 0x7C(0x4)
	EScoreName ScoreName; // 0x80(0x4)
	struct FName MarkerHudViewName; // 0x84(0x8)
	uint8_t Pad_0x8C[0x4]; // 0x8C(0x4)
	struct FString VO_ScanLessThan3; // 0x90(0x10)
	struct FString VO_ScanMoreThan3; // 0xA0(0x10)
	struct FString VO_MarkEnemy; // 0xB0(0x10)
	float VO_CoolDownTime; // 0xC0(0x4)
	struct FName WaterInteractRippleEffectId; // 0xC4(0x8)
	struct FName SilenceLoopAudioName; // 0xCC(0x8)
	struct FName PreScanAudioName; // 0xD4(0x8)
	struct FName ScanAudioName; // 0xDC(0x8)
	struct FName NewCharacterMarkerAudio; // 0xE4(0x8)
	uint8_t Pad_0xEC[0x4]; // 0xEC(0x4)
};

// Object: ScriptStruct DFMAbility.DetectItem
// Size: 0x10 (Inherited: 0x0)
struct FDetectItem
{
	struct ADFMCharacter* CHARACTER; // 0x0(0x8)
	float DetectTime; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityDataBase
// Size: 0x10 (Inherited: 0x1)
struct FAbilityDataBase : FAbilityFragment
{
	int32_t skillEntityIndex; // 0x0(0x4)
	int32_t LogicID; // 0x4(0x4)
	struct TWeakObjectPtr<struct UQA_AbilityLogicTask> QA; // 0x8(0x8)
};

// Object: ScriptStruct DFMAbility.AbilityDefaultData
// Size: 0x14 (Inherited: 0x10)
struct FAbilityDefaultData : FAbilityDataBase
{
	uint8_t ClientTrigger : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
};

// Object: ScriptStruct DFMAbility.MarkerEffectData
// Size: 0x8 (Inherited: 0x0)
struct FMarkerEffectData
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
};

// Object: ScriptStruct DFMAbility.DiffuseAreaClientCell
// Size: 0x30 (Inherited: 0x0)
struct FDiffuseAreaClientCell
{
	uint8_t bIsActive : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float MaxHeight; // 0x4(0x4)
	struct FVector BaseLocation; // 0x8(0xC)
	float BaseYaw; // 0x14(0x4)
	int32_t EffectHandleIndex; // 0x18(0x4)
	int32_t EffectUid; // 0x1C(0x4)
	struct UFXResourceContainerComponent* Effect; // 0x20(0x8)
	struct UMeshComponent* Mesh; // 0x28(0x8)
};

// Object: ScriptStruct DFMAbility.SyncDiffuseAreaClientCell
// Size: 0x8 (Inherited: 0x0)
struct FSyncDiffuseAreaClientCell
{
	int32_t Index; // 0x0(0x4)
	float MaxHeight; // 0x4(0x4)
};

// Object: ScriptStruct DFMAbility.DiffuseAreaCell
// Size: 0x30 (Inherited: 0x0)
struct FDiffuseAreaCell
{
	int32_t X; // 0x0(0x4)
	int32_t Y; // 0x4(0x4)
	float DamageHeight; // 0x8(0x4)
	float DiffuseHeight; // 0xC(0x4)
	struct FVector Location; // 0x10(0xC)
	struct FVector Normal; // 0x1C(0xC)
	float ExtinguishTime; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct DFMAbility.DFMAbilityArrowData
// Size: 0x38 (Inherited: 0x0)
struct FDFMAbilityArrowData
{
	EDFMGamePlayMode GameMode; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float CheckRadius; // 0x4(0x4)
	float CheckRadiusInWater; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	int64_t AttackValueId; // 0x10(0x8)
	int64_t AttackValueIdInWater; // 0x18(0x8)
	int64_t BarbedWireAttackValueId; // 0x20(0x8)
	int32_t BarbedWireAddBuffId; // 0x28(0x4)
	uint8_t bBarbedWireAttackHitSelf : 1; // 0x2C(0x1), Mask(0x1)
	uint8_t BitPad_0x2C_1 : 7; // 0x2C(0x1)
	uint8_t Pad_0x2D[0x3]; // 0x2D(0x3)
	float MakeDamageInterval; // 0x30(0x4)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityFunctionData
// Size: 0x18 (Inherited: 0x10)
struct FAbilityFunctionData : FAbilityDataBase
{
	struct FName Name; // 0x10(0x8)
};

// Object: ScriptStruct DFMAbility.AbilityTempalteLoadData
// Size: 0x18 (Inherited: 0x0)
struct FAbilityTempalteLoadData
{
	struct TArray<int32_t> SkillEntityIndexs; // 0x0(0x10)
	uint64_t LoadHandler; // 0x10(0x8)
};

// Object: ScriptStruct DFMAbility.AbilityTemplateRepData
// Size: 0x2C0 (Inherited: 0x0)
struct FAbilityTemplateRepData
{
	int32_t SkillId; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FAbilityTaskRepData> NodeData; // 0x8(0x10)
	uint8_t bUseDsRepData : 1; // 0x18(0x1), Mask(0x1)
	uint8_t BitPad_0x18_1 : 7; // 0x18(0x1)
	uint8_t bClientPredict : 1; // 0x19(0x1), Mask(0x1)
	uint8_t BitPad_0x19_1 : 7; // 0x19(0x1)
	uint8_t Pad_0x1A[0x6]; // 0x1A(0x6)
	struct TArray<struct FName> NodeNoCheckTime; // 0x20(0x10)
	struct TMap<struct FName, ENodeCantPlay> NodeCantPlayMap; // 0x30(0x50)
	struct TArray<struct FName> OverrideParams; // 0x80(0x10)
	struct TMap<struct FName, EAbilityStateFlag> LogicFlags; // 0x90(0x50)
	struct TMap<struct FName, EAbilityNodeExcuteType> LogicExcuteType; // 0xE0(0x50)
	struct TMap<ESkillBehavior, struct FSkillBehaviorData> SkillBehaviorMap; // 0x130(0x50)
	struct TMap<ESkillBehavior, struct FSkillBehaviorData> SkillBehaviorMapBase; // 0x180(0x50)
	struct TMap<ESkillBtnCall, struct FSkillBtnCallData> BehaviorGroupMap; // 0x1D0(0x50)
	struct TMap<ESkillBtnCall, struct FSkillBtnCallData> BehaviorGroupMapBase; // 0x220(0x50)
	struct TMap<EFSMGamePlayStatusDefine, int32_t> FSMStatusMapBase; // 0x270(0x50)
};

// Object: ScriptStruct DFMAbility.AbilityTaskRepData
// Size: 0x40 (Inherited: 0x0)
struct FAbilityTaskRepData
{
	struct FString ClassPath; // 0x0(0x10)
	struct FString TaskName; // 0x10(0x10)
	struct TArray<uint8_t> BaseData; // 0x20(0x10)
	struct TArray<uint8_t> ParamData; // 0x30(0x10)
};

// Object: ScriptStruct DFMAbility.DefenseConfig
// Size: 0x20 (Inherited: 0x0)
struct FDefenseConfig
{
	struct TArray<int32_t> BuffAdds; // 0x0(0x10)
	float HorizontalDistance; // 0x10(0x4)
	float VerticalDistance; // 0x14(0x4)
	float CheckInterval; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct DFMAbility.EnginVehicleChargingData
// Size: 0xC (Inherited: 0x0)
struct FEnginVehicleChargingData
{
	uint8_t HasVehicleRecycle : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float VehicleHealthPercent; // 0x4(0x4)
	float VehiclePowerPercent; // 0x8(0x4)
};

// Object: ScriptStruct DFMAbility.MauriceAuraConfig
// Size: 0x20 (Inherited: 0x0)
struct FMauriceAuraConfig
{
	float radius; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FMauriceAuraBuffByCount> BuffsByCount; // 0x8(0x10)
	uint8_t Pad_0x18[0x8]; // 0x18(0x8)
};

// Object: ScriptStruct DFMAbility.MauriceAuraBuffByCount
// Size: 0x18 (Inherited: 0x0)
struct FMauriceAuraBuffByCount
{
	int32_t MinCount; // 0x0(0x4)
	int32_t MaxCount; // 0x4(0x4)
	struct TArray<int32_t> BuffIds; // 0x8(0x10)
};

// Object: ScriptStruct DFMAbility.LevelAbilityActorInfo
// Size: 0x18 (Inherited: 0x0)
struct FLevelAbilityActorInfo
{
	uint64_t ID; // 0x0(0x8)
	int32_t CampId; // 0x8(0x4)
	int32_t TeamID; // 0xC(0x4)
	int32_t HP; // 0x10(0x4)
	int32_t CustomValue; // 0x14(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityProjectilData
// Size: 0x28 (Inherited: 0x0)
struct FAbilityProjectilData
{
	int32_t UpdateCount; // 0x0(0x4)
	struct FVector Velocity; // 0x4(0xC)
	struct FVector pos; // 0x10(0xC)
	struct FRotator Rot; // 0x1C(0xC)
};

// Object: ScriptStruct DFMAbility.AbilityMontageLoadHadnle
// Size: 0x10 (Inherited: 0x0)
struct FAbilityMontageLoadHadnle
{
	struct TArray<struct FAbilityMontageLoadData> LoadDatas; // 0x0(0x10)
};

// Object: ScriptStruct DFMAbility.AbilityMontageLoadData
// Size: 0x14 (Inherited: 0x0)
struct FAbilityMontageLoadData
{
	int32_t skillEntityIndex; // 0x0(0x4)
	struct TWeakObjectPtr<struct USkeletalMeshComponent> InSkeletalMeshComponent; // 0x4(0x8)
	float PlayRate; // 0xC(0x4)
	float StartingPosition; // 0x10(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityParticleSmokeWallParam
// Size: 0x1C (Inherited: 0x0)
struct FAbilityParticleSmokeWallParam
{
	int32_t MaterialIndex; // 0x0(0x4)
	struct FName ParamName; // 0x4(0x8)
	float StartValue; // 0xC(0x4)
	float EndValue; // 0x10(0x4)
	float DelayTime; // 0x14(0x4)
	float FadeOutTime; // 0x18(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityMineDataFX
// Size: 0x210 (Inherited: 0x0)
struct FAbilityMineDataFX
{
	uint8_t Pad_0x0[0x200]; // 0x0(0x200)
	struct UFXResourceContainerComponent* FXComp; // 0x200(0x8)
	int32_t ExplosionFXCompHandle; // 0x208(0x4)
	uint8_t Pad_0x20C[0x4]; // 0x20C(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityMineExplosionEffectConfig
// Size: 0x278 (Inherited: 0x0)
struct FAbilityMineExplosionEffectConfig
{
	struct TSoftObjectPtr<UGPAudioEventAsset> ExplosionAudio; // 0x0(0x28)
	struct FName ExplosionEffectId; // 0x28(0x8)
	uint64_t ExplosionEffectFXId; // 0x30(0x8)
	struct FAbilityMineDataFX MineDataFX; // 0x38(0x210)
	struct FVector ExplosionOffset; // 0x248(0xC)
	struct FRotator ExplosionRot; // 0x254(0xC)
	struct FVector ExplosionScale; // 0x260(0xC)
	struct FName HitDecalId; // 0x26C(0x8)
	uint8_t Pad_0x274[0x4]; // 0x274(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityPlayMontageRowData
// Size: 0xA4 (Inherited: 0x0)
struct FAbilityPlayMontageRowData
{
	struct FName AnimKey; // 0x0(0x8)
	float AnimRate; // 0x8(0x4)
	EAnimationPlayType AnimationPlayType; // 0xC(0x1)
	EAnimationPlayType AnimationPlayType3P; // 0xD(0x1)
	uint8_t bUse3PPlayType : 1; // 0xE(0x1), Mask(0x1)
	uint8_t BitPad_0xE_1 : 7; // 0xE(0x1)
	uint8_t Pad_0xF[0x1]; // 0xF(0x1)
	int32_t LoopCount; // 0x10(0x4)
	uint8_t Loop : 1; // 0x14(0x1), Mask(0x1)
	uint8_t BitPad_0x14_1 : 7; // 0x14(0x1)
	uint8_t ThreeAction : 1; // 0x15(0x1), Mask(0x1)
	uint8_t BitPad_0x15_1 : 7; // 0x15(0x1)
	uint8_t Pad_0x16[0x2]; // 0x16(0x2)
	float ThreeActionTime; // 0x18(0x4)
	uint8_t UseLeftHandAnim : 1; // 0x1C(0x1), Mask(0x1)
	uint8_t BitPad_0x1C_1 : 7; // 0x1C(0x1)
	uint8_t UseLeftHandAnimUpdatePose : 1; // 0x1D(0x1), Mask(0x1)
	uint8_t BitPad_0x1D_1 : 7; // 0x1D(0x1)
	uint8_t ForbiddenLeftHandAnim : 1; // 0x1E(0x1), Mask(0x1)
	uint8_t BitPad_0x1E_1 : 7; // 0x1E(0x1)
	uint8_t InVehicleIgnoreLeanPose : 1; // 0x1F(0x1), Mask(0x1)
	uint8_t BitPad_0x1F_1 : 7; // 0x1F(0x1)
	uint8_t bForbidHandIKWhenWeaponInactive : 1; // 0x20(0x1), Mask(0x1)
	uint8_t BitPad_0x20_1 : 7; // 0x20(0x1)
	uint8_t Pad_0x21[0x3]; // 0x21(0x3)
	struct FName Notify; // 0x24(0x8)
	struct FName Notify2; // 0x2C(0x8)
	struct FName Notify3; // 0x34(0x8)
	float BlendIn; // 0x3C(0x4)
	float BlendOut; // 0x40(0x4)
	uint8_t bStopAllMontange : 1; // 0x44(0x1), Mask(0x1)
	uint8_t BitPad_0x44_1 : 7; // 0x44(0x1)
	uint8_t bPlayEndEquip : 1; // 0x45(0x1), Mask(0x1)
	uint8_t BitPad_0x45_1 : 7; // 0x45(0x1)
	uint8_t bMotionAddEndSection : 1; // 0x46(0x1), Mask(0x1)
	uint8_t BitPad_0x46_1 : 7; // 0x46(0x1)
	uint8_t Pad_0x47[0x1]; // 0x47(0x1)
	int32_t AnimationPlayIndex; // 0x48(0x4)
	uint8_t WeaponEquipAnim : 1; // 0x4C(0x1), Mask(0x1)
	uint8_t BitPad_0x4C_1 : 7; // 0x4C(0x1)
	EInteractiveGetWeaponType GetWeaponType; // 0x4D(0x1)
	EInteractivePutWeaponType PutWeaponType; // 0x4E(0x1)
	uint8_t Pad_0x4F[0x1]; // 0x4F(0x1)
	float GetWeaponEquipBlendIn; // 0x50(0x4)
	float GetWeaponEquipBlendOut; // 0x54(0x4)
	uint8_t bGetStopAll : 1; // 0x58(0x1), Mask(0x1)
	uint8_t BitPad_0x58_1 : 7; // 0x58(0x1)
	uint8_t bNextFrameVisible : 1; // 0x59(0x1), Mask(0x1)
	uint8_t BitPad_0x59_1 : 7; // 0x59(0x1)
	uint8_t Pad_0x5A[0x2]; // 0x5A(0x2)
	float fGetStopTimer; // 0x5C(0x4)
	float PutWeaponEquipBlendOut; // 0x60(0x4)
	float PutWeaponPreTime; // 0x64(0x4)
	int32_t QuietEquipSlot; // 0x68(0x4)
	struct FName AnimMeshName; // 0x6C(0x8)
	int32_t AnimMeshIndex; // 0x74(0x4)
	int32_t AnimMeshStopIndex; // 0x78(0x4)
	struct FName EndSpawnActorNotifyEvent; // 0x7C(0x8)
	uint8_t bEnable3POverrideConfig : 1; // 0x84(0x1), Mask(0x1)
	uint8_t BitPad_0x84_1 : 7; // 0x84(0x1)
	uint8_t Pad_0x85[0x3]; // 0x85(0x3)
	float AnimTimeOffset3P; // 0x88(0x4)
	EInteractiveGetWeaponType GetWeaponType3p; // 0x8C(0x1)
	EInteractivePutWeaponType PutWeaponType3p; // 0x8D(0x1)
	uint8_t bEnableSwimOverrideConfig : 1; // 0x8E(0x1), Mask(0x1)
	uint8_t BitPad_0x8E_1 : 7; // 0x8E(0x1)
	EInteractiveGetWeaponType GetWeaponTypeSwim; // 0x8F(0x1)
	uint8_t bStopLeftHandlAnim : 1; // 0x90(0x1), Mask(0x1)
	uint8_t BitPad_0x90_1 : 7; // 0x90(0x1)
	uint8_t bAnimCallbackStopAllLastMontage : 1; // 0x91(0x1), Mask(0x1)
	uint8_t BitPad_0x91_1 : 7; // 0x91(0x1)
	uint8_t ShowFPPLowerMesh : 1; // 0x92(0x1), Mask(0x1)
	uint8_t BitPad_0x92_1 : 7; // 0x92(0x1)
	uint8_t Pad_0x93[0x1]; // 0x93(0x1)
	struct FName UnNormalBreakMeshName; // 0x94(0x8)
	uint8_t bForbitLeftAnim : 1; // 0x9C(0x1), Mask(0x1)
	uint8_t BitPad_0x9C_1 : 7; // 0x9C(0x1)
	uint8_t Pad_0x9D[0x3]; // 0x9D(0x3)
	float DontPlayOverrtime; // 0xA0(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityPlayMontageData
// Size: 0x828 (Inherited: 0x780)
struct FAbilityPlayMontageData : FCharacterPlayMontageData
{
	struct FAbilityPlayMontageRowData RowData; // 0x780(0xA4)
	uint8_t Pad_0x824[0x4]; // 0x824(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityMontageSystemData
// Size: 0xC0 (Inherited: 0x10)
struct FAbilityMontageSystemData : FAbilityDataBase
{
	struct TMap<uint32_t, struct UAnimMontage*> InMontageFPP; // 0x10(0x50)
	struct TMap<uint32_t, struct UAnimMontage*> InMontageTPP; // 0x60(0x50)
	struct FRotator Rotator; // 0xB0(0xC)
	uint8_t Pad_0xBC[0x4]; // 0xBC(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityMontageTaskData
// Size: 0x98 (Inherited: 0x10)
struct FAbilityMontageTaskData : FAbilityDataBase
{
	struct FTimerHandle UnEquipAnimTimer; // 0x10(0x8)
	struct FTimerHandle EquipAnimTimer; // 0x18(0x8)
	struct FTimerHandle AnimTimer; // 0x20(0x8)
	struct FTimerHandle NotifyTimer; // 0x28(0x8)
	struct FTimerHandle Notify2Timer; // 0x30(0x8)
	struct FTimerHandle Notify3Timer; // 0x38(0x8)
	struct FTimerHandle StopAnimTimer; // 0x40(0x8)
	struct TArray<struct FAbilityMontageLockNotifyData> LockTimer; // 0x48(0x10)
	struct TArray<struct FAbilityMontageVisibleNotifyData> VisibleTimer; // 0x58(0x10)
	struct TWeakObjectPtr<struct UAnimMontage> EndedDelegateMontage; // 0x68(0x8)
	uint8_t Pad_0x70[0x10]; // 0x70(0x10)
	struct TWeakObjectPtr<struct UAnimMontage> UnEquipMontage; // 0x80(0x8)
	uint8_t Pad_0x88[0x10]; // 0x88(0x10)
};

// Object: ScriptStruct DFMAbility.AbilityMontageVisibleNotifyData
// Size: 0x18 (Inherited: 0x0)
struct FAbilityMontageVisibleNotifyData
{
	struct FTimerHandle NotifyTimer; // 0x0(0x8)
	int32_t SkillId; // 0x8(0x4)
	uint8_t MeshVisible : 1; // 0xC(0x1), Mask(0x1)
	uint8_t BitPad_0xC_1 : 7; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	struct FName MeshName; // 0x10(0x8)
};

// Object: ScriptStruct DFMAbility.AbilityMontageLockNotifyData
// Size: 0x30 (Inherited: 0x0)
struct FAbilityMontageLockNotifyData
{
	struct FTimerHandle NotifyTimer; // 0x0(0x8)
	struct TArray<ECharacterStateMask> LockStateAbilitys; // 0x8(0x10)
	struct TArray<ECharacterStateMask> UnLockStateAbilitys; // 0x18(0x10)
	uint8_t ReleaseLock : 1; // 0x28(0x1), Mask(0x1)
	uint8_t BitPad_0x28_1 : 7; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
};

// Object: ScriptStruct DFMAbility.AbilityPreviewActorData
// Size: 0x58 (Inherited: 0x10)
struct FAbilityPreviewActorData : FAbilityDataBase
{
	struct AActor* Actor; // 0x10(0x8)
	struct FVector StartLocation; // 0x18(0xC)
	struct FVector LaunchVelocity; // 0x24(0xC)
	struct TArray<struct AActor*> LineCubePool; // 0x30(0x10)
	struct TArray<struct AActor*> LineCubePool2; // 0x40(0x10)
	float NextDrawTime; // 0x50(0x4)
	uint8_t Pad_0x54[0x4]; // 0x54(0x4)
};

// Object: ScriptStruct DFMAbility.DFMAbilityAdvanceScanTracePathItem
// Size: 0x18 (Inherited: 0x0)
struct FDFMAbilityAdvanceScanTracePathItem
{
	struct FVector Point; // 0x0(0xC)
	int32_t StartIndex; // 0xC(0x4)
	struct ADFMCharacter* Target; // 0x10(0x8)
};

// Object: ScriptStruct DFMAbility.DFMAbilityAdvanceScanItem
// Size: 0x18 (Inherited: 0x0)
struct FDFMAbilityAdvanceScanItem
{
	struct ADFMCharacter* Target; // 0x0(0x8)
	struct TArray<struct FVector> Paths; // 0x8(0x10)
};

// Object: ScriptStruct DFMAbility.SmokeStateArray
// Size: 0x118 (Inherited: 0x108)
struct FSmokeStateArray : FFastArraySerializer
{
	struct TArray<struct FSmokeStateItem> Items; // 0x108(0x10)
};

// Object: ScriptStruct DFMAbility.SmokeStateItem
// Size: 0x30 (Inherited: 0xC)
struct FSmokeStateItem : FFastArraySerializerItem
{
	ESmokeState CurrentSmokeState; // 0xC(0x1)
	ESmokeState LastSmokeState; // 0xD(0x1)
	uint8_t Pad_0xE[0x2]; // 0xE(0x2)
	int32_t ExtinguishBoxIndex; // 0x10(0x4)
	struct FBox SmokeBox; // 0x14(0x1C)
};

// Object: ScriptStruct DFMAbility.AbilityDeformableSmokeBox
// Size: 0xCC (Inherited: 0x0)
struct FAbilityDeformableSmokeBox
{
	uint8_t Pad_0x0[0xCC]; // 0x0(0xCC)
};

// Object: ScriptStruct DFMAbility.AbilityLeaveStateData
// Size: 0x1C (Inherited: 0x10)
struct FAbilityLeaveStateData : FAbilityDataBase
{
	struct FName StateName; // 0x10(0x8)
	EAbilityTriggerType Trigger; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
};

// Object: ScriptStruct DFMAbility.AbilityStateData
// Size: 0x18 (Inherited: 0x10)
struct FAbilityStateData : FAbilityDataBase
{
	struct FName StateName; // 0x10(0x8)
};

// Object: ScriptStruct DFMAbility.DFMAbilitySubTitleConfig
// Size: 0x78 (Inherited: 0x10)
struct FDFMAbilitySubTitleConfig : FDescRowBase
{
	struct FName SubtitleName; // 0x10(0x8)
	struct FText SpeakerName; // 0x18(0x18)
	struct FText NonePOISubtitle; // 0x30(0x18)
	struct FText POISubtitleFormatString; // 0x48(0x18)
	float SubtitleDuration; // 0x60(0x4)
	uint8_t SubtitlePriority; // 0x64(0x1)
	uint8_t bOverrideSamePriority : 1; // 0x65(0x1), Mask(0x1)
	uint8_t BitPad_0x65_1 : 7; // 0x65(0x1)
	uint8_t bPlayVO : 1; // 0x66(0x1), Mask(0x1)
	uint8_t BitPad_0x66_1 : 7; // 0x66(0x1)
	uint8_t Pad_0x67[0x1]; // 0x67(0x1)
	struct UGPAudioEventAsset* VOEvent; // 0x68(0x8)
	EGPAudioBlueprintType VOType; // 0x70(0x1)
	uint8_t Pad_0x71[0x3]; // 0x71(0x3)
	float MaxPlayVODistance; // 0x74(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityTimerHandle
// Size: 0x18 (Inherited: 0x10)
struct FAbilityTimerHandle : FAbilityDataBase
{
	struct FTimerHandle TimerHandle; // 0x10(0x8)
};

// Object: ScriptStruct DFMAbility.AbilityThrowBlockingSpawnMaterialParameter
// Size: 0x10 (Inherited: 0x0)
struct FAbilityThrowBlockingSpawnMaterialParameter
{
	struct FName ParamName; // 0x0(0x8)
	struct UCurveFloat* ParamCurve; // 0x8(0x8)
};

// Object: ScriptStruct DFMAbility.AbilityThrowBlockingData
// Size: 0x30 (Inherited: 0x0)
struct FAbilityThrowBlockingData
{
	struct TArray<EBuffGameRole> AllGameRoles; // 0x0(0x10)
	float MainPartMaxHP; // 0x10(0x4)
	float EdgePartMaxHP; // 0x14(0x4)
	float RadialDamageRate; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	struct UCurveFloat* HPCurve; // 0x20(0x8)
	float BurningCutHPSpeed; // 0x28(0x4)
	float BurningEdgeDamageRate; // 0x2C(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityVoxelizationValidBoxResult
// Size: 0x10 (Inherited: 0x0)
struct FAbilityVoxelizationValidBoxResult
{
	struct TArray<struct FBox> ValidBoxes; // 0x0(0x10)
};

// Object: ScriptStruct DFMAbility.AbilityVoxelizationResult
// Size: 0x20 (Inherited: 0x0)
struct FAbilityVoxelizationResult
{
	struct TArray<uint8_t> VoxelOccupancy; // 0x0(0x10)
	struct FIntVector GridDimensions; // 0x10(0xC)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityVoxelizationParams
// Size: 0x70 (Inherited: 0x0)
struct FAbilityVoxelizationParams
{
	struct FIntVector GridDimensions; // 0x0(0xC)
	struct FVector Location; // 0xC(0xC)
	uint8_t Pad_0x18[0x8]; // 0x18(0x8)
	struct FQuat Rotation; // 0x20(0x10)
	struct FVector Extent; // 0x30(0xC)
	float VoxelSize; // 0x3C(0x4)
	float BigBoxSize; // 0x40(0x4)
	struct FBox WorldBounds; // 0x44(0x1C)
	struct TWeakObjectPtr<struct APawn> Owner; // 0x60(0x8)
	uint8_t Pad_0x68[0x8]; // 0x68(0x8)
};

// Object: ScriptStruct DFMAbility.DFMAbilityC202KnifeData
// Size: 0x30 (Inherited: 0x0)
struct FDFMAbilityC202KnifeData
{
	EDFMGamePlayMode GameMode; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	int64_t AttackValueId; // 0x8(0x8)
	int32_t EMPBuffID; // 0x10(0x4)
	float EMPRange; // 0x14(0x4)
	float EMPWorkRange; // 0x18(0x4)
	float EMPEffectTime; // 0x1C(0x4)
	float PrepareEMPTime; // 0x20(0x4)
	uint8_t bNeedMarker : 1; // 0x24(0x1), Mask(0x1)
	uint8_t BitPad_0x24_1 : 7; // 0x24(0x1)
	uint8_t bNeedTracing : 1; // 0x25(0x1), Mask(0x1)
	uint8_t BitPad_0x25_1 : 7; // 0x25(0x1)
	uint8_t Pad_0x26[0x2]; // 0x26(0x2)
	float MarkEnenmyRange; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct DFMAbility.KnifeDrawPathData
// Size: 0x20 (Inherited: 0x0)
struct FKnifeDrawPathData
{
	struct TWeakObjectPtr<struct AActor> TargetChar; // 0x0(0x8)
	struct FVector PathStartPos; // 0x8(0xC)
	struct FVector PathEndPos; // 0x14(0xC)
};

// Object: ScriptStruct DFMAbility.AIMultiPatrolTimeSequence
// Size: 0x40 (Inherited: 0x10)
struct FAIMultiPatrolTimeSequence : FDescRowBase
{
	int32_t Minute; // 0x10(0x4)
	int32_t Second; // 0x14(0x4)
	struct FString PathSequence; // 0x18(0x10)
	int32_t AllSeconds; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
	struct TArray<struct FAIMultiPatrolDataBase> PathSeq; // 0x30(0x10)
};

// Object: ScriptStruct DFMAbility.AIMultiPatrolDataBase
// Size: 0x28 (Inherited: 0x0)
struct FAIMultiPatrolDataBase
{
	struct FVector Location; // 0x0(0xC)
	struct FRotator Rotation; // 0xC(0xC)
	int32_t uid; // 0x18(0x4)
	int32_t ParentUid; // 0x1C(0x4)
	float StayTime; // 0x20(0x4)
	EGroupPatrolPose PatrolPose; // 0x24(0x1)
	EPatrolType PatrolType; // 0x25(0x1)
	EAIPatrolPointType Type; // 0x26(0x1)
	uint8_t Pad_0x27[0x1]; // 0x27(0x1)
};

// Object: ScriptStruct DFMAbility.AIMultiPatrolConfig
// Size: 0x10 (Inherited: 0x0)
struct FAIMultiPatrolConfig
{
	struct UDataTable* DataTable; // 0x0(0x8)
	int32_t Wight; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct DFMAbility.AIMultiPatrolTransientData
// Size: 0x30 (Inherited: 0x0)
struct FAIMultiPatrolTransientData
{
	int32_t NextPointUid; // 0x0(0x4)
	int32_t CurrentPointUid; // 0x4(0x4)
	int32_t SeatIndex; // 0x8(0x4)
	uint8_t FrontType; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	struct TArray<struct FAIMultiPatrolDataBase> CurrentPathSeq; // 0x10(0x10)
	struct TArray<struct FAIMultiPatrolDataBase> CurrentPathPointSeq; // 0x20(0x10)
};

// Object: ScriptStruct DFMAbility.AIMultiPatrolSection
// Size: 0x40 (Inherited: 0x28)
struct FAIMultiPatrolSection : FAIMultiPatrolDataBase
{
	struct FName SectionName; // 0x28(0x8)
	struct TArray<struct FAIMultiPatrolPath> Paths; // 0x30(0x10)
};

// Object: ScriptStruct DFMAbility.AIMultiPatrolPath
// Size: 0x40 (Inherited: 0x28)
struct FAIMultiPatrolPath : FAIMultiPatrolDataBase
{
	struct FName PathName; // 0x28(0x8)
	struct TArray<struct FAIMultiPatrolPoint> Points; // 0x30(0x10)
};

// Object: ScriptStruct DFMAbility.AIMultiPatrolPoint
// Size: 0x38 (Inherited: 0x28)
struct FAIMultiPatrolPoint : FAIMultiPatrolDataBase
{
	struct TArray<struct FAIMultiPatrolSubPoint> SubPoints; // 0x28(0x10)
};

// Object: ScriptStruct DFMAbility.AIMultiPatrolSubPoint
// Size: 0x2C (Inherited: 0x28)
struct FAIMultiPatrolSubPoint : FAIMultiPatrolDataBase
{
	int32_t SeatIndex; // 0x28(0x4)
};

// Object: ScriptStruct DFMAbility.C204EMPTakerItem
// Size: 0x18 (Inherited: 0x0)
struct FC204EMPTakerItem
{
	struct AActor* EmpTaker; // 0x0(0x8)
	int32_t uid; // 0x8(0x4)
	float Distance; // 0xC(0x4)
	int32_t Priority; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct DFMAbility.VehicleBoss04SkillState
// Size: 0x10 (Inherited: 0x0)
struct FVehicleBoss04SkillState
{
	EVehicleBoss04FireMode FireMode; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float FireDelta; // 0x4(0x4)
	float PreTime; // 0x8(0x4)
	float PostTime; // 0xC(0x4)
};

// Object: ScriptStruct DFMAbility.VehicleBoss04WeaponInfo
// Size: 0xD0 (Inherited: 0x0)
struct FVehicleBoss04WeaponInfo
{
	uint8_t bEnable : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	EVehicleBoss04WeaponType WeaponType; // 0x1(0x1)
	uint8_t Pad_0x2[0x6]; // 0x2(0x6)
	struct TArray<struct FName> FireSockets; // 0x8(0x10)
	struct FVector SocketOffset; // 0x18(0xC)
	float FireDelta; // 0x24(0x4)
	float FireRange; // 0x28(0x4)
	int32_t AttackId; // 0x2C(0x4)
	float PreTime; // 0x30(0x4)
	float PostTime; // 0x34(0x4)
	struct TArray<struct FVehicleBoss04WeaponFXInfo> FireFX; // 0x38(0x10)
	uint64_t HitFXId; // 0x48(0x8)
	struct TArray<struct FVehicleBoss04TrailFXInfo> TrailFX; // 0x50(0x10)
	struct TArray<struct FVehicleBoss04SoundInfo> SoundConf; // 0x60(0x10)
	float Speed; // 0x70(0x4)
	float MaxDis; // 0x74(0x4)
	struct TSoftObjectPtr<UStaticMesh> MissleModel; // 0x78(0x28)
	struct FVector ModelScale; // 0xA0(0xC)
	uint8_t bMobileUseTrail : 1; // 0xAC(0x1), Mask(0x1)
	uint8_t BitPad_0xAC_1 : 7; // 0xAC(0x1)
	uint8_t Pad_0xAD[0x3]; // 0xAD(0x3)
	struct FLinearColor MobileColor; // 0xB0(0x10)
	float MobileThinkness; // 0xC0(0x4)
	int32_t BulletMaxNum; // 0xC4(0x4)
	float EffectPossibility; // 0xC8(0x4)
	uint8_t Pad_0xCC[0x4]; // 0xCC(0x4)
};

// Object: ScriptStruct DFMAbility.VehicleBoss04SoundInfo
// Size: 0xC (Inherited: 0x0)
struct FVehicleBoss04SoundInfo
{
	struct FName SoundName; // 0x0(0x8)
	uint8_t bAttachToBullet : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
};

// Object: ScriptStruct DFMAbility.VehicleBoss04TrailFXInfo
// Size: 0x5C (Inherited: 0x0)
struct FVehicleBoss04TrailFXInfo
{
	uint8_t bIsReal : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct FName FXName; // 0x4(0x8)
	struct FName MobileFXNameOverride; // 0xC(0x8)
	struct FVector offset; // 0x14(0xC)
	struct FVector Scale; // 0x20(0xC)
	struct FRotator Rot; // 0x2C(0xC)
	struct FVector MOffset; // 0x38(0xC)
	struct FVector MScale; // 0x44(0xC)
	struct FRotator MRot; // 0x50(0xC)
};

// Object: ScriptStruct DFMAbility.VehicleBoss04WeaponFXInfo
// Size: 0x50 (Inherited: 0x0)
struct FVehicleBoss04WeaponFXInfo
{
	struct FName FXName; // 0x0(0x8)
	struct FVector offset; // 0x8(0xC)
	struct FVector Scale; // 0x14(0xC)
	struct FRotator Rot; // 0x20(0xC)
	struct FVector MOffset; // 0x2C(0xC)
	struct FVector MScale; // 0x38(0xC)
	struct FRotator MRot; // 0x44(0xC)
};

// Object: ScriptStruct DFMAbility.VehicleBoss04SoundRuntimeInfo
// Size: 0x290 (Inherited: 0x0)
struct FVehicleBoss04SoundRuntimeInfo
{
	struct FResourceAudioRow ResourceAudioFX; // 0x0(0x210)
	uint8_t bAttachToBullet : 1; // 0x210(0x1), Mask(0x1)
	uint8_t BitPad_0x210_1 : 7; // 0x210(0x1)
	uint8_t Pad_0x211[0x7]; // 0x211(0x7)
	struct FSoftObjectLoader AudioPlaySP; // 0x218(0x18)
	struct FSoftObjectLoader CloseAudioEvent; // 0x230(0x18)
	struct FSoftObjectLoader MedAudioEvent; // 0x248(0x18)
	struct FSoftObjectLoader FarAudioEvent; // 0x260(0x18)
	struct FSoftObjectLoader AudioStopSP; // 0x278(0x18)
};

// Object: ScriptStruct DFMAbility.MovementStateRepData
// Size: 0x1C (Inherited: 0x0)
struct FMovementStateRepData
{
	EStunGrenadeMovementState MovementState; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct FVector_NetQuantize10 ServerPos; // 0x4(0xC)
	struct FVector_NetQuantize10 ServerVelocity; // 0x10(0xC)
};

// Object: ScriptStruct DFMAbility.ScannedCharacterInfo
// Size: 0x8 (Inherited: 0x0)
struct FScannedCharacterInfo
{
	int32_t CharacterGUID; // 0x0(0x4)
	uint8_t bIsLockedTarget : 1; // 0x4(0x1), Mask(0x1)
	uint8_t BitPad_0x4_1 : 7; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
};

// Object: ScriptStruct DFMAbility.StunGrenadeData
// Size: 0x30 (Inherited: 0x0)
struct FStunGrenadeData
{
	EDFMGamePlayMode GameMode; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float TrackingRadius; // 0x4(0x4)
	float StartTrackingTime; // 0x8(0x4)
	float FlyToTargetSpeed; // 0xC(0x4)
	float FreezeValue; // 0x10(0x4)
	uint8_t bIgnoreSelf : 1; // 0x14(0x1), Mask(0x1)
	uint8_t BitPad_0x14_1 : 7; // 0x14(0x1)
	uint8_t bIgnoreTeammate : 1; // 0x15(0x1), Mask(0x1)
	uint8_t BitPad_0x15_1 : 7; // 0x15(0x1)
	uint8_t Pad_0x16[0x2]; // 0x16(0x2)
	float ExplodeRadius; // 0x18(0x4)
	float ExplodeDelay; // 0x1C(0x4)
	struct TArray<int32_t> BuffIds; // 0x20(0x10)
};

// Object: ScriptStruct DFMAbility.FootprintTrackerGroupData
// Size: 0x38 (Inherited: 0x0)
struct FFootprintTrackerGroupData
{
	uint8_t bIsNeedCheck : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bIsStartLeft : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t bIsMainOnly : 1; // 0x2(0x1), Mask(0x1)
	uint8_t BitPad_0x2_1 : 7; // 0x2(0x1)
	uint8_t Pad_0x3[0x1]; // 0x3(0x1)
	float NextCheckTime; // 0x4(0x4)
	int32_t CurrCheckIndex; // 0x8(0x4)
	struct FBox AABBBox; // 0xC(0x1C)
	struct TArray<struct FFootprintTrackerData> Footprints; // 0x28(0x10)
};

// Object: ScriptStruct DFMAbility.FootprintTrackerPlayerData
// Size: 0x88 (Inherited: 0x0)
struct FFootprintTrackerPlayerData
{
	uint8_t bIsNeedCheck : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	uint32_t TickGroupID; // 0x4(0x4)
	struct UInstancedStaticMeshComponent* ISMComponent; // 0x8(0x8)
	struct UInstancedStaticMeshComponent* SearchedISMComponent; // 0x10(0x8)
	struct TArray<struct FFootprintIsmData> ISMDataArray; // 0x18(0x10)
	struct TArray<struct FFootprintIsmData> SearchedISMDataArray; // 0x28(0x10)
	struct TMap<uint32_t, struct FFootprintTrackerGroupData> AllGroupsMap; // 0x38(0x50)
};

// Object: ScriptStruct DFMAbility.FootprintTrackerData
// Size: 0x20 (Inherited: 0x0)
struct FFootprintTrackerData
{
	struct FVector Location; // 0x0(0xC)
	struct FRotator Rotation; // 0xC(0xC)
	uint8_t bNeedTick : 1; // 0x18(0x1), Mask(0x1)
	uint8_t BitPad_0x18_1 : 7; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
	int32_t bIsShow; // 0x1C(0x4)
};

// Object: ScriptStruct DFMAbility.FootprintIsmData
// Size: 0xC (Inherited: 0x0)
struct FFootprintIsmData
{
	uint32_t GroupID; // 0x0(0x4)
	int32_t Index; // 0x4(0x4)
	uint8_t bNeedTick : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
};

// Object: ScriptStruct DFMAbility.ListenRangePoint
// Size: 0x8 (Inherited: 0x0)
struct FListenRangePoint
{
	float BaseRange; // 0x0(0x4)
	float RangeCoeff; // 0x4(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityAttachMeshLoadHadnle
// Size: 0x18 (Inherited: 0x0)
struct FAbilityAttachMeshLoadHadnle
{
	struct TArray<struct FAbilityAttachMeshLoadData> LoadDatas; // 0x0(0x10)
	int32_t LoadType; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityAttachMeshLoadData
// Size: 0x10 (Inherited: 0x0)
struct FAbilityAttachMeshLoadData
{
	int32_t skillEntityIndex; // 0x0(0x4)
	struct FName MeshName; // 0x4(0x8)
	int32_t MaterialIndex; // 0xC(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityAttachMeshTaskData
// Size: 0x20 (Inherited: 0x10)
struct FAbilityAttachMeshTaskData : FAbilityDataBase
{
	struct FTimerHandle TimerHandle; // 0x10(0x8)
	struct FTimerHandle NotifyTimer; // 0x18(0x8)
};

// Object: ScriptStruct DFMAbility.AbilityAttachMeshAnimData
// Size: 0x160 (Inherited: 0x0)
struct FAbilityAttachMeshAnimData
{
	struct FName ItemMeshKey; // 0x0(0x8)
	struct FName ItemMeshPartKey; // 0x8(0x8)
	struct TSoftObjectPtr<USkeletalMesh> ItemMeshPath; // 0x10(0x28)
	struct TSoftObjectPtr<USkeletalMesh> ItemMeshPath3P; // 0x38(0x28)
	struct TSoftObjectPtr<UAnimSequenceBase> AnimSeqPath; // 0x60(0x28)
	float AnimRate; // 0x88(0x4)
	uint8_t Loop : 1; // 0x8C(0x1), Mask(0x1)
	uint8_t BitPad_0x8C_1 : 7; // 0x8C(0x1)
	uint8_t Pad_0x8D[0x3]; // 0x8D(0x3)
	struct FName SocketName; // 0x90(0x8)
	struct FName SocketName_3P; // 0x98(0x8)
	struct FVector AttachRelativeLocation; // 0xA0(0xC)
	struct FVector AttachRelativeScale3D; // 0xAC(0xC)
	struct FRotator AttachRelativeRotator; // 0xB8(0xC)
	struct FName MeshName; // 0xC4(0x8)
	uint8_t SetMeshVisible : 1; // 0xCC(0x1), Mask(0x1)
	uint8_t BitPad_0xCC_1 : 7; // 0xCC(0x1)
	uint8_t MeshVisible : 1; // 0xCD(0x1), Mask(0x1)
	uint8_t BitPad_0xCD_1 : 7; // 0xCD(0x1)
	uint8_t Pad_0xCE[0x2]; // 0xCE(0x2)
	struct FName ParentMeshName; // 0xD0(0x8)
	struct FName Notify; // 0xD8(0x8)
	struct TSoftObjectPtr<UGPAudioEventAsset> ItemMeshAudioPath; // 0xE0(0x28)
	EGPAudioBlueprintType ItemMeshAudioType; // 0x108(0x1)
	uint8_t bIsBPAnim : 1; // 0x109(0x1), Mask(0x1)
	uint8_t BitPad_0x109_1 : 7; // 0x109(0x1)
	uint8_t Pad_0x10A[0x2]; // 0x10A(0x2)
	int32_t BPAnimIndex; // 0x10C(0x4)
	uint8_t PreLoad : 1; // 0x110(0x1), Mask(0x1)
	uint8_t BitPad_0x110_1 : 7; // 0x110(0x1)
	uint8_t Pad_0x111[0x3]; // 0x111(0x3)
	struct FName EffectId; // 0x114(0x8)
	struct FName EffectSocketName; // 0x11C(0x8)
	struct FVector EffectRelativeLocation; // 0x124(0xC)
	struct FVector EffectRelativeScale3D; // 0x130(0xC)
	struct FRotator EffectRelativeRotator; // 0x13C(0xC)
	uint8_t SupportWeapon : 1; // 0x148(0x1), Mask(0x1)
	uint8_t BitPad_0x148_1 : 7; // 0x148(0x1)
	uint8_t IsBindMesh : 1; // 0x149(0x1), Mask(0x1)
	uint8_t BitPad_0x149_1 : 7; // 0x149(0x1)
	uint8_t bUseCurWeaponMesh : 1; // 0x14A(0x1), Mask(0x1)
	uint8_t BitPad_0x14A_1 : 7; // 0x14A(0x1)
	uint8_t Pad_0x14B[0x1]; // 0x14B(0x1)
	struct FName AvatarID; // 0x14C(0x8)
	uint8_t InVisibleWhenTrigger : 1; // 0x154(0x1), Mask(0x1)
	uint8_t BitPad_0x154_1 : 7; // 0x154(0x1)
	uint8_t bSetForceKeepFullMipLevels : 1; // 0x155(0x1), Mask(0x1)
	uint8_t BitPad_0x155_1 : 7; // 0x155(0x1)
	uint8_t Pad_0x156[0x2]; // 0x156(0x2)
	float SimulateNotApplyDistance; // 0x158(0x4)
	uint8_t bCreate3pItemMeshOn1p : 1; // 0x15C(0x1), Mask(0x1)
	uint8_t BitPad_0x15C_1 : 7; // 0x15C(0x1)
	uint8_t Pad_0x15D[0x3]; // 0x15D(0x3)
};

// Object: ScriptStruct DFMAbility.AbilityAudioData
// Size: 0x20 (Inherited: 0x0)
struct FAbilityAudioData
{
	struct UGPAudioEventAsset* AudioEventAsset; // 0x0(0x8)
	struct FName AudioEventAudioName; // 0x8(0x8)
	EGPAudioBlueprintType EType; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	float Duration; // 0x14(0x4)
	uint8_t bNeedMakeNoise : 1; // 0x18(0x1), Mask(0x1)
	uint8_t BitPad_0x18_1 : 7; // 0x18(0x1)
	uint8_t bPreCutted : 1; // 0x19(0x1), Mask(0x1)
	uint8_t BitPad_0x19_1 : 7; // 0x19(0x1)
	EAudioRoleType RoleType; // 0x1A(0x1)
	uint8_t Pad_0x1B[0x5]; // 0x1B(0x5)
};

// Object: ScriptStruct DFMAbility.AbilityBuffAwardConfig
// Size: 0xB8 (Inherited: 0x0)
struct FAbilityBuffAwardConfig
{
	float KillAwardTime; // 0x0(0x4)
	EStaminaIndependentChangeType KillAwardStaminaChangeType; // 0x4(0x1)
	uint8_t bKillDataReport : 1; // 0x5(0x1), Mask(0x1)
	uint8_t BitPad_0x5_1 : 7; // 0x5(0x1)
	uint8_t Pad_0x6[0x2]; // 0x6(0x2)
	int32_t KillAIAwardBuffID; // 0x8(0x4)
	int32_t KillPlayerAwardBuffID; // 0xC(0x4)
	int32_t MaxIncreaseCount; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct TMap<ECharingSlot, float> KillAIAwardChargingPercent; // 0x18(0x50)
	struct TMap<ECharingSlot, float> KillPlayerAwardChargingPercent; // 0x68(0x50)
};

// Object: ScriptStruct DFMAbility.AbilityRecycleSpawnActorConf
// Size: 0x8 (Inherited: 0x0)
struct FAbilityRecycleSpawnActorConf
{
	ECharingSlot ItemPos; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float RecycleSlotChargingPercent; // 0x4(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityRecycleSpawnActorData
// Size: 0x50 (Inherited: 0x0)
struct FAbilityRecycleSpawnActorData
{
	struct TMap<ESkillRecycleType, struct FAbilityRecycleSpawnActorConf> RecycleConf; // 0x0(0x50)
};

// Object: ScriptStruct DFMAbility.AbilityDriverFlyRebot
// Size: 0x8 (Inherited: 0x0)
struct FAbilityDriverFlyRebot
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
};

// Object: ScriptStruct DFMAbility.AbilityDriverVehicle
// Size: 0x8 (Inherited: 0x0)
struct FAbilityDriverVehicle
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
};

// Object: ScriptStruct DFMAbility.AbilityItemPreviewData
// Size: 0x38 (Inherited: 0x0)
struct FAbilityItemPreviewData
{
	struct AItemPreviewActor* ActorClass; // 0x0(0x8)
	struct FSoftObjectPath MeshPath; // 0x8(0x18)
	struct FVector Rotator; // 0x20(0xC)
	float PreviewDistance; // 0x2C(0x4)
	float MaxDeltaHeight; // 0x30(0x4)
	uint8_t bAttachToSurface : 1; // 0x34(0x1), Mask(0x1)
	uint8_t BitPad_0x34_1 : 7; // 0x34(0x1)
	uint8_t Pad_0x35[0x3]; // 0x35(0x3)
};

// Object: ScriptStruct DFMAbility.GPAbilityAvatarAssets
// Size: 0x18 (Inherited: 0x0)
struct FGPAbilityAvatarAssets
{
	uint64_t TaskPreloadHandle; // 0x0(0x8)
	struct TArray<struct FSoftObjectPath> TaskPreAssetName; // 0x8(0x10)
};

// Object: ScriptStruct DFMAbility.MeshMatUpdateCache
// Size: 0x20 (Inherited: 0x0)
struct FMeshMatUpdateCache
{
	struct FTimerHandle MatEffectTimerHandle; // 0x0(0x8)
	struct UMaterialInstanceDynamic* Mid; // 0x8(0x8)
	struct USkeletalMeshComponent* SkMesh; // 0x10(0x8)
	float MatEffectStartTime; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct DFMAbility.MatEffectConfig
// Size: 0x58 (Inherited: 0x0)
struct FMatEffectConfig
{
	uint8_t bPreLoad : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bForceAllMeshMat : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	struct FFloatRange CurrEffectTimeRange; // 0x4(0x10)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct TArray<struct FScreenPostProcesaScalarParameterConfig> ScalarParams; // 0x18(0x10)
	struct TArray<struct FScreenPostProcesaVectorParameterConfig> VectorParams; // 0x28(0x10)
	struct TArray<struct FScreenPostProcesaCurveFloatParameterConfig> CurveFloatParams; // 0x38(0x10)
	struct TArray<struct FMatCurveColorParameterConfig> CurveColorParams; // 0x48(0x10)
};

// Object: ScriptStruct DFMAbility.MeshMatEffectConfig
// Size: 0x50 (Inherited: 0x0)
struct FMeshMatEffectConfig
{
	struct TMap<int32_t, struct FMatEffectConfig> MatIndexAndEffectConfigs; // 0x0(0x50)
};

// Object: ScriptStruct DFMAbility.AbilityPlayMontageDataP2
// Size: 0x198 (Inherited: 0xA4)
struct FAbilityPlayMontageDataP2 : FAbilityPlayMontageRowData
{
	uint8_t Pad_0xA4[0x4]; // 0xA4(0x4)
	struct FAbilityPlayMontageAnimUnitSet AnimUnitSet; // 0xA8(0xF0)
};

// Object: ScriptStruct DFMAbility.AbilityPlayMontageDataP4
// Size: 0x198 (Inherited: 0x198)
struct FAbilityPlayMontageDataP4 : FAbilityPlayMontageDataP2
{
};

// Object: ScriptStruct DFMAbility.AbilityPlayMontageDataP1
// Size: 0xA4 (Inherited: 0xA4)
struct FAbilityPlayMontageDataP1 : FAbilityPlayMontageRowData
{
};

// Object: ScriptStruct DFMAbility.AbilityPlayMontageDataP3
// Size: 0xA4 (Inherited: 0xA4)
struct FAbilityPlayMontageDataP3 : FAbilityPlayMontageDataP1
{
};

// Object: ScriptStruct DFMAbility.AbilityPreviewData
// Size: 0xF0 (Inherited: 0x0)
struct FAbilityPreviewData
{
	struct TSoftClassPtr<struct UObject*> ActorClassSoftPath; // 0x0(0x28)
	struct TSoftClassPtr<struct UObject*> LineActorClassSoftPath; // 0x28(0x28)
	struct UObject* ActorClass; // 0x50(0x8)
	struct UObject* LineActorClass; // 0x58(0x8)
	float Speed; // 0x60(0x4)
	float IntersectionPointLenth; // 0x64(0x4)
	struct FVector LenthScale; // 0x68(0xC)
	struct FVector StartOffset; // 0x74(0xC)
	struct FVector TargetOffset; // 0x80(0xC)
	float UpSpeed; // 0x8C(0x4)
	uint8_t UseWeapnDirction : 1; // 0x90(0x1), Mask(0x1)
	uint8_t BitPad_0x90_1 : 7; // 0x90(0x1)
	uint8_t Pad_0x91[0x3]; // 0x91(0x3)
	float LineOffset; // 0x94(0x4)
	struct FName SocketName; // 0x98(0x8)
	float MaxSimTime; // 0xA0(0x4)
	uint8_t ShowBouncePath : 1; // 0xA4(0x1), Mask(0x1)
	uint8_t BitPad_0xA4_1 : 7; // 0xA4(0x1)
	uint8_t Pad_0xA5[0x3]; // 0xA5(0x3)
	float Bounciness; // 0xA8(0x4)
	float Friction; // 0xAC(0x4)
	struct FName MeshName; // 0xB0(0x8)
	uint8_t bUseWeaponMesh : 1; // 0xB8(0x1), Mask(0x1)
	uint8_t BitPad_0xB8_1 : 7; // 0xB8(0x1)
	uint8_t Pad_0xB9[0x3]; // 0xB9(0x3)
	int32_t WeaponMeshSlotID; // 0xBC(0x4)
	float NextDrawTime; // 0xC0(0x4)
	uint8_t InitVisible : 1; // 0xC4(0x1), Mask(0x1)
	uint8_t BitPad_0xC4_1 : 7; // 0xC4(0x1)
	uint8_t Pad_0xC5[0x3]; // 0xC5(0x3)
	float limitHeight; // 0xC8(0x4)
	float SweepRadius; // 0xCC(0x4)
	struct FVector ActorScale1; // 0xD0(0xC)
	struct FVector ActorScale2; // 0xDC(0xC)
	float ActorScale1Dis; // 0xE8(0x4)
	float ActorScale2Dis; // 0xEC(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityProjectileActorData
// Size: 0x48 (Inherited: 0x0)
struct FAbilityProjectileActorData
{
	struct UObject* ProjectileActorClass; // 0x0(0x8)
	struct TSoftClassPtr<struct UObject*> ProjectileActorClassSoftPath; // 0x8(0x28)
	uint8_t Pad_0x30[0x4]; // 0x30(0x4)
	struct FVector StartPosistion; // 0x34(0xC)
	struct TWeakObjectPtr<struct AActor> Target; // 0x40(0x8)
};

// Object: ScriptStruct DFMAbility.SetCharAbilityMaskData
// Size: 0x10 (Inherited: 0x0)
struct FSetCharAbilityMaskData
{
	struct TArray<ECharacterStateMask> StateMaskList; // 0x0(0x10)
};

// Object: ScriptStruct DFMAbility.AASpawnActorData
// Size: 0x78 (Inherited: 0x0)
struct FAASpawnActorData
{
	struct UObject* ActorClass; // 0x0(0x8)
	struct TSoftClassPtr<struct UObject*> ActorClassSoftPath; // 0x8(0x28)
	struct FVector offset; // 0x30(0xC)
	uint8_t UsePreview : 1; // 0x3C(0x1), Mask(0x1)
	uint8_t BitPad_0x3C_1 : 7; // 0x3C(0x1)
	uint8_t Attach : 1; // 0x3D(0x1), Mask(0x1)
	uint8_t BitPad_0x3D_1 : 7; // 0x3D(0x1)
	uint8_t Pad_0x3E[0x2]; // 0x3E(0x2)
	struct FName ActorName; // 0x40(0x8)
	struct FName Tag; // 0x48(0x8)
	struct FName TraceTarget; // 0x50(0x8)
	uint8_t FastSpawn : 1; // 0x58(0x1), Mask(0x1)
	uint8_t BitPad_0x58_1 : 7; // 0x58(0x1)
	uint8_t UseItemPreview : 1; // 0x59(0x1), Mask(0x1)
	uint8_t BitPad_0x59_1 : 7; // 0x59(0x1)
	uint8_t ClearWhenRemove : 1; // 0x5A(0x1), Mask(0x1)
	uint8_t BitPad_0x5A_1 : 7; // 0x5A(0x1)
	uint8_t ClearWhenDie : 1; // 0x5B(0x1), Mask(0x1)
	uint8_t BitPad_0x5B_1 : 7; // 0x5B(0x1)
	uint8_t SpawnAtHitResult : 1; // 0x5C(0x1), Mask(0x1)
	uint8_t BitPad_0x5C_1 : 7; // 0x5C(0x1)
	uint8_t Pad_0x5D[0x3]; // 0x5D(0x3)
	struct FVector SpawnAtHitResultOffset; // 0x60(0xC)
	uint8_t SpawnAtCharPos : 1; // 0x6C(0x1), Mask(0x1)
	uint8_t BitPad_0x6C_1 : 7; // 0x6C(0x1)
	uint8_t Pad_0x6D[0x3]; // 0x6D(0x3)
	int32_t SkinId; // 0x70(0x4)
	uint8_t Pad_0x74[0x4]; // 0x74(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityCastSkillData
// Size: 0x14 (Inherited: 0x0)
struct FAbilityCastSkillData
{
	int32_t CastSkillid; // 0x0(0x4)
	struct TWeakObjectPtr<struct UDFMAbilityInstance> FromSkill; // 0x4(0x8)
	struct FName LogicName; // 0xC(0x8)
};

// Object: ScriptStruct DFMAbility.AbilityUseSupportPack
// Size: 0x20 (Inherited: 0x10)
struct FAbilityUseSupportPack : FAbilityDataBase
{
	struct FTimerHandle TimerHandle; // 0x10(0x8)
	float TimeoutCounter; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct DFMAbility.AbilityWantCharacterSpeakData
// Size: 0x1 (Inherited: 0x0)
struct FAbilityWantCharacterSpeakData
{
	ECharacterAudioType VoiceType; // 0x0(0x1)
};

// Object: ScriptStruct DFMAbility.AbilityWeaponProjectileData
// Size: 0x80 (Inherited: 0x0)
struct FAbilityWeaponProjectileData
{
	struct TSoftClassPtr<struct UObject*> ProjectileActorClassSoftPath; // 0x0(0x28)
	struct UObject* ProjectileActorClass; // 0x28(0x8)
	float Speed; // 0x30(0x4)
	struct FVector StartOffset; // 0x34(0xC)
	uint8_t Attach : 1; // 0x40(0x1), Mask(0x1)
	uint8_t BitPad_0x40_1 : 7; // 0x40(0x1)
	uint8_t Pad_0x41[0x3]; // 0x41(0x3)
	struct FName SocketName; // 0x44(0x8)
	struct FName MeshName; // 0x4C(0x8)
	struct FVector Rotator; // 0x54(0xC)
	uint8_t bWeaponDir : 1; // 0x60(0x1), Mask(0x1)
	uint8_t BitPad_0x60_1 : 7; // 0x60(0x1)
	uint8_t bUsePreview : 1; // 0x61(0x1), Mask(0x1)
	uint8_t BitPad_0x61_1 : 7; // 0x61(0x1)
	uint8_t bUseWeaponPreview : 1; // 0x62(0x1), Mask(0x1)
	uint8_t BitPad_0x62_1 : 7; // 0x62(0x1)
	uint8_t FastProjectile : 1; // 0x63(0x1), Mask(0x1)
	uint8_t BitPad_0x63_1 : 7; // 0x63(0x1)
	uint8_t SimulatePath : 1; // 0x64(0x1), Mask(0x1)
	uint8_t BitPad_0x64_1 : 7; // 0x64(0x1)
	uint8_t Pad_0x65[0x3]; // 0x65(0x3)
	float CrouchHeight; // 0x68(0x4)
	float PronehHeight; // 0x6C(0x4)
	float SlidinghHeight; // 0x70(0x4)
	uint8_t UsePlayerViewPoint : 1; // 0x74(0x1), Mask(0x1)
	uint8_t BitPad_0x74_1 : 7; // 0x74(0x1)
	uint8_t RemoveWhenRedploy : 1; // 0x75(0x1), Mask(0x1)
	uint8_t BitPad_0x75_1 : 7; // 0x75(0x1)
	uint8_t RemoveWhenDie : 1; // 0x76(0x1), Mask(0x1)
	uint8_t BitPad_0x76_1 : 7; // 0x76(0x1)
	uint8_t WeaponAttachPos; // 0x77(0x1)
	uint8_t WeaponManagerSlotIndex; // 0x78(0x1)
	uint8_t Pad_0x79[0x7]; // 0x79(0x7)
};

// Object: ScriptStruct DFMAbility.SpiderBasedMovementInfo
// Size: 0x30 (Inherited: 0x0)
struct FSpiderBasedMovementInfo
{
	struct UPrimitiveComponent* MovementBase; // 0x0(0x8)
	uint8_t bMoveOnBaseDirectly : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	struct FName BoneName; // 0xC(0x8)
	struct FVector_NetQuantize100 Location; // 0x14(0xC)
	struct FRotator Rotation; // 0x20(0xC)
	uint8_t bRelativeRotation : 1; // 0x2C(0x1), Mask(0x1)
	uint8_t BitPad_0x2C_1 : 7; // 0x2C(0x1)
	uint8_t bServerHasVelocity : 1; // 0x2D(0x1), Mask(0x1)
	uint8_t BitPad_0x2D_1 : 7; // 0x2D(0x1)
	uint8_t Pad_0x2E[0x2]; // 0x2E(0x2)
};

// Object: ScriptStruct DFMAbility.SpiderRepMovement
// Size: 0x40 (Inherited: 0x0)
struct FSpiderRepMovement
{
	struct FVector Location; // 0x0(0xC)
	struct FVector CurrentNormal; // 0xC(0xC)
	float Time; // 0x18(0x4)
	ESpiderMoveMode MoveMode; // 0x1C(0x1)
	uint8_t BounceTimes; // 0x1D(0x1)
	uint8_t UseBaseMove : 1; // 0x1E(0x1), Mask(0x1)
	uint8_t BitPad_0x1E_1 : 7; // 0x1E(0x1)
	uint8_t Pad_0x1F[0x1]; // 0x1F(0x1)
	struct UPrimitiveComponent* MovementBase; // 0x20(0x8)
	struct FName BoneName; // 0x28(0x8)
	struct FVector LocalLocation; // 0x30(0xC)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
};

// Object: ScriptStruct DFMAbility.SpiderNetAnimPlayInfo
// Size: 0x8 (Inherited: 0x0)
struct FSpiderNetAnimPlayInfo
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
};

// Object: ScriptStruct DFMAbility.ThreatDetectionCheckInfo
// Size: 0x8 (Inherited: 0x0)
struct FThreatDetectionCheckInfo
{
	int32_t CheckTickNum; // 0x0(0x4)
	uint8_t bIsPassCheck : 1; // 0x4(0x1), Mask(0x1)
	uint8_t BitPad_0x4_1 : 7; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
};

// Object: ScriptStruct DFMAbility.ThreatDetectionRoleParam
// Size: 0x40 (Inherited: 0x0)
struct FThreatDetectionRoleParam
{
	struct TArray<EBuffGameRole> AllGameRoles; // 0x0(0x10)
	float TickRate; // 0x10(0x4)
	int32_t TickCheckNum; // 0x14(0x4)
	float TickRate_HD; // 0x18(0x4)
	int32_t TickCheckNum_HD; // 0x1C(0x4)
	uint8_t KeepCheckAimTarget : 1; // 0x20(0x1), Mask(0x1)
	uint8_t BitPad_0x20_1 : 7; // 0x20(0x1)
	uint8_t Pad_0x21[0x3]; // 0x21(0x3)
	float CheckDistance; // 0x24(0x4)
	struct UCurveFloat* CheckAngleCurve; // 0x28(0x8)
	float AimCheckDistance; // 0x30(0x4)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
	struct UCurveFloat* AimCheckAngleCurve; // 0x38(0x8)
};

// Object: ScriptStruct DFMAbility.ThrowBlockingAnimInstanceProxy
// Size: 0x7B0 (Inherited: 0x7A0)
struct FThrowBlockingAnimInstanceProxy : FAnimInstanceProxy
{
	uint8_t bIsFullyExpanded : 1; // 0x798(0x1), Mask(0x1)
	uint8_t bIsSpawnState : 1; // 0x799(0x1), Mask(0x1)
	struct ADFMAbilityThrowBlocking* ThrowBlocking; // 0x7A0(0x8)
	uint8_t BitPad_0x7A8_2 : 6; // 0x7A8(0x1)
	uint8_t Pad_0x7A9[0x7]; // 0x7A9(0x7)
};

// Object: ScriptStruct DFMAbility.ProxSensorArrowScanData
// Size: 0x24 (Inherited: 0x0)
struct FProxSensorArrowScanData
{
	EDFMGamePlayMode GameMode; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float MarkEnemyTime; // 0x4(0x4)
	float MarkVehicleTime; // 0x8(0x4)
	float DetectorLifeTime; // 0xC(0x4)
	float MinScanRadius; // 0x10(0x4)
	float MaxScanRadius; // 0x14(0x4)
	float MaxScanRadiusHeight; // 0x18(0x4)
	uint8_t bNeedBlockCheck : 1; // 0x1C(0x1), Mask(0x1)
	uint8_t BitPad_0x1C_1 : 7; // 0x1C(0x1)
	uint8_t bNeedMarkEnemyInMap : 1; // 0x1D(0x1), Mask(0x1)
	uint8_t BitPad_0x1D_1 : 7; // 0x1D(0x1)
	uint8_t Pad_0x1E[0x2]; // 0x1E(0x2)
	int32_t CheckBlockTime; // 0x20(0x4)
};

// Object: ScriptStruct DFMAbility.GameModeSpawnSmokeUASConfig
// Size: 0x40 (Inherited: 0x0)
struct FGameModeSpawnSmokeUASConfig
{
	int32_t MapID; // 0x0(0x4)
	struct FName Desc; // 0x4(0x8)
	EDFMGamePlayMode GamePlayMode; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	struct AActor* ActorClass; // 0x10(0x8)
	struct TSoftClassPtr<struct AActor*> ActorClassPtr; // 0x18(0x28)
};

// Object: ScriptStruct DFMAbility.ZoyaSwarmsAvatarData
// Size: 0x68 (Inherited: 0x0)
struct FZoyaSwarmsAvatarData
{
	uint64_t AvatarID; // 0x0(0x8)
	struct TSoftObjectPtr<UStaticMesh> Mesh; // 0x8(0x28)
	struct TSoftObjectPtr<UMaterialInterface> Material; // 0x30(0x28)
	struct FName ClientStartEffect; // 0x58(0x8)
	struct FName ClientStartEffect_3P; // 0x60(0x8)
};

// Object: ScriptStruct DFMAbility.ZoyaSwarmsItemAnimInstanceProxy
// Size: 0x7A0 (Inherited: 0x7A0)
struct FZoyaSwarmsItemAnimInstanceProxy : FAnimInstanceProxy
{
	uint8_t bIsBindToTarget : 1; // 0x798(0x1), Mask(0x1)
};

// Object: ScriptStruct DFMAbility.ZoyaSwarmsAvatarEffectData
// Size: 0x28 (Inherited: 0x0)
struct FZoyaSwarmsAvatarEffectData
{
	uint64_t AvatarID; // 0x0(0x8)
	int32_t CastEffectNum; // 0x8(0x4)
	struct FName CastEffect3P; // 0xC(0x8)
	struct FName CastEffect1P; // 0x14(0x8)
	struct FName CastScreenEffect1P; // 0x1C(0x8)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
};

// Object: Class DFMAbility.AbilityAttachBaseMesh
// Size: 0x3D0 (Inherited: 0x370)
struct AAbilityAttachBaseMesh : AActor
{
	DEFINE_UE_CLASS_HELPERS(AAbilityAttachBaseMesh, "AbilityAttachBaseMesh")

	uint8_t Pad_0x370[0x12]; // 0x370(0x12)
	uint8_t IsSnapToTarget : 1; // 0x382(0x1), Mask(0x1)
	uint8_t BitPad_0x382_1 : 7; // 0x382(0x1)
	uint8_t Pad_0x383[0x1]; // 0x383(0x1)
	struct FName StaticMeshSocketName; // 0x384(0x8)
	struct FName SkeletalMeshSocketName; // 0x38C(0x8)
	uint8_t bDefalutMeshIsStaticMesh : 1; // 0x394(0x1), Mask(0x1)
	uint8_t BitPad_0x394_1 : 7; // 0x394(0x1)
	uint8_t bSetMasterPose : 1; // 0x395(0x1), Mask(0x1)
	uint8_t BitPad_0x395_1 : 7; // 0x395(0x1)
	uint8_t bUseFromPool : 1; // 0x396(0x1), Mask(0x1)
	uint8_t BitPad_0x396_1 : 7; // 0x396(0x1)
	uint8_t bMeshEnable : 1; // 0x397(0x1), Mask(0x1)
	uint8_t BitPad_0x397_1 : 7; // 0x397(0x1)
	EAbiltyTemplateAttachMeshMode AttachMeshMode; // 0x398(0x1)
	uint8_t Pad_0x399[0x7]; // 0x399(0x7)
	struct UGPSkeletalMeshComponent* CurSkeletalMeshComponent; // 0x3A0(0x8)
	struct UGPSkeletalMeshComponent* CurSkeletalMeshComponentMasterPose; // 0x3A8(0x8)
	struct UStaticMeshComponent* CurStaticMeshComponent; // 0x3B0(0x8)
	uint8_t CurGameAKComponent[0x8]; // 0x3B8(0x8)
	int32_t CurSkeletalMeshComponentEnable; // 0x3C0(0x4)
	int32_t CurSkeletalMeshComponentMasterPoseEnable; // 0x3C4(0x4)
	int32_t CurStaticMeshComponentEnable; // 0x3C8(0x4)
	int32_t CurGameAKComponentEnable; // 0x3CC(0x4)

	// Object: Function DFMAbility.AbilityAttachBaseMesh.UpdatePostEffectVectorParameters
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xc3d5064
	// Params: [ Num(3) Size(0x20) ]
	void UpdatePostEffectVectorParameters(struct FName PostEffectName, struct FName ParameterName, struct FLinearColor Value);

	// Object: Function DFMAbility.AbilityAttachBaseMesh.UpdatePostEffectScalarParameters
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3d4f4c
	// Params: [ Num(3) Size(0x14) ]
	void UpdatePostEffectScalarParameters(struct FName PostEffectName, struct FName ParameterName, float Value);

	// Object: Function DFMAbility.AbilityAttachBaseMesh.SwitchToStaticMesh
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3d4f38
	// Params: [ Num(0) Size(0x0) ]
	void SwitchToStaticMesh();

	// Object: Function DFMAbility.AbilityAttachBaseMesh.SwitchToSkeletalMesh
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3d4f24
	// Params: [ Num(0) Size(0x0) ]
	void SwitchToSkeletalMesh();

	// Object: Function DFMAbility.AbilityAttachBaseMesh.SwitchToMasterPoseMesh
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3d4f10
	// Params: [ Num(0) Size(0x0) ]
	void SwitchToMasterPoseMesh();

	// Object: Function DFMAbility.AbilityAttachBaseMesh.SetPostEffectActive
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3d4e6c
	// Params: [ Num(1) Size(0x8) ]
	void SetPostEffectActive(struct FName PostEffectName);

	// Object: Function DFMAbility.AbilityAttachBaseMesh.SetCurStaticMeshComponentEnable
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d4d7c
	// Params: [ Num(2) Size(0x2) ]
	void SetCurStaticMeshComponentEnable(uint8_t Enable, uint8_t fromLod);

	// Object: Function DFMAbility.AbilityAttachBaseMesh.SetCurSkeletalMeshComponentMasterPoseEnable
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d4c8c
	// Params: [ Num(2) Size(0x2) ]
	void SetCurSkeletalMeshComponentMasterPoseEnable(uint8_t Enable, uint8_t fromLod);

	// Object: Function DFMAbility.AbilityAttachBaseMesh.SetCurSkeletalMeshComponentEnable
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d4b9c
	// Params: [ Num(2) Size(0x2) ]
	void SetCurSkeletalMeshComponentEnable(uint8_t Enable, uint8_t fromLod);

	// Object: Function DFMAbility.AbilityAttachBaseMesh.SetCurGameAKComponentEnable
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d4aac
	// Params: [ Num(2) Size(0x2) ]
	void SetCurGameAKComponentEnable(uint8_t Enable, uint8_t fromLod);

	// Object: Function DFMAbility.AbilityAttachBaseMesh.RemovePostEffect
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3d4a08
	// Params: [ Num(1) Size(0x8) ]
	void RemovePostEffect(struct FName PostEffectName);

	// Object: Function DFMAbility.AbilityAttachBaseMesh.Is3P
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xc3d49d0
	// Params: [ Num(1) Size(0x1) ]
	uint8_t Is3P();

	// Object: Function DFMAbility.AbilityAttachBaseMesh.GetMasterSkeletalMesh
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d499c
	// Params: [ Num(1) Size(0x8) ]
	struct USkeletalMeshComponent* GetMasterSkeletalMesh();

	// Object: Function DFMAbility.AbilityAttachBaseMesh.EnableAllMeshTick
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3d48f0
	// Params: [ Num(1) Size(0x1) ]
	void EnableAllMeshTick(uint8_t Enable);

	// Object: Function DFMAbility.AbilityAttachBaseMesh.CharacterAvatarChangeSignature
	// Flags: [Final|Native|Public]
	// Offset: 0xc3d48dc
	// Params: [ Num(0) Size(0x0) ]
	void CharacterAvatarChangeSignature();

	// Object: Function DFMAbility.AbilityAttachBaseMesh.BP_SkeletalMeshMasterPose
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x8) ]
	struct UGPSkeletalMeshComponent* BP_SkeletalMeshMasterPose();

	// Object: Function DFMAbility.AbilityAttachBaseMesh.BP_SkeletalMesh
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x8) ]
	struct UGPSkeletalMeshComponent* BP_SkeletalMesh();

	// Object: Function DFMAbility.AbilityAttachBaseMesh.BP_SetMaterialScaleParams
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetMaterialScaleParams(float Value);

	// Object: Function DFMAbility.AbilityAttachBaseMesh.BP_SetMasterPose
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3d4830
	// Params: [ Num(1) Size(0x1) ]
	void BP_SetMasterPose(uint8_t Set);

	// Object: Function DFMAbility.AbilityAttachBaseMesh.BP_SetBPAnimIndex
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(3) Size(0x9) ]
	void BP_SetBPAnimIndex(int32_t AnimIndex, float PlayRate, uint8_t bLoopAnim);

	// Object: Function DFMAbility.AbilityAttachBaseMesh.BP_PostBeginPlay
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_PostBeginPlay();
};

// Object: Class DFMAbility.AbilityAttachRopeActor
// Size: 0x418 (Inherited: 0x370)
struct AAbilityAttachRopeActor : AActor
{
	DEFINE_UE_CLASS_HELPERS(AAbilityAttachRopeActor, "AbilityAttachRopeActor")

	uint8_t Pad_0x370[0x8]; // 0x370(0x8)
	int32_t CurrentLOD; // 0x378(0x4)
	int32_t LocalViewPriority; // 0x37C(0x4)
	struct TArray<struct UAbilityAttachRopeComponent*> CableArray; // 0x380(0x10)
	struct TArray<struct FVector> CachePaths; // 0x390(0x10)
	struct TArray<struct FVector> CacheResultPaths; // 0x3A0(0x10)
	struct TArray<int32_t> CacheMergeResults; // 0x3B0(0x10)
	uint8_t bEnableUseCacheResults : 1; // 0x3C0(0x1), Mask(0x1)
	uint8_t BitPad_0x3C0_1 : 7; // 0x3C0(0x1)
	struct FCollisionResponseContainer CollisionResponse; // 0x3C1(0x20)
	uint8_t Pad_0x3E1[0x3]; // 0x3E1(0x3)
	struct FVector HalfExtent; // 0x3E4(0xC)
	float RopeRadius; // 0x3F0(0x4)
	float MinDistanceToCheckDetail; // 0x3F4(0x4)
	uint8_t bEnableUseShowDistanceToCheckDetail : 1; // 0x3F8(0x1), Mask(0x1)
	uint8_t BitPad_0x3F8_1 : 7; // 0x3F8(0x1)
	uint8_t Pad_0x3F9[0x3]; // 0x3F9(0x3)
	int32_t DebugForceLod; // 0x3FC(0x4)
	struct FName RopeRippleID; // 0x400(0x8)
	struct TArray<struct UDFMInteractiveWaterComponent*> RopeRipples; // 0x408(0x10)
};

// Object: Class DFMAbility.AbilityAttachRopeComponent
// Size: 0x670 (Inherited: 0x580)
struct UAbilityAttachRopeComponent : UPrimitiveComponent
{
	DEFINE_UE_CLASS_HELPERS(UAbilityAttachRopeComponent, "AbilityAttachRopeComponent")

	int32_t SimulateFrame; // 0x578(0x4)
	float TimeStepScale; // 0x57C(0x4)
	int32_t NumSegments; // 0x580(0x4)
	float RopeLegth; // 0x584(0x4)
	float RopeLegthToUV; // 0x588(0x4)
	float RopeWidth; // 0x58C(0x4)
	int32_t NumSides; // 0x590(0x4)
	float TileMaterial; // 0x594(0x4)
	float SegmentScale; // 0x598(0x4)
	float SegmentMinScale; // 0x59C(0x4)
	float SegmentMaxScale; // 0x5A0(0x4)
	float SegmentScaleMinDistance; // 0x5A4(0x4)
	float SegmentScaleMaxDistance; // 0x5A8(0x4)
	int32_t NumOfParticleAttachToKeyPoint; // 0x5AC(0x4)
	float NodeAttachToKeyPointMass; // 0x5B0(0x4)
	float SegmentMaxOffset; // 0x5B4(0x4)
	struct UMaterialInterface* RopeMaterial; // 0x5B8(0x8)
	uint8_t bEnablePhysics : 1; // 0x5C0(0x1), Mask(0x1)
	float GravityScale; // 0x5C4(0x4)
	float DistanceStiffness; // 0x5C8(0x4)
	float BendingStiffness; // 0x5CC(0x4)
	float SegmentStiffness; // 0x5D0(0x4)
	float WayPointStiffness; // 0x5D4(0x4)
	float damping; // 0x5D8(0x4)
	int32_t SolverIterations; // 0x5DC(0x4)
	struct TArray<struct FAttachRopeConfig> RopeLodConfig; // 0x5E0(0x10)
	uint8_t bEnableLod : 1; // 0x5F0(0x1), Mask(0x1)
	uint8_t BitPad_0x5F4_2 : 6; // 0x5F4(0x1)
	uint8_t Pad_0x5F5[0x3]; // 0x5F5(0x3)
	struct UMaterialInstanceDynamic* DynamicMaterialInstance; // 0x5F8(0x8)
	uint8_t Pad_0x600[0x68]; // 0x600(0x68)
	int32_t CurrentLOD; // 0x668(0x4)
	uint8_t Pad_0x66C[0x4]; // 0x66C(0x4)

	// Object: Function DFMAbility.AbilityAttachRopeComponent.RebuildRope
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3d5290
	// Params: [ Num(0) Size(0x0) ]
	void RebuildRope();
};

// Object: Class DFMAbility.AbilityVoxelizationComponent
// Size: 0x3F0 (Inherited: 0x240)
struct UAbilityVoxelizationComponent : USceneComponent
{
	DEFINE_UE_CLASS_HELPERS(UAbilityVoxelizationComponent, "AbilityVoxelizationComponent")

	EAbilityVoxelCheckType CheckType; // 0x240(0x1)
	uint8_t Pad_0x241[0x3]; // 0x241(0x3)
	struct FVector CheckBoxSize; // 0x244(0xC)
	float CheckRadius; // 0x250(0x4)
	float CheckHeight; // 0x254(0x4)
	struct FVector CheckVoxelSize; // 0x258(0xC)
	int32_t ClientVoxelMerge; // 0x264(0x4)
	EAbilityVoxelDiffuseType DiffuseType; // 0x268(0x1)
	uint8_t Pad_0x269[0x3]; // 0x269(0x3)
	float CylinderBFSParentOffset; // 0x26C(0x4)
	float DamagePlaneLimit; // 0x270(0x4)
	int32_t DamageDiffuseAddOffset; // 0x274(0x4)
	struct TArray<struct UObject*> IgnoreObjectClass; // 0x278(0x10)
	uint8_t bHasVoxelization : 1; // 0x288(0x1), Mask(0x1)
	uint8_t BitPad_0x288_1 : 7; // 0x288(0x1)
	uint8_t Pad_0x289[0x3]; // 0x289(0x3)
	struct FVector CheckSize; // 0x28C(0xC)
	struct FBox WorldBaseAABB; // 0x298(0x1C)
	uint8_t Pad_0x2B4[0x4]; // 0x2B4(0x4)
	struct TArray<uint8_t> VoxelCheckResults; // 0x2B8(0x10)
	struct TArray<uint8_t> DamageDiffuseResults; // 0x2C8(0x10)
	struct FIntVector VoxelCount; // 0x2D8(0xC)
	float VoxelPlaneRate; // 0x2E4(0x4)
	float DamagePlaneRate; // 0x2E8(0x4)
	uint8_t Pad_0x2EC[0x4]; // 0x2EC(0x4)
	struct TArray<uint8_t> DamagePlaneResults; // 0x2F0(0x10)
	uint8_t Pad_0x300[0x10]; // 0x300(0x10)
	struct TArray<uint8_t> OctreeCompressedData; // 0x310(0x10)
	struct FIntVector ClientVoxelCount; // 0x320(0xC)
	uint8_t bHasClientData : 1; // 0x32C(0x1), Mask(0x1)
	uint8_t BitPad_0x32C_1 : 7; // 0x32C(0x1)
	uint8_t Pad_0x32D[0x3]; // 0x32D(0x3)
	int32_t MaxClientVoxelCount; // 0x330(0x4)
	uint8_t Pad_0x334[0x4]; // 0x334(0x4)
	struct TArray<uint8_t> DecompressResults; // 0x338(0x10)
	uint8_t Pad_0x348[0xA8]; // 0x348(0xA8)

	// Object: Function DFMAbility.AbilityVoxelizationComponent.Voxelization
	// Flags: [Final|Native|Public]
	// Offset: 0xc3db264
	// Params: [ Num(0) Size(0x0) ]
	void Voxelization();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.RealDoDamageDiffuse
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3db140
	// Params: [ Num(4) Size(0xD) ]
	uint8_t RealDoDamageDiffuse(int32_t X, int32_t Y, int32_t Z);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.OnRep_ClientData
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3db12c
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_ClientData();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.IsVoxelization
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3db0f4
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsVoxelization();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.IsOBB
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3db0bc
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsOBB();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.InitLineTraceParams
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3db0a8
	// Params: [ Num(0) Size(0x0) ]
	void InitLineTraceParams();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.InitData
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3db094
	// Params: [ Num(0) Size(0x0) ]
	void InitData();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.InitCheckSize
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3db080
	// Params: [ Num(0) Size(0x0) ]
	void InitCheckSize();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.GetVoxelLocation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|Const]
	// Offset: 0xc3dafc4
	// Params: [ Num(2) Size(0x18) ]
	struct FVector GetVoxelLocation(const struct FVector& Location);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.GetVoxelIndexByVoxelLocation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|Const]
	// Offset: 0xc3daf04
	// Params: [ Num(2) Size(0x18) ]
	struct FIntVector GetVoxelIndexByVoxelLocation(const struct FVector& VoxelLocation);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.GetVoxelIndex
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|Const]
	// Offset: 0xc3dae44
	// Params: [ Num(2) Size(0x18) ]
	struct FIntVector GetVoxelIndex(const struct FVector& Location);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.GetVoxelArrayIndex
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3dad24
	// Params: [ Num(4) Size(0x10) ]
	int32_t GetVoxelArrayIndex(int32_t X, int32_t Y, int32_t Z);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.GetQueryAABB
	// Flags: [Final|Native|Protected|HasDefaults|Const]
	// Offset: 0xc3dacb8
	// Params: [ Num(1) Size(0x1C) ]
	struct FBox GetQueryAABB();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.GetDecompressResults
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3dac30
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<uint8_t> GetDecompressResults();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.GetDamageDiffuseResults
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3daba8
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<uint8_t> GetDamageDiffuseResults();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.GetCurrVoxelSize
	// Flags: [Final|Native|Public|HasDefaults|Const]
	// Offset: 0xc3dab70
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetCurrVoxelSize();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.GetCurrVoxelCount
	// Flags: [Final|Native|Public|HasDefaults|Const]
	// Offset: 0xc3dab34
	// Params: [ Num(1) Size(0xC) ]
	struct FIntVector GetCurrVoxelCount();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.GetCheckSize
	// Flags: [Final|Native|Public|HasDefaults|Const]
	// Offset: 0xc3dab0c
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetCheckSize();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.DoVoxelization
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3daad4
	// Params: [ Num(1) Size(0x1) ]
	uint8_t DoVoxelization();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.DoLineTraceCheck
	// Flags: [Final|Native|Protected|HasOutParms|HasDefaults]
	// Offset: 0xc3da9c8
	// Params: [ Num(3) Size(0x19) ]
	uint8_t DoLineTraceCheck(const struct FVector& Start, const struct FVector& End);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.DoDamageDiffuse_DFS
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3da8b0
	// Params: [ Num(3) Size(0xC) ]
	void DoDamageDiffuse_DFS(int32_t X, int32_t Y, int32_t Z);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.DoDamageDiffuse_CylinderBFS
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3da798
	// Params: [ Num(3) Size(0xC) ]
	void DoDamageDiffuse_CylinderBFS(int32_t X, int32_t Y, int32_t Z);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.DoDamageDiffuse_BFS
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3da680
	// Params: [ Num(3) Size(0xC) ]
	void DoDamageDiffuse_BFS(int32_t X, int32_t Y, int32_t Z);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.DecompressOctreeNode
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0xc3da554
	// Params: [ Num(3) Size(0xC) ]
	void DecompressOctreeNode(int32_t Level, int32_t NodeIndex, int32_t& ReadIndex);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.DecompressOctree
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3da540
	// Params: [ Num(0) Size(0x0) ]
	void DecompressOctree();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.DebugDrawVoxels
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3da52c
	// Params: [ Num(0) Size(0x0) ]
	void DebugDrawVoxels();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.DamageDiffuse
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3da518
	// Params: [ Num(0) Size(0x0) ]
	void DamageDiffuse();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.CountVoxelPlaneRate
	// Flags: [Final|Native|Protected|Const]
	// Offset: 0xc3da4e4
	// Params: [ Num(1) Size(0x4) ]
	float CountVoxelPlaneRate();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.CompressOctreeNode
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3da408
	// Params: [ Num(2) Size(0x8) ]
	void CompressOctreeNode(int32_t Level, int32_t NodeIndex);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.CompressOctree
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3da3f4
	// Params: [ Num(0) Size(0x0) ]
	void CompressOctree();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.CompareDecompressResults
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3da3e0
	// Params: [ Num(0) Size(0x0) ]
	void CompareDecompressResults();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.ClientDebugDrawVoxels
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Protected]
	// Offset: 0xc3da3c4
	// Params: [ Num(0) Size(0x0) ]
	void ClientDebugDrawVoxels();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.ClientDebugDrawLine
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults|Const]
	// Offset: 0xc3da2a4
	// Params: [ Num(3) Size(0x1C) ]
	void ClientDebugDrawLine(struct FVector Start, struct FVector End, struct FColor Color);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.ClientDebugDrawBox
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults|Const]
	// Offset: 0xc3da184
	// Params: [ Num(3) Size(0x1C) ]
	void ClientDebugDrawBox(struct FVector Origin, struct FVector Extent, struct FColor Color);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.CheckLocationWithOutVoxel
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0xc3d9f9c
	// Params: [ Num(6) Size(0x31) ]
	uint8_t CheckLocationWithOutVoxel(const struct TArray<uint8_t>& ResultsToCheck, uint8_t TargetResult, const struct FVector& Location, int32_t CheckAddOffset, struct FIntVector& OutVoxelIdx);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.CheckLocation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0xc3d9e94
	// Params: [ Num(3) Size(0xE) ]
	uint8_t CheckLocation(const struct FVector& Location, uint8_t CheckAddOffset);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.CheckDamagePlaneLimit
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d9dac
	// Params: [ Num(3) Size(0x9) ]
	uint8_t CheckDamagePlaneLimit(int32_t X, int32_t Y);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.BuildOctreeCheckLevel0
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d9c88
	// Params: [ Num(4) Size(0xD) ]
	uint8_t BuildOctreeCheckLevel0(int32_t X, int32_t Y, int32_t Z);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.BuildOctree
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d9c74
	// Params: [ Num(0) Size(0x0) ]
	void BuildOctree();

	// Object: Function DFMAbility.AbilityVoxelizationComponent.BaseCheckLocation_Sphere
	// Flags: [Final|Native|Protected|HasOutParms|HasDefaults|Const]
	// Offset: 0xc3d9bb8
	// Params: [ Num(2) Size(0xD) ]
	uint8_t BaseCheckLocation_Sphere(const struct FVector& VoxelLocation);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.BaseCheckLocation_Cylinder
	// Flags: [Final|Native|Protected|HasOutParms|HasDefaults|Const]
	// Offset: 0xc3d9afc
	// Params: [ Num(2) Size(0xD) ]
	uint8_t BaseCheckLocation_Cylinder(const struct FVector& VoxelLocation);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.BaseCheckLocation_Box
	// Flags: [Final|Native|Protected|HasOutParms|HasDefaults|Const]
	// Offset: 0xc3d9a40
	// Params: [ Num(2) Size(0xD) ]
	uint8_t BaseCheckLocation_Box(const struct FVector& VoxelLocation);

	// Object: Function DFMAbility.AbilityVoxelizationComponent.BaseCheckLocation
	// Flags: [Final|Native|Protected|HasOutParms|HasDefaults|Const]
	// Offset: 0xc3d9984
	// Params: [ Num(2) Size(0xD) ]
	uint8_t BaseCheckLocation(const struct FVector& VoxelLocation);
};

// Object: Class DFMAbility.AbilityBulletVoxelizationComponent
// Size: 0x400 (Inherited: 0x3F0)
struct UAbilityBulletVoxelizationComponent : UAbilityVoxelizationComponent
{
	DEFINE_UE_CLASS_HELPERS(UAbilityBulletVoxelizationComponent, "AbilityBulletVoxelizationComponent")

	float DamageDiffuseCheckSize; // 0x3E4(0x4)
	float DamageDiffuseMaxDistance; // 0x3E8(0x4)
	float DamageDiffuseCheckHeight; // 0x3EC(0x4)
	float DamageDiffuseMaxTime; // 0x3F0(0x4)
	float DamageDiffuseStepTime; // 0x3F4(0x4)
};

// Object: Class DFMAbility.AbilityCableActor
// Size: 0x388 (Inherited: 0x370)
struct AAbilityCableActor : AActor
{
	DEFINE_UE_CLASS_HELPERS(AAbilityCableActor, "AbilityCableActor")

	uint8_t Pad_0x370[0x8]; // 0x370(0x8)
	struct TArray<struct UAbilityCableComponent*> CableArray; // 0x378(0x10)
};

// Object: Class DFMAbility.AbilityCableComponent
// Size: 0x730 (Inherited: 0x6F0)
struct UAbilityCableComponent : UMeshComponent
{
	DEFINE_UE_CLASS_HELPERS(UAbilityCableComponent, "AbilityCableComponent")

	struct TArray<struct FVector> Particles; // 0x6E8(0x10)
	uint8_t Pad_0x700[0x14]; // 0x700(0x14)
	int32_t NumSegments; // 0x714(0x4)
	float TotalLength; // 0x718(0x4)
	float RopeWidth; // 0x71C(0x4)
	int32_t NumSides; // 0x720(0x4)
	float TileMaterial; // 0x724(0x4)
	uint8_t Pad_0x728[0x8]; // 0x728(0x8)
};

// Object: Class DFMAbility.DFMAbilityInstance
// Size: 0x40 (Inherited: 0x40)
struct UDFMAbilityInstance : UGPAbilityInstance
{
	DEFINE_UE_CLASS_HELPERS(UDFMAbilityInstance, "DFMAbilityInstance")

	// Object: Function DFMAbility.DFMAbilityInstance.SetCullScreenSizeRatio
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc414924
	// Params: [ Num(1) Size(0x4) ]
	void SetCullScreenSizeRatio(float ratio);

	// Object: Function DFMAbility.DFMAbilityInstance.IsServer
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc4148ec
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsServer();

	// Object: Function DFMAbility.DFMAbilityInstance.IsMPMode
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xc4148b4
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsMPMode();

	// Object: Function DFMAbility.DFMAbilityInstance.IsFPPMode
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc41487c
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsFPPMode();

	// Object: Function DFMAbility.DFMAbilityInstance.IsEquipingWeapon
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xfabd628
	// Params: [ Num(2) Size(0x5) ]
	uint8_t IsEquipingWeapon(int32_t WeaponSlot);

	// Object: Function DFMAbility.DFMAbilityInstance.Is1PorStandalone
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xc414844
	// Params: [ Num(1) Size(0x1) ]
	uint8_t Is1PorStandalone();

	// Object: Function DFMAbility.DFMAbilityInstance.Is1P
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc41480c
	// Params: [ Num(1) Size(0x1) ]
	uint8_t Is1P();

	// Object: Function DFMAbility.DFMAbilityInstance.HasAuthority
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc4147d4
	// Params: [ Num(1) Size(0x1) ]
	uint8_t HasAuthority();

	// Object: Function DFMAbility.DFMAbilityInstance.GetNetMode
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xeffacf8
	// Params: [ Num(1) Size(0x1) ]
	ENetMode GetNetMode();

	// Object: Function DFMAbility.DFMAbilityInstance.GetHealthData
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure]
	// Offset: 0xc414680
	// Params: [ Num(3) Size(0xC) ]
	void GetHealthData(int32_t& cur, int32_t& Max, float& Percent);

	// Object: Function DFMAbility.DFMAbilityInstance.GetENetRole
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc41464c
	// Params: [ Num(1) Size(0x1) ]
	ENetRole GetENetRole();

	// Object: Function DFMAbility.DFMAbilityInstance.GetCurrentGameTime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xfa016d0
	// Params: [ Num(1) Size(0x4) ]
	float GetCurrentGameTime();

	// Object: Function DFMAbility.DFMAbilityInstance.GetCullScreenSizeRatio
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xc414618
	// Params: [ Num(1) Size(0x4) ]
	float GetCullScreenSizeRatio();

	// Object: Function DFMAbility.DFMAbilityInstance.GetAbilityData
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xc4145e0
	// Params: [ Num(1) Size(0x3B8) ]
	struct FGPAbilityEntityData GetAbilityData();

	// Object: Function DFMAbility.DFMAbilityInstance.GetAbilityCharacter
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xf87fd3c
	// Params: [ Num(1) Size(0x8) ]
	struct AGPCharacter* GetAbilityCharacter();

	// Object: Function DFMAbility.DFMAbilityInstance.FireOneShot
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc4145cc
	// Params: [ Num(0) Size(0x0) ]
	void FireOneShot();

	// Object: Function DFMAbility.DFMAbilityInstance.ClientSwitchMainWeapon
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc414528
	// Params: [ Num(1) Size(0x1) ]
	void ClientSwitchMainWeapon(EWeaponSwitchType SwitchType);
};

// Object: Class DFMAbility.AbilityInstanceAIAlert
// Size: 0x148 (Inherited: 0x40)
struct UAbilityInstanceAIAlert : UDFMAbilityInstance
{
	DEFINE_UE_CLASS_HELPERS(UAbilityInstanceAIAlert, "AbilityInstanceAIAlert")

	float AlertCooldown; // 0x3C(0x4)
	struct FAlertMarkConfig AlertMarkConfig; // 0x40(0x14)
	struct TArray<struct TSoftObjectPtr<UGPAudioEventAsset>> AlertVOEvents; // 0x58(0x10)
	struct TArray<struct UGPAudioEventAsset*> AlertVOEventObjects; // 0x68(0x10)
	float VoicePlaybackCooldown; // 0x78(0x4)
	float SubtitlePlaybackCooldown; // 0x7C(0x4)
	float PlayVOMaxDistance; // 0x80(0x4)
	float PassiveAlertTriggerRange; // 0x84(0x4)
	float MinContinuousSightTimeForAlert; // 0x88(0x4)
	uint8_t Pad_0x8C[0x4]; // 0x8C(0x4)
	struct FText SpeakerName; // 0x90(0x18)
	struct FText NonePOISubtitle; // 0xA8(0x18)
	struct FText POISubtitleFormatString; // 0xC0(0x18)
	float TeammateActiveRange; // 0xD8(0x4)
	uint8_t Pad_0xDC[0x4]; // 0xDC(0x4)
	struct TMap<struct AActor*, struct FAIAlertInfo> AlertCache; // 0xE0(0x50)
	float LastVoicePlaybackTime; // 0x130(0x4)
	float LastSubtitlePlaybackTime; // 0x134(0x4)
	struct APlayerCommanderFakeAIController* CommanderController; // 0x138(0x8)
	struct AAIAlertRPC* AlertRPCComponent; // 0x140(0x8)

	// Object: Function DFMAbility.AbilityInstanceAIAlert.OnReceiveAIAlert
	// Flags: [Final|Native|Public]
	// Offset: 0xc3d52e8
	// Params: [ Num(2) Size(0x10) ]
	void OnReceiveAIAlert(struct ADFMAICharacter* AI, struct ADFMCharacter* Enemy);
};

// Object: Class DFMAbility.AbilityInstanceBionicSpySkill
// Size: 0x58 (Inherited: 0x40)
struct UAbilityInstanceBionicSpySkill : UDFMAbilityInstance
{
	DEFINE_UE_CLASS_HELPERS(UAbilityInstanceBionicSpySkill, "AbilityInstanceBionicSpySkill")

	struct FName TargetPanelName; // 0x3C(0x8)
	float FailedCDTime; // 0x44(0x4)
	float MaxProgressHUDShowTime; // 0x48(0x4)
	struct ABionicSpyActor* BionicSpyActorClass; // 0x50(0x8)

	// Object: Function DFMAbility.AbilityInstanceBionicSpySkill.TrySpawnSpyActor
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d5734
	// Params: [ Num(1) Size(0x4) ]
	int32_t TrySpawnSpyActor();

	// Object: Function DFMAbility.AbilityInstanceBionicSpySkill.SetProgressHUDShowState
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xc3d5688
	// Params: [ Num(1) Size(0x1) ]
	void SetProgressHUDShowState(uint8_t bIsShow);

	// Object: Function DFMAbility.AbilityInstanceBionicSpySkill.SetCD
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d55dc
	// Params: [ Num(1) Size(0x1) ]
	void SetCD(uint8_t bIsSuccess);

	// Object: Function DFMAbility.AbilityInstanceBionicSpySkill.SendTargetLoadPanel
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xc3d55c8
	// Params: [ Num(0) Size(0x0) ]
	void SendTargetLoadPanel();

	// Object: Function DFMAbility.AbilityInstanceBionicSpySkill.DataFlowAddCastNum
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d551c
	// Params: [ Num(1) Size(0x1) ]
	void DataFlowAddCastNum(uint8_t bIsSuccess);

	// Object: Function DFMAbility.AbilityInstanceBionicSpySkill.CheckFootprintSearchData
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d54e4
	// Params: [ Num(1) Size(0x1) ]
	uint8_t CheckFootprintSearchData();
};

// Object: Class DFMAbility.AbilityInstanceBionicSpySwitchSkill
// Size: 0x68 (Inherited: 0x40)
struct UAbilityInstanceBionicSpySwitchSkill : UDFMAbilityInstance
{
	DEFINE_UE_CLASS_HELPERS(UAbilityInstanceBionicSpySwitchSkill, "AbilityInstanceBionicSpySwitchSkill")

	float MinSwitchTime; // 0x3C(0x4)
	float ClientAddSwitchTime; // 0x40(0x4)
	float TipsTime; // 0x44(0x4)
	float CheckTickRate; // 0x48(0x4)
	struct TArray<struct FSpySwitchMapData> AllMapData; // 0x50(0x10)
	struct FTimerHandle TickTimerHandle; // 0x60(0x8)

	// Object: Function DFMAbility.AbilityInstanceBionicSpySwitchSkill.TrySwitchSpyMode
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xc3d59c8
	// Params: [ Num(0) Size(0x0) ]
	void TrySwitchSpyMode();

	// Object: Function DFMAbility.AbilityInstanceBionicSpySwitchSkill.TryCloseHUD
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d59b4
	// Params: [ Num(0) Size(0x0) ]
	void TryCloseHUD();

	// Object: Function DFMAbility.AbilityInstanceBionicSpySwitchSkill.StopTickTimer
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d59a0
	// Params: [ Num(0) Size(0x0) ]
	void StopTickTimer();

	// Object: Function DFMAbility.AbilityInstanceBionicSpySwitchSkill.StartTickTimer
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d598c
	// Params: [ Num(0) Size(0x0) ]
	void StartTickTimer();

	// Object: Function DFMAbility.AbilityInstanceBionicSpySwitchSkill.DoTimerTick
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d5978
	// Params: [ Num(0) Size(0x0) ]
	void DoTimerTick();

	// Object: Function DFMAbility.AbilityInstanceBionicSpySwitchSkill.DoCheck
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d5940
	// Params: [ Num(1) Size(0x1) ]
	uint8_t DoCheck();

	// Object: Function DFMAbility.AbilityInstanceBionicSpySwitchSkill.CheckSpyData
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d5888
	// Params: [ Num(2) Size(0x2) ]
	uint8_t CheckSpyData(uint8_t bShowTips);

	// Object: Function DFMAbility.AbilityInstanceBionicSpySwitchSkill.CheckMapData
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d5850
	// Params: [ Num(1) Size(0x1) ]
	uint8_t CheckMapData();

	// Object: Function DFMAbility.AbilityInstanceBionicSpySwitchSkill.CheckDistance
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d57a0
	// Params: [ Num(2) Size(0x5) ]
	uint8_t CheckDistance(float MaxDistance);
};

// Object: Class DFMAbility.AbilityInstanceCallAI2
// Size: 0x80 (Inherited: 0x40)
struct UAbilityInstanceCallAI2 : UDFMAbilityInstance
{
	DEFINE_UE_CLASS_HELPERS(UAbilityInstanceCallAI2, "AbilityInstanceCallAI2")

	struct ACallAIAbility* CallAIAbilityClass; // 0x40(0x8)
	struct FName BossAnaisMapName; // 0x48(0x8)
	struct FName BossAnaisName; // 0x50(0x8)
	float CheckAnaisProbability; // 0x58(0x4)
	float DynamicSetRagdollNumLimitRange; // 0x5C(0x4)
	float DynamicSetRagdollNumLimitDuration; // 0x60(0x4)
	uint8_t Pad_0x64[0x4]; // 0x64(0x4)
	struct ACallAIAbility* CacheCallAIAbility; // 0x68(0x8)
	uint8_t Pad_0x70[0x10]; // 0x70(0x10)
};

// Object: Class DFMAbility.AbilityInstanceCallDog
// Size: 0x88 (Inherited: 0x40)
struct UAbilityInstanceCallDog : UDFMAbilityInstance
{
	DEFINE_UE_CLASS_HELPERS(UAbilityInstanceCallDog, "AbilityInstanceCallDog")

	float MaxLeftTime; // 0x3C(0x4)
	float DespawnShowTime; // 0x40(0x4)
	struct FName CallDogAIName; // 0x44(0x8)
	float CallDogDistance; // 0x4C(0x4)
	struct TSoftObjectPtr<UDataTable> NpcTemplateTable; // 0x50(0x28)
	uint64_t SkillKillAttackValueId; // 0x78(0x8)
	struct TWeakObjectPtr<struct ADFMAICharacterCallDog> CallDogCharacter; // 0x80(0x8)

	// Object: Function DFMAbility.AbilityInstanceCallDog.StopCD
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d5c88
	// Params: [ Num(0) Size(0x0) ]
	void StopCD();

	// Object: Function DFMAbility.AbilityInstanceCallDog.SetDogCharacter
	// Flags: [Final|Native|Public]
	// Offset: 0xc3d5be4
	// Params: [ Num(1) Size(0x8) ]
	void SetDogCharacter(struct ADFMAICharacterCallDog* DogCharacter);

	// Object: Function DFMAbility.AbilityInstanceCallDog.ResumeCD
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d5bd0
	// Params: [ Num(0) Size(0x0) ]
	void ResumeCD();

	// Object: Function DFMAbility.AbilityInstanceCallDog.DoSpawnAI
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d5b98
	// Params: [ Num(1) Size(0x1) ]
	uint8_t DoSpawnAI();
};

// Object: Class DFMAbility.AbilityLauncherFireModeParams
// Size: 0x238 (Inherited: 0x200)
struct UAbilityLauncherFireModeParams : UGPWeaponFireModeParamsAbilityLauncher
{
	DEFINE_UE_CLASS_HELPERS(UAbilityLauncherFireModeParams, "AbilityLauncherFireModeParams")

	uint8_t bIsC201Launcher : 1; // 0x1FB(0x1), Mask(0x1)
	struct AAbilityWeaponThrowableBullet* LauncherBulletClass; // 0x200(0x8)
	struct AAbilityWeaponThrowableBullet* LauncherBulletClass2; // 0x208(0x8)
	struct AAbilityWeaponThrowableBullet* LauncherBulletClass3; // 0x210(0x8)
	struct FName SocketName; // 0x218(0x8)
	float IntersectionPointLength; // 0x220(0x4)
	struct FVector TargetOffset; // 0x224(0xC)
	float OwnerVelocityFactor; // 0x230(0x4)
	uint8_t bEnableMIDIStopForEmptyAmmo : 1; // 0x234(0x1), Mask(0x1)
	uint8_t BitPad_0x234_2 : 6; // 0x234(0x1)
	uint8_t Pad_0x235[0x3]; // 0x235(0x3)
};

// Object: Class DFMAbility.AbilityLauncherFireMode
// Size: 0x478 (Inherited: 0x100)
struct UAbilityLauncherFireMode : UGPWeaponFireModePhysicSimulate
{
	DEFINE_UE_CLASS_HELPERS(UAbilityLauncherFireMode, "AbilityLauncherFireMode")

	uint8_t Pad_0x100[0x340]; // 0x100(0x340)
	struct UGPWeaponFireModeParamsAbilityLauncher* AbilityLauncherFireModeParams; // 0x440(0x8)
	uint8_t Pad_0x448[0x10]; // 0x448(0x10)
	struct FTimerHandle SwitchWeaponNextFrameTimerHandle; // 0x458(0x8)
	uint8_t bEnableSwitchWeaponInEndFire : 1; // 0x460(0x1), Mask(0x1)
	uint8_t BitPad_0x460_1 : 7; // 0x460(0x1)
	uint8_t bResetCurrentWeapon : 1; // 0x461(0x1), Mask(0x1)
	uint8_t BitPad_0x461_1 : 7; // 0x461(0x1)
	uint8_t bEnableResetPreviewLine : 1; // 0x462(0x1), Mask(0x1)
	uint8_t BitPad_0x462_1 : 7; // 0x462(0x1)
	uint8_t Pad_0x463[0x5]; // 0x463(0x5)
	struct UAbilityLauncherFireModeParams* DirectLauncherParams; // 0x468(0x8)
	int32_t SpawnBulletCnt; // 0x470(0x4)
	int32_t LastFireID; // 0x474(0x4)

	// Object: Function DFMAbility.AbilityLauncherFireMode.TrySpawnFakeBullet
	// Flags: [Native|Protected|HasOutParms]
	// Offset: 0xc3d8bc8
	// Params: [ Num(1) Size(0xB0) ]
	void TrySpawnFakeBullet(struct FWeaponFireRepInfo& RepInfo);

	// Object: Function DFMAbility.AbilityLauncherFireMode.SpawnGrenade
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3d8a34
	// Params: [ Num(4) Size(0x30) ]
	void SpawnGrenade(const struct FVector& StartLocation, const struct FVector& FireRotation, const struct FVector& AffectInitVelocity, const uint64_t& BulletGuid);

	// Object: Function DFMAbility.AbilityLauncherFireMode.ResetPreviewLine
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d8a20
	// Params: [ Num(0) Size(0x0) ]
	void ResetPreviewLine();

	// Object: Function DFMAbility.AbilityLauncherFireMode.OnSwitchWeaponNextFrame
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d8a0c
	// Params: [ Num(0) Size(0x0) ]
	void OnSwitchWeaponNextFrame();

	// Object: Function DFMAbility.AbilityLauncherFireMode.OnEndfireSwitchWeaponInNextFrame
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3d89f8
	// Params: [ Num(0) Size(0x0) ]
	void OnEndfireSwitchWeaponInNextFrame();

	// Object: Function DFMAbility.AbilityLauncherFireMode.CheckIsClientOnlyThrowConfig
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3d89c0
	// Params: [ Num(1) Size(0x1) ]
	uint8_t CheckIsClientOnlyThrowConfig();
};

// Object: Class DFMAbility.AbilityMineAnimInstance
// Size: 0xA20 (Inherited: 0x270)
struct UAbilityMineAnimInstance : UAnimInstance
{
	DEFINE_UE_CLASS_HELPERS(UAbilityMineAnimInstance, "AbilityMineAnimInstance")

	struct FAbilityMineAnimInstanceProxy LocalProxy; // 0x270(0x7B0)
};

// Object: Class DFMAbility.AbilityNodeTriggerInterface
// Size: 0x28 (Inherited: 0x28)
struct IAbilityNodeTriggerInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(IAbilityNodeTriggerInterface, "AbilityNodeTriggerInterface")

	// Object: Function DFMAbility.AbilityNodeTriggerInterface.SetTriggerType
	// Flags: [Native|Public]
	// Offset: 0xc3d8e68
	// Params: [ Num(1) Size(0x4) ]
	void SetTriggerType(int32_t Type);

	// Object: Function DFMAbility.AbilityNodeTriggerInterface.GetTriggerType
	// Flags: [Native|Public]
	// Offset: 0xc3d8e2c
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetTriggerType();

	// Object: Function DFMAbility.AbilityNodeTriggerInterface.DebugCustomTrigger
	// Flags: [Native|Public]
	// Offset: 0xc3d8d80
	// Params: [ Num(1) Size(0x4) ]
	void DebugCustomTrigger(int32_t Index);

	// Object: Function DFMAbility.AbilityNodeTriggerInterface.BroadcastTrigger
	// Flags: [Native|Public]
	// Offset: 0xc3d8d64
	// Params: [ Num(0) Size(0x0) ]
	void BroadcastTrigger();
};

// Object: Class DFMAbility.AbilityOverloadBuffHandler
// Size: 0x140 (Inherited: 0x130)
struct UAbilityOverloadBuffHandler : UGPEffectCueHandler
{
	DEFINE_UE_CLASS_HELPERS(UAbilityOverloadBuffHandler, "AbilityOverloadBuffHandler")

	uint8_t Pad_0x130[0x10]; // 0x130(0x10)

	// Object: Function DFMAbility.AbilityOverloadBuffHandler.TrySendEvent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3d8fd0
	// Params: [ Num(1) Size(0x1) ]
	void TrySendEvent(uint8_t bIsAdd);
};

// Object: Class DFMAbility.AbilityProjectileInterface
// Size: 0x28 (Inherited: 0x28)
struct IAbilityProjectileInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(IAbilityProjectileInterface, "AbilityProjectileInterface")

	// Object: Function DFMAbility.AbilityProjectileInterface.SetVelocityStartPos
	// Flags: [Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0xC) ]
	void SetVelocityStartPos(struct FVector pos);

	// Object: Function DFMAbility.AbilityProjectileInterface.SetVelocity
	// Flags: [Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0xC) ]
	void SetVelocity(struct FVector Velocity);

	// Object: Function DFMAbility.AbilityProjectileInterface.SetRealStop
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void SetRealStop(uint8_t Stop);

	// Object: Function DFMAbility.AbilityProjectileInterface.SetIgnoreOwner
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x8) ]
	void SetIgnoreOwner(struct AActor* Actor);
};

// Object: Class DFMAbility.AbilityVehicleAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UAbilityVehicleAnimInstance : UAnimInstance
{
	DEFINE_UE_CLASS_HELPERS(UAbilityVehicleAnimInstance, "AbilityVehicleAnimInstance")

	// Object: Function DFMAbility.AbilityVehicleAnimInstance.GetSocketUpOffsetLoaction
	// Flags: [Final|Native|Private|HasDefaults|BlueprintCallable|BlueprintPure]
	// Offset: 0xc3d9650
	// Params: [ Num(4) Size(0x1C) ]
	struct FVector GetSocketUpOffsetLoaction(struct FName Name, float offset, ERelativeTransformSpace Space);

	// Object: Function DFMAbility.AbilityVehicleAnimInstance.GetSocketRightOffsetLoaction
	// Flags: [Final|Native|Private|HasDefaults|BlueprintCallable|BlueprintPure]
	// Offset: 0xc3d9528
	// Params: [ Num(4) Size(0x1C) ]
	struct FVector GetSocketRightOffsetLoaction(struct FName Name, float offset, ERelativeTransformSpace Space);

	// Object: Function DFMAbility.AbilityVehicleAnimInstance.GetSocketForwadOffsetLoaction
	// Flags: [Final|Native|Private|HasDefaults|BlueprintCallable|BlueprintPure]
	// Offset: 0xc3d9400
	// Params: [ Num(4) Size(0x1C) ]
	struct FVector GetSocketForwadOffsetLoaction(struct FName Name, float offset, ERelativeTransformSpace Space);

	// Object: Function DFMAbility.AbilityVehicleAnimInstance.getSocketAndSocketOffset
	// Flags: [Final|Native|Private|HasDefaults|BlueprintCallable|BlueprintPure]
	// Offset: 0xc3d92dc
	// Params: [ Num(4) Size(0x20) ]
	struct FVector getSocketAndSocketOffset(struct FName socket1, struct FName socket2, ERelativeTransformSpace Space);
};

// Object: Class DFMAbility.AbilityVoxelizationTestActor
// Size: 0x390 (Inherited: 0x370)
struct AAbilityVoxelizationTestActor : AActor
{
	DEFINE_UE_CLASS_HELPERS(AAbilityVoxelizationTestActor, "AbilityVoxelizationTestActor")

	uint8_t Pad_0x370[0xC]; // 0x370(0xC)
	float CheckInterval; // 0x37C(0x4)
	struct UAbilityVoxelizationComponent* AbilityVoxelizationComponent; // 0x380(0x8)
	float NextCheckTime; // 0x388(0x4)
	uint8_t Pad_0x38C[0x4]; // 0x38C(0x4)
};

// Object: Class DFMAbility.AbilityVoxelizationUtils
// Size: 0x28 (Inherited: 0x28)
struct UAbilityVoxelizationUtils : UObject
{
	DEFINE_UE_CLASS_HELPERS(UAbilityVoxelizationUtils, "AbilityVoxelizationUtils")

	// Object: Function DFMAbility.AbilityVoxelizationUtils.TransformToLocal_OBB
	// Flags: [Final|Native|Static|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3dc378
	// Params: [ Num(8) Size(0x68) ]
	static void TransformToLocal_OBB(struct TArray<uint8_t>& OutVoxelData, const struct TArray<struct FVector>& VoxelArr, const float& SceneVoxelSize, const struct FVector& Center, const struct FVector& CheckSize, const struct FQuat& Rotation, const struct FVector& CheckVoxelSize, const struct FIntVector& VoxelCount);

	// Object: Function DFMAbility.AbilityVoxelizationUtils.TransformToLocal
	// Flags: [Final|Native|Static|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3dc13c
	// Params: [ Num(6) Size(0x58) ]
	static void TransformToLocal(struct TArray<uint8_t>& OutVoxelData, const struct TArray<struct FVector>& VoxelArr, const float& SceneVoxelSize, const struct FBox& WorldBaseAABB, const struct FVector& CheckVoxelSize, const struct FIntVector& VoxelCount);

	// Object: Function DFMAbility.AbilityVoxelizationUtils.RotationAABB
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults]
	// Offset: 0xc3dc034
	// Params: [ Num(3) Size(0x4C) ]
	static struct FBox RotationAABB(const struct FBox& Bound, const struct FQuat& Rotation);

	// Object: Function DFMAbility.AbilityVoxelizationUtils.OBBVoxelization
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults]
	// Offset: 0xc3dbe08
	// Params: [ Num(7) Size(0x5D) ]
	static uint8_t OBBVoxelization(struct UObject* WorldContextObject, struct TArray<uint8_t>& OutVoxelData, struct FIntVector& OutVoxelCount, const struct FBox& Bound, const struct FQuat& Rotation, const struct FVector& CheckVoxelSize);

	// Object: Function DFMAbility.AbilityVoxelizationUtils.DoVoxelization
	// Flags: [Final|Native|Static|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3dbb10
	// Params: [ Num(10) Size(0x7D) ]
	static uint8_t DoVoxelization(struct UObject* WorldContextObject, struct TArray<uint8_t>& OutVoxelData, struct FVector& OutOrigin, float& OutSceneVoxelSize, struct FIntVector& OutVoxelCount, struct FBox Bound, uint8_t bUseRotation, struct FQuat Rotation, struct FVector CheckVoxelSize);

	// Object: Function DFMAbility.AbilityVoxelizationUtils.BaseVoxelization
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults]
	// Offset: 0xc3db8e0
	// Params: [ Num(7) Size(0x51) ]
	static uint8_t BaseVoxelization(struct UObject* WorldContextObject, struct TArray<uint8_t>& OutVoxelData, struct FVector& OutOrigin, float& OutVoxelSize, struct FIntVector& OutVoxelCount, const struct FBox& Bound);

	// Object: Function DFMAbility.AbilityVoxelizationUtils.BaseTransformToLocal
	// Flags: [Final|Native|Static|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3db6f4
	// Params: [ Num(5) Size(0x4C) ]
	static void BaseTransformToLocal(struct TArray<uint8_t>& OutVoxelData, const struct TArray<struct FVector>& VoxelArr, const float& SceneVoxelSize, const struct FBox& WorldBaseAABB, const struct FIntVector& VoxelCount);

	// Object: Function DFMAbility.AbilityVoxelizationUtils.AlignBoundToScene
	// Flags: [Final|Native|Static|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3db5e8
	// Params: [ Num(3) Size(0x3C) ]
	static struct FBox AlignBoundToScene(const struct FBox& Bound, const float& SceneVoxelSize);

	// Object: Function DFMAbility.AbilityVoxelizationUtils.AABBVoxelization
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults]
	// Offset: 0xc3db40c
	// Params: [ Num(6) Size(0x4D) ]
	static uint8_t AABBVoxelization(struct UObject* WorldContextObject, struct TArray<uint8_t>& OutVoxelData, struct FIntVector& OutVoxelCount, const struct FBox& Bound, const struct FVector& CheckVoxelSize);
};

// Object: Class DFMAbility.AbilityVoxelizeFrozenAppearenceActor
// Size: 0x388 (Inherited: 0x370)
struct AAbilityVoxelizeFrozenAppearenceActor : AActor
{
	DEFINE_UE_CLASS_HELPERS(AAbilityVoxelizeFrozenAppearenceActor, "AbilityVoxelizeFrozenAppearenceActor")

	uint8_t Pad_0x370[0x8]; // 0x370(0x8)
	struct UTextureRenderTarget2D* VoxelRT; // 0x378(0x8)
	uint8_t Pad_0x380[0x8]; // 0x380(0x8)

	// Object: Function DFMAbility.AbilityVoxelizeFrozenAppearenceActor.UpdateFromVoxelData
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xc3ddf94
	// Params: [ Num(7) Size(0x5D) ]
	uint8_t UpdateFromVoxelData(const struct TArray<uint8_t>& InVoxelValues, const struct FIntVector& InDimensions, const struct FVector& InWorldOrigin, const struct FVector& InVoxelSize, const struct FQuat& InRotation, const struct FVector& InMinLocal);

	// Object: Function DFMAbility.AbilityVoxelizeFrozenAppearenceActor.RequestUpdateVoxelData
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xc3dded8
	// Params: [ Num(1) Size(0x10) ]
	void RequestUpdateVoxelData(const struct TArray<uint8_t>& InVoxelValues);

	// Object: Function DFMAbility.AbilityVoxelizeFrozenAppearenceActor.ReleaseRT
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3ddec4
	// Params: [ Num(0) Size(0x0) ]
	void ReleaseRT();

	// Object: Function DFMAbility.AbilityVoxelizeFrozenAppearenceActor.GetVoxelRT
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3ddea8
	// Params: [ Num(1) Size(0x8) ]
	struct UTextureRenderTarget2D* GetVoxelRT();

	// Object: Function DFMAbility.AbilityVoxelizeFrozenAppearenceActor.GetCurrentPhase
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3dde8c
	// Params: [ Num(1) Size(0x1) ]
	EFrozenAppearancePhase GetCurrentPhase();
};

// Object: Class DFMAbility.AbilityWaterEffectComponent
// Size: 0x1A8 (Inherited: 0xF8)
struct UAbilityWaterEffectComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UAbilityWaterEffectComponent, "AbilityWaterEffectComponent")

	EWaterState WaterState; // 0xF8(0x1)
	uint8_t Pad_0xF9[0x3]; // 0xF9(0x3)
	float DistanceToWaterSurface; // 0xFC(0x4)
	float LastWaterHeight; // 0x100(0x4)
	uint8_t Pad_0x104[0x4]; // 0x104(0x4)
	struct TArray<struct FWaterEffectFX> WaterFXList; // 0x108(0x10)
	uint8_t Pad_0x118[0x8C]; // 0x118(0x8C)
	EWaterState RepWaterState; // 0x1A4(0x1)
	uint8_t Pad_0x1A5[0x3]; // 0x1A5(0x3)

	// Object: Function DFMAbility.AbilityWaterEffectComponent.OnWaterStateRep
	// Flags: [Final|Native|Private]
	// Offset: 0xc3de448
	// Params: [ Num(0) Size(0x0) ]
	void OnWaterStateRep();

	// Object: Function DFMAbility.AbilityWaterEffectComponent.BroadcastWaterStateChanged
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Public]
	// Offset: 0xc3de398
	// Params: [ Num(1) Size(0x8) ]
	void BroadcastWaterStateChanged(struct FWaterEffectBroadcastMsg Msg);
};

// Object: Class DFMAbility.DFMAbilityWeaponThrowableBullet
// Size: 0x1890 (Inherited: 0x1890)
struct ADFMAbilityWeaponThrowableBullet : AAbilityWeaponThrowableBullet
{
	DEFINE_UE_CLASS_HELPERS(ADFMAbilityWeaponThrowableBullet, "DFMAbilityWeaponThrowableBullet")

	// Object: Function DFMAbility.DFMAbilityWeaponThrowableBullet.DestroyLevelActorSpawnBySelf
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc432128
	// Params: [ Num(2) Size(0x9) ]
	void DestroyLevelActorSpawnBySelf(struct AActor* SelfActor, EAbilityLevelActorType ActorType);
};

// Object: Class DFMAbility.AbilityWeaponBulletGrenade
// Size: 0x1890 (Inherited: 0x1890)
struct AAbilityWeaponBulletGrenade : ADFMAbilityWeaponThrowableBullet
{
	DEFINE_UE_CLASS_HELPERS(AAbilityWeaponBulletGrenade, "AbilityWeaponBulletGrenade")

	uint8_t bStopAllMove : 1; // 0x1884(0x1), Mask(0x1)

	// Object: Function DFMAbility.AbilityWeaponBulletGrenade.InitBulletGrenade
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xc3de518
	// Params: [ Num(3) Size(0x20) ]
	void InitBulletGrenade(struct AActor* GrenadeOwner, const struct FVector& FireStartLocation, const struct FVector& InitVelocity);

	// Object: Function DFMAbility.AbilityWeaponBulletGrenade.BP_OnExplosion
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_OnExplosion();
};

// Object: Class DFMAbility.AbilityWeaponBulletGrenadeC4
// Size: 0x16E0 (Inherited: 0x16D0)
struct AAbilityWeaponBulletGrenadeC4 : AWeaponThrowableBulletProjectile
{
	DEFINE_UE_CLASS_HELPERS(AAbilityWeaponBulletGrenadeC4, "AbilityWeaponBulletGrenadeC4")

	struct FName ImpactAudioKey; // 0x16C4(0x8)
	struct FName CountDownAudioKey; // 0x16CC(0x8)

	// Object: Function DFMAbility.AbilityWeaponBulletGrenadeC4.BP_StickyToTarget
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_StickyToTarget();

	// Object: Function DFMAbility.AbilityWeaponBulletGrenadeC4.BP_MoveIntoWater
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_MoveIntoWater();
};

// Object: Class DFMAbility.AbilityWeaponBulletGrenadeMine
// Size: 0x18A0 (Inherited: 0x1890)
struct AAbilityWeaponBulletGrenadeMine : AAbilityWeaponBulletGrenade
{
	DEFINE_UE_CLASS_HELPERS(AAbilityWeaponBulletGrenadeMine, "AbilityWeaponBulletGrenadeMine")

	struct ADFMAbilitySuppressionMine* AbilitySuppressionMine; // 0x1888(0x8)
	uint8_t bIsCheckMine : 1; // 0x1890(0x1), Mask(0x1)
	uint8_t BitPad_0x1898_1 : 7; // 0x1898(0x1)
	uint8_t Pad_0x1899[0x7]; // 0x1899(0x7)

	// Object: Function DFMAbility.AbilityWeaponBulletGrenadeMine.OnRep_AbilitySuppressionMine
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3de714
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_AbilitySuppressionMine();

	// Object: Function DFMAbility.AbilityWeaponBulletGrenadeMine.BPSetSpawnMineActor
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xc3de670
	// Params: [ Num(1) Size(0x8) ]
	void BPSetSpawnMineActor(struct ADFMAbilitySuppressionMine* MineActor);
};

// Object: Class DFMAbility.AbilityWeaponThrowableC204Interference
// Size: 0x19C0 (Inherited: 0x1890)
struct AAbilityWeaponThrowableC204Interference : AAbilityWeaponThrowableBullet
{
	DEFINE_UE_CLASS_HELPERS(AAbilityWeaponThrowableC204Interference, "AbilityWeaponThrowableC204Interference")

	struct FC204InterferenceData InterferenceData; // 0x1890(0x98)
	float ExplodeTimeSeconds; // 0x1928(0x4)
	uint8_t Pad_0x192C[0x4]; // 0x192C(0x4)
	struct FAvatarFXOperateHandle ChangeUpFXHandle; // 0x1930(0x10)
	struct FAvatarFXOperateHandle ExplosionFXHandle; // 0x1940(0x10)
	struct FAvatarFXOperateHandle RangeFXHandle; // 0x1950(0x10)
	struct FAvatarFXOperateHandle DestroyFXHandle; // 0x1960(0x10)
	struct FTimerHandle DestroyTimerHandle; // 0x1970(0x8)
	uint8_t bHasBeginDestroy : 1; // 0x1978(0x1), Mask(0x1)
	uint8_t BitPad_0x1978_1 : 7; // 0x1978(0x1)
	uint8_t bHasBounce : 1; // 0x1979(0x1), Mask(0x1)
	uint8_t BitPad_0x1979_1 : 7; // 0x1979(0x1)
	uint8_t bHasStop : 1; // 0x197A(0x1), Mask(0x1)
	uint8_t BitPad_0x197A_1 : 7; // 0x197A(0x1)
	uint8_t Pad_0x197B[0x5]; // 0x197B(0x5)
	uint64_t AnimInstLoadId; // 0x1980(0x8)
	uint8_t Pad_0x1988[0x24]; // 0x1988(0x24)
	uint8_t bCanBeEmp : 1; // 0x19AC(0x1), Mask(0x1)
	uint8_t BitPad_0x19AC_1 : 7; // 0x19AC(0x1)
	uint8_t Pad_0x19AD[0x3]; // 0x19AD(0x3)
	struct FTimerHandle VoiceTimerHandle; // 0x19B0(0x8)
	uint8_t Pad_0x19B8[0x8]; // 0x19B8(0x8)

	// Object: Function DFMAbility.AbilityWeaponThrowableC204Interference.ShowDestroyEffect
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3de948
	// Params: [ Num(0) Size(0x0) ]
	void ShowDestroyEffect();

	// Object: Function DFMAbility.AbilityWeaponThrowableC204Interference.ResetPlayHitVoice
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3de934
	// Params: [ Num(0) Size(0x0) ]
	void ResetPlayHitVoice();

	// Object: Function DFMAbility.AbilityWeaponThrowableC204Interference.PlayHitVoice
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3de920
	// Params: [ Num(0) Size(0x0) ]
	void PlayHitVoice();

	// Object: Function DFMAbility.AbilityWeaponThrowableC204Interference.OnAnimInstLoaded
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3de850
	// Params: [ Num(1) Size(0x10) ]
	void OnAnimInstLoaded(struct TArray<struct FSoftObjectPath> InPaths);

	// Object: Function DFMAbility.AbilityWeaponThrowableC204Interference.MulticastShowDestroyEffect
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Protected]
	// Offset: 0xc3de834
	// Params: [ Num(0) Size(0x0) ]
	void MulticastShowDestroyEffect();

	// Object: Function DFMAbility.AbilityWeaponThrowableC204Interference.DestroySelf
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3de820
	// Params: [ Num(0) Size(0x0) ]
	void DestroySelf();

	// Object: Function DFMAbility.AbilityWeaponThrowableC204Interference.CountHitData
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3de77c
	// Params: [ Num(1) Size(0x8) ]
	void CountHitData(struct AActor* Target);

	// Object: Function DFMAbility.AbilityWeaponThrowableC204Interference.BP_ProjectileExplode
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_ProjectileExplode();
};

// Object: Class DFMAbility.DFMAbilityActor
// Size: 0x4F8 (Inherited: 0x3D8)
struct ADFMAbilityActor : AGPAbilityActor
{
	DEFINE_UE_CLASS_HELPERS(ADFMAbilityActor, "DFMAbilityActor")

	uint8_t Pad_0x3D8[0x8]; // 0x3D8(0x8)
	struct TWeakObjectPtr<struct ADFMCharacter> AbilityActorOwner; // 0x3E0(0x8)
	int32_t SinglePlayerMaxExistNum; // 0x3E8(0x4)
	int32_t AllCampNearbyMaxExistNum; // 0x3EC(0x4)
	float AllCampNearbyCheckRad; // 0x3F0(0x4)
	EBattleFieldPropType AbilityActorType; // 0x3F4(0x1)
	uint8_t Pad_0x3F5[0x3]; // 0x3F5(0x3)
	struct FName WaterRippleID; // 0x3F8(0x8)
	struct UDFMInteractiveWaterComponent* RippleEffectComponent; // 0x400(0x8)
	struct USkeletalMeshComponent* MainMesh; // 0x408(0x8)
	uint8_t bUseWeaponSkinData : 1; // 0x410(0x1), Mask(0x1)
	uint8_t BitPad_0x410_1 : 7; // 0x410(0x1)
	uint8_t Pad_0x411[0x3]; // 0x411(0x3)
	struct FName ResourceKey; // 0x414(0x8)
	uint8_t bUse1PMeshOnFPP : 1; // 0x41C(0x1), Mask(0x1)
	uint8_t BitPad_0x41C_1 : 7; // 0x41C(0x1)
	uint8_t Pad_0x41D[0x3]; // 0x41D(0x3)
	uint64_t MeshAsyncRequestId; // 0x420(0x8)
	uint64_t MaterialAsyncRequestId; // 0x428(0x8)
	struct FTimerHandle ElecDeviceMarkerTimerHandle; // 0x430(0x8)
	struct UAbilityElectricDeviceMapIconViewController* ElectricDeviceMapIconViewController; // 0x438(0x8)
	uint32_t OutLineItemID; // 0x440(0x4)
	uint8_t Pad_0x444[0x4]; // 0x444(0x4)
	struct USkeletalMeshComponent* OutLineMeshComp; // 0x448(0x8)
	struct FName OutLineMeshTag; // 0x450(0x8)
	struct TMap<struct AGPCharacter*, uint8_t> MarkerMap; // 0x458(0x50)
	struct TMap<struct AGPCharacter*, struct FTimerHandle> MarkerTimerMap; // 0x4A8(0x50)

	// Object: Function DFMAbility.DFMAbilityActor.RemoveElecDeviceMarker
	// Flags: [Native|Public]
	// Offset: 0xc3fb878
	// Params: [ Num(0) Size(0x0) ]
	void RemoveElecDeviceMarker();

	// Object: Function DFMAbility.DFMAbilityActor.RemoveC204PassiveMarker
	// Flags: [Native|Public]
	// Offset: 0xc3fb7cc
	// Params: [ Num(1) Size(0x8) ]
	void RemoveC204PassiveMarker(struct AGPCharacter* SourceChar);

	// Object: Function DFMAbility.DFMAbilityActor.OnSetSkinResult
	// Flags: [Native|Protected]
	// Offset: 0xc3fb718
	// Params: [ Num(1) Size(0x1) ]
	void OnSetSkinResult(uint8_t bReturnValue);

	// Object: Function DFMAbility.DFMAbilityActor.OnRep_OutLineItemID
	// Flags: [Native|Public]
	// Offset: 0xc3fb6fc
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_OutLineItemID();

	// Object: Function DFMAbility.DFMAbilityActor.IsUnderWater
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xc3fb6bc
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsUnderWater();

	// Object: Function DFMAbility.DFMAbilityActor.IsC204PassiveMarkerValid
	// Flags: [Native|Public]
	// Offset: 0xc3fb604
	// Params: [ Num(2) Size(0x9) ]
	uint8_t IsC204PassiveMarkerValid(struct AGPCharacter* SourceChar);

	// Object: Function DFMAbility.DFMAbilityActor.InitSkinInternal
	// Flags: [Native|Protected|HasOutParms]
	// Offset: 0xc3fb3c0
	// Params: [ Num(1) Size(0x370) ]
	void InitSkinInternal(const struct FCharacterHeroResourceAttachMeshData& SkinData);

	// Object: Function DFMAbility.DFMAbilityActor.GetWaterSurfaceDistance
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3fb38c
	// Params: [ Num(1) Size(0x4) ]
	float GetWaterSurfaceDistance();

	// Object: Function DFMAbility.DFMAbilityActor.ClientAddElecDeviceMarker
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Public]
	// Offset: 0xc3fb268
	// Params: [ Num(3) Size(0x10) ]
	void ClientAddElecDeviceMarker(struct AGPCharacter* DetectOwner, int32_t MarkerType, float MarkerTime);

	// Object: Function DFMAbility.DFMAbilityActor.AddElecDeviceMarker
	// Flags: [Native|Public]
	// Offset: 0xc3fb180
	// Params: [ Num(2) Size(0x8) ]
	void AddElecDeviceMarker(int32_t MarkerType, float MarkerTime);
};

// Object: Class DFMAbility.DFMAbilityLevelActor
// Size: 0x588 (Inherited: 0x4F8)
struct ADFMAbilityLevelActor : ADFMAbilityActor
{
	DEFINE_UE_CLASS_HELPERS(ADFMAbilityLevelActor, "DFMAbilityLevelActor")

	uint8_t Pad_0x4F8[0x2C]; // 0x4F8(0x2C)
	EAbilityLevelActorType AbilityLevelActorType; // 0x524(0x1)
	uint8_t bAutoAttachToSurface : 1; // 0x525(0x1), Mask(0x1)
	uint8_t BitPad_0x525_1 : 7; // 0x525(0x1)
	uint8_t Pad_0x526[0x2]; // 0x526(0x2)
	float AttachToSurfaceDis; // 0x528(0x4)
	struct FName DeadPacicle; // 0x52C(0x8)
	uint8_t Pad_0x534[0x4]; // 0x534(0x4)
	struct UDFMSkeletalMeshComponent* MeshComponent; // 0x538(0x8)
	struct UBoxComponent* CapsuleComponent; // 0x540(0x8)
	uint8_t CanHurtBySelf : 1; // 0x548(0x1), Mask(0x1)
	uint8_t BitPad_0x548_1 : 7; // 0x548(0x1)
	uint8_t CanHurtByTeamMate : 1; // 0x549(0x1), Mask(0x1)
	uint8_t BitPad_0x549_1 : 7; // 0x549(0x1)
	uint8_t CanHurtByCampMate : 1; // 0x54A(0x1), Mask(0x1)
	uint8_t BitPad_0x54A_1 : 7; // 0x54A(0x1)
	uint8_t Pad_0x54B[0x1]; // 0x54B(0x1)
	float Health; // 0x54C(0x4)
	int32_t CampId; // 0x550(0x4)
	int32_t TeamID; // 0x554(0x4)
	int32_t CustomValue; // 0x558(0x4)
	uint8_t IsAlive : 1; // 0x55C(0x1), Mask(0x1)
	uint8_t BitPad_0x55C_1 : 7; // 0x55C(0x1)
	uint8_t Pad_0x55D[0x3]; // 0x55D(0x3)
	uint64_t OwnerPlayerId; // 0x560(0x8)
	uint8_t ReplaceBySameOwner : 1; // 0x568(0x1), Mask(0x1)
	uint8_t BitPad_0x568_1 : 7; // 0x568(0x1)
	uint8_t Pad_0x569[0x3]; // 0x569(0x3)
	float DelayDestroyTime; // 0x56C(0x4)
	struct AActor* OwnerActor; // 0x570(0x8)
	uint8_t Pad_0x578[0x8]; // 0x578(0x8)
	uint8_t DoStartDestroySelf : 1; // 0x580(0x1), Mask(0x1)
	uint8_t BitPad_0x580_1 : 7; // 0x580(0x1)
	uint8_t Pad_0x581[0x7]; // 0x581(0x7)

	// Object: Function DFMAbility.DFMAbilityLevelActor.TryStickyToThrowAttachable
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0xc418b10
	// Params: [ Num(2) Size(0x89) ]
	uint8_t TryStickyToThrowAttachable(const struct FHitResult& ImpactResult);

	// Object: Function DFMAbility.DFMAbilityLevelActor.StickyToTarget
	// Flags: [Final|Native|Protected|HasOutParms|BlueprintCallable]
	// Offset: 0xc418a48
	// Params: [ Num(1) Size(0x88) ]
	void StickyToTarget(const struct FHitResult& ImpactResult);

	// Object: Function DFMAbility.DFMAbilityLevelActor.Rep_Destroy
	// Flags: [Final|Native|Protected]
	// Offset: 0xf648c7c
	// Params: [ Num(0) Size(0x0) ]
	void Rep_Destroy();
};

// Object: Class DFMAbility.ADS
// Size: 0x6C8 (Inherited: 0x588)
struct AADS : ADFMAbilityLevelActor
{
	DEFINE_UE_CLASS_HELPERS(AADS, "ADS")

	uint8_t Pad_0x588[0x28]; // 0x588(0x28)
	float ProtectedRange; // 0x5B0(0x4)
	float ProtectedTime; // 0x5B4(0x4)
	float ProtectedCoolDown; // 0x5B8(0x4)
	float ProtectedRemainCount; // 0x5BC(0x4)
	float ProtectedRemainCounter; // 0x5C0(0x4)
	float TickInterval; // 0x5C4(0x4)
	struct FVector FirePointHeight; // 0x5C8(0xC)
	uint8_t Pad_0x5D4[0x4]; // 0x5D4(0x4)
	struct TArray<struct AGPWeaponBulletBase*> RegistedProjectileArray; // 0x5D8(0x10)
	uint8_t Pad_0x5E8[0x10]; // 0x5E8(0x10)
	struct UGPSkeletalMeshComponent* SkeletalMeshComponent; // 0x5F8(0x8)
	float InnerRadius; // 0x600(0x4)
	float OutterRadius; // 0x604(0x4)
	int32_t InnerAttackerValueID; // 0x608(0x4)
	int32_t OutterAttackerValueID; // 0x60C(0x4)
	float EMPCollDownTime; // 0x610(0x4)
	float MarkerOffset; // 0x614(0x4)
	uint8_t bBlockStinger : 1; // 0x618(0x1), Mask(0x1)
	uint8_t BitPad_0x618_1 : 7; // 0x618(0x1)
	uint8_t Pad_0x619[0x7]; // 0x619(0x7)
	struct UGPAudioEventAsset* DeployAudio; // 0x620(0x8)
	struct UGPAudioEventAsset* DestroyAudio; // 0x628(0x8)
	struct FName DestroyEffectId; // 0x630(0x8)
	ETacticalEquipmentMarkerType TacticalEquipmentMarker; // 0x638(0x1)
	uint8_t Pad_0x639[0x7]; // 0x639(0x7)
	struct UAnimationAsset* AnimationToPlay; // 0x640(0x8)
	struct UAnimationAsset* PlaceAnimation; // 0x648(0x8)
	uint8_t Pad_0x650[0x8]; // 0x650(0x8)
	struct USphereComponent* SphereComponent; // 0x658(0x8)
	struct UAbilityADSMapIconViewController* IconCtrl; // 0x660(0x8)
	struct TSoftObjectPtr<UGPAudioEventAsset> InterceptAudio; // 0x668(0x28)
	struct TSoftObjectPtr<UGPAudioEventAsset> BeIntercepted2DAudio; // 0x690(0x28)
	struct FName InterceptEffectId; // 0x6B8(0x8)
	struct FName FireEffectId; // 0x6C0(0x8)

	// Object: Function DFMAbility.ADS.OnProjectileIntercepted
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults]
	// Offset: 0xc3df090
	// Params: [ Num(2) Size(0x18) ]
	void OnProjectileIntercepted(struct FVector ProjectilePos, struct AActor* BulletCreator);

	// Object: Function DFMAbility.ADS.OnCharacterExpertIdChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xc3defb4
	// Params: [ Num(2) Size(0x8) ]
	void OnCharacterExpertIdChanged(int32_t OldExpertId, int32_t CurExpertId);

	// Object: Function DFMAbility.ADS.HasBlockBetweenADSAndProjConsiderVehicle
	// Flags: [Final|Native|Public|HasDefaults|Const]
	// Offset: 0xc3dee8c
	// Params: [ Num(4) Size(0x21) ]
	uint8_t HasBlockBetweenADSAndProjConsiderVehicle(struct AGPWeaponBulletBase* InBullet, struct FVector Start, struct FVector End);

	// Object: Function DFMAbility.ADS.HasBlockBetweenADSAndProj
	// Flags: [Final|Native|Public|HasDefaults|Const]
	// Offset: 0xc3ded64
	// Params: [ Num(4) Size(0x21) ]
	uint8_t HasBlockBetweenADSAndProj(struct AGPWeaponBulletBase* InBullet, struct FVector Start, struct FVector End);

	// Object: Function DFMAbility.ADS.DoDefenseAction
	// Flags: [Native|Public|HasOutParms]
	// Offset: 0xc3dec4c
	// Params: [ Num(3) Size(0x91) ]
	uint8_t DoDefenseAction(struct AGPWeaponBulletBase* InBullet, const struct FHitResult& InOverlapResult);

	// Object: Function DFMAbility.ADS.ClientResetProtectedCoolDownTimer
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Public]
	// Offset: 0xc3dec30
	// Params: [ Num(0) Size(0x0) ]
	void ClientResetProtectedCoolDownTimer();

	// Object: Function DFMAbility.ADS.ClientNotifyEMPEffect
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Public]
	// Offset: 0xc3deb84
	// Params: [ Num(1) Size(0x4) ]
	void ClientNotifyEMPEffect(float EMPTime);
};

// Object: Class DFMAbility.AIAlertRPC
// Size: 0x3F8 (Inherited: 0x370)
struct AAIAlertRPC : AActor
{
	DEFINE_UE_CLASS_HELPERS(AAIAlertRPC, "AIAlertRPC")

	uint8_t Pad_0x370[0x8]; // 0x370(0x8)
	float TeammateActiveRange; // 0x378(0x4)
	struct FAlertMarkConfig AlertMarkConfig; // 0x37C(0x14)
	struct TArray<struct FConflictZoneInfo> ConflictZoneInfoArray; // 0x390(0x10)
	struct FTimerHandle UpdateTimerHandle; // 0x3A0(0x8)
	struct TMap<struct FString, struct UMapIconViewController*> ClientConflictZoneControllerMap; // 0x3A8(0x50)

	// Object: Function DFMAbility.AIAlertRPC.SpawnAIAlertRPC
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0xc3df5f8
	// Params: [ Num(2) Size(0x10) ]
	static struct AAIAlertRPC* SpawnAIAlertRPC(struct AActor* OwnerActor);

	// Object: Function DFMAbility.AIAlertRPC.OnRep_ConflictZoneInfoArray
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3df5e4
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_ConflictZoneInfoArray();

	// Object: Function DFMAbility.AIAlertRPC.MulticastUpdateConflictZones
	// Flags: [Net|Native|Event|NetMulticast|Public]
	// Offset: 0xc3df530
	// Params: [ Num(1) Size(0x10) ]
	void MulticastUpdateConflictZones(struct TArray<struct FConflictZoneInfo> InConflictZoneInfoArray);

	// Object: Function DFMAbility.AIAlertRPC.FindAIAlertRPC
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0xc3df48c
	// Params: [ Num(2) Size(0x10) ]
	static struct AAIAlertRPC* FindAIAlertRPC(struct AActor* OwnerActor);

	// Object: Function DFMAbility.AIAlertRPC.ClientShowTips
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xc3df3d8
	// Params: [ Num(1) Size(0x10) ]
	void ClientShowTips(struct FString TipsBuffer);

	// Object: Function DFMAbility.AIAlertRPC.ClientPlayAlertSubtitle
	// Flags: [Net|Native|Event|NetMulticast|Public]
	// Offset: 0xc3df2b0
	// Params: [ Num(2) Size(0x68) ]
	void ClientPlayAlertSubtitle(struct FAIAlertSubtitleInfo SubtitleInfo, struct AActor* SpeakerActor);
};

// Object: Class DFMAbility.AnimNotify_BionicSpy
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_BionicSpy : UAnimNotify
{
	DEFINE_UE_CLASS_HELPERS(UAnimNotify_BionicSpy, "AnimNotify_BionicSpy")
};

// Object: Class DFMAbility.AnimNotifyState_HideBones
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotifyState_HideBones : UAnimNotifyState
{
	DEFINE_UE_CLASS_HELPERS(UAnimNotifyState_HideBones, "AnimNotifyState_HideBones")

	struct TArray<struct FName> BoneNames; // 0x30(0x10)
};

// Object: Class DFMAbility.ArtilleryShell
// Size: 0x4D0 (Inherited: 0x370)
struct AArtilleryShell : AActor
{
	DEFINE_UE_CLASS_HELPERS(AArtilleryShell, "ArtilleryShell")

	uint8_t Pad_0x370[0x18]; // 0x370(0x18)
	struct UArtilleryShellProjectileSphereComponent* SceneRoot; // 0x388(0x8)
	struct UArtilleryShellProjectileMovementComponent* ProjectileMovementComponent; // 0x390(0x8)
	struct FArtilleryShellMovementParameter MovementParameter; // 0x398(0x48)
	int64_t ExplodeAttackerValueId; // 0x3E0(0x8)
	uint8_t bExplosionEffectDirUseImpactNormal : 1; // 0x3E8(0x1), Mask(0x1)
	uint8_t BitPad_0x3E8_1 : 7; // 0x3E8(0x1)
	uint8_t bGetHitFXIndexOnClient : 1; // 0x3E9(0x1), Mask(0x1)
	uint8_t BitPad_0x3E9_1 : 7; // 0x3E9(0x1)
	uint8_t bReturnFaceIndex_GetHitFXIndex : 1; // 0x3EA(0x1), Mask(0x1)
	uint8_t BitPad_0x3EA_1 : 7; // 0x3EA(0x1)
	uint8_t Pad_0x3EB[0x1]; // 0x3EB(0x1)
	float GetHitFXIndex_Offset; // 0x3EC(0x4)
	struct TArray<struct FArtilleryShellHitFXSurfaceAttribute> HitFXSurfaceAttributes; // 0x3F0(0x10)
	struct TMap<struct FName, struct FRotator> HitEffectRotatorOffsetMap; // 0x400(0x50)
	struct FName ShellTrailEffectID; // 0x450(0x8)
	ECraterSizeType CraterSizeID; // 0x458(0x1)
	uint8_t Pad_0x459[0x3]; // 0x459(0x3)
	float DelayDisappearTime; // 0x45C(0x4)
	uint8_t bModifyDamage : 1; // 0x460(0x1), Mask(0x1)
	uint8_t BitPad_0x460_1 : 7; // 0x460(0x1)
	uint8_t Pad_0x461[0x3]; // 0x461(0x3)
	float TeamMateDamageRatio; // 0x464(0x4)
	float TeamMateVehicleDamageRatio; // 0x468(0x4)
	float KnockDownRadius; // 0x46C(0x4)
	EExplosionType ExplosionType; // 0x470(0x1)
	uint8_t Pad_0x471[0x3]; // 0x471(0x3)
	float CameraShakeRadius; // 0x474(0x4)
	struct FName ScreenEffectName; // 0x478(0x8)
	float ScreenEffectRadius; // 0x480(0x4)
	uint8_t bEnableOptMoveTick : 1; // 0x484(0x1), Mask(0x1)
	uint8_t BitPad_0x484_1 : 7; // 0x484(0x1)
	uint8_t OptMoveTickFrame; // 0x485(0x1)
	uint8_t Pad_0x486[0x12]; // 0x486(0x12)
	struct UFXResourceContainerComponent* ShellTrailEffectContainer; // 0x498(0x8)
	uint8_t Pad_0x4A0[0x5]; // 0x4A0(0x5)
	uint8_t bCheckUnderWater : 1; // 0x4A5(0x1), Mask(0x1)
	uint8_t BitPad_0x4A5_1 : 7; // 0x4A5(0x1)
	uint8_t Pad_0x4A6[0x2]; // 0x4A6(0x2)
	float UnderWaterZ; // 0x4A8(0x4)
	float bUseWave; // 0x4AC(0x4)
	struct FName InToWaterEffectID; // 0x4B0(0x8)
	uint8_t Pad_0x4B8[0x18]; // 0x4B8(0x18)

	// Object: Function DFMAbility.ArtilleryShell.UpdateUnderWater
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3e0244
	// Params: [ Num(0) Size(0x0) ]
	void UpdateUnderWater();

	// Object: Function DFMAbility.ArtilleryShell.UpdateDynamicCollisionElement
	// Flags: [Native|Public]
	// Offset: 0xc3e0228
	// Params: [ Num(0) Size(0x0) ]
	void UpdateDynamicCollisionElement();

	// Object: Function DFMAbility.ArtilleryShell.StopShellTrailEffect
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e0214
	// Params: [ Num(0) Size(0x0) ]
	void StopShellTrailEffect();

	// Object: Function DFMAbility.ArtilleryShell.SpawnExplosionActor
	// Flags: [Native|Public|HasDefaults]
	// Offset: 0xc3e012c
	// Params: [ Num(2) Size(0x18) ]
	void SpawnExplosionActor(struct FVector Location, struct FRotator Rotator);

	// Object: Function DFMAbility.ArtilleryShell.PlayShellTrailEffect
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e0118
	// Params: [ Num(0) Size(0x0) ]
	void PlayShellTrailEffect();

	// Object: Function DFMAbility.ArtilleryShell.PlayScreenEffect
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xc3e0038
	// Params: [ Num(2) Size(0x10) ]
	void PlayScreenEffect(struct FVector Location, float Distance);

	// Object: Function DFMAbility.ArtilleryShell.PlayExplosionEffect
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xc3dff1c
	// Params: [ Num(3) Size(0x1C) ]
	void PlayExplosionEffect(struct FVector Location, struct FRotator Rotator, int32_t HitFXIndex);

	// Object: Function DFMAbility.ArtilleryShell.PlayCameraShake
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xc3dfe3c
	// Params: [ Num(2) Size(0x10) ]
	void PlayCameraShake(struct FVector Location, float Distance);

	// Object: Function DFMAbility.ArtilleryShell.OnShellHitBP
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void OnShellHitBP();

	// Object: Function DFMAbility.ArtilleryShell.OnShellHit
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xc3dfd74
	// Params: [ Num(1) Size(0x88) ]
	void OnShellHit(const struct FHitResult& ImpactResult);

	// Object: Function DFMAbility.ArtilleryShell.OnRep_MovementParameter
	// Flags: [Final|Native|Public]
	// Offset: 0xc3dfd60
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_MovementParameter();

	// Object: Function DFMAbility.ArtilleryShell.NeedSpawnExplosionActor
	// Flags: [Native|Public]
	// Offset: 0xc3dfd20
	// Params: [ Num(1) Size(0x1) ]
	uint8_t NeedSpawnExplosionActor();

	// Object: Function DFMAbility.ArtilleryShell.MulticastShellExploded
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults]
	// Offset: 0xc3dfbfc
	// Params: [ Num(3) Size(0x1C) ]
	void MulticastShellExploded(struct FVector Location, struct FRotator Rotator, int32_t HitFXIndex);

	// Object: Function DFMAbility.ArtilleryShell.IsUnderWater
	// Flags: [Final|Native|Protected|HasDefaults]
	// Offset: 0xc3dfb4c
	// Params: [ Num(2) Size(0xD) ]
	uint8_t IsUnderWater(struct FVector pos);

	// Object: Function DFMAbility.ArtilleryShell.GetHitFXSurfaceAttributeIndexOnClient
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xc3dfaa0
	// Params: [ Num(2) Size(0x10) ]
	int32_t GetHitFXSurfaceAttributeIndexOnClient(struct FVector Location);

	// Object: Function DFMAbility.ArtilleryShell.GetHitFXSurfaceAttributeIndex
	// Flags: [Final|Native|Public]
	// Offset: 0xc3df9b0
	// Params: [ Num(3) Size(0x8) ]
	int32_t GetHitFXSurfaceAttributeIndex(EPhysicalSurface HitSurfaceType, uint8_t bIsHitLandscape);

	// Object: Function DFMAbility.ArtilleryShell.DestroySelf
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3df99c
	// Params: [ Num(0) Size(0x0) ]
	void DestroySelf();

	// Object: Function DFMAbility.ArtilleryShell.ClearDynmicCollisionElement
	// Flags: [Native|Public]
	// Offset: 0xc3df980
	// Params: [ Num(0) Size(0x0) ]
	void ClearDynmicCollisionElement();

	// Object: Function DFMAbility.ArtilleryShell.BP_GetTrailEffectSocket
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x8) ]
	struct USceneComponent* BP_GetTrailEffectSocket();

	// Object: Function DFMAbility.ArtilleryShell.BP_GetShellObj
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x8) ]
	struct USceneComponent* BP_GetShellObj();

	// Object: Function DFMAbility.ArtilleryShell.BP_GetDynmicCollisionBox
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x8) ]
	struct UBoxComponent* BP_GetDynmicCollisionBox();
};

// Object: Class DFMAbility.ArtilleryShell_GuidedMissle
// Size: 0x578 (Inherited: 0x4D0)
struct AArtilleryShell_GuidedMissle : AArtilleryShell
{
	DEFINE_UE_CLASS_HELPERS(AArtilleryShell_GuidedMissle, "ArtilleryShell_GuidedMissle")

	struct UGPAudioEventAsset* AlertStartAudioEvent; // 0x4D0(0x8)
	struct UGPAudioEventAsset* AlertStopAudioEvent; // 0x4D8(0x8)
	float AlertAudioDelay; // 0x4E0(0x4)
	float AlertAudioDuration; // 0x4E4(0x4)
	struct UGPAudioEventAsset* FlyStartAudioEvent; // 0x4E8(0x8)
	struct UGPAudioEventAsset* FlyStopAudioEvent; // 0x4F0(0x8)
	float FlyAudioDelay; // 0x4F8(0x4)
	uint8_t Pad_0x4FC[0x4]; // 0x4FC(0x4)
	struct UGPAudioEventAsset* InCommingAudioEvent; // 0x500(0x8)
	float InCommingAudioHeight; // 0x508(0x4)
	struct FName LightEffectID; // 0x50C(0x8)
	struct FVector LightEffectScale; // 0x514(0xC)
	float LightEffectHideHeight; // 0x520(0x4)
	uint8_t Pad_0x524[0x34]; // 0x524(0x34)
	struct UFXResourceContainerComponent* LightEffectContainer; // 0x558(0x8)
	uint8_t Pad_0x560[0x18]; // 0x560(0x18)

	// Object: Function DFMAbility.ArtilleryShell_GuidedMissle.StopFlyAudio
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e3890
	// Params: [ Num(0) Size(0x0) ]
	void StopFlyAudio();

	// Object: Function DFMAbility.ArtilleryShell_GuidedMissle.StopAlertAudio
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e387c
	// Params: [ Num(0) Size(0x0) ]
	void StopAlertAudio();

	// Object: Function DFMAbility.ArtilleryShell_GuidedMissle.PreloadResourceStep2
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e3868
	// Params: [ Num(0) Size(0x0) ]
	void PreloadResourceStep2();

	// Object: Function DFMAbility.ArtilleryShell_GuidedMissle.PreloadResourceStep1
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e3854
	// Params: [ Num(0) Size(0x0) ]
	void PreloadResourceStep1();

	// Object: Function DFMAbility.ArtilleryShell_GuidedMissle.PreloadResource
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e3840
	// Params: [ Num(0) Size(0x0) ]
	void PreloadResource();

	// Object: Function DFMAbility.ArtilleryShell_GuidedMissle.PlayLightEffect
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e382c
	// Params: [ Num(0) Size(0x0) ]
	void PlayLightEffect();

	// Object: Function DFMAbility.ArtilleryShell_GuidedMissle.PlayFlyAudio
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e3818
	// Params: [ Num(0) Size(0x0) ]
	void PlayFlyAudio();

	// Object: Function DFMAbility.ArtilleryShell_GuidedMissle.PlayAlertAudio
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e3804
	// Params: [ Num(0) Size(0x0) ]
	void PlayAlertAudio();

	// Object: Function DFMAbility.ArtilleryShell_GuidedMissle.DestoryLightEffect
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e37f0
	// Params: [ Num(0) Size(0x0) ]
	void DestoryLightEffect();

	// Object: Function DFMAbility.ArtilleryShell_GuidedMissle.CheckHeight
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e37dc
	// Params: [ Num(0) Size(0x0) ]
	void CheckHeight();
};

// Object: Class DFMAbility.ArtilleryShell_SectorArtilerrate
// Size: 0x4F8 (Inherited: 0x4D0)
struct AArtilleryShell_SectorArtilerrate : AArtilleryShell
{
	DEFINE_UE_CLASS_HELPERS(AArtilleryShell_SectorArtilerrate, "ArtilleryShell_SectorArtilerrate")

	struct UGPAudioEventAsset* FlyStartAudioEvent; // 0x4D0(0x8)
	struct UGPAudioEventAsset* FlyStopAudioEvent; // 0x4D8(0x8)
	float FlyAudioDelay; // 0x4E0(0x4)
	uint8_t Pad_0x4E4[0x14]; // 0x4E4(0x14)

	// Object: Function DFMAbility.ArtilleryShell_SectorArtilerrate.StopFlyAudio
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e38d4
	// Params: [ Num(0) Size(0x0) ]
	void StopFlyAudio();

	// Object: Function DFMAbility.ArtilleryShell_SectorArtilerrate.PreloadResource
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e38c0
	// Params: [ Num(0) Size(0x0) ]
	void PreloadResource();

	// Object: Function DFMAbility.ArtilleryShell_SectorArtilerrate.PlayFlyAudio
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e38ac
	// Params: [ Num(0) Size(0x0) ]
	void PlayFlyAudio();
};

// Object: Class DFMAbility.ArtilleryShell_SectorSmoke
// Size: 0x518 (Inherited: 0x4D0)
struct AArtilleryShell_SectorSmoke : AArtilleryShell
{
	DEFINE_UE_CLASS_HELPERS(AArtilleryShell_SectorSmoke, "ArtilleryShell_SectorSmoke")

	float UpdateFoliageBuffInterval; // 0x4CC(0x4)
	struct TArray<struct TWeakObjectPtr<struct AActor>> PreInsideActorList; // 0x4D0(0x10)
	struct UGPAudioEventAsset* FlyStartAudioEvent; // 0x4E0(0x8)
	struct UGPAudioEventAsset* FlyStopAudioEvent; // 0x4E8(0x8)
	float FlyAudioDelay; // 0x4F0(0x4)
	int32_t SmokeId; // 0x4F4(0x4)
	struct AGPDeformableSmokeEmitActor* SmokeEmitActorBP; // 0x4F8(0x8)
	uint8_t Pad_0x504[0x14]; // 0x504(0x14)

	// Object: Function DFMAbility.ArtilleryShell_SectorSmoke.UpdateFoliageBuffForCharacter
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3e3954
	// Params: [ Num(0) Size(0x0) ]
	void UpdateFoliageBuffForCharacter();

	// Object: Function DFMAbility.ArtilleryShell_SectorSmoke.StopFlyAudio
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e3940
	// Params: [ Num(0) Size(0x0) ]
	void StopFlyAudio();

	// Object: Function DFMAbility.ArtilleryShell_SectorSmoke.PreloadResource
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e392c
	// Params: [ Num(0) Size(0x0) ]
	void PreloadResource();

	// Object: Function DFMAbility.ArtilleryShell_SectorSmoke.PlayFlyAudio
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e3918
	// Params: [ Num(0) Size(0x0) ]
	void PlayFlyAudio();

	// Object: Function DFMAbility.ArtilleryShell_SectorSmoke.ClearAllCharacterBuff
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3e3904
	// Params: [ Num(0) Size(0x0) ]
	void ClearAllCharacterBuff();

	// Object: Function DFMAbility.ArtilleryShell_SectorSmoke.ClearActorInside
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3e38f0
	// Params: [ Num(0) Size(0x0) ]
	void ClearActorInside();
};

// Object: Class DFMAbility.ArtilleryShellingTemplate
// Size: 0x488 (Inherited: 0x370)
struct AArtilleryShellingTemplate : AActor
{
	DEFINE_UE_CLASS_HELPERS(AArtilleryShellingTemplate, "ArtilleryShellingTemplate")

	uint8_t bIsSpawnSmoke : 1; // 0x370(0x1), Mask(0x1)
	uint8_t BitPad_0x370_1 : 7; // 0x370(0x1)
	uint8_t bIsShowTips : 1; // 0x371(0x1), Mask(0x1)
	uint8_t BitPad_0x371_1 : 7; // 0x371(0x1)
	uint8_t Pad_0x372[0x2]; // 0x372(0x2)
	int32_t SkillId; // 0x374(0x4)
	struct FBreakthroughEventRange ShellNumRange; // 0x378(0x8)
	EArtilleryShellDropMethod DropMethod; // 0x380(0x1)
	uint8_t Pad_0x381[0x7]; // 0x381(0x7)
	struct TArray<struct FVector2D> DropOrder; // 0x388(0x10)
	float Extent; // 0x398(0x4)
	float ExtraRandomOffset; // 0x39C(0x4)
	float FireInterval; // 0x3A0(0x4)
	float FireDelay; // 0x3A4(0x4)
	struct AArtilleryShell* ShellTemplate; // 0x3A8(0x8)
	float ShellFireDistance; // 0x3B0(0x4)
	float ShellFireHeight; // 0x3B4(0x4)
	float ShellFlyTime; // 0x3B8(0x4)
	float GravityZ; // 0x3BC(0x4)
	float RemoveUseCountDelay; // 0x3C0(0x4)
	uint8_t bEnableObstacleAvoidance : 1; // 0x3C4(0x1), Mask(0x1)
	uint8_t BitPad_0x3C4_1 : 7; // 0x3C4(0x1)
	uint8_t Pad_0x3C5[0x3]; // 0x3C5(0x3)
	float ObstacleThreshold; // 0x3C8(0x4)
	uint8_t bEnableObstacleAvoidance_Horizontal : 1; // 0x3CC(0x1), Mask(0x1)
	uint8_t BitPad_0x3CC_1 : 7; // 0x3CC(0x1)
	uint8_t AvoidObstacleAngle; // 0x3CD(0x1)
	uint8_t AvoidObstacleAngleNum; // 0x3CE(0x1)
	uint8_t bEnableObstacleAvoidance_Vertical : 1; // 0x3CF(0x1), Mask(0x1)
	uint8_t BitPad_0x3CF_1 : 7; // 0x3CF(0x1)
	uint8_t AvoidObstacleAngleNum_Vertical; // 0x3D0(0x1)
	uint8_t bUseSphereTrace : 1; // 0x3D1(0x1), Mask(0x1)
	uint8_t BitPad_0x3D1_1 : 7; // 0x3D1(0x1)
	uint8_t bCheckUnderWater : 1; // 0x3D2(0x1), Mask(0x1)
	uint8_t BitPad_0x3D2_1 : 7; // 0x3D2(0x1)
	uint8_t Pad_0x3D3[0x1]; // 0x3D3(0x1)
	float UnderWaterZ; // 0x3D4(0x4)
	uint8_t bIsEnableLaunchAudio : 1; // 0x3D8(0x1), Mask(0x1)
	uint8_t BitPad_0x3D8_1 : 7; // 0x3D8(0x1)
	uint8_t Pad_0x3D9[0x3]; // 0x3D9(0x3)
	float LaunchAudioDelayTime; // 0x3DC(0x4)
	uint8_t bIsEnableWarnAudio : 1; // 0x3E0(0x1), Mask(0x1)
	uint8_t BitPad_0x3E0_1 : 7; // 0x3E0(0x1)
	uint8_t Pad_0x3E1[0x3]; // 0x3E1(0x3)
	float WarnAudioDelayTime; // 0x3E4(0x4)
	float WarnAudioStopOffsetTime; // 0x3E8(0x4)
	uint8_t Pad_0x3EC[0x7C]; // 0x3EC(0x7C)
	struct AGPCharacter* MakerInstigator; // 0x468(0x8)
	uint8_t Pad_0x470[0x18]; // 0x470(0x18)

	// Object: Function DFMAbility.ArtilleryShellingTemplate.SetCampId
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3e3c8c
	// Params: [ Num(1) Size(0x4) ]
	void SetCampId(int32_t NewCampId);

	// Object: Function DFMAbility.ArtilleryShellingTemplate.ClientDebugTraceLine
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults]
	// Offset: 0xc3e3a94
	// Params: [ Num(5) Size(0xA8) ]
	void ClientDebugTraceLine(struct FVector Start, struct FVector End, struct FColor Color, struct FHitResult HitResult, float radius);

	// Object: Function DFMAbility.ArtilleryShellingTemplate.ArtilleryShellingCommand
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xc3e39d8
	// Params: [ Num(2) Size(0x9) ]
	uint8_t ArtilleryShellingCommand(const struct FVector2D& pos);
};

// Object: Class DFMAbility.ArtilleryShellProjectileMovementComponent
// Size: 0x270 (Inherited: 0x210)
struct UArtilleryShellProjectileMovementComponent : UProjectileMovementComponent
{
	DEFINE_UE_CLASS_HELPERS(UArtilleryShellProjectileMovementComponent, "ArtilleryShellProjectileMovementComponent")

	uint8_t bUseNewMove : 1; // 0x20C(0x1), Mask(0x1)
	struct TArray<struct UObject*> IgnoreObjectClass; // 0x210(0x10)
	uint8_t bIgnoreADS : 1; // 0x220(0x1), Mask(0x1)
	uint8_t BitPad_0x220_2 : 6; // 0x220(0x1)
	uint8_t Pad_0x221[0x3]; // 0x221(0x3)
	int32_t ClientIgnoreCollisionDistSquared; // 0x224(0x4)
	struct TArray<struct FName> ClientIgnoreActorTagArr; // 0x228(0x10)
	struct TArray<struct FString> ClientIgnoreActorNameArr; // 0x238(0x10)
	struct FVector Direction; // 0x248(0xC)
	struct FVector RebasedDestination; // 0x254(0xC)
	float Accelerate; // 0x260(0x4)
	uint8_t Pad_0x264[0xC]; // 0x264(0xC)

	// Object: Function DFMAbility.ArtilleryShellProjectileMovementComponent.InitClientIgnoreActorWhenMoving
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e3ebc
	// Params: [ Num(0) Size(0x0) ]
	void InitClientIgnoreActorWhenMoving();

	// Object: Function DFMAbility.ArtilleryShellProjectileMovementComponent.Init
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xc3e3dac
	// Params: [ Num(2) Size(0x58) ]
	void Init(struct FVector InitVelocity, struct FArtilleryShellMovementParameter MovementParameter);
};

// Object: Class DFMAbility.ArtilleryShellProjectileSphereComponent
// Size: 0x5A0 (Inherited: 0x5A0)
struct UArtilleryShellProjectileSphereComponent : USphereComponent
{
	DEFINE_UE_CLASS_HELPERS(UArtilleryShellProjectileSphereComponent, "ArtilleryShellProjectileSphereComponent")

	uint8_t bReturnFaceIndexOnMove : 1; // 0x594(0x1), Mask(0x1)
};

// Object: Class DFMAbility.BionicBirdActor
// Size: 0x7A0 (Inherited: 0x4D0)
struct ABionicBirdActor : ABionicBirdBaseActor
{
	DEFINE_UE_CLASS_HELPERS(ABionicBirdActor, "BionicBirdActor")

	uint8_t Pad_0x4D0[0x18]; // 0x4D0(0x18)
	float EnergyConsumedSpeed_SOL; // 0x4E8(0x4)
	float MaxHealth_SOL; // 0x4EC(0x4)
	uint8_t bIsDebug : 1; // 0x4F0(0x1), Mask(0x1)
	uint8_t BitPad_0x4F0_1 : 7; // 0x4F0(0x1)
	uint8_t bCleanSprintCancelRequest : 1; // 0x4F1(0x1), Mask(0x1)
	uint8_t BitPad_0x4F1_1 : 7; // 0x4F1(0x1)
	uint8_t bPilotVerify : 1; // 0x4F2(0x1), Mask(0x1)
	uint8_t BitPad_0x4F2_1 : 7; // 0x4F2(0x1)
	uint8_t Pad_0x4F3[0x1]; // 0x4F3(0x1)
	float PilotVerifySize; // 0x4F4(0x4)
	float PilotVerifyOffset; // 0x4F8(0x4)
	float PilotVerifyDestroyDelay; // 0x4FC(0x4)
	float MoveTrainCheckSize; // 0x500(0x4)
	float MoveTrainCheckCD; // 0x504(0x4)
	int32_t SkillId; // 0x508(0x4)
	int32_t SpySkillID; // 0x50C(0x4)
	int32_t ThreatId; // 0x510(0x4)
	int32_t OnControlBuffId; // 0x514(0x4)
	struct FName BaseAttachTag; // 0x518(0x8)
	struct FName AttachToViewTargetTag; // 0x520(0x8)
	float ViewTraceInterval; // 0x528(0x4)
	float ClientLaunchDisableTime; // 0x52C(0x4)
	float LauncherBulletBaseSpeed; // 0x530(0x4)
	float LauncherBulletMoveSpeedScale; // 0x534(0x4)
	float AnimRotatorInterpSpeed; // 0x538(0x4)
	uint8_t Pad_0x53C[0x4]; // 0x53C(0x4)
	struct TArray<int32_t> DamageIgnoreBuffIds; // 0x540(0x10)
	struct FName HudViewName; // 0x550(0x8)
	struct AAbilityWeaponThrowableBullet* LauncherBulletClass; // 0x558(0x8)
	float NoEmpGrenadeTipsTime; // 0x560(0x4)
	int32_t LauncherBulletPreviewID; // 0x564(0x4)
	float LauncherBulletPreviewMaxSimTime; // 0x568(0x4)
	float BaseFOV; // 0x56C(0x4)
	float SprintFOV; // 0x570(0x4)
	float FOVLerpSpeed; // 0x574(0x4)
	struct FName BaseDestroyFXName; // 0x578(0x8)
	struct FName DamageDestroyFXName; // 0x580(0x8)
	struct FName SprintExplosionFXName; // 0x588(0x8)
	uint8_t bDestroyUnderWater : 1; // 0x590(0x1), Mask(0x1)
	uint8_t BitPad_0x590_1 : 7; // 0x590(0x1)
	uint8_t bUseSettingSensitivity : 1; // 0x591(0x1), Mask(0x1)
	uint8_t BitPad_0x591_1 : 7; // 0x591(0x1)
	uint8_t bIsClientDestroyStopMark : 1; // 0x592(0x1), Mask(0x1)
	uint8_t BitPad_0x592_1 : 7; // 0x592(0x1)
	uint8_t Pad_0x593[0x1]; // 0x593(0x1)
	float MaxHeight; // 0x594(0x4)
	float ThrowableAttachVelocityScale; // 0x598(0x4)
	float MaxVelocity; // 0x59C(0x4)
	float MobileMaxVelocity; // 0x5A0(0x4)
	float BlockingMinVelocity; // 0x5A4(0x4)
	struct FVector2D BlockingDecelerationInput; // 0x5A8(0x8)
	struct FVector2D BlockingDecelerationOutput; // 0x5B0(0x8)
	struct FVector InputMinValue; // 0x5B8(0xC)
	float InputLeftRightScale; // 0x5C4(0x4)
	float InputBackScale; // 0x5C8(0x4)
	struct FVector Acceleration; // 0x5CC(0xC)
	struct FVector2D VelocityToAccelerationScaleInput; // 0x5D8(0x8)
	struct FVector2D VelocityToAccelerationScaleOutput; // 0x5E0(0x8)
	struct FVector2D XVelocityToYZAccelerationScaleInput; // 0x5E8(0x8)
	struct FVector2D XVelocityToYZAccelerationScaleOutput; // 0x5F0(0x8)
	struct FVector2D VelocityToDecelerationInput; // 0x5F8(0x8)
	struct FVector2D VelocityToDecelerationOutput; // 0x600(0x8)
	struct FVector2D VelocityInterpSpeedInput; // 0x608(0x8)
	struct FVector2D VelocityInterpSpeedOutput; // 0x610(0x8)
	float VelocityInterpAngleDecelerationScale; // 0x618(0x4)
	struct FVector2D PitchLimit; // 0x61C(0x8)
	float MobileRotaRecoverDelay; // 0x624(0x4)
	float MobileRotaRecoverSpeed; // 0x628(0x4)
	float YawSensitive; // 0x62C(0x4)
	float MobileYawSensitive; // 0x630(0x4)
	float YawRotateSpeed; // 0x634(0x4)
	float PitchSensitive; // 0x638(0x4)
	float MobilePitchSensitive; // 0x63C(0x4)
	float PitchRotateSpeed; // 0x640(0x4)
	float YawToRollArg; // 0x644(0x4)
	float YInputToRollArg; // 0x648(0x4)
	float RollInterpSpeed; // 0x64C(0x4)
	float MinRotateValue; // 0x650(0x4)
	float SprintDelayTime; // 0x654(0x4)
	float SprintStartDeceleration; // 0x658(0x4)
	struct FVector SprintAcceleration; // 0x65C(0xC)
	float SprintMaxVelocity; // 0x668(0x4)
	float SprintYawRotateSpeed; // 0x66C(0x4)
	float SprintPitchRotateSpeed; // 0x670(0x4)
	float SprintEnergyConsumedSpeedScale; // 0x674(0x4)
	int32_t SprintAttackValueId; // 0x678(0x4)
	uint8_t bIsDebugMode : 1; // 0x67C(0x1), Mask(0x1)
	uint8_t BitPad_0x67C_1 : 7; // 0x67C(0x1)
	uint8_t Pad_0x67D[0x3]; // 0x67D(0x3)
	struct FVector DebugMoveInput; // 0x680(0xC)
	struct FRotator DebugRotatorInput; // 0x68C(0xC)
	struct FString BeDestroyedVoiceString; // 0x698(0x10)
	struct UGPAudioEventAsset* FlySoundEvent; // 0x6A8(0x8)
	struct UGPAudioEventAsset* FlySoundStopEvent; // 0x6B0(0x8)
	struct UGPAudioEventAsset* SprintSoundEvent; // 0x6B8(0x8)
	struct UGPAudioEventAsset* SprintSoundStopEvent; // 0x6C0(0x8)
	struct UGPAudioEventAsset* LauncherSoundEvent; // 0x6C8(0x8)
	struct UBionicBirdMovement* BirdMovement; // 0x6D0(0x8)
	uint8_t Pad_0x6D8[0x10]; // 0x6D8(0x10)
	uint8_t bIsPilotVerify : 1; // 0x6E8(0x1), Mask(0x1)
	uint8_t BitPad_0x6E8_1 : 7; // 0x6E8(0x1)
	uint8_t Pad_0x6E9[0x3]; // 0x6E9(0x3)
	float CurrPilotVerifyDestroyDelay; // 0x6EC(0x4)
	float ClientDestroyTime; // 0x6F0(0x4)
	EVehicleAbilityType LockVehicleType; // 0x6F4(0x1)
	uint8_t Pad_0x6F5[0x3]; // 0x6F5(0x3)
	struct UMobilePlayerInput* MobilePlayerInput; // 0x6F8(0x8)
	float NoMobileTouchTime; // 0x700(0x4)
	uint8_t bIsStartMarking : 1; // 0x704(0x1), Mask(0x1)
	uint8_t BitPad_0x704_1 : 7; // 0x704(0x1)
	uint8_t Pad_0x705[0x3]; // 0x705(0x3)
	struct UC203MarkComponent* MarkComponent; // 0x708(0x8)
	float NextMarkingTime; // 0x710(0x4)
	struct FVector CameraLocation; // 0x714(0xC)
	struct FVector CameraForward; // 0x720(0xC)
	uint8_t bHasLaunched : 1; // 0x72C(0x1), Mask(0x1)
	uint8_t BitPad_0x72C_1 : 7; // 0x72C(0x1)
	uint8_t Pad_0x72D[0x3]; // 0x72D(0x3)
	float CurrClientLaunchDisableTime; // 0x730(0x4)
	struct TWeakObjectPtr<struct AActor> WeaponOwner; // 0x734(0x8)
	int32_t ChildAttachedNum; // 0x73C(0x4)
	uint8_t bIsMoveUp : 1; // 0x740(0x1), Mask(0x1)
	uint8_t BitPad_0x740_1 : 7; // 0x740(0x1)
	uint8_t bIsMoveDown : 1; // 0x741(0x1), Mask(0x1)
	uint8_t BitPad_0x741_1 : 7; // 0x741(0x1)
	uint8_t Pad_0x742[0x2]; // 0x742(0x2)
	float CameraRollValue; // 0x744(0x4)
	struct FRotator CurrentRotateInput; // 0x748(0xC)
	struct FRotator LastRotateInput; // 0x754(0xC)
	float YawControl; // 0x760(0x4)
	float PitchControl; // 0x764(0x4)
	uint8_t bIsSprintKeyDown : 1; // 0x768(0x1), Mask(0x1)
	uint8_t BitPad_0x768_1 : 7; // 0x768(0x1)
	uint8_t Pad_0x769[0x3]; // 0x769(0x3)
	float SprintDelay; // 0x76C(0x4)
	uint8_t bIsSprint : 1; // 0x770(0x1), Mask(0x1)
	uint8_t BitPad_0x770_1 : 7; // 0x770(0x1)
	uint8_t bIsSprintHit : 1; // 0x771(0x1), Mask(0x1)
	uint8_t BitPad_0x771_1 : 7; // 0x771(0x1)
	uint8_t bIsSpawnDestroyFX : 1; // 0x772(0x1), Mask(0x1)
	uint8_t BitPad_0x772_1 : 7; // 0x772(0x1)
	uint8_t bIsBirdDestroyed : 1; // 0x773(0x1), Mask(0x1)
	uint8_t BitPad_0x773_1 : 7; // 0x773(0x1)
	uint8_t Pad_0x774[0x4]; // 0x774(0x4)
	struct UBionicBirdAnimInstance* CachedAnimInstance; // 0x778(0x8)
	struct USceneComponent* MeshRotateRoot; // 0x780(0x8)
	float UpdateAudioTime; // 0x788(0x4)
	struct FGPAudioFuturePlayingID FlyAudio; // 0x78C(0x8)
	struct FGPAudioFuturePlayingID SprintAudio; // 0x794(0x8)
	uint8_t Pad_0x79C[0x4]; // 0x79C(0x4)

	// Object: Function DFMAbility.BionicBirdActor.UpdateSprintDelay
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e54f8
	// Params: [ Num(1) Size(0x4) ]
	void UpdateSprintDelay(float DeltaTime);

	// Object: Function DFMAbility.BionicBirdActor.UpdateRotateInput
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e5454
	// Params: [ Num(1) Size(0x4) ]
	void UpdateRotateInput(float DeltaTime);

	// Object: Function DFMAbility.BionicBirdActor.UpdateCameraInfo
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e5440
	// Params: [ Num(0) Size(0x0) ]
	void UpdateCameraInfo();

	// Object: Function DFMAbility.BionicBirdActor.UpdateAnimation
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e539c
	// Params: [ Num(1) Size(0x4) ]
	void UpdateAnimation(float DeltaTime);

	// Object: Function DFMAbility.BionicBirdActor.TrySprint
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e5388
	// Params: [ Num(0) Size(0x0) ]
	void TrySprint();

	// Object: Function DFMAbility.BionicBirdActor.TrySetPilotVerify
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e52dc
	// Params: [ Num(1) Size(0x1) ]
	void TrySetPilotVerify(uint8_t bIsVerify);

	// Object: Function DFMAbility.BionicBirdActor.TryRemoveOnControlBuff
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e5238
	// Params: [ Num(1) Size(0x8) ]
	void TryRemoveOnControlBuff(struct AGPCharacter* InOwnerCharacter);

	// Object: Function DFMAbility.BionicBirdActor.TryRemoveInputTypeChangedEvent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e5224
	// Params: [ Num(0) Size(0x0) ]
	void TryRemoveInputTypeChangedEvent();

	// Object: Function DFMAbility.BionicBirdActor.TryMarking
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e5180
	// Params: [ Num(1) Size(0x4) ]
	void TryMarking(float DeltaTime);

	// Object: Function DFMAbility.BionicBirdActor.TryLaunch
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e516c
	// Params: [ Num(0) Size(0x0) ]
	void TryLaunch();

	// Object: Function DFMAbility.BionicBirdActor.TryHideSkillWeapon
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e50c8
	// Params: [ Num(1) Size(0x8) ]
	void TryHideSkillWeapon(struct AGPCharacter* GPCharacter);

	// Object: Function DFMAbility.BionicBirdActor.TryHideAttachedChild
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3e5024
	// Params: [ Num(1) Size(0x8) ]
	void TryHideAttachedChild(struct AActor* InChild);

	// Object: Function DFMAbility.BionicBirdActor.TryHideAllAttachedChildren
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3e5010
	// Params: [ Num(0) Size(0x0) ]
	void TryHideAllAttachedChildren();

	// Object: Function DFMAbility.BionicBirdActor.TryCloseAttachedChildResponseToProjectileChannel
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3e4f6c
	// Params: [ Num(1) Size(0x8) ]
	void TryCloseAttachedChildResponseToProjectileChannel(struct AActor* InChild);

	// Object: Function DFMAbility.BionicBirdActor.TryCleanSprintCancelRequest
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4ec8
	// Params: [ Num(1) Size(0x8) ]
	void TryCleanSprintCancelRequest(struct AGPCharacter* InOwnerCharacter);

	// Object: Function DFMAbility.BionicBirdActor.TryCastSpy
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4eb4
	// Params: [ Num(0) Size(0x0) ]
	void TryCastSpy();

	// Object: Function DFMAbility.BionicBirdActor.TryAddOnControlBuff
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4e10
	// Params: [ Num(1) Size(0x8) ]
	void TryAddOnControlBuff(struct AGPCharacter* InOwnerCharacter);

	// Object: Function DFMAbility.BionicBirdActor.TryAddKillScore
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4d6c
	// Params: [ Num(1) Size(0x8) ]
	void TryAddKillScore(struct AActor* Killer);

	// Object: Function DFMAbility.BionicBirdActor.TryAddInputTypeChangedEvent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4d58
	// Params: [ Num(0) Size(0x0) ]
	void TryAddInputTypeChangedEvent();

	// Object: Function DFMAbility.BionicBirdActor.TickPilotVerify
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4cb4
	// Params: [ Num(1) Size(0x4) ]
	void TickPilotVerify(float DeltaTime);

	// Object: Function DFMAbility.BionicBirdActor.TickCheckOwnerCharacter
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4ca0
	// Params: [ Num(0) Size(0x0) ]
	void TickCheckOwnerCharacter();

	// Object: Function DFMAbility.BionicBirdActor.StopAllSound
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4c8c
	// Params: [ Num(0) Size(0x0) ]
	void StopAllSound();

	// Object: Function DFMAbility.BionicBirdActor.SpawnDestroyEffect
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xc3e4b60
	// Params: [ Num(3) Size(0xE) ]
	void SpawnDestroyEffect(struct FVector Position, uint8_t bIsSprintEffect, uint8_t bIsDamageEffect);

	// Object: Function DFMAbility.BionicBirdActor.ShowNoEmpGrenadeTips
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4b4c
	// Params: [ Num(0) Size(0x0) ]
	void ShowNoEmpGrenadeTips();

	// Object: Function DFMAbility.BionicBirdActor.SetSkeletalMeshShowState
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4aa0
	// Params: [ Num(1) Size(0x1) ]
	void SetSkeletalMeshShowState(uint8_t bIsShow);

	// Object: Function DFMAbility.BionicBirdActor.SetIsStartMarking
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e49f4
	// Params: [ Num(1) Size(0x1) ]
	void SetIsStartMarking(uint8_t bInIsStartMarking);

	// Object: Function DFMAbility.BionicBirdActor.ServerTryLaunch
	// Flags: [Final|Net|NetReliableNative|Event|Private|NetServer]
	// Offset: 0xc3e49d8
	// Params: [ Num(0) Size(0x0) ]
	void ServerTryLaunch();

	// Object: Function DFMAbility.BionicBirdActor.ServerSprintHit
	// Flags: [Net|NetReliableNative|Event|Public|NetServer]
	// Offset: 0xc3e49bc
	// Params: [ Num(0) Size(0x0) ]
	void ServerSprintHit();

	// Object: Function DFMAbility.BionicBirdActor.ServerOnExitBtn
	// Flags: [Final|Net|NetReliableNative|Event|Private|NetServer]
	// Offset: 0xc3e49a0
	// Params: [ Num(0) Size(0x0) ]
	void ServerOnExitBtn();

	// Object: Function DFMAbility.BionicBirdActor.SendProjectileThreatExplosion
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e498c
	// Params: [ Num(0) Size(0x0) ]
	void SendProjectileThreatExplosion();

	// Object: Function DFMAbility.BionicBirdActor.SendProjectileThreatCreate
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4978
	// Params: [ Num(0) Size(0x0) ]
	void SendProjectileThreatCreate();

	// Object: Function DFMAbility.BionicBirdActor.RemoveCharacterTakeEMPEvent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4964
	// Params: [ Num(0) Size(0x0) ]
	void RemoveCharacterTakeEMPEvent();

	// Object: Function DFMAbility.BionicBirdActor.RemoveCharacterTakeDamageEvent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4950
	// Params: [ Num(0) Size(0x0) ]
	void RemoveCharacterTakeDamageEvent();

	// Object: Function DFMAbility.BionicBirdActor.ProcessMoveUnderWater
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e493c
	// Params: [ Num(0) Size(0x0) ]
	void ProcessMoveUnderWater();

	// Object: Function DFMAbility.BionicBirdActor.PlayFlySound
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4928
	// Params: [ Num(0) Size(0x0) ]
	void PlayFlySound();

	// Object: Function DFMAbility.BionicBirdActor.OnStartLocalFocusCheckNightVision
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4914
	// Params: [ Num(0) Size(0x0) ]
	void OnStartLocalFocusCheckNightVision();

	// Object: Function DFMAbility.BionicBirdActor.OnSprintHitActor
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e4870
	// Params: [ Num(1) Size(0x8) ]
	void OnSprintHitActor(struct AActor* OtherActor);

	// Object: Function DFMAbility.BionicBirdActor.OnServerKnockBack
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e47cc
	// Params: [ Num(1) Size(0x8) ]
	void OnServerKnockBack(struct AGPCharacterBase* InGPCharacterBase);

	// Object: Function DFMAbility.BionicBirdActor.OnRep_IsStartMarking
	// Flags: [Final|Native|Private]
	// Offset: 0x10a4fa08
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_IsStartMarking();

	// Object: Function DFMAbility.BionicBirdActor.OnRep_HasLaunched
	// Flags: [Final|Native|Private]
	// Offset: 0x10a993a0
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_HasLaunched();

	// Object: Function DFMAbility.BionicBirdActor.OnInputTypeChanged
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4728
	// Params: [ Num(1) Size(0x1) ]
	void OnInputTypeChanged(EGPInputType InputType);

	// Object: Function DFMAbility.BionicBirdActor.OnArenaRoundStateChange
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4714
	// Params: [ Num(0) Size(0x0) ]
	void OnArenaRoundStateChange();

	// Object: Function DFMAbility.BionicBirdActor.MulticastSpawnDestroyEffect
	// Flags: [Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults]
	// Offset: 0x107b7274
	// Params: [ Num(3) Size(0xE) ]
	void MulticastSpawnDestroyEffect(struct FVector Position, uint8_t bIsSprintEffect, uint8_t bIsDamageEffect);

	// Object: Function DFMAbility.BionicBirdActor.MulticastPlaySprintSound
	// Flags: [Final|Net|NetReliableNative|Event|NetMulticast|Private]
	// Offset: 0xc3e46f8
	// Params: [ Num(0) Size(0x0) ]
	void MulticastPlaySprintSound();

	// Object: Function DFMAbility.BionicBirdActor.MulticastPlayLauncherSound
	// Flags: [Final|Net|NetReliableNative|Event|NetMulticast|Private]
	// Offset: 0xc3e46dc
	// Params: [ Num(0) Size(0x0) ]
	void MulticastPlayLauncherSound();

	// Object: Function DFMAbility.BionicBirdActor.MakeSprintDamage
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e46c8
	// Params: [ Num(0) Size(0x0) ]
	void MakeSprintDamage();

	// Object: Function DFMAbility.BionicBirdActor.IsGamepadControl
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4690
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsGamepadControl();

	// Object: Function DFMAbility.BionicBirdActor.IsEnableBionicBirdDebug
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3e4658
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsEnableBionicBirdDebug();

	// Object: Function DFMAbility.BionicBirdActor.InitMobilePlayerInput
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e45b4
	// Params: [ Num(1) Size(0x8) ]
	void InitMobilePlayerInput(struct AGPCharacter* InOwnerCharacter);

	// Object: Function DFMAbility.BionicBirdActor.InitMobileArgs
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e45a0
	// Params: [ Num(0) Size(0x0) ]
	void InitMobileArgs();

	// Object: Function DFMAbility.BionicBirdActor.InitMarkComponent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e458c
	// Params: [ Num(0) Size(0x0) ]
	void InitMarkComponent();

	// Object: Function DFMAbility.BionicBirdActor.InitLockVehicleType
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4578
	// Params: [ Num(0) Size(0x0) ]
	void InitLockVehicleType();

	// Object: Function DFMAbility.BionicBirdActor.GetSkillComponent
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3e4544
	// Params: [ Num(1) Size(0x8) ]
	struct UGPSkillComponent* GetSkillComponent();

	// Object: Function DFMAbility.BionicBirdActor.GetMoveRotator
	// Flags: [Final|Native|Public|HasDefaults|Const]
	// Offset: 0xc3e450c
	// Params: [ Num(1) Size(0xC) ]
	struct FRotator GetMoveRotator();

	// Object: Function DFMAbility.BionicBirdActor.GetMaxVelocity
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3e44d8
	// Params: [ Num(1) Size(0x4) ]
	float GetMaxVelocity();

	// Object: Function DFMAbility.BionicBirdActor.GetIsShowSkeletalMesh
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3e44a0
	// Params: [ Num(1) Size(0x1) ]
	uint8_t GetIsShowSkeletalMesh();

	// Object: Function DFMAbility.BionicBirdActor.DoPilotVerify
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4468
	// Params: [ Num(1) Size(0x1) ]
	uint8_t DoPilotVerify();

	// Object: Function DFMAbility.BionicBirdActor.DoMoveTrainVerify
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4430
	// Params: [ Num(1) Size(0x1) ]
	uint8_t DoMoveTrainVerify();

	// Object: Function DFMAbility.BionicBirdActor.DoMarking
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e441c
	// Params: [ Num(0) Size(0x0) ]
	void DoMarking();

	// Object: Function DFMAbility.BionicBirdActor.DoLaunch
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4408
	// Params: [ Num(0) Size(0x0) ]
	void DoLaunch();

	// Object: Function DFMAbility.BionicBirdActor.DoHeightVerify
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e43d0
	// Params: [ Num(1) Size(0x1) ]
	uint8_t DoHeightVerify();

	// Object: Function DFMAbility.BionicBirdActor.DoCloseAttachedChildResponseToProjectileChannel
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3e432c
	// Params: [ Num(1) Size(0x8) ]
	void DoCloseAttachedChildResponseToProjectileChannel(struct AActor* InChild);

	// Object: Function DFMAbility.BionicBirdActor.DataFlowAddUseCount
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3e4318
	// Params: [ Num(0) Size(0x0) ]
	void DataFlowAddUseCount();

	// Object: Function DFMAbility.BionicBirdActor.DataFlowAddLaunchCount
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3e4304
	// Params: [ Num(0) Size(0x0) ]
	void DataFlowAddLaunchCount();

	// Object: Function DFMAbility.BionicBirdActor.DataFlowAddDestroyedCount
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3e42f0
	// Params: [ Num(0) Size(0x0) ]
	void DataFlowAddDestroyedCount();

	// Object: Function DFMAbility.BionicBirdActor.ClientPlayBeDestroyedVO
	// Flags: [Final|Net|NetReliableNative|Event|Private|NetClient|Const]
	// Offset: 0xc3e42d4
	// Params: [ Num(0) Size(0x0) ]
	void ClientPlayBeDestroyedVO();

	// Object: Function DFMAbility.BionicBirdActor.CheckSoundAlive
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e42c0
	// Params: [ Num(0) Size(0x0) ]
	void CheckSoundAlive();

	// Object: Function DFMAbility.BionicBirdActor.CheckMobileRota
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4210
	// Params: [ Num(2) Size(0x5) ]
	uint8_t CheckMobileRota(float DeltaTime);

	// Object: Function DFMAbility.BionicBirdActor.CheckMaxEnergy
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e41fc
	// Params: [ Num(0) Size(0x0) ]
	void CheckMaxEnergy();

	// Object: Function DFMAbility.BionicBirdActor.CheckAttachedChild
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e414c
	// Params: [ Num(2) Size(0x9) ]
	uint8_t CheckAttachedChild(struct USceneComponent* ChildComponent);

	// Object: Function DFMAbility.BionicBirdActor.AddCharacterTakeEMPEvent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4138
	// Params: [ Num(0) Size(0x0) ]
	void AddCharacterTakeEMPEvent();

	// Object: Function DFMAbility.BionicBirdActor.AddCharacterTakeDamageEvent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e4124
	// Params: [ Num(0) Size(0x0) ]
	void AddCharacterTakeDamageEvent();
};

// Object: Class DFMAbility.BionicBirdAnimInstance
// Size: 0xA40 (Inherited: 0x280)
struct UBionicBirdAnimInstance : UGPAnimInstanceBase
{
	DEFINE_UE_CLASS_HELPERS(UBionicBirdAnimInstance, "BionicBirdAnimInstance")

	struct FBionicBirdAnimInstanceProxy LocalProxy; // 0x280(0x7C0)

	// Object: Function DFMAbility.BionicBirdAnimInstance.SetState
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xc3e6bf0
	// Params: [ Num(4) Size(0x20) ]
	void SetState(struct FVector Velocity, struct FVector MoveInput, float Pitch, float Roll);
};

// Object: Class DFMAbility.BionicBirdGrenade
// Size: 0x1700 (Inherited: 0x16D0)
struct ABionicBirdGrenade : AWeaponThrowableBulletProjectile
{
	DEFINE_UE_CLASS_HELPERS(ABionicBirdGrenade, "BionicBirdGrenade")

	float ThrowTimeSeconds; // 0x16C4(0x4)
	float DeployTimeSeconds; // 0x16C8(0x4)
	float DeployStopMoveDelayTime; // 0x16CC(0x4)
	float DeploySpawnDelayTime; // 0x16D0(0x4)
	struct ABionicBirdActor* BionicBirdActorClass; // 0x16D8(0x8)
	struct UBionicBirdGrenadeMovement* BionicBirdGrenadeMovement; // 0x16E0(0x8)
	float ThrowTimeSecondsLeft; // 0x16E8(0x4)
	float DeployTimeSecondsLeft; // 0x16EC(0x4)
	struct TWeakObjectPtr<struct ABionicBirdActor> BionicBirdActor; // 0x16F0(0x8)

	// Object: Function DFMAbility.BionicBirdGrenade.TrySpawnBionicBirdActor
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6d9c
	// Params: [ Num(0) Size(0x0) ]
	void TrySpawnBionicBirdActor();

	// Object: Function DFMAbility.BionicBirdGrenade.TryControlBionicBirdActor
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6d88
	// Params: [ Num(0) Size(0x0) ]
	void TryControlBionicBirdActor();

	// Object: Function DFMAbility.BionicBirdGrenade.StartHover
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6d74
	// Params: [ Num(0) Size(0x0) ]
	void StartHover();

	// Object: Function DFMAbility.BionicBirdGrenade.OnDeployStart
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6d60
	// Params: [ Num(0) Size(0x0) ]
	void OnDeployStart();

	// Object: Function DFMAbility.BionicBirdGrenade.OnDeployEnd
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6d4c
	// Params: [ Num(0) Size(0x0) ]
	void OnDeployEnd();
};

// Object: Class DFMAbility.BionicBirdGrenadeMovement
// Size: 0x710 (Inherited: 0x710)
struct UBionicBirdGrenadeMovement : UGPWeaponProjectileMovementComponent
{
	DEFINE_UE_CLASS_HELPERS(UBionicBirdGrenadeMovement, "BionicBirdGrenadeMovement")

	// Object: Function DFMAbility.BionicBirdGrenadeMovement.StartHover
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e6db8
	// Params: [ Num(2) Size(0x8) ]
	void StartHover(float StopTime, float MinHeight);
};

// Object: Class DFMAbility.BionicBirdMarkingActor
// Size: 0x480 (Inherited: 0x370)
struct ABionicBirdMarkingActor : ABionicBirdMarkingBaseActor
{
	DEFINE_UE_CLASS_HELPERS(ABionicBirdMarkingActor, "BionicBirdMarkingActor")

	float MarkingCountDownTime; // 0x370(0x4)
	float MaxMarkingTime; // 0x374(0x4)
	float SceneMarkingMaxDistance; // 0x378(0x4)
	float MarkingSoundCD; // 0x37C(0x4)
	uint8_t bUseSocketISM : 1; // 0x380(0x1), Mask(0x1)
	uint8_t BitPad_0x380_1 : 7; // 0x380(0x1)
	uint8_t bUseLineISM : 1; // 0x381(0x1), Mask(0x1)
	uint8_t BitPad_0x381_1 : 7; // 0x381(0x1)
	uint8_t bUseSocketEffect : 1; // 0x382(0x1), Mask(0x1)
	uint8_t BitPad_0x382_1 : 7; // 0x382(0x1)
	uint8_t Pad_0x383[0x1]; // 0x383(0x1)
	struct FName SocketEffectName; // 0x384(0x8)
	uint8_t bIsDrawDebugSphere : 1; // 0x38C(0x1), Mask(0x1)
	uint8_t BitPad_0x38C_1 : 7; // 0x38C(0x1)
	uint8_t bIsDrawDebugLine : 1; // 0x38D(0x1), Mask(0x1)
	uint8_t BitPad_0x38D_1 : 7; // 0x38D(0x1)
	uint8_t Pad_0x38E[0x2]; // 0x38E(0x2)
	int32_t MarkerJointIndex; // 0x390(0x4)
	float MarkerJointOffsetZ; // 0x394(0x4)
	struct TArray<struct FBionicBirdMarkingJoint> JointInfos; // 0x398(0x10)
	float JointBaseSize; // 0x3A8(0x4)
	uint8_t Pad_0x3AC[0x4]; // 0x3AC(0x4)
	struct UCurveVector* JointSizeCurve; // 0x3B0(0x8)
	struct FName JointMtArgName; // 0x3B8(0x8)
	struct UCurveFloat* JointMtCurve; // 0x3C0(0x8)
	struct FName JointMtColorName; // 0x3C8(0x8)
	struct UCurveLinearColor* JointMtColorCurve; // 0x3D0(0x8)
	struct FName LineMtArgName; // 0x3D8(0x8)
	struct UCurveFloat* LineMtCurve; // 0x3E0(0x8)
	struct FName LineMtColorName; // 0x3E8(0x8)
	struct UCurveLinearColor* LineMtColorCurve; // 0x3F0(0x8)
	struct TWeakObjectPtr<struct AGPCharacter> TargetCharacter; // 0x3F8(0x8)
	EBionicBirdMarkingType CurrMarkingType; // 0x400(0x1)
	uint8_t bIsCurrSelfMark : 1; // 0x401(0x1), Mask(0x1)
	uint8_t BitPad_0x401_1 : 7; // 0x401(0x1)
	uint8_t Pad_0x402[0x2]; // 0x402(0x2)
	float CurrMarkingTypeTime; // 0x404(0x4)
	float NextMarkingSoundCD; // 0x408(0x4)
	uint8_t bIsPlayMarkSound : 1; // 0x40C(0x1), Mask(0x1)
	uint8_t BitPad_0x40C_1 : 7; // 0x40C(0x1)
	uint8_t Pad_0x40D[0x3]; // 0x40D(0x3)
	struct TArray<struct FVector> SpherePositions; // 0x410(0x10)
	struct TArray<float> SphereRadiuses; // 0x420(0x10)
	struct TArray<struct FVector> LinePositions; // 0x430(0x10)
	uint8_t Pad_0x440[0x20]; // 0x440(0x20)
	struct UInstancedStaticMeshComponent* JointISMComponent; // 0x460(0x8)
	struct UInstancedStaticMeshComponent* LineISMComponent; // 0x468(0x8)
	struct UMaterialInstanceDynamic* JointMaterial; // 0x470(0x8)
	struct UMaterialInstanceDynamic* LineMaterial; // 0x478(0x8)

	// Object: Function DFMAbility.BionicBirdMarkingActor.TryShowSceneMarking
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7194
	// Params: [ Num(0) Size(0x0) ]
	void TryShowSceneMarking();

	// Object: Function DFMAbility.BionicBirdMarkingActor.TickMarkingCountDown
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e70f0
	// Params: [ Num(1) Size(0x4) ]
	void TickMarkingCountDown(float DeltaTime);

	// Object: Function DFMAbility.BionicBirdMarkingActor.TickMarking
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e704c
	// Params: [ Num(1) Size(0x4) ]
	void TickMarking(float DeltaTime);

	// Object: Function DFMAbility.BionicBirdMarkingActor.TickFadeOut_Size
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7038
	// Params: [ Num(0) Size(0x0) ]
	void TickFadeOut_Size();

	// Object: Function DFMAbility.BionicBirdMarkingActor.TickFadeOut_Line
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7024
	// Params: [ Num(0) Size(0x0) ]
	void TickFadeOut_Line();

	// Object: Function DFMAbility.BionicBirdMarkingActor.TickFadeOut_Joint
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7010
	// Params: [ Num(0) Size(0x0) ]
	void TickFadeOut_Joint();

	// Object: Function DFMAbility.BionicBirdMarkingActor.TickFadeOut
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e6ffc
	// Params: [ Num(0) Size(0x0) ]
	void TickFadeOut();

	// Object: Function DFMAbility.BionicBirdMarkingActor.SpawnJointEffect
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6fe8
	// Params: [ Num(0) Size(0x0) ]
	void SpawnJointEffect();

	// Object: Function DFMAbility.BionicBirdMarkingActor.ShowMarker
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6fd4
	// Params: [ Num(0) Size(0x0) ]
	void ShowMarker();

	// Object: Function DFMAbility.BionicBirdMarkingActor.SetTargetLocation
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6fc0
	// Params: [ Num(0) Size(0x0) ]
	void SetTargetLocation();

	// Object: Function DFMAbility.BionicBirdMarkingActor.SetISMJointData
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6fac
	// Params: [ Num(0) Size(0x0) ]
	void SetISMJointData();

	// Object: Function DFMAbility.BionicBirdMarkingActor.SetCurrMarkingTypeTimeByType
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6f98
	// Params: [ Num(0) Size(0x0) ]
	void SetCurrMarkingTypeTimeByType();

	// Object: Function DFMAbility.BionicBirdMarkingActor.OnMarkingTimeEnd
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6f84
	// Params: [ Num(0) Size(0x0) ]
	void OnMarkingTimeEnd();

	// Object: Function DFMAbility.BionicBirdMarkingActor.InitISM
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6f70
	// Params: [ Num(0) Size(0x0) ]
	void InitISM();

	// Object: Function DFMAbility.BionicBirdMarkingActor.HideMarker
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6f5c
	// Params: [ Num(0) Size(0x0) ]
	void HideMarker();

	// Object: Function DFMAbility.BionicBirdMarkingActor.HideISM
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6f48
	// Params: [ Num(0) Size(0x0) ]
	void HideISM();

	// Object: Function DFMAbility.BionicBirdMarkingActor.GetMarkerLocation
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3e6f10
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetMarkerLocation();

	// Object: Function DFMAbility.BionicBirdMarkingActor.GetCameraLocation
	// Flags: [Final|Native|Private|HasDefaults|Const]
	// Offset: 0xc3e6ed8
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetCameraLocation();

	// Object: Function DFMAbility.BionicBirdMarkingActor.DrawDebug
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6ec4
	// Params: [ Num(0) Size(0x0) ]
	void DrawDebug();

	// Object: Function DFMAbility.BionicBirdMarkingActor.CopyJointInfos
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6eb0
	// Params: [ Num(0) Size(0x0) ]
	void CopyJointInfos();

	// Object: Function DFMAbility.BionicBirdMarkingActor.CheckMarkingSoundCD
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e6e9c
	// Params: [ Num(0) Size(0x0) ]
	void CheckMarkingSoundCD();
};

// Object: Class DFMAbility.BionicBirdMarkingAnimInstance
// Size: 0xA50 (Inherited: 0x280)
struct UBionicBirdMarkingAnimInstance : UGPAnimInstanceBase
{
	DEFINE_UE_CLASS_HELPERS(UBionicBirdMarkingAnimInstance, "BionicBirdMarkingAnimInstance")

	struct FBionicBirdMarkingAnimInstanceProxy LocalProxy; // 0x280(0x7D0)

	// Object: Function DFMAbility.BionicBirdMarkingAnimInstance.SnapshotTargetCharacterMeshPose
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e72b8
	// Params: [ Num(1) Size(0x8) ]
	void SnapshotTargetCharacterMeshPose(struct USkeletalMeshComponent* TargetCharacterMesh);
};

// Object: Class DFMAbility.BionicBirdMovement
// Size: 0x360 (Inherited: 0x300)
struct UBionicBirdMovement : UGPControllableActorReplicatedMovementComponent
{
	DEFINE_UE_CLASS_HELPERS(UBionicBirdMovement, "BionicBirdMovement")

	uint8_t bDoubleSidedCheck : 1; // 0x300(0x1), Mask(0x1)
	uint8_t BitPad_0x300_1 : 7; // 0x300(0x1)
	uint8_t Pad_0x301[0x7]; // 0x301(0x7)
	struct ABionicBirdActor* OwnerBionicBird; // 0x308(0x8)
	struct FVector ActorMoveForwardVector; // 0x310(0xC)
	struct FVector ActorMoveRightVector; // 0x31C(0xC)
	struct FVector ActorMoveUpVector; // 0x328(0xC)
	struct FVector AnimVelocity; // 0x334(0xC)
	struct FVector AnimInput; // 0x340(0xC)
	struct TWeakObjectPtr<struct AWaterDataAssetsStreamer> WaterStreamer; // 0x34C(0x8)
	uint8_t Pad_0x354[0xC]; // 0x354(0xC)

	// Object: Function DFMAbility.BionicBirdMovement.TryHitBreakablePawnActor
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7990
	// Params: [ Num(2) Size(0x9) ]
	uint8_t TryHitBreakablePawnActor(struct AActor* OtherActor);

	// Object: Function DFMAbility.BionicBirdMovement.SendAinInfoToServer
	// Flags: [Final|Net|Native|Event|Private|NetServer|HasDefaults]
	// Offset: 0xc3e78a8
	// Params: [ Num(2) Size(0x18) ]
	void SendAinInfoToServer(struct FVector InAnimVelocity, struct FVector InAnimInput);

	// Object: Function DFMAbility.BionicBirdMovement.MoveCheckPawn
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3e7804
	// Params: [ Num(1) Size(0xC) ]
	void MoveCheckPawn(struct FVector OldLocation);

	// Object: Function DFMAbility.BionicBirdMovement.IgnoreADS
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3e7760
	// Params: [ Num(1) Size(0x8) ]
	void IgnoreADS(struct USceneComponent* NewUpdatedComponent);

	// Object: Function DFMAbility.BionicBirdMovement.GetInputBaseVector
	// Flags: [Final|Native|Private|HasDefaults|Const]
	// Offset: 0xc3e76b0
	// Params: [ Num(2) Size(0x10) ]
	struct FVector GetInputBaseVector(int32_t InputIdx);

	// Object: Function DFMAbility.BionicBirdMovement.DoubleSidedCheck
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3e760c
	// Params: [ Num(1) Size(0xC) ]
	void DoubleSidedCheck(struct FVector OldLocation);

	// Object: Function DFMAbility.BionicBirdMovement.CheckMoveUnderWater
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3e7568
	// Params: [ Num(1) Size(0xC) ]
	void CheckMoveUnderWater(struct FVector OldLocation);

	// Object: Function DFMAbility.BionicBirdMovement.CalculateVelocity
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3e747c
	// Params: [ Num(2) Size(0x10) ]
	void CalculateVelocity(float DeltaTime, const struct FVector& Input);

	// Object: Function DFMAbility.BionicBirdMovement.CalculateActorMoveForward
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7468
	// Params: [ Num(0) Size(0x0) ]
	void CalculateActorMoveForward();

	// Object: Function DFMAbility.BionicBirdMovement.BlockingDecelerateVelocity
	// Flags: [Final|Native|Private|HasOutParms]
	// Offset: 0xc3e7364
	// Params: [ Num(2) Size(0x8C) ]
	void BlockingDecelerateVelocity(const struct FHitResult& Hit, float DeltaTime);
};

// Object: Class DFMAbility.BionicBirdWeapon
// Size: 0x1440 (Inherited: 0x1440)
struct ABionicBirdWeapon : ADFMWeapon
{
	DEFINE_UE_CLASS_HELPERS(ABionicBirdWeapon, "BionicBirdWeapon")

	uint8_t bIsTppCastHiddenShadow : 1; // 0x1432(0x1), Mask(0x1)

	// Object: Function DFMAbility.BionicBirdWeapon.CustomUpdateShadowConfig
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7a60
	// Params: [ Num(0) Size(0x0) ]
	void CustomUpdateShadowConfig();
};

// Object: Class DFMAbility.BionicSpyActor
// Size: 0x6C0 (Inherited: 0x4D0)
struct ABionicSpyActor : ABionicSpyBaseActor
{
	DEFINE_UE_CLASS_HELPERS(ABionicSpyActor, "BionicSpyActor")

	uint8_t Pad_0x4D0[0x10]; // 0x4D0(0x10)
	float EnergyConsumedSpeed_SOL; // 0x4E0(0x4)
	int32_t ThreatId; // 0x4E4(0x4)
	uint8_t bUsePawnOverlap : 1; // 0x4E8(0x1), Mask(0x1)
	uint8_t BitPad_0x4E8_1 : 7; // 0x4E8(0x1)
	ECharingSlot CDSlot; // 0x4E9(0x1)
	uint8_t Pad_0x4EA[0x2]; // 0x4EA(0x2)
	struct FName HudViewName; // 0x4EC(0x8)
	float BaseFOV; // 0x4F4(0x4)
	float FOVLerpSpeed; // 0x4F8(0x4)
	struct FName BindSocketName; // 0x4FC(0x8)
	struct FVector BindSocketBaseOffset; // 0x504(0xC)
	struct FVector BindSocketOffset; // 0x510(0xC)
	struct FVector BindSocketOffset_CarryingBox; // 0x51C(0xC)
	float CameraPitchLimit; // 0x528(0x4)
	float CameraYawLimit; // 0x52C(0x4)
	float CameraSmooth; // 0x530(0x4)
	ECollisionChannel CheckChannel; // 0x534(0x1)
	uint8_t Pad_0x535[0x3]; // 0x535(0x3)
	float CheckRadius; // 0x538(0x4)
	struct FName GrabbedSocketName; // 0x53C(0x8)
	float GrabbedNearClipPlane; // 0x544(0x4)
	float GrabbedLerpTime; // 0x548(0x4)
	struct FName GrabbedLookAtSocketName; // 0x54C(0x8)
	struct FVector GrabbedLookAtOffset; // 0x554(0xC)
	float GrabbedLookAtDelayTime; // 0x560(0x4)
	float GrabbedLookAtLerpTime; // 0x564(0x4)
	int32_t SkillId; // 0x568(0x4)
	int32_t SwitchSkillID; // 0x56C(0x4)
	int32_t TargetBuffID; // 0x570(0x4)
	float MinStopControlDelay; // 0x574(0x4)
	float SwitchSpyModeDelay; // 0x578(0x4)
	float ExposeTime; // 0x57C(0x4)
	int32_t CanExposeBuffID; // 0x580(0x4)
	int32_t OnExposeBuffID; // 0x584(0x4)
	int32_t OnControlBuffId; // 0x588(0x4)
	uint8_t Pad_0x58C[0x4]; // 0x58C(0x4)
	struct TArray<int32_t> DamageIgnoreBuffIds; // 0x590(0x10)
	struct FName ItemSocketName; // 0x5A0(0x8)
	struct FVector ItemAttachRelativeLocation; // 0x5A8(0xC)
	struct FRotator ItemAttachRelativeRotator; // 0x5B4(0xC)
	struct TSoftObjectPtr<USkeletalMesh> ItemMeshPath; // 0x5C0(0x28)
	struct TSoftObjectPtr<UAnimSequenceBase> ItemAnimSeqPath; // 0x5E8(0x28)
	struct UGPAudioEventAsset* DestroySoundEvent; // 0x610(0x8)
	struct UGPAudioEventAsset* FlySoundEvent; // 0x618(0x8)
	struct UGPAudioEventAsset* FlySoundStopEvent; // 0x620(0x8)
	struct TWeakObjectPtr<struct ADFMCharacter> AbilityActorOwner; // 0x628(0x8)
	struct TWeakObjectPtr<struct ADFMCharacter> TargetCharacter; // 0x630(0x8)
	struct UShapeComponent* PawnShapeComponent; // 0x638(0x8)
	struct UBionicSpyHudView* CachedView; // 0x640(0x8)
	float CanStopControlTime; // 0x648(0x4)
	struct FRotator LastCameraBaseRotation; // 0x64C(0xC)
	float CurrCameraPitch; // 0x658(0x4)
	float CurrCameraYaw; // 0x65C(0x4)
	uint8_t bIsCanExpose : 1; // 0x660(0x1), Mask(0x1)
	uint8_t BitPad_0x660_1 : 7; // 0x660(0x1)
	uint8_t Pad_0x661[0x3]; // 0x661(0x3)
	float CurrExposeTime; // 0x664(0x4)
	float CurrSwitchToSpyModeDelay; // 0x668(0x4)
	float CurrStopSpyModeDelay; // 0x66C(0x4)
	uint8_t bIsAutoStopSpyMode : 1; // 0x670(0x1), Mask(0x1)
	uint8_t BitPad_0x670_1 : 7; // 0x670(0x1)
	uint8_t bIsHiddenSpyTargetEquipment : 1; // 0x671(0x1), Mask(0x1)
	uint8_t BitPad_0x671_1 : 7; // 0x671(0x1)
	uint8_t bIsGrabbed : 1; // 0x672(0x1), Mask(0x1)
	uint8_t BitPad_0x672_1 : 7; // 0x672(0x1)
	uint8_t Pad_0x673[0x1]; // 0x673(0x1)
	float CurrGrabbedLookAtDelayTime; // 0x674(0x4)
	float CurrGrabbedLookAtLerpTime; // 0x678(0x4)
	float CurrGrabbedLerpTime; // 0x67C(0x4)
	struct FVector GrabbedLerpStartLocationOffset; // 0x680(0xC)
	struct FRotator GrabbedLerpStartRotationOffset; // 0x68C(0xC)
	float UpdateAudioTime; // 0x698(0x4)
	struct FGPAudioFuturePlayingID FlyAudio; // 0x69C(0x8)
	uint8_t bIsStayOnServer : 1; // 0x6A4(0x1), Mask(0x1)
	uint8_t BitPad_0x6A4_1 : 7; // 0x6A4(0x1)
	uint8_t Pad_0x6A5[0x3]; // 0x6A5(0x3)
	int32_t CurrentMarkNum; // 0x6A8(0x4)
	float NextMarkTime; // 0x6AC(0x4)
	struct UC203MarkComponent* MarkComponent; // 0x6B0(0x8)
	uint8_t bIsShowItemMesh : 1; // 0x6B8(0x1), Mask(0x1)
	uint8_t BitPad_0x6B8_1 : 7; // 0x6B8(0x1)
	uint8_t Pad_0x6B9[0x7]; // 0x6B9(0x7)

	// Object: Function DFMAbility.BionicSpyActor.UpdateBuffDetectorData
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8de4
	// Params: [ Num(1) Size(0x1) ]
	void UpdateBuffDetectorData(uint8_t bIsAdd);

	// Object: Function DFMAbility.BionicSpyActor.TryStopSwitchSkill
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8d40
	// Params: [ Num(1) Size(0x8) ]
	void TryStopSwitchSkill(struct AGPCharacter* InOwnerCharacter);

	// Object: Function DFMAbility.BionicSpyActor.TryStopSpyMode
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8d2c
	// Params: [ Num(0) Size(0x0) ]
	void TryStopSpyMode();

	// Object: Function DFMAbility.BionicSpyActor.TryShowItemMeshForTarget
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8d18
	// Params: [ Num(0) Size(0x0) ]
	void TryShowItemMeshForTarget();

	// Object: Function DFMAbility.BionicSpyActor.TryRemoveOnControlBuff
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8c74
	// Params: [ Num(1) Size(0x8) ]
	void TryRemoveOnControlBuff(struct AGPCharacter* InOwnerCharacter);

	// Object: Function DFMAbility.BionicSpyActor.TryRemoveHiddenSpyTargetEquipment
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8c60
	// Params: [ Num(0) Size(0x0) ]
	void TryRemoveHiddenSpyTargetEquipment();

	// Object: Function DFMAbility.BionicSpyActor.TryAddOnControlBuff
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8bbc
	// Params: [ Num(1) Size(0x8) ]
	void TryAddOnControlBuff(struct AGPCharacter* InOwnerCharacter);

	// Object: Function DFMAbility.BionicSpyActor.TryAddHiddenSpyTargetEquipment
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8ba8
	// Params: [ Num(0) Size(0x0) ]
	void TryAddHiddenSpyTargetEquipment();

	// Object: Function DFMAbility.BionicSpyActor.TickSwitchToSpyModeDelay
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8b04
	// Params: [ Num(1) Size(0x4) ]
	void TickSwitchToSpyModeDelay(float DeltaTime);

	// Object: Function DFMAbility.BionicSpyActor.TickStopSpyModeDelay
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8a60
	// Params: [ Num(1) Size(0x4) ]
	void TickStopSpyModeDelay(float DeltaTime);

	// Object: Function DFMAbility.BionicSpyActor.TickSpyTarget_View
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3e892c
	// Params: [ Num(3) Size(0x1C) ]
	void TickSpyTarget_View(float DeltaTime, struct FVector& Location, struct FRotator& Rotation);

	// Object: Function DFMAbility.BionicSpyActor.TickSpyTarget_Item
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3e8834
	// Params: [ Num(2) Size(0x18) ]
	void TickSpyTarget_Item(struct FVector& Location, struct FRotator& Rotation);

	// Object: Function DFMAbility.BionicSpyActor.TickSpyTarget_GrabbedView
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3e8700
	// Params: [ Num(3) Size(0x1C) ]
	void TickSpyTarget_GrabbedView(float DeltaTime, struct FVector& Location, struct FRotator& Rotation);

	// Object: Function DFMAbility.BionicSpyActor.TickSpyTarget
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e865c
	// Params: [ Num(1) Size(0x4) ]
	void TickSpyTarget(float DeltaTime);

	// Object: Function DFMAbility.BionicSpyActor.TickMark
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e85b8
	// Params: [ Num(1) Size(0x4) ]
	void TickMark(float DeltaTime);

	// Object: Function DFMAbility.BionicSpyActor.TickExpose
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8514
	// Params: [ Num(1) Size(0x4) ]
	void TickExpose(float DeltaTime);

	// Object: Function DFMAbility.BionicSpyActor.TickCheckTargetCharacter
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8500
	// Params: [ Num(0) Size(0x0) ]
	void TickCheckTargetCharacter();

	// Object: Function DFMAbility.BionicSpyActor.StopSpyTarget
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e84ec
	// Params: [ Num(0) Size(0x0) ]
	void StopSpyTarget();

	// Object: Function DFMAbility.BionicSpyActor.StopAllSound
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e84d8
	// Params: [ Num(0) Size(0x0) ]
	void StopAllSound();

	// Object: Function DFMAbility.BionicSpyActor.StartSpyTarget
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e8434
	// Params: [ Num(1) Size(0x8) ]
	void StartSpyTarget(struct AGPCharacter* Target);

	// Object: Function DFMAbility.BionicSpyActor.SetSkillCD
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8420
	// Params: [ Num(0) Size(0x0) ]
	void SetSkillCD();

	// Object: Function DFMAbility.BionicSpyActor.SetPawnShapeComponentCollision
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8374
	// Params: [ Num(1) Size(0x1) ]
	void SetPawnShapeComponentCollision(uint8_t bIsCollision);

	// Object: Function DFMAbility.BionicSpyActor.SetOwnerSelfSpyActor
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3e82d0
	// Params: [ Num(1) Size(0x8) ]
	void SetOwnerSelfSpyActor(struct ABionicSpyActor* SpyActor);

	// Object: Function DFMAbility.BionicSpyActor.SetIsShowItemMesh
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8224
	// Params: [ Num(1) Size(0x1) ]
	void SetIsShowItemMesh(uint8_t bIsShow);

	// Object: Function DFMAbility.BionicSpyActor.SetCanStopControlTime
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8210
	// Params: [ Num(0) Size(0x0) ]
	void SetCanStopControlTime();

	// Object: Function DFMAbility.BionicSpyActor.ServerTryStopControl
	// Flags: [Final|Net|NetReliableNative|Event|Private|NetServer]
	// Offset: 0xc3e81f4
	// Params: [ Num(0) Size(0x0) ]
	void ServerTryStopControl();

	// Object: Function DFMAbility.BionicSpyActor.SendViewBlackFadeIn
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e81e0
	// Params: [ Num(0) Size(0x0) ]
	void SendViewBlackFadeIn();

	// Object: Function DFMAbility.BionicSpyActor.SendProjectileThreatExplosion
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e81cc
	// Params: [ Num(0) Size(0x0) ]
	void SendProjectileThreatExplosion();

	// Object: Function DFMAbility.BionicSpyActor.SendProjectileThreatCreate
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e81b8
	// Params: [ Num(0) Size(0x0) ]
	void SendProjectileThreatCreate();

	// Object: Function DFMAbility.BionicSpyActor.SendClientSpyBreak
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e81a4
	// Params: [ Num(0) Size(0x0) ]
	void SendClientSpyBreak();

	// Object: Function DFMAbility.BionicSpyActor.RemoveCharacterTakeDamageEvent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8190
	// Params: [ Num(0) Size(0x0) ]
	void RemoveCharacterTakeDamageEvent();

	// Object: Function DFMAbility.BionicSpyActor.PlayFlySound
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e817c
	// Params: [ Num(0) Size(0x0) ]
	void PlayFlySound();

	// Object: Function DFMAbility.BionicSpyActor.PlayDestroySound
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e8168
	// Params: [ Num(0) Size(0x0) ]
	void PlayDestroySound();

	// Object: Function DFMAbility.BionicSpyActor.OnTogglePortalDoor
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e808c
	// Params: [ Num(2) Size(0x10) ]
	void OnTogglePortalDoor(struct AActor* PortalDoor, struct AGPCharacter* TogglePlayer);

	// Object: Function DFMAbility.BionicSpyActor.OnTargetCharacterDead
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8078
	// Params: [ Num(0) Size(0x0) ]
	void OnTargetCharacterDead();

	// Object: Function DFMAbility.BionicSpyActor.OnStartCanExpose
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e8064
	// Params: [ Num(0) Size(0x0) ]
	void OnStartCanExpose();

	// Object: Function DFMAbility.BionicSpyActor.OnServerKnockBack
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7fc0
	// Params: [ Num(1) Size(0x8) ]
	void OnServerKnockBack(struct AGPCharacterBase* InGPCharacterBase);

	// Object: Function DFMAbility.BionicSpyActor.OnRep_TargetCharacter
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7fac
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_TargetCharacter();

	// Object: Function DFMAbility.BionicSpyActor.OnPassiveMoveAction
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7f00
	// Params: [ Num(1) Size(0x1) ]
	void OnPassiveMoveAction(uint8_t IsActive);

	// Object: Function DFMAbility.BionicSpyActor.OnBeingAssassinate
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7e54
	// Params: [ Num(1) Size(0x1) ]
	void OnBeingAssassinate(uint8_t bCarried);

	// Object: Function DFMAbility.BionicSpyActor.OnArenaRoundStateChange
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7e40
	// Params: [ Num(0) Size(0x0) ]
	void OnArenaRoundStateChange();

	// Object: Function DFMAbility.BionicSpyActor.IsViewTarget
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3e7e08
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsViewTarget();

	// Object: Function DFMAbility.BionicSpyActor.IsTargetCharacterValid
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7dd0
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsTargetCharacterValid();

	// Object: Function DFMAbility.BionicSpyActor.IsLocalPlayerSpyActor
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3e7d98
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsLocalPlayerSpyActor();

	// Object: Function DFMAbility.BionicSpyActor.InitPawnShapeComponent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7d84
	// Params: [ Num(0) Size(0x0) ]
	void InitPawnShapeComponent();

	// Object: Function DFMAbility.BionicSpyActor.InitMarkComponent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7d70
	// Params: [ Num(0) Size(0x0) ]
	void InitMarkComponent();

	// Object: Function DFMAbility.BionicSpyActor.GetView
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7d3c
	// Params: [ Num(1) Size(0x8) ]
	struct UBionicSpyHudView* GetView();

	// Object: Function DFMAbility.BionicSpyActor.DoMark
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7d28
	// Params: [ Num(0) Size(0x0) ]
	void DoMark();

	// Object: Function DFMAbility.BionicSpyActor.ClientTryStopControl
	// Flags: [Final|Net|NetReliableNative|Event|Private|NetClient]
	// Offset: 0xc3e7d0c
	// Params: [ Num(0) Size(0x0) ]
	void ClientTryStopControl();

	// Object: Function DFMAbility.BionicSpyActor.CleanCameraData
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7cf8
	// Params: [ Num(0) Size(0x0) ]
	void CleanCameraData();

	// Object: Function DFMAbility.BionicSpyActor.CheckSoundAlive
	// Flags: [Final|Native|Public]
	// Offset: 0xc3e7ce4
	// Params: [ Num(0) Size(0x0) ]
	void CheckSoundAlive();

	// Object: Function DFMAbility.BionicSpyActor.CheckMaxEnergy
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7cd0
	// Params: [ Num(0) Size(0x0) ]
	void CheckMaxEnergy();

	// Object: Function DFMAbility.BionicSpyActor.CheckHudState
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7c2c
	// Params: [ Num(1) Size(0x8) ]
	void CheckHudState(struct AGPCharacter* InOwnerCharacter);

	// Object: Function DFMAbility.BionicSpyActor.CheckCanStopControlTime
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7bf4
	// Params: [ Num(1) Size(0x1) ]
	uint8_t CheckCanStopControlTime();

	// Object: Function DFMAbility.BionicSpyActor.CheckAutoStopSpyMode
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7be0
	// Params: [ Num(0) Size(0x0) ]
	void CheckAutoStopSpyMode();

	// Object: Function DFMAbility.BionicSpyActor.AutoSetPawnShapeCollision
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7bcc
	// Params: [ Num(0) Size(0x0) ]
	void AutoSetPawnShapeCollision();

	// Object: Function DFMAbility.BionicSpyActor.AddCharacterTakeDamageEvent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3e7bb8
	// Params: [ Num(0) Size(0x0) ]
	void AddCharacterTakeDamageEvent();
};

// Object: Class DFMAbility.BionicSpyCueHandler
// Size: 0x148 (Inherited: 0x130)
struct UBionicSpyCueHandler : UGPEffectCueHandler
{
	DEFINE_UE_CLASS_HELPERS(UBionicSpyCueHandler, "BionicSpyCueHandler")

	uint8_t bSetForceKeepFullMipLevels : 1; // 0x130(0x1), Mask(0x1)
	uint8_t BitPad_0x130_1 : 7; // 0x130(0x1)
	uint8_t Pad_0x131[0x3]; // 0x131(0x3)
	struct FName StartSoundName; // 0x134(0x8)
	uint8_t Pad_0x13C[0x4]; // 0x13C(0x4)
	struct FTimerHandle TickTimerHandle; // 0x140(0x8)

	// Object: Function DFMAbility.BionicSpyCueHandler.StopTickTimer
	// Flags: [Final|Native|Private]
	// Offset: 0xc3ea9e4
	// Params: [ Num(0) Size(0x0) ]
	void StopTickTimer();

	// Object: Function DFMAbility.BionicSpyCueHandler.StopStartSound
	// Flags: [Final|Native|Private]
	// Offset: 0xc3ea9d0
	// Params: [ Num(0) Size(0x0) ]
	void StopStartSound();

	// Object: Function DFMAbility.BionicSpyCueHandler.StartTickTimer
	// Flags: [Final|Native|Private]
	// Offset: 0xc3ea9bc
	// Params: [ Num(0) Size(0x0) ]
	void StartTickTimer();

	// Object: Function DFMAbility.BionicSpyCueHandler.PlayStartSound
	// Flags: [Final|Native|Private]
	// Offset: 0xc3ea9a8
	// Params: [ Num(0) Size(0x0) ]
	void PlayStartSound();

	// Object: Function DFMAbility.BionicSpyCueHandler.IsFPP
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3ea970
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsFPP();

	// Object: Function DFMAbility.BionicSpyCueHandler.Is1P
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3ea938
	// Params: [ Num(1) Size(0x1) ]
	uint8_t Is1P();

	// Object: Function DFMAbility.BionicSpyCueHandler.DoTimerTick
	// Flags: [Final|Native|Private]
	// Offset: 0xc3ea924
	// Params: [ Num(0) Size(0x0) ]
	void DoTimerTick();
};

// Object: Class DFMAbility.BionicSpyMovement
// Size: 0xF8 (Inherited: 0xF8)
struct UBionicSpyMovement : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UBionicSpyMovement, "BionicSpyMovement")
};

// Object: Class DFMAbility.BowArrowMesh
// Size: 0x3B8 (Inherited: 0x370)
struct ABowArrowMesh : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABowArrowMesh, "BowArrowMesh")

	struct FName FireArrowMeshTag; // 0x370(0x8)
	struct FName ProxSensorArrowMeshTag; // 0x378(0x8)
	struct UStaticMeshComponent* FireArrowMeshComponent; // 0x380(0x8)
	struct UStaticMeshComponent* ProxSensorArrowMeshComponent; // 0x388(0x8)
	struct UFXResourceContainerComponent* ArrowFX; // 0x390(0x8)
	struct FName FireArrowFXName; // 0x398(0x8)
	struct FName ProxSensorArrowFXName; // 0x3A0(0x8)
	uint8_t Pad_0x3A8[0x10]; // 0x3A8(0x10)

	// Object: Function DFMAbility.BowArrowMesh.SetArrowType
	// Flags: [Final|Native|Public]
	// Offset: 0xc3eacd8
	// Params: [ Num(1) Size(0x1) ]
	void SetArrowType(uint8_t IsProxSensorArrow);

	// Object: Function DFMAbility.BowArrowMesh.SetArrowEffect
	// Flags: [Final|Native|Public]
	// Offset: 0xc3eac2c
	// Params: [ Num(1) Size(0x1) ]
	void SetArrowEffect(uint8_t bActive);

	// Object: Function DFMAbility.BowArrowMesh.OnChargeStateChange
	// Flags: [Final|Native|Public]
	// Offset: 0xc3eab80
	// Params: [ Num(1) Size(0x1) ]
	void OnChargeStateChange(uint8_t ischarging);

	// Object: Function DFMAbility.BowArrowMesh.BP_SetFXRenderMatrixMode
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3eaaa0
	// Params: [ Num(2) Size(0x9) ]
	void BP_SetFXRenderMatrixMode(struct UFXResourceContainerComponent* FXResource, ERenderMatrixMode MatrixMode);

	// Object: Function DFMAbility.BowArrowMesh.BP_OnChargeStateChange
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_OnChargeStateChange(uint8_t ischarging);
};

// Object: Class DFMAbility.C203MarkComponent
// Size: 0x238 (Inherited: 0xF8)
struct UC203MarkComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UC203MarkComponent, "C203MarkComponent")

	struct TArray<struct FC203MarkData> AllGameRoleData; // 0xF8(0x10)
	int32_t SkillId; // 0x108(0x4)
	uint8_t Pad_0x10C[0x4]; // 0x10C(0x4)
	struct FC203MarkData CurrentMarkData; // 0x110(0x38)
	struct TWeakObjectPtr<struct ADFMCharacter> AbilityOwner; // 0x148(0x8)
	struct TWeakObjectPtr<struct ADFMCharacter> SpyTarget; // 0x150(0x8)
	struct TMap<uint32_t, float> NextMarkTimeMap; // 0x158(0x50)
	uint8_t Pad_0x1A8[0x90]; // 0x1A8(0x90)

	// Object: Function DFMAbility.C203MarkComponent.TryMarkTarget
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xc3ebcac
	// Params: [ Num(3) Size(0x15) ]
	uint8_t TryMarkTarget(struct AGPCharacter* Target, struct FVector CameraForward);

	// Object: Function DFMAbility.C203MarkComponent.TryMarkLockCountDown
	// Flags: [Final|Native|Private]
	// Offset: 0xc3ebbfc
	// Params: [ Num(2) Size(0x9) ]
	uint8_t TryMarkLockCountDown(struct AGPCharacter* Target);

	// Object: Function DFMAbility.C203MarkComponent.TryBreakMarkLockCountDown
	// Flags: [Final|Native|Private]
	// Offset: 0xc3ebb58
	// Params: [ Num(1) Size(0x8) ]
	void TryBreakMarkLockCountDown(struct AGPCharacter* Target);

	// Object: Function DFMAbility.C203MarkComponent.ServerDoMarkTarget_C203
	// Flags: [Final|Net|NetReliableNative|Event|Private|NetServer]
	// Offset: 0xc3ebaac
	// Params: [ Num(1) Size(0x8) ]
	void ServerDoMarkTarget_C203(struct AGPCharacter* Target);

	// Object: Function DFMAbility.C203MarkComponent.SaveMarkTargetCD
	// Flags: [Final|Native|Private]
	// Offset: 0xc3eba08
	// Params: [ Num(1) Size(0x8) ]
	void SaveMarkTargetCD(struct AGPCharacter* Target);

	// Object: Function DFMAbility.C203MarkComponent.RealDoMarkTarget_C203
	// Flags: [Final|Native|Private]
	// Offset: 0xc3eb964
	// Params: [ Num(1) Size(0x8) ]
	void RealDoMarkTarget_C203(struct AGPCharacter* Target);

	// Object: Function DFMAbility.C203MarkComponent.IsIsBionicSpy
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3eb93c
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsIsBionicSpy();

	// Object: Function DFMAbility.C203MarkComponent.IsBionicBird
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3eb914
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsBionicBird();

	// Object: Function DFMAbility.C203MarkComponent.InitGameRoleData
	// Flags: [Final|Native|Private]
	// Offset: 0xc3eb900
	// Params: [ Num(0) Size(0x0) ]
	void InitGameRoleData();

	// Object: Function DFMAbility.C203MarkComponent.InitBLockTest
	// Flags: [Final|Native|Private]
	// Offset: 0xc3eb8ec
	// Params: [ Num(0) Size(0x0) ]
	void InitBLockTest();

	// Object: Function DFMAbility.C203MarkComponent.Init
	// Flags: [Final|Native|Public]
	// Offset: 0xc3eb7d4
	// Params: [ Num(3) Size(0x14) ]
	void Init(struct ADFMCharacter* InAbilityOwner, struct ADFMCharacter* InSpyTarget, int32_t InSkillId);

	// Object: Function DFMAbility.C203MarkComponent.GetCheckCD
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3eb7a0
	// Params: [ Num(1) Size(0x4) ]
	float GetCheckCD();

	// Object: Function DFMAbility.C203MarkComponent.GetBaseLocation
	// Flags: [Final|Native|Private|HasDefaults|Const]
	// Offset: 0xc3eb768
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetBaseLocation();

	// Object: Function DFMAbility.C203MarkComponent.DoMarkTarget_C203
	// Flags: [Final|Native|Private]
	// Offset: 0xc3eb6c4
	// Params: [ Num(1) Size(0x8) ]
	void DoMarkTarget_C203(struct AGPCharacter* Target);

	// Object: Function DFMAbility.C203MarkComponent.DoMarkTarget_Base
	// Flags: [Final|Native|Private]
	// Offset: 0xc3eb620
	// Params: [ Num(1) Size(0x8) ]
	void DoMarkTarget_Base(struct AGPCharacter* Target);

	// Object: Function DFMAbility.C203MarkComponent.DoBlockTest
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3eb4f8
	// Params: [ Num(4) Size(0x21) ]
	uint8_t DoBlockTest(struct AGPCharacter* Target, struct FVector StartPoint, struct FVector EndPoint);

	// Object: Function DFMAbility.C203MarkComponent.CheckTargetSilenceZone
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3eb448
	// Params: [ Num(2) Size(0x9) ]
	uint8_t CheckTargetSilenceZone(struct AGPCharacter* Target);

	// Object: Function DFMAbility.C203MarkComponent.CheckTargetRenderTime
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3eb398
	// Params: [ Num(2) Size(0x9) ]
	uint8_t CheckTargetRenderTime(struct AGPCharacter* Target);

	// Object: Function DFMAbility.C203MarkComponent.CheckSmoke
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3eb2ac
	// Params: [ Num(3) Size(0x19) ]
	uint8_t CheckSmoke(struct FVector Start, struct FVector End);

	// Object: Function DFMAbility.C203MarkComponent.CheckMarkTargetCD
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3eb1fc
	// Params: [ Num(2) Size(0x9) ]
	uint8_t CheckMarkTargetCD(struct AGPCharacter* Target);

	// Object: Function DFMAbility.C203MarkComponent.CheckMarkTarget
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3eb110
	// Params: [ Num(3) Size(0x15) ]
	uint8_t CheckMarkTarget(struct AGPCharacter* Target, struct FVector CameraForward);

	// Object: Function DFMAbility.C203MarkComponent.CheckMarkBLock
	// Flags: [Final|Native|Private]
	// Offset: 0xc3eb060
	// Params: [ Num(2) Size(0x9) ]
	uint8_t CheckMarkBLock(struct AGPCharacter* Target);

	// Object: Function DFMAbility.C203MarkComponent.CheckIsSpyViewTarget
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3eafb0
	// Params: [ Num(2) Size(0x9) ]
	uint8_t CheckIsSpyViewTarget(struct AGPCharacter* Target);

	// Object: Function DFMAbility.C203MarkComponent.CheckExitState
	// Flags: [Final|Native|Private]
	// Offset: 0xc3eaf00
	// Params: [ Num(2) Size(0x9) ]
	uint8_t CheckExitState(struct AGPCharacter* Target);
};

// Object: Class DFMAbility.C204InterferenceAnimInstance
// Size: 0xA30 (Inherited: 0x280)
struct UC204InterferenceAnimInstance : UGPAnimInstanceBase
{
	DEFINE_UE_CLASS_HELPERS(UC204InterferenceAnimInstance, "C204InterferenceAnimInstance")

	struct FC204InterferenceAnimInstanceProxy LocalProxy; // 0x280(0x7A0)
	struct USkeletalMeshComponent* MasterPoseMesh; // 0xA20(0x8)
	uint8_t Pad_0xA28[0x8]; // 0xA28(0x8)

	// Object: Function DFMAbility.C204InterferenceAnimInstance.SetInfo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3ebf08
	// Params: [ Num(2) Size(0x2) ]
	void SetInfo(uint8_t bPreFire, uint8_t bExplode);
};

// Object: Class DFMAbility.C501CallAIFightTargetComponent
// Size: 0x1B0 (Inherited: 0xF8)
struct UC501CallAIFightTargetComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UC501CallAIFightTargetComponent, "C501CallAIFightTargetComponent")

	float Normal_VisionLostRemoveDelay; // 0xF8(0x4)
	float Assault_VisionLostRemoveDelay; // 0xFC(0x4)
	float UpdateInterval; // 0x100(0x4)
	float DistanceScoreWeight; // 0x104(0x4)
	float DirectionScoreWeight; // 0x108(0x4)
	float TypeScoreWeight; // 0x10C(0x4)
	float StickinessScoreWeight; // 0x110(0x4)
	float VisionScoreWeight; // 0x114(0x4)
	float BroadcastedTargetScoreWeight; // 0x118(0x4)
	float PlayerTargetBonus; // 0x11C(0x4)
	float CurrentTargetStickinessBonus; // 0x120(0x4)
	float MaxEvaluateDistance; // 0x124(0x4)
	float VisionDecayDuration; // 0x128(0x4)
	float BroadcastedTargetBonus; // 0x12C(0x4)
	uint8_t bEnableDebugLog : 1; // 0x130(0x1), Mask(0x1)
	uint8_t BitPad_0x130_1 : 7; // 0x130(0x1)
	uint8_t Pad_0x131[0x7]; // 0x131(0x7)
	struct TArray<struct FC501FightTargetCandidate> CandidateList; // 0x138(0x10)
	struct TWeakObjectPtr<struct ADFMCharacter> CurrentFightTarget; // 0x148(0x8)
	struct TSet<struct TWeakObjectPtr<struct ADFMCharacter>> BroadcastedFightTargets; // 0x150(0x50)
	struct TWeakObjectPtr<struct ADFMAIController> OwnerController; // 0x1A0(0x8)
	uint8_t Pad_0x1A8[0x8]; // 0x1A8(0x8)

	// Object: Function DFMAbility.C501CallAIFightTargetComponent.RemoveCandidate
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3ec444
	// Params: [ Num(1) Size(0x8) ]
	void RemoveCandidate(struct ADFMCharacter* Target);

	// Object: Function DFMAbility.C501CallAIFightTargetComponent.RemoveBroadcastedFightTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3ec3a0
	// Params: [ Num(1) Size(0x8) ]
	void RemoveBroadcastedFightTarget(struct ADFMCharacter* Target);

	// Object: Function DFMAbility.C501CallAIFightTargetComponent.IsBroadcastedFightTarget
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3ec2f0
	// Params: [ Num(2) Size(0x9) ]
	uint8_t IsBroadcastedFightTarget(struct ADFMCharacter* Target);

	// Object: Function DFMAbility.C501CallAIFightTargetComponent.HasValidFightTarget
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3ec2b8
	// Params: [ Num(1) Size(0x1) ]
	uint8_t HasValidFightTarget();

	// Object: Function DFMAbility.C501CallAIFightTargetComponent.GetCurrentFightTarget
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3ec284
	// Params: [ Num(1) Size(0x8) ]
	struct ADFMCharacter* GetCurrentFightTarget();

	// Object: Function DFMAbility.C501CallAIFightTargetComponent.GetCandidateList
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3ec1f8
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<struct FC501FightTargetCandidate> GetCandidateList();

	// Object: Function DFMAbility.C501CallAIFightTargetComponent.GetCandidateCount
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3ec1dc
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetCandidateCount();

	// Object: Function DFMAbility.C501CallAIFightTargetComponent.GetBroadcastedFightTargetCount
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3ec1a8
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetBroadcastedFightTargetCount();

	// Object: Function DFMAbility.C501CallAIFightTargetComponent.ForceReevaluateTargets
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3ec194
	// Params: [ Num(0) Size(0x0) ]
	void ForceReevaluateTargets();

	// Object: Function DFMAbility.C501CallAIFightTargetComponent.ClearCandidates
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3ec180
	// Params: [ Num(0) Size(0x0) ]
	void ClearCandidates();

	// Object: Function DFMAbility.C501CallAIFightTargetComponent.ClearBroadcastedFightTargets
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3ec16c
	// Params: [ Num(0) Size(0x0) ]
	void ClearBroadcastedFightTargets();

	// Object: Function DFMAbility.C501CallAIFightTargetComponent.AddCandidate
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3ec0c8
	// Params: [ Num(1) Size(0x8) ]
	void AddCandidate(struct ADFMCharacter* Target);

	// Object: Function DFMAbility.C501CallAIFightTargetComponent.AddBroadcastedFightTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3ec024
	// Params: [ Num(1) Size(0x8) ]
	void AddBroadcastedFightTarget(struct ADFMCharacter* Target);
};

// Object: Class DFMAbility.CallAIAbility
// Size: 0x758 (Inherited: 0x370)
struct ACallAIAbility : AActor
{
	DEFINE_UE_CLASS_HELPERS(ACallAIAbility, "CallAIAbility")

	uint8_t Pad_0x370[0x8]; // 0x370(0x8)
	struct FMulticastInlineDelegate OnCallAIStatusUpdated; // 0x378(0x10)
	struct FName AIInfoHudName; // 0x388(0x8)
	struct FCallAIConfig CallAIConfig; // 0x390(0x10)
	struct TArray<struct AActor*> ForbiddenAreas; // 0x3A0(0x10)
	struct TArray<struct FAISpawnInfo> AISpawnInfos; // 0x3B0(0x10)
	struct TArray<struct AAIController*> CallAIControllers; // 0x3C0(0x10)
	struct TArray<struct ADFMCharacter*> CallAICharacters; // 0x3D0(0x10)
	struct TArray<struct ADFMCharacter*> MarkedCharacters; // 0x3E0(0x10)
	struct TMap<struct AAIController*, ECallAIType> ControllerTypeMap; // 0x3F0(0x50)
	struct TArray<struct FPendingExitAI> PendingExitAIs; // 0x440(0x10)
	struct APlayerCommanderFakeAIController* FakeCommander; // 0x450(0x8)
	struct TArray<struct ADFMCharacter*> Enemies; // 0x458(0x10)
	uint8_t Pad_0x468[0x4]; // 0x468(0x4)
	float EnemySearchRadius; // 0x46C(0x4)
	float CallAIDelay; // 0x470(0x4)
	float AIExitDelay; // 0x474(0x4)
	float ForceExitDelay; // 0x478(0x4)
	float CombatEnemyTimeThreshold; // 0x47C(0x4)
	struct FText Text_CallAIFailed; // 0x480(0x18)
	struct AGPDeformableSmokeEmitActor* SmokeActorBP; // 0x498(0x8)
	float SmokeSpawnDelay; // 0x4A0(0x4)
	int32_t SmokeId; // 0x4A4(0x4)
	float SpawnLocationCheckRadius; // 0x4A8(0x4)
	float DoorAvoidanceDistance; // 0x4AC(0x4)
	uint8_t bValidateSpawnLocations : 1; // 0x4B0(0x1), Mask(0x1)
	uint8_t BitPad_0x4B0_1 : 7; // 0x4B0(0x1)
	uint8_t Pad_0x4B1[0x7]; // 0x4B1(0x7)
	struct TArray<struct TSoftObjectPtr<UEnvQuery>> BasePointEnvQuerySequence; // 0x4B8(0x10)
	struct TSoftObjectPtr<UEnvQuery> SpawnPointEnvQuery_CallAI2; // 0x4C8(0x28)
	struct FCallAI2SpawnContext CallAI2Context; // 0x4F0(0x48)
	uint64_t SkillKillAttackValueId; // 0x538(0x8)
	struct FName PhoneMeshName; // 0x540(0x8)
	struct FName PhoneScreenMaterialSlotName; // 0x548(0x8)
	struct UMaterialInterface* DefaultPhoneScreenMaterial; // 0x550(0x8)
	struct UMaterialInterface* AnaisPhoneScreenMaterial; // 0x558(0x8)
	struct TArray<struct AGPDeformableSmokeEmitActor*> SpawnedSmokeActors; // 0x560(0x10)
	uint8_t Pad_0x570[0x70]; // 0x570(0x70)
	struct TMap<struct ADFMCharacter*, struct FEnemyPlayerInfo> CombatEnemyPlayerInfos; // 0x5E0(0x50)
	float ActivityRangeRadius_Prudent; // 0x630(0x4)
	float ActivityRangeRadius_Assult; // 0x634(0x4)
	int32_t SkillId_Aura; // 0x638(0x4)
	int32_t SkillId_PlayPrudentAnim; // 0x63C(0x4)
	int32_t SkillId_PlayAssaultAnim; // 0x640(0x4)
	uint8_t Pad_0x644[0x4]; // 0x644(0x4)
	struct UCallAIActivityZoneMapIconViewController* ClientActivityZoneController; // 0x648(0x8)
	struct FName BBKey_IsRecallMoving; // 0x650(0x8)
	struct UEnvQuery* CommandMoveEnvQuery; // 0x658(0x8)
	float CommandMoveCooldown; // 0x660(0x4)
	float CommandMoveMinDistance; // 0x664(0x4)
	float CommandMoveMarkerLifeSpan; // 0x668(0x4)
	uint8_t Pad_0x66C[0xC]; // 0x66C(0xC)
	struct FName BBKey_CommandTargetLocation; // 0x678(0x8)
	struct FName BBKey_IsCommandMoving; // 0x680(0x8)
	struct FString AudioType_TooFar; // 0x688(0x10)
	struct FText Text_TooFar; // 0x698(0x18)
	struct FName CommandButtonAudioName; // 0x6B0(0x8)
	struct FName CallAIVoiceName; // 0x6B8(0x8)
	struct FName CallAIVoiceName_Anais; // 0x6C0(0x8)
	struct FName AIExitVoiceName; // 0x6C8(0x8)
	struct FName CombatStyle_Prudent_VoiceName; // 0x6D0(0x8)
	struct FName CombatStyle_Assault_VoiceName; // 0x6D8(0x8)
	struct FName CommandMoveVoiceName; // 0x6E0(0x8)
	struct UC501CallAIFightTargetComponent* CallAIFightTargetComponentClass; // 0x6E8(0x8)
	struct ADFMCharacter* AbilityCharacter; // 0x6F0(0x8)
	int32_t SkillId; // 0x6F8(0x4)
	uint8_t bRepIsInit : 1; // 0x6FC(0x1), Mask(0x1)
	uint8_t BitPad_0x6FC_1 : 7; // 0x6FC(0x1)
	uint8_t bIsPlayingCallAnimation : 1; // 0x6FD(0x1), Mask(0x1)
	uint8_t BitPad_0x6FD_1 : 7; // 0x6FD(0x1)
	uint8_t bHasAnais : 1; // 0x6FE(0x1), Mask(0x1)
	uint8_t BitPad_0x6FE_1 : 7; // 0x6FE(0x1)
	uint8_t Pad_0x6FF[0x19]; // 0x6FF(0x19)
	struct FCallAIStatusInfo CurrentStatusInfo; // 0x718(0x30)
	uint8_t Pad_0x748[0x8]; // 0x748(0x8)
	struct ASkillSubsystem* SkillSystem; // 0x750(0x8)

	// Object: Function DFMAbility.CallAIAbility.ServerCommandAI
	// Flags: [Net|NetReliableNative|Event|Public|NetServer|HasDefaults]
	// Offset: 0xc3ecd88
	// Params: [ Num(1) Size(0xC) ]
	void ServerCommandAI(struct FVector TargetLocation);

	// Object: Function DFMAbility.CallAIAbility.OnTakeDamage
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xc3ecc74
	// Params: [ Num(2) Size(0x8A1) ]
	void OnTakeDamage(const struct FDamageResultInfo& DamageResult, ECharacterPart& HitPart);

	// Object: Function DFMAbility.CallAIAbility.OnSummonerAssistKill
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xc3ecbb0
	// Params: [ Num(1) Size(0x1A8) ]
	void OnSummonerAssistKill(const struct FKillInfo& KillInfo);

	// Object: Function DFMAbility.CallAIAbility.OnSummonedAIMakeDamage
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xc3ecaf0
	// Params: [ Num(1) Size(0x8A0) ]
	void OnSummonedAIMakeDamage(const struct FDamageResultInfo& DamageResult);

	// Object: Function DFMAbility.CallAIAbility.OnSummonedAIDied
	// Flags: [Final|Native|Public]
	// Offset: 0xc3ec9d8
	// Params: [ Num(3) Size(0x18) ]
	void OnSummonedAIDied(struct AGPCharacterBase* DiedCharacter, struct AController* Killer, struct UDamageType* DamageType);

	// Object: Function DFMAbility.CallAIAbility.OnRep_Init
	// Flags: [Final|Native|Public]
	// Offset: 0xc3ec9c4
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_Init();

	// Object: Function DFMAbility.CallAIAbility.OnRep_CurrentStatusInfo
	// Flags: [Final|Native|Private]
	// Offset: 0xc3ec9b0
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_CurrentStatusInfo();

	// Object: Function DFMAbility.CallAIAbility.OnRep_CallAICharacters
	// Flags: [Final|Native|Public]
	// Offset: 0xc3ec99c
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_CallAICharacters();

	// Object: Function DFMAbility.CallAIAbility.OnPlayerMakeDamage
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xc3ec8dc
	// Params: [ Num(1) Size(0x8A0) ]
	void OnPlayerMakeDamage(const struct FDamageResultInfo& DamageResult);

	// Object: Function DFMAbility.CallAIAbility.OnNetReconnectSuccess
	// Flags: [Final|Native|Public]
	// Offset: 0xc3ec8c8
	// Params: [ Num(0) Size(0x0) ]
	void OnNetReconnectSuccess();

	// Object: DelegateFunction DFMAbility.CallAIAbility.OnCallAIStatusUpdated__DelegateSignature
	// Flags: [MulticastDelegate|Public|Delegate|HasOutParms]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x30) ]
	void OnCallAIStatusUpdated__DelegateSignature(const struct FCallAIStatusInfo& StatusInfo);

	// Object: Function DFMAbility.CallAIAbility.OnCallAIStatusChanged_Handler
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xc3ec7ec
	// Params: [ Num(1) Size(0x30) ]
	void OnCallAIStatusChanged_Handler(const struct FCallAIStatusInfo& StatusInfo);

	// Object: Function DFMAbility.CallAIAbility.IsCombatStylePrudent
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3ec7c8
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsCombatStylePrudent();

	// Object: Function DFMAbility.CallAIAbility.IsCombatStyleAssault
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3ec7a4
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsCombatStyleAssault();

	// Object: Function DFMAbility.CallAIAbility.GetCurrentCombatStyle
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3ec788
	// Params: [ Num(1) Size(0x1) ]
	ECallAICombatStyle GetCurrentCombatStyle();

	// Object: Function DFMAbility.CallAIAbility.GetCallAIStatus
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3ec6f4
	// Params: [ Num(1) Size(0x30) ]
	struct FCallAIStatusInfo GetCallAIStatus();

	// Object: Function DFMAbility.CallAIAbility.ClientShowTips
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xc3ec640
	// Params: [ Num(1) Size(0x10) ]
	void ClientShowTips(struct FString TipsBuffer);
};

// Object: Class DFMAbility.CallAIInfoPanelControllerHelper
// Size: 0x68 (Inherited: 0x28)
struct UCallAIInfoPanelControllerHelper : UObject
{
	DEFINE_UE_CLASS_HELPERS(UCallAIInfoPanelControllerHelper, "CallAIInfoPanelControllerHelper")

	uint8_t Pad_0x28[0x8]; // 0x28(0x8)
	struct ACallAIAbility* CallAIAbility; // 0x30(0x8)
	uint8_t Pad_0x38[0x30]; // 0x38(0x30)

	// Object: Function DFMAbility.CallAIInfoPanelControllerHelper.OnCallAIStatusUpdated
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xc3effbc
	// Params: [ Num(1) Size(0x30) ]
	void OnCallAIStatusUpdated(const struct FCallAIStatusInfo& StatusInfo);
};

// Object: Class DFMAbility.CallAIInfoPanelHudController
// Size: 0x98 (Inherited: 0x80)
struct UCallAIInfoPanelHudController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UCallAIInfoPanelHudController, "CallAIInfoPanelHudController")

	uint8_t Pad_0x80[0x8]; // 0x80(0x8)
	struct UCallAIInfoPanelControllerHelper* ControllerHelper; // 0x88(0x8)
	struct UCallAIInfoPanelHudView* CallAIView; // 0x90(0x8)
};

// Object: Class DFMAbility.CallAIInfoPanelHudView
// Size: 0x488 (Inherited: 0x400)
struct UCallAIInfoPanelHudView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UCallAIInfoPanelHudView, "CallAIInfoPanelHudView")

	uint8_t Pad_0x400[0x8]; // 0x400(0x8)
	struct UDFHDKeyIconBoxTextWidget* WBP_CommonKeyIconBoxText_1; // 0x408(0x8)
	struct FName UIDeviceStartAudioName; // 0x410(0x8)
	struct FName ButtonActivateAudioName; // 0x418(0x8)
	struct FName ButtonEndAudioName; // 0x420(0x8)
	struct FCallAIInfoPanelViewLogic ViewLogic; // 0x428(0x50)
	struct TArray<struct UUserWidget*> AIUnitWidgets; // 0x478(0x10)

	// Object: Function DFMAbility.CallAIInfoPanelHudView.UpdateAIStatus
	// Flags: [Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xc3f02a0
	// Params: [ Num(1) Size(0x30) ]
	void UpdateAIStatus(const struct FCallAIStatusInfo& StatusInfo);

	// Object: Function DFMAbility.CallAIInfoPanelHudView.BP_SetType
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetType(int32_t CombatStyle);

	// Object: Function DFMAbility.CallAIInfoPanelHudView.BP_SetPercent
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetPercent(float Percent);

	// Object: Function DFMAbility.CallAIInfoPanelHudView.BP_SetAINumb
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(4) Size(0x10) ]
	void BP_SetAINumb(int32_t RifleCount, int32_t MGCount, int32_t ShieldCount, int32_t FirebatCount);
};

// Object: Class DFMAbility.CallAIInfoPanelUIController
// Size: 0xC0 (Inherited: 0xA8)
struct UCallAIInfoPanelUIController : UBaseUIController
{
	DEFINE_UE_CLASS_HELPERS(UCallAIInfoPanelUIController, "CallAIInfoPanelUIController")

	uint8_t Pad_0xA8[0x8]; // 0xA8(0x8)
	struct UCallAIInfoPanelControllerHelper* ControllerHelper; // 0xB0(0x8)
	struct UCallAIInfoPanelUIView* CallAIView; // 0xB8(0x8)
};

// Object: Class DFMAbility.CallAIInfoPanelUIView
// Size: 0x4E8 (Inherited: 0x460)
struct UCallAIInfoPanelUIView : UDFMBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UCallAIInfoPanelUIView, "CallAIInfoPanelUIView")

	uint8_t Pad_0x460[0x8]; // 0x460(0x8)
	struct UDFHDKeyIconBoxTextWidget* WBP_CommonKeyIconBoxText_1; // 0x468(0x8)
	struct FName UIDeviceStartAudioName; // 0x470(0x8)
	struct FName ButtonActivateAudioName; // 0x478(0x8)
	struct FName ButtonEndAudioName; // 0x480(0x8)
	struct FCallAIInfoPanelViewLogic ViewLogic; // 0x488(0x50)
	struct TArray<struct UUserWidget*> AIUnitWidgets; // 0x4D8(0x10)

	// Object: Function DFMAbility.CallAIInfoPanelUIView.UpdateAIStatus
	// Flags: [Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xc3f04e4
	// Params: [ Num(1) Size(0x30) ]
	void UpdateAIStatus(const struct FCallAIStatusInfo& StatusInfo);

	// Object: Function DFMAbility.CallAIInfoPanelUIView.BP_SetType
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetType(int32_t CombatStyle);

	// Object: Function DFMAbility.CallAIInfoPanelUIView.BP_SetPercent
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetPercent(float Percent);

	// Object: Function DFMAbility.CallAIInfoPanelUIView.BP_SetAINumb
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(4) Size(0x10) ]
	void BP_SetAINumb(int32_t RifleCount, int32_t MGCount, int32_t ShieldCount, int32_t FirebatCount);
};

// Object: Class DFMAbility.EnvQueryTest_CallAISpawnPosition_Visibility
// Size: 0x208 (Inherited: 0x1F8)
struct UEnvQueryTest_CallAISpawnPosition_Visibility : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UEnvQueryTest_CallAISpawnPosition_Visibility, "EnvQueryTest_CallAISpawnPosition_Visibility")

	struct UEnvQueryContext* PlayerCharacterContext; // 0x1F8(0x8)
	EDrawDebugTrace DrawType; // 0x200(0x1)
	uint8_t Pad_0x201[0x3]; // 0x201(0x3)
	float WidthMargin; // 0x204(0x4)
};

// Object: Class DFMAbility.EnvQueryTest_CallAISpawnPosition_BestDistanceToPlayer
// Size: 0x208 (Inherited: 0x1F8)
struct UEnvQueryTest_CallAISpawnPosition_BestDistanceToPlayer : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UEnvQueryTest_CallAISpawnPosition_BestDistanceToPlayer, "EnvQueryTest_CallAISpawnPosition_BestDistanceToPlayer")

	struct UEnvQueryContext* PlayerCharacterContext; // 0x1F8(0x8)
	float BestDistance; // 0x200(0x4)
	uint8_t Pad_0x204[0x4]; // 0x204(0x4)
};

// Object: Class DFMAbility.EnvQueryContext_PlayerCharacter
// Size: 0x30 (Inherited: 0x28)
struct UEnvQueryContext_PlayerCharacter : UEnvQueryContext
{
	DEFINE_UE_CLASS_HELPERS(UEnvQueryContext_PlayerCharacter, "EnvQueryContext_PlayerCharacter")

	float EnemySearchRadius; // 0x28(0x4)
	uint8_t bIgnoreEnemy : 1; // 0x2C(0x1), Mask(0x1)
	uint8_t BitPad_0x2C_1 : 7; // 0x2C(0x1)
	uint8_t bIgnoreTeammate : 1; // 0x2D(0x1), Mask(0x1)
	uint8_t BitPad_0x2D_1 : 7; // 0x2D(0x1)
	uint8_t bIgnoreSelf : 1; // 0x2E(0x1), Mask(0x1)
	uint8_t BitPad_0x2E_1 : 7; // 0x2E(0x1)
	uint8_t Pad_0x2F[0x1]; // 0x2F(0x1)
};

// Object: Class DFMAbility.EnvQueryTest_NotInWater
// Size: 0x1F8 (Inherited: 0x1F8)
struct UEnvQueryTest_NotInWater : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UEnvQueryTest_NotInWater, "EnvQueryTest_NotInWater")
};

// Object: Class DFMAbility.EnvQueryGenerator_CallAISpawnBasePoint
// Size: 0x108 (Inherited: 0x80)
struct UEnvQueryGenerator_CallAISpawnBasePoint : UEnvQueryGenerator_ProjectedPoints
{
	DEFINE_UE_CLASS_HELPERS(UEnvQueryGenerator_CallAISpawnBasePoint, "EnvQueryGenerator_CallAISpawnBasePoint")

	struct FAIDataProviderFloatValue GridSize; // 0x80(0x38)
	struct FAIDataProviderFloatValue SpaceBetween; // 0xB8(0x38)
	struct UEnvQueryContext* GenerateAround; // 0xF0(0x8)
	struct FVector CenterLocationOffset; // 0xF8(0xC)
	uint8_t Pad_0x104[0x4]; // 0x104(0x4)
};

// Object: Class DFMAbility.CallDogFightTargetComponent
// Size: 0x1A8 (Inherited: 0xF8)
struct UCallDogFightTargetComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UCallDogFightTargetComponent, "CallDogFightTargetComponent")

	float VisionLostRemoveDelay; // 0xF8(0x4)
	float UpdateInterval; // 0xFC(0x4)
	float DistanceScoreWeight; // 0x100(0x4)
	float DirectionScoreWeight; // 0x104(0x4)
	float TypeScoreWeight; // 0x108(0x4)
	float StickinessScoreWeight; // 0x10C(0x4)
	float VisionScoreWeight; // 0x110(0x4)
	float BroadcastedTargetScoreWeight; // 0x114(0x4)
	float PlayerTargetBonus; // 0x118(0x4)
	float CurrentTargetStickinessBonus; // 0x11C(0x4)
	float MaxEvaluateDistance; // 0x120(0x4)
	float VisionDecayDuration; // 0x124(0x4)
	float BroadcastedTargetBonus; // 0x128(0x4)
	uint8_t bEnableDebugLog : 1; // 0x12C(0x1), Mask(0x1)
	uint8_t BitPad_0x12C_1 : 7; // 0x12C(0x1)
	uint8_t Pad_0x12D[0x3]; // 0x12D(0x3)
	struct TArray<struct FCallDogFightTargetCandidate> CandidateList; // 0x130(0x10)
	struct TWeakObjectPtr<struct ADFMCharacter> CurrentFightTarget; // 0x140(0x8)
	struct TSet<struct TWeakObjectPtr<struct ADFMCharacter>> BroadcastedFightTargets; // 0x148(0x50)
	struct TWeakObjectPtr<struct ADFMAIController> OwnerController; // 0x198(0x8)
	uint8_t Pad_0x1A0[0x8]; // 0x1A0(0x8)

	// Object: Function DFMAbility.CallDogFightTargetComponent.RemoveCandidate
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3f0b2c
	// Params: [ Num(1) Size(0x8) ]
	void RemoveCandidate(struct ADFMCharacter* Target);

	// Object: Function DFMAbility.CallDogFightTargetComponent.RemoveBroadcastedFightTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3f0a88
	// Params: [ Num(1) Size(0x8) ]
	void RemoveBroadcastedFightTarget(struct ADFMCharacter* Target);

	// Object: Function DFMAbility.CallDogFightTargetComponent.IsBroadcastedFightTarget
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3f09d8
	// Params: [ Num(2) Size(0x9) ]
	uint8_t IsBroadcastedFightTarget(struct ADFMCharacter* Target);

	// Object: Function DFMAbility.CallDogFightTargetComponent.HasValidFightTarget
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3f09a0
	// Params: [ Num(1) Size(0x1) ]
	uint8_t HasValidFightTarget();

	// Object: Function DFMAbility.CallDogFightTargetComponent.GetCurrentFightTarget
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3f096c
	// Params: [ Num(1) Size(0x8) ]
	struct ADFMCharacter* GetCurrentFightTarget();

	// Object: Function DFMAbility.CallDogFightTargetComponent.GetCandidateList
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3f08e0
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<struct FCallDogFightTargetCandidate> GetCandidateList();

	// Object: Function DFMAbility.CallDogFightTargetComponent.GetCandidateCount
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3f08c4
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetCandidateCount();

	// Object: Function DFMAbility.CallDogFightTargetComponent.GetBroadcastedFightTargetCount
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xc3f0890
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetBroadcastedFightTargetCount();

	// Object: Function DFMAbility.CallDogFightTargetComponent.ForceReevaluateTargets
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3f087c
	// Params: [ Num(0) Size(0x0) ]
	void ForceReevaluateTargets();

	// Object: Function DFMAbility.CallDogFightTargetComponent.ClearCandidates
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3f0868
	// Params: [ Num(0) Size(0x0) ]
	void ClearCandidates();

	// Object: Function DFMAbility.CallDogFightTargetComponent.ClearBroadcastedFightTargets
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3f0854
	// Params: [ Num(0) Size(0x0) ]
	void ClearBroadcastedFightTargets();

	// Object: Function DFMAbility.CallDogFightTargetComponent.AddCandidate
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3f07b0
	// Params: [ Num(1) Size(0x8) ]
	void AddCandidate(struct ADFMCharacter* Target);

	// Object: Function DFMAbility.CallDogFightTargetComponent.AddBroadcastedFightTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xc3f070c
	// Params: [ Num(1) Size(0x8) ]
	void AddBroadcastedFightTarget(struct ADFMCharacter* Target);
};

// Object: Class DFMAbility.ChainHookAnimComponent
// Size: 0xB80 (Inherited: 0xB80)
struct UChainHookAnimComponent : ULeftWeaponAnimComponent
{
	DEFINE_UE_CLASS_HELPERS(UChainHookAnimComponent, "ChainHookAnimComponent")

	uint8_t bIsShowHook : 1; // 0xB79(0x1), Mask(0x1)

	// Object: Function DFMAbility.ChainHookAnimComponent.UpdateWeaponAnimInstanceParams
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f0cdc
	// Params: [ Num(0) Size(0x0) ]
	void UpdateWeaponAnimInstanceParams();

	// Object: Function DFMAbility.ChainHookAnimComponent.ResetWeaponAnimInstanceParams
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f0cc8
	// Params: [ Num(0) Size(0x0) ]
	void ResetWeaponAnimInstanceParams();

	// Object: Function DFMAbility.ChainHookAnimComponent.IsNeedShowHook
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3f0c18
	// Params: [ Num(2) Size(0x2) ]
	uint8_t IsNeedShowHook(EGPWeaponInnerEvent InWeaponEvent);

	// Object: Function DFMAbility.ChainHookAnimComponent.GetIsShowHook
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3f0bfc
	// Params: [ Num(1) Size(0x1) ]
	uint8_t GetIsShowHook();
};

// Object: Class DFMAbility.ChainHookAnimInstance
// Size: 0xA10 (Inherited: 0x270)
struct UChainHookAnimInstance : UAnimInstance
{
	DEFINE_UE_CLASS_HELPERS(UChainHookAnimInstance, "ChainHookAnimInstance")

	struct FChainHookAnimInstanceProxy LocalProxy; // 0x270(0x7A0)
};

// Object: Class DFMAbility.ChainHookComponent
// Size: 0x7A0 (Inherited: 0x408)
struct UChainHookComponent : UGPWeaponDataComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UChainHookComponent, "ChainHookComponent")

	struct TArray<struct FChainHookRoleData> AllGameRoleData; // 0x408(0x10)
	struct TArray<struct FChainHookBendCheckData> AllBendCheckData; // 0x418(0x10)
	struct TArray<struct FChainHookBendCheckData> ClientAllBendCheckData; // 0x428(0x10)
	uint8_t bClearTakerOffsetOnDirectConnection : 1; // 0x438(0x1), Mask(0x1)
	uint8_t BitPad_0x438_1 : 7; // 0x438(0x1)
	uint8_t bDSCheckChainCutOff : 1; // 0x439(0x1), Mask(0x1)
	uint8_t BitPad_0x439_1 : 7; // 0x439(0x1)
	uint8_t Pad_0x43A[0x2]; // 0x43A(0x2)
	float ClientMaxMeleeHitMaxAngle; // 0x43C(0x4)
	int32_t RobotAIBreakAddDamageID; // 0x440(0x4)
	int32_t MultiMaxPointsCount; // 0x444(0x4)
	float MultiCheckStep; // 0x448(0x4)
	float MergeDistance; // 0x44C(0x4)
	float WallAdjustCheckStep; // 0x450(0x4)
	int32_t WallAdjustCheckCheckCount; // 0x454(0x4)
	float MultiPullBackBendPointOffset; // 0x458(0x4)
	float PullBackBendPoint_MinTime; // 0x45C(0x4)
	float PullBackBendPoint_KeepMinDistance; // 0x460(0x4)
	float PullBackBendPoint_MinDistance; // 0x464(0x4)
	uint8_t bPullBackForbidSwitchWeapon : 1; // 0x468(0x1), Mask(0x1)
	uint8_t BitPad_0x468_1 : 7; // 0x468(0x1)
	uint8_t Pad_0x469[0x3]; // 0x469(0x3)
	float DSHitOthersPullBackAddDelay; // 0x46C(0x4)
	float ChainMaxLength; // 0x470(0x4)
	float MaxBindOffset; // 0x474(0x4)
	struct FVector ForceBindOffset_DeadBox; // 0x478(0xC)
	float MoveForwardMaxTime; // 0x484(0x4)
	float PullBackMaxTime; // 0x488(0x4)
	float PullBackEndDelayTime; // 0x48C(0x4)
	float PullBackEndOffset; // 0x490(0x4)
	float PullBackEndOffset_DeadBox; // 0x494(0x4)
	float PullBackEndHitBackOffset; // 0x498(0x4)
	float PullBackBaseSpeed; // 0x49C(0x4)
	float PullBackMaxSpeed; // 0x4A0(0x4)
	float PullBackAcceleration; // 0x4A4(0x4)
	uint8_t bPullBackStopCheckActorLocation : 1; // 0x4A8(0x1), Mask(0x1)
	uint8_t BitPad_0x4A8_1 : 7; // 0x4A8(0x1)
	uint8_t Pad_0x4A9[0x3]; // 0x4A9(0x3)
	float PullBackStopDistance; // 0x4AC(0x4)
	float PullBackStopDistanceToEnd; // 0x4B0(0x4)
	float PullBackStopDistanceSimple; // 0x4B4(0x4)
	float PullBackNoneBaseSpeed; // 0x4B8(0x4)
	float PullBackNoneMaxSpeed; // 0x4BC(0x4)
	float PullBackNoneAcceleration; // 0x4C0(0x4)
	float BreakPullBackSpeed; // 0x4C4(0x4)
	float CarryTargetMaxDistance; // 0x4C8(0x4)
	struct FName CarryBodyActionName; // 0x4CC(0x8)
	float ExitItemLerpStopDistance; // 0x4D4(0x4)
	float ShowItemMinDistance; // 0x4D8(0x4)
	float ShowItemMinDistance_3P; // 0x4DC(0x4)
	struct FName WeaponSocketName; // 0x4E0(0x8)
	int32_t TryBendUpStepSize; // 0x4E8(0x4)
	int32_t TryBendUpStepNum; // 0x4EC(0x4)
	int32_t TryBendStepSize; // 0x4F0(0x4)
	float TryBendStepForwardRate; // 0x4F4(0x4)
	int32_t TryBendStepNum; // 0x4F8(0x4)
	float CheckRadius; // 0x4FC(0x4)
	int32_t ClientFitStepSize; // 0x500(0x4)
	int32_t ClientFitStepStepNum; // 0x504(0x4)
	uint8_t bIsClientFitToStart : 1; // 0x508(0x1), Mask(0x1)
	uint8_t BitPad_0x508_1 : 7; // 0x508(0x1)
	uint8_t Pad_0x509[0x3]; // 0x509(0x3)
	float PullBackSuccessTime; // 0x50C(0x4)
	float PullBackNoneTime; // 0x510(0x4)
	float PullBackBreakTime; // 0x514(0x4)
	struct TSoftClassPtr<struct AChainHookHitBoxActor*> HitBoxActorClassPath; // 0x518(0x28)
	struct TSoftClassPtr<struct AChainHookItemActor*> ClientHookItemActorClassPath; // 0x540(0x28)
	struct TSoftClassPtr<struct AChainHookItemActor*> LowClientHookItemActorClassPath; // 0x568(0x28)
	struct TArray<struct UObject*> IgnoreObjectClass; // 0x590(0x10)
	struct FChainHookRoleData CurrentData; // 0x5A0(0x30)
	struct TWeakObjectPtr<struct AChainHookHitBoxActor> HitBoxActor; // 0x5D0(0x8)
	uint8_t bIsHitBoxActorCanHit : 1; // 0x5D8(0x1), Mask(0x1)
	uint8_t BitPad_0x5D8_1 : 7; // 0x5D8(0x1)
	uint8_t bClientHitInvalidTarget : 1; // 0x5D9(0x1), Mask(0x1)
	uint8_t BitPad_0x5D9_1 : 7; // 0x5D9(0x1)
	uint8_t Pad_0x5DA[0x2]; // 0x5DA(0x2)
	struct TWeakObjectPtr<struct AChainHookGrenade> HookGrenade; // 0x5DC(0x8)
	struct FVector GrenadeStartOffset; // 0x5E4(0xC)
	struct FVector GrenadeRegisterLocation; // 0x5F0(0xC)
	struct FVector GrenadeHitLocation; // 0x5FC(0xC)
	uint8_t Pad_0x608[0x10]; // 0x608(0x10)
	struct TWeakObjectPtr<struct AActor> HookTakerActor; // 0x618(0x8)
	struct FVector HookTakerOffset; // 0x620(0xC)
	uint8_t bIsHookTakerUsingSceneWeapon : 1; // 0x62C(0x1), Mask(0x1)
	uint8_t BitPad_0x62C_1 : 7; // 0x62C(0x1)
	uint8_t Pad_0x62D[0x3]; // 0x62D(0x3)
	float PullBackSpeed; // 0x630(0x4)
	struct FVector CurrentLocation; // 0x634(0xC)
	EChainHookState CurrState; // 0x640(0x1)
	uint8_t Pad_0x641[0x3]; // 0x641(0x3)
	float MoveForwardEndTime; // 0x644(0x4)
	float PullBackDelayEndTime; // 0x648(0x4)
	float PullBackEndTime; // 0x64C(0x4)
	float CurrPullBackEndDelayTime; // 0x650(0x4)
	float TotalBackToSocketTime; // 0x654(0x4)
	float BackToSocketTime; // 0x658(0x4)
	struct FVector BackToSocketStartLocation; // 0x65C(0xC)
	uint8_t bIsInit : 1; // 0x668(0x1), Mask(0x1)
	uint8_t BitPad_0x668_1 : 7; // 0x668(0x1)
	uint8_t bIsCutOff : 1; // 0x669(0x1), Mask(0x1)
	uint8_t BitPad_0x669_1 : 7; // 0x669(0x1)
	uint8_t bIsBend : 1; // 0x66A(0x1), Mask(0x1)
	uint8_t BitPad_0x66A_1 : 7; // 0x66A(0x1)
	uint8_t Pad_0x66B[0x1]; // 0x66B(0x1)
	struct FVector BendPoint; // 0x66C(0xC)
	struct FVector BendBasePoint; // 0x678(0xC)
	float LastPullBackBendRemoveTime; // 0x684(0x4)
	struct FVector LastPullBackBendPoint; // 0x688(0xC)
	struct FVector LastPullBackBaseBendPoint; // 0x694(0xC)
	int32_t CurrCheckRopeIdx; // 0x6A0(0x4)
	uint8_t Pad_0x6A4[0x4]; // 0x6A4(0x4)
	struct TArray<struct FChainHookRopePoint> RopePoints; // 0x6A8(0x10)
	uint8_t Pad_0x6B8[0xA8]; // 0x6B8(0xA8)
	uint8_t bIsWeaponEnable : 1; // 0x760(0x1), Mask(0x1)
	uint8_t BitPad_0x760_1 : 7; // 0x760(0x1)
	uint8_t Pad_0x761[0x7]; // 0x761(0x7)
	struct AChainHookWeapon* HookWeapon; // 0x768(0x8)
	struct AChainHookItemActor* ClientHookItemActor; // 0x770(0x8)
	uint8_t bIsShowItem : 1; // 0x778(0x1), Mask(0x1)
	uint8_t BitPad_0x778_1 : 7; // 0x778(0x1)
	uint8_t bIsForceUpdateItem : 1; // 0x779(0x1), Mask(0x1)
	uint8_t BitPad_0x779_1 : 7; // 0x779(0x1)
	uint8_t Pad_0x77A[0xE]; // 0x77A(0xE)
	uint8_t bIsSetSkin : 1; // 0x788(0x1), Mask(0x1)
	uint8_t BitPad_0x788_1 : 7; // 0x788(0x1)
	uint8_t Pad_0x789[0x3]; // 0x789(0x3)
	float ExitTotalTime; // 0x78C(0x4)
	float ExitTimeSeconds; // 0x790(0x4)
	float ExitItemLerpTime; // 0x794(0x4)
	float ExitTimeRate; // 0x798(0x4)
	float ExitTimeBendRate; // 0x79C(0x4)

	// Object: Function DFMAbility.ChainHookComponent.UpdateClientHookItem
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f3b74
	// Params: [ Num(0) Size(0x0) ]
	void UpdateClientHookItem();

	// Object: Function DFMAbility.ChainHookComponent.UpdateCarryView
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3f3ac8
	// Params: [ Num(1) Size(0x1) ]
	void UpdateCarryView(uint8_t bShow);

	// Object: Function DFMAbility.ChainHookComponent.UpdateBend_Multi
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3f39dc
	// Params: [ Num(3) Size(0x19) ]
	uint8_t UpdateBend_Multi(struct FVector Start, struct FVector End);

	// Object: Function DFMAbility.ChainHookComponent.UnloadClientHookItem
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f39c8
	// Params: [ Num(0) Size(0x0) ]
	void UnloadClientHookItem();

	// Object: Function DFMAbility.ChainHookComponent.TrySpawnHitBoxActor
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f39b4
	// Params: [ Num(0) Size(0x0) ]
	void TrySpawnHitBoxActor();

	// Object: Function DFMAbility.ChainHookComponent.TrySetSkin
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3f39a0
	// Params: [ Num(0) Size(0x0) ]
	void TrySetSkin();

	// Object: Function DFMAbility.ChainHookComponent.TryResetKeyPoint
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3f38c0
	// Params: [ Num(2) Size(0x18) ]
	void TryResetKeyPoint(struct FVector Start, struct FVector End);

	// Object: Function DFMAbility.ChainHookComponent.TryMoveKeyPoint
	// Flags: [Final|Native|Private|HasOutParms]
	// Offset: 0xc3f37c8
	// Params: [ Num(2) Size(0x18) ]
	void TryMoveKeyPoint(int32_t Idx, struct TArray<struct FChainHookRopePoint>& KeyPoints);

	// Object: Function DFMAbility.ChainHookComponent.TryMergeKeyPoint
	// Flags: [Final|Native|Private|HasOutParms]
	// Offset: 0xc3f36c8
	// Params: [ Num(2) Size(0x18) ]
	void TryMergeKeyPoint(uint8_t bIsStart, struct TArray<struct FChainHookRopePoint>& KeyPoints);

	// Object: Function DFMAbility.ChainHookComponent.TryLoadClientHookItem
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f36b4
	// Params: [ Num(0) Size(0x0) ]
	void TryLoadClientHookItem();

	// Object: Function DFMAbility.ChainHookComponent.TryInitHookWeapon
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f36a0
	// Params: [ Num(0) Size(0x0) ]
	void TryInitHookWeapon();

	// Object: Function DFMAbility.ChainHookComponent.TryInitBend
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f368c
	// Params: [ Num(0) Size(0x0) ]
	void TryInitBend();

	// Object: Function DFMAbility.ChainHookComponent.TryFix3PMoveForward
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f3678
	// Params: [ Num(0) Size(0x0) ]
	void TryFix3PMoveForward();

	// Object: Function DFMAbility.ChainHookComponent.TryDrawDebugMultiInfo
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f3664
	// Params: [ Num(0) Size(0x0) ]
	void TryDrawDebugMultiInfo();

	// Object: Function DFMAbility.ChainHookComponent.TryDoRobotAIBreakAddDamage
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f3650
	// Params: [ Num(0) Size(0x0) ]
	void TryDoRobotAIBreakAddDamage();

	// Object: Function DFMAbility.ChainHookComponent.TryDestroyHitBoxActor
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f363c
	// Params: [ Num(0) Size(0x0) ]
	void TryDestroyHitBoxActor();

	// Object: Function DFMAbility.ChainHookComponent.TryClientFitBend
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3f34b8
	// Params: [ Num(5) Size(0x3C) ]
	struct FVector TryClientFitBend(const struct FVector& Start, const struct FVector& End, struct FVector AddPoint, struct FVector Forward);

	// Object: Function DFMAbility.ChainHookComponent.TryCarryTarget
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3f34a4
	// Params: [ Num(0) Size(0x0) ]
	void TryCarryTarget();

	// Object: Function DFMAbility.ChainHookComponent.TryBreakChainHook
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f33b0
	// Params: [ Num(3) Size(0xA) ]
	uint8_t TryBreakChainHook(struct AActor* HitActor, uint8_t bForce);

	// Object: Function DFMAbility.ChainHookComponent.TryBreak
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f339c
	// Params: [ Num(0) Size(0x0) ]
	void TryBreak();

	// Object: Function DFMAbility.ChainHookComponent.TimingSkillDataFlow
	// Flags: [Native|Protected]
	// Offset: 0xc3f3380
	// Params: [ Num(0) Size(0x0) ]
	void TimingSkillDataFlow();

	// Object: Function DFMAbility.ChainHookComponent.TickPullBack
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f32dc
	// Params: [ Num(1) Size(0x4) ]
	void TickPullBack(float DeltaTime);

	// Object: Function DFMAbility.ChainHookComponent.TickMoveForward
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f32c8
	// Params: [ Num(0) Size(0x0) ]
	void TickMoveForward();

	// Object: Function DFMAbility.ChainHookComponent.TickHookTakerLocation
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f32b4
	// Params: [ Num(0) Size(0x0) ]
	void TickHookTakerLocation();

	// Object: Function DFMAbility.ChainHookComponent.TickHitTarget
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f32a0
	// Params: [ Num(0) Size(0x0) ]
	void TickHitTarget();

	// Object: Function DFMAbility.ChainHookComponent.TickHitBoxActor
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f328c
	// Params: [ Num(0) Size(0x0) ]
	void TickHitBoxActor();

	// Object: Function DFMAbility.ChainHookComponent.TickEnd
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f31e8
	// Params: [ Num(1) Size(0x4) ]
	void TickEnd(float DeltaTime);

	// Object: Function DFMAbility.ChainHookComponent.TickChain
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f31b0
	// Params: [ Num(1) Size(0x1) ]
	uint8_t TickChain();

	// Object: Function DFMAbility.ChainHookComponent.TickBackToSocket
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f310c
	// Params: [ Num(1) Size(0x4) ]
	void TickBackToSocket(float DeltaTime);

	// Object: Function DFMAbility.ChainHookComponent.SyncHitTargetInfo
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3f3060
	// Params: [ Num(1) Size(0x1) ]
	void SyncHitTargetInfo(uint8_t bIsHit);

	// Object: Function DFMAbility.ChainHookComponent.SyncChainHookInfo
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3f304c
	// Params: [ Num(0) Size(0x0) ]
	void SyncChainHookInfo();

	// Object: Function DFMAbility.ChainHookComponent.StopExitTimer
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f3038
	// Params: [ Num(0) Size(0x0) ]
	void StopExitTimer();

	// Object: Function DFMAbility.ChainHookComponent.StopAllSound
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f3024
	// Params: [ Num(0) Size(0x0) ]
	void StopAllSound();

	// Object: Function DFMAbility.ChainHookComponent.StartExitTimer
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f2f80
	// Params: [ Num(1) Size(0x4) ]
	void StartExitTimer(float DelayTime);

	// Object: Function DFMAbility.ChainHookComponent.SkillComRepChainHookInfo
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xc3f2e64
	// Params: [ Num(3) Size(0x1C) ]
	void SkillComRepChainHookInfo(EChainHookState State, struct AActor* HitActor, struct FVector HitOffset);

	// Object: Function DFMAbility.ChainHookComponent.SetState
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f2dc0
	// Params: [ Num(1) Size(0x1) ]
	void SetState(EChainHookState State);

	// Object: Function DFMAbility.ChainHookComponent.SetHookAimingHudState
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f2cd0
	// Params: [ Num(2) Size(0x2) ]
	void SetHookAimingHudState(uint8_t bIsShowAim, uint8_t bIsShowTarget);

	// Object: Function DFMAbility.ChainHookComponent.SetHitSkillTipsState
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f2c24
	// Params: [ Num(1) Size(0x1) ]
	void SetHitSkillTipsState(uint8_t bIsShowTips);

	// Object: Function DFMAbility.ChainHookComponent.SetHitBoxActorCanHit
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f2b78
	// Params: [ Num(1) Size(0x1) ]
	void SetHitBoxActorCanHit(uint8_t bIsCanHit);

	// Object: Function DFMAbility.ChainHookComponent.SetForceUpdateItem
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f2b5c
	// Params: [ Num(0) Size(0x0) ]
	void SetForceUpdateItem();

	// Object: Function DFMAbility.ChainHookComponent.SetCancleBtnState
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f2ab0
	// Params: [ Num(1) Size(0x1) ]
	void SetCancleBtnState(uint8_t bIsShowCancleBtn);

	// Object: Function DFMAbility.ChainHookComponent.SendServerHitInvalidTarget
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f2a9c
	// Params: [ Num(0) Size(0x0) ]
	void SendServerHitInvalidTarget();

	// Object: Function DFMAbility.ChainHookComponent.ResetHitBoxHP
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f2a88
	// Params: [ Num(0) Size(0x0) ]
	void ResetHitBoxHP();

	// Object: Function DFMAbility.ChainHookComponent.RemovePullBackDelayHookedBuff
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3f2a74
	// Params: [ Num(0) Size(0x0) ]
	void RemovePullBackDelayHookedBuff();

	// Object: Function DFMAbility.ChainHookComponent.RemovePullBackDelayBuff
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3f2a60
	// Params: [ Num(0) Size(0x0) ]
	void RemovePullBackDelayBuff();

	// Object: Function DFMAbility.ChainHookComponent.RefreshKeyInfo
	// Flags: [Final|Native|Private|HasOutParms]
	// Offset: 0xc3f2968
	// Params: [ Num(2) Size(0x18) ]
	void RefreshKeyInfo(int32_t Idx, struct TArray<struct FChainHookRopePoint>& KeyPoints);

	// Object: Function DFMAbility.ChainHookComponent.PlaySetStateSound
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f2954
	// Params: [ Num(0) Size(0x0) ]
	void PlaySetStateSound();

	// Object: Function DFMAbility.ChainHookComponent.PlayItemBreakSound
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f2940
	// Params: [ Num(0) Size(0x0) ]
	void PlayItemBreakSound();

	// Object: Function DFMAbility.ChainHookComponent.PlayBreakSound
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f292c
	// Params: [ Num(0) Size(0x0) ]
	void PlayBreakSound();

	// Object: Function DFMAbility.ChainHookComponent.OnServerHitInvalidTarget
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f2918
	// Params: [ Num(0) Size(0x0) ]
	void OnServerHitInvalidTarget();

	// Object: Function DFMAbility.ChainHookComponent.OnRepHitBoxActor
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f2874
	// Params: [ Num(1) Size(0x8) ]
	void OnRepHitBoxActor(struct AChainHookHitBoxActor* BoxActor);

	// Object: Function DFMAbility.ChainHookComponent.OnPullBackEnd
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f2860
	// Params: [ Num(0) Size(0x0) ]
	void OnPullBackEnd();

	// Object: Function DFMAbility.ChainHookComponent.OnHookUnregister
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f27bc
	// Params: [ Num(1) Size(0x8) ]
	void OnHookUnregister(struct AChainHookGrenade* Grenade);

	// Object: Function DFMAbility.ChainHookComponent.OnHookGrenadeRegister
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f2718
	// Params: [ Num(1) Size(0x8) ]
	void OnHookGrenadeRegister(struct AChainHookGrenade* Grenade);

	// Object: Function DFMAbility.ChainHookComponent.OnHitTarget
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xc3f25ec
	// Params: [ Num(3) Size(0x28) ]
	void OnHitTarget(struct TScriptInterface<IChainHookTakerInterface> InHookTaker, struct FVector HitLocation, struct FVector ProjectileStickyOffset);

	// Object: Function DFMAbility.ChainHookComponent.OnHitOthers
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xc3f2548
	// Params: [ Num(1) Size(0xC) ]
	void OnHitOthers(struct FVector HitLocation);

	// Object: Function DFMAbility.ChainHookComponent.OnHitNone
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f2534
	// Params: [ Num(0) Size(0x0) ]
	void OnHitNone();

	// Object: Function DFMAbility.ChainHookComponent.OnHitInvalidTarget
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f2488
	// Params: [ Num(1) Size(0x1) ]
	void OnHitInvalidTarget(uint8_t bIsHitNone);

	// Object: Function DFMAbility.ChainHookComponent.OnHitAndDestroyed
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f2474
	// Params: [ Num(0) Size(0x0) ]
	void OnHitAndDestroyed();

	// Object: Function DFMAbility.ChainHookComponent.OnHitAddBendIgnoredActor
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f23d0
	// Params: [ Num(1) Size(0x8) ]
	void OnHitAddBendIgnoredActor(struct AActor* HitActor);

	// Object: Function DFMAbility.ChainHookComponent.OnClientHookItemLoaded
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3f2310
	// Params: [ Num(1) Size(0x18) ]
	void OnClientHookItemLoaded(const struct FSoftObjectPath& Path);

	// Object: Function DFMAbility.ChainHookComponent.OnBreak
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f2220
	// Params: [ Num(2) Size(0x2) ]
	void OnBreak(uint8_t bIsAddCount, uint8_t bCheckEndSimple);

	// Object: Function DFMAbility.ChainHookComponent.OnBackToSocketEnd
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f220c
	// Params: [ Num(0) Size(0x0) ]
	void OnBackToSocketEnd();

	// Object: Function DFMAbility.ChainHookComponent.MultiCheckKeyPoint
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3f20d0
	// Params: [ Num(3) Size(0x20) ]
	void MultiCheckKeyPoint(uint8_t bIsStart, struct FVector TargetLoc, struct TArray<struct FChainHookRopePoint>& KeyPoints);

	// Object: Function DFMAbility.ChainHookComponent.IsDS
	// Flags: [Final|Native|Protected|Const]
	// Offset: 0xc3f2098
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsDS();

	// Object: Function DFMAbility.ChainHookComponent.IsDirectConnection
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f2060
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsDirectConnection();

	// Object: Function DFMAbility.ChainHookComponent.IsClient
	// Flags: [Final|Native|Protected|Const]
	// Offset: 0xc3f2028
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsClient();

	// Object: Function DFMAbility.ChainHookComponent.IsCanHitTarget
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f1f68
	// Params: [ Num(2) Size(0x11) ]
	uint8_t IsCanHitTarget(struct TScriptInterface<IChainHookTakerInterface> InHookTaker);

	// Object: Function DFMAbility.ChainHookComponent.InitGameRoleData
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f1f54
	// Params: [ Num(0) Size(0x0) ]
	void InitGameRoleData();

	// Object: Function DFMAbility.ChainHookComponent.HideClientHookItem
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f1f40
	// Params: [ Num(0) Size(0x0) ]
	void HideClientHookItem();

	// Object: Function DFMAbility.ChainHookComponent.GetWeaponSocketLocation
	// Flags: [Final|Native|Private|HasDefaults|Const]
	// Offset: 0xc3f1f08
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetWeaponSocketLocation();

	// Object: Function DFMAbility.ChainHookComponent.GetPullBackEndPoint
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3f1ed0
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetPullBackEndPoint();

	// Object: Function DFMAbility.ChainHookComponent.GetPullBackEndLocation
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3f1e20
	// Params: [ Num(2) Size(0x18) ]
	struct FVector GetPullBackEndLocation(struct FVector PullBackTarget);

	// Object: Function DFMAbility.ChainHookComponent.GetIsCutOff
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3f1e04
	// Params: [ Num(1) Size(0x1) ]
	uint8_t GetIsCutOff();

	// Object: Function DFMAbility.ChainHookComponent.GetHookTakerActor
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3f1dcc
	// Params: [ Num(1) Size(0x8) ]
	struct AActor* GetHookTakerActor();

	// Object: Function DFMAbility.ChainHookComponent.GetCurrState
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3f1db0
	// Params: [ Num(1) Size(0x1) ]
	EChainHookState GetCurrState();

	// Object: Function DFMAbility.ChainHookComponent.GetCheckStartPoint
	// Flags: [Final|Native|Private|HasDefaults|Const]
	// Offset: 0xc3f1d00
	// Params: [ Num(2) Size(0x10) ]
	struct FVector GetCheckStartPoint(EChainHookCheckStartType StartType);

	// Object: Function DFMAbility.ChainHookComponent.GetCheckEndPoint
	// Flags: [Final|Native|Private|HasDefaults|Const]
	// Offset: 0xc3f1c50
	// Params: [ Num(2) Size(0x10) ]
	struct FVector GetCheckEndPoint(EChainHookCheckEndType EndType);

	// Object: Function DFMAbility.ChainHookComponent.GetCameraLocation
	// Flags: [Final|Native|Private|HasDefaults|Const]
	// Offset: 0xc3f1c18
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetCameraLocation();

	// Object: Function DFMAbility.ChainHookComponent.ForbidCharacterAbility
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3f1b6c
	// Params: [ Num(1) Size(0x1) ]
	void ForbidCharacterAbility(uint8_t bIsForbid);

	// Object: Function DFMAbility.ChainHookComponent.FindGameRoleDataIndex
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3f1b38
	// Params: [ Num(1) Size(0x4) ]
	int32_t FindGameRoleDataIndex();

	// Object: Function DFMAbility.ChainHookComponent.DSCheckChain_Multi
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f1b00
	// Params: [ Num(1) Size(0x1) ]
	uint8_t DSCheckChain_Multi();

	// Object: Function DFMAbility.ChainHookComponent.DrawDebugSegment
	// Flags: [Final|Native|Private|HasDefaults|Const]
	// Offset: 0xc3f1a20
	// Params: [ Num(2) Size(0x18) ]
	void DrawDebugSegment(struct FVector Start, struct FVector End);

	// Object: Function DFMAbility.ChainHookComponent.DrawDebugInfo
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3f1a0c
	// Params: [ Num(0) Size(0x0) ]
	void DrawDebugInfo();

	// Object: Function DFMAbility.ChainHookComponent.DoMultiCheckKeyPoint
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3f18d0
	// Params: [ Num(3) Size(0x20) ]
	void DoMultiCheckKeyPoint(uint8_t bIsStart, struct FVector TargetLoc, struct TArray<struct FChainHookRopePoint>& KeyPoints);

	// Object: Function DFMAbility.ChainHookComponent.DoExit
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f18bc
	// Params: [ Num(0) Size(0x0) ]
	void DoExit();

	// Object: Function DFMAbility.ChainHookComponent.DoBendSweep
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3f1750
	// Params: [ Num(4) Size(0xA1) ]
	uint8_t DoBendSweep(struct FHitResult& OutHit, const struct FVector& Start, const struct FVector& End);

	// Object: Function DFMAbility.ChainHookComponent.DoAddKeyPoint
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3f1614
	// Params: [ Num(3) Size(0x20) ]
	void DoAddKeyPoint(uint8_t bIsStart, struct FVector TargetLoc, struct TArray<struct FChainHookRopePoint>& KeyPoints);

	// Object: Function DFMAbility.ChainHookComponent.DataFlowAddThrowNumber
	// Flags: [Native|Protected]
	// Offset: 0xc3f15f8
	// Params: [ Num(0) Size(0x0) ]
	void DataFlowAddThrowNumber();

	// Object: Function DFMAbility.ChainHookComponent.DataFlowAddHitInfo
	// Flags: [Native|Protected]
	// Offset: 0xc3f15dc
	// Params: [ Num(0) Size(0x0) ]
	void DataFlowAddHitInfo();

	// Object: Function DFMAbility.ChainHookComponent.CountPullBackEndLocation
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3f14f0
	// Params: [ Num(3) Size(0x1C) ]
	struct FVector CountPullBackEndLocation(float StopDistance, struct FVector Target);

	// Object: Function DFMAbility.ChainHookComponent.CountGrenadeStartOffset
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f14dc
	// Params: [ Num(0) Size(0x0) ]
	void CountGrenadeStartOffset();

	// Object: Function DFMAbility.ChainHookComponent.ClientShowHitAndDestroyed
	// Flags: [Net|NetReliableNative|Event|Public|NetClient]
	// Offset: 0xc3f14c0
	// Params: [ Num(0) Size(0x0) ]
	void ClientShowHitAndDestroyed();

	// Object: Function DFMAbility.ChainHookComponent.ClientCheckChain_Multi
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f1488
	// Params: [ Num(1) Size(0x1) ]
	uint8_t ClientCheckChain_Multi();

	// Object: Function DFMAbility.ChainHookComponent.CleanLoadClientHookItem
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f1474
	// Params: [ Num(0) Size(0x0) ]
	void CleanLoadClientHookItem();

	// Object: Function DFMAbility.ChainHookComponent.CleanHitInfo
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f1460
	// Params: [ Num(0) Size(0x0) ]
	void CleanHitInfo();

	// Object: Function DFMAbility.ChainHookComponent.CleanBend
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f144c
	// Params: [ Num(0) Size(0x0) ]
	void CleanBend();

	// Object: Function DFMAbility.ChainHookComponent.CheckSkillComRepState
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f139c
	// Params: [ Num(2) Size(0x2) ]
	uint8_t CheckSkillComRepState(EChainHookState State);

	// Object: Function DFMAbility.ChainHookComponent.CheckPullBackDistance
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3f1278
	// Params: [ Num(4) Size(0x15) ]
	uint8_t CheckPullBackDistance(struct FVector Distance, float XYSize, float ZSize);

	// Object: Function DFMAbility.ChainHookComponent.CheckIsUseLowItem
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3f1240
	// Params: [ Num(1) Size(0x1) ]
	uint8_t CheckIsUseLowItem();

	// Object: Function DFMAbility.ChainHookComponent.CheckIsPullBackEndSimple
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f1208
	// Params: [ Num(1) Size(0x1) ]
	uint8_t CheckIsPullBackEndSimple();

	// Object: Function DFMAbility.ChainHookComponent.CheckIsPullBackEnd
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3f1158
	// Params: [ Num(2) Size(0xD) ]
	uint8_t CheckIsPullBackEnd(struct FVector PullBackTarget);

	// Object: Function DFMAbility.ChainHookComponent.CheckIsLocalHookTakerActor
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3f1120
	// Params: [ Num(1) Size(0x1) ]
	uint8_t CheckIsLocalHookTakerActor();

	// Object: Function DFMAbility.ChainHookComponent.CheckIsHookTakerUsingSceneWeapon
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3f10e8
	// Params: [ Num(1) Size(0x1) ]
	uint8_t CheckIsHookTakerUsingSceneWeapon();

	// Object: Function DFMAbility.ChainHookComponent.CheckHookTakerOffset
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3f1038
	// Params: [ Num(1) Size(0xC) ]
	void CheckHookTakerOffset(const struct FVector& ProjectileStickyOffset);

	// Object: Function DFMAbility.ChainHookComponent.CheckEnableClientHookItemShowState
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f1024
	// Params: [ Num(0) Size(0x0) ]
	void CheckEnableClientHookItemShowState();

	// Object: Function DFMAbility.ChainHookComponent.CheckCVarWeaponHookVal
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f1010
	// Params: [ Num(0) Size(0x0) ]
	void CheckCVarWeaponHookVal();

	// Object: Function DFMAbility.ChainHookComponent.CheckClientHookItemShowState
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f0ffc
	// Params: [ Num(0) Size(0x0) ]
	void CheckClientHookItemShowState();

	// Object: Function DFMAbility.ChainHookComponent.CarryTargetCheckDistance
	// Flags: [Final|Native|Protected]
	// Offset: 0xc3f0f4c
	// Params: [ Num(2) Size(0x9) ]
	uint8_t CarryTargetCheckDistance(struct AActor* Target);

	// Object: Function DFMAbility.ChainHookComponent.CancelFire
	// Flags: [Final|Native|Protected|Const]
	// Offset: 0xc3f0f38
	// Params: [ Num(0) Size(0x0) ]
	void CancelFire();

	// Object: Function DFMAbility.ChainHookComponent.AddPullBackDelayHookedBuff
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3f0f24
	// Params: [ Num(0) Size(0x0) ]
	void AddPullBackDelayHookedBuff();

	// Object: Function DFMAbility.ChainHookComponent.AddPullBackDelayBuff
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3f0f10
	// Params: [ Num(0) Size(0x0) ]
	void AddPullBackDelayBuff();

	// Object: Function DFMAbility.ChainHookComponent.AddIgnoredWeapon
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f0e6c
	// Params: [ Num(1) Size(0x8) ]
	void AddIgnoredWeapon(struct AGPCharacter* GPCharacter);

	// Object: Function DFMAbility.ChainHookComponent.AddHookBrokenCount
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f0e58
	// Params: [ Num(0) Size(0x0) ]
	void AddHookBrokenCount();
};

// Object: Class DFMAbility.ChainHookGrenade
// Size: 0x18D0 (Inherited: 0x1890)
struct AChainHookGrenade : ADFMAbilityWeaponThrowableBullet
{
	DEFINE_UE_CLASS_HELPERS(AChainHookGrenade, "ChainHookGrenade")

	float AddHealthDamage; // 0x1884(0x4)
	ECharacterPart AddHealthDamagePart; // 0x1888(0x1)
	float MaxHitDistance; // 0x188C(0x4)
	float MaxStickyOffsetZ; // 0x1890(0x4)
	float MinStickyOffsetZ; // 0x1894(0x4)
	uint8_t IsHitCharAddTrace : 1; // 0x1898(0x1), Mask(0x1)
	float HitCharAddTraceAddThickness; // 0x189C(0x4)
	uint8_t bIsIgnoreDSPlayExplosionEffect : 1; // 0x18A0(0x1), Mask(0x1)
	uint8_t BitPad_0x18A5_2 : 6; // 0x18A5(0x1)
	uint8_t Pad_0x18A6[0x2]; // 0x18A6(0x2)
	struct TArray<struct UObject*> IgnoreObjectClass; // 0x18A8(0x10)
	uint8_t bIsHookStop : 1; // 0x18B8(0x1), Mask(0x1)
	uint8_t BitPad_0x18B8_1 : 7; // 0x18B8(0x1)
	uint8_t Pad_0x18B9[0x3]; // 0x18B9(0x3)
	struct FVector HookStartLocation; // 0x18BC(0xC)
	uint8_t Pad_0x18C8[0x8]; // 0x18C8(0x8)

	// Object: Function DFMAbility.ChainHookGrenade.UnregisterToHookComponent_3P
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f736c
	// Params: [ Num(0) Size(0x0) ]
	void UnregisterToHookComponent_3P();

	// Object: Function DFMAbility.ChainHookGrenade.UnregisterToHookComponent
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f7358
	// Params: [ Num(0) Size(0x0) ]
	void UnregisterToHookComponent();

	// Object: Function DFMAbility.ChainHookGrenade.TryStickyHookToCharacter
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults|Const]
	// Offset: 0xc3f7284
	// Params: [ Num(2) Size(0x94) ]
	struct FVector TryStickyHookToCharacter(const struct FHitResult& ImpactResult);

	// Object: Function DFMAbility.ChainHookGrenade.TryCheckHitCharAddTrace
	// Flags: [Final|Native|Private|HasOutParms]
	// Offset: 0xc3f71b0
	// Params: [ Num(2) Size(0x89) ]
	uint8_t TryCheckHitCharAddTrace(struct FHitResult& ImpactResult);

	// Object: Function DFMAbility.ChainHookGrenade.RegisterToHookComponent_3P
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f719c
	// Params: [ Num(0) Size(0x0) ]
	void RegisterToHookComponent_3P();

	// Object: Function DFMAbility.ChainHookGrenade.RegisterToHookComponent
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f7188
	// Params: [ Num(0) Size(0x0) ]
	void RegisterToHookComponent();

	// Object: Function DFMAbility.ChainHookGrenade.PlayHitSound
	// Flags: [Final|Native|Private|HasOutParms]
	// Offset: 0xc3f70c0
	// Params: [ Num(1) Size(0x88) ]
	void PlayHitSound(const struct FHitResult& ImpactResult);

	// Object: Function DFMAbility.ChainHookGrenade.PlayHitEffect
	// Flags: [Final|Native|Private|HasOutParms]
	// Offset: 0xc3f6ff8
	// Params: [ Num(1) Size(0x88) ]
	void PlayHitEffect(const struct FHitResult& ImpactResult);

	// Object: Function DFMAbility.ChainHookGrenade.OnHitOthers
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3f6f54
	// Params: [ Num(1) Size(0xC) ]
	void OnHitOthers(struct FVector HitLocation);

	// Object: Function DFMAbility.ChainHookGrenade.OnHitNone
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f6f40
	// Params: [ Num(0) Size(0x0) ]
	void OnHitNone();

	// Object: Function DFMAbility.ChainHookGrenade.OnHitHookTaker
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3f6e14
	// Params: [ Num(3) Size(0x28) ]
	void OnHitHookTaker(struct TScriptInterface<IChainHookTakerInterface> HookTaker, struct FVector HitLocation, struct FVector ProjectileStickyOffset);

	// Object: Function DFMAbility.ChainHookGrenade.InitTrajectoryFlagBlackSet
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f6e00
	// Params: [ Num(0) Size(0x0) ]
	void InitTrajectoryFlagBlackSet();

	// Object: Function DFMAbility.ChainHookGrenade.GetTPPChainHookComponent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f6dcc
	// Params: [ Num(1) Size(0x8) ]
	struct UChainHookComponent* GetTPPChainHookComponent();

	// Object: Function DFMAbility.ChainHookGrenade.GetHookWeapon_3P
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xc3f6d98
	// Params: [ Num(1) Size(0x8) ]
	struct AWeaponBase* GetHookWeapon_3P();

	// Object: Function DFMAbility.ChainHookGrenade.GetHookLocation
	// Flags: [Final|Native|Public|HasDefaults|Const]
	// Offset: 0xc3f6d60
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetHookLocation();

	// Object: Function DFMAbility.ChainHookGrenade.GetHitBoneName
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f6d2c
	// Params: [ Num(1) Size(0x8) ]
	struct FName GetHitBoneName();

	// Object: Function DFMAbility.ChainHookGrenade.GetChainHookComponent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f6cf8
	// Params: [ Num(1) Size(0x8) ]
	struct UChainHookComponent* GetChainHookComponent();

	// Object: Function DFMAbility.ChainHookGrenade.DoHookPointDamage
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f6c54
	// Params: [ Num(1) Size(0x8) ]
	void DoHookPointDamage(struct AActor* HitTarget);

	// Object: Function DFMAbility.ChainHookGrenade.DoHookHealthDamage
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f6bb0
	// Params: [ Num(1) Size(0x8) ]
	void DoHookHealthDamage(struct AActor* HitTarget);

	// Object: Function DFMAbility.ChainHookGrenade.DoCheckHitCharAddTrace
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xc3f6a20
	// Params: [ Num(5) Size(0xA9) ]
	uint8_t DoCheckHitCharAddTrace(struct FHitResult& OutHit, struct FVector HitCharLocation, struct FVector HitCharNormal, struct AActor* HitChar);

	// Object: Function DFMAbility.ChainHookGrenade.CheckMaxHitDistance
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xc3f6970
	// Params: [ Num(2) Size(0xD) ]
	uint8_t CheckMaxHitDistance(struct FVector HitLocation);
};

// Object: Class DFMAbility.ChainHookHitBoxActor
// Size: 0x3E8 (Inherited: 0x370)
struct AChainHookHitBoxActor : AActor
{
	DEFINE_UE_CLASS_HELPERS(AChainHookHitBoxActor, "ChainHookHitBoxActor")

	uint8_t Pad_0x370[0x28]; // 0x370(0x28)
	uint8_t bIsDrawDebug : 1; // 0x398(0x1), Mask(0x1)
	uint8_t BitPad_0x398_1 : 7; // 0x398(0x1)
	uint8_t Pad_0x399[0x3]; // 0x399(0x3)
	int32_t ThreatId; // 0x39C(0x4)
	EHitEventType HitEventType; // 0x3A0(0x1)
	uint8_t Pad_0x3A1[0x3]; // 0x3A1(0x3)
	float HitExtent; // 0x3A4(0x4)
	struct TWeakObjectPtr<struct AGPCharacter> OwnerCharacter; // 0x3A8(0x8)
	uint8_t bIsCanHit : 1; // 0x3B0(0x1), Mask(0x1)
	uint8_t BitPad_0x3B0_1 : 7; // 0x3B0(0x1)
	uint8_t bIsRegisterToSkillComponent : 1; // 0x3B1(0x1), Mask(0x1)
	uint8_t BitPad_0x3B1_1 : 7; // 0x3B1(0x1)
	uint8_t Pad_0x3B2[0x2]; // 0x3B2(0x2)
	float MaxHP; // 0x3B4(0x4)
	float CurrHP; // 0x3B8(0x4)
	struct TWeakObjectPtr<struct UChainHookComponent> OwnerHook; // 0x3BC(0x8)
	uint8_t Pad_0x3C4[0x4]; // 0x3C4(0x4)
	struct TArray<struct UBoxComponent*> CurrHitBoxArray; // 0x3C8(0x10)
	struct FVector MarkerLocation; // 0x3D8(0xC)
	uint8_t Pad_0x3E4[0x4]; // 0x3E4(0x4)

	// Object: Function DFMAbility.ChainHookHitBoxActor.TryRegisterToSkillComponent
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f7988
	// Params: [ Num(0) Size(0x0) ]
	void TryRegisterToSkillComponent();

	// Object: Function DFMAbility.ChainHookHitBoxActor.TickHitBox
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xc3f786c
	// Params: [ Num(3) Size(0x1C) ]
	void TickHitBox(int32_t Index, struct FVector Start, struct FVector End);

	// Object: Function DFMAbility.ChainHookHitBoxActor.SetIsCanHit
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f77c0
	// Params: [ Num(1) Size(0x1) ]
	void SetIsCanHit(uint8_t isCanHit);

	// Object: Function DFMAbility.ChainHookHitBoxActor.SetChainHookComponent
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f771c
	// Params: [ Num(1) Size(0x8) ]
	void SetChainHookComponent(struct UChainHookComponent* Hook);

	// Object: Function DFMAbility.ChainHookHitBoxActor.SendProjectileThreatExplosion
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f7708
	// Params: [ Num(0) Size(0x0) ]
	void SendProjectileThreatExplosion();

	// Object: Function DFMAbility.ChainHookHitBoxActor.SendProjectileThreatCreate
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f76f4
	// Params: [ Num(0) Size(0x0) ]
	void SendProjectileThreatCreate();

	// Object: Function DFMAbility.ChainHookHitBoxActor.ResetHP
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f76e0
	// Params: [ Num(0) Size(0x0) ]
	void ResetHP();

	// Object: Function DFMAbility.ChainHookHitBoxActor.OnRep_OwnerCharacter
	// Flags: [Final|Native|Public]
	// Offset: 0x10ac3d28
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_OwnerCharacter();

	// Object: Function DFMAbility.ChainHookHitBoxActor.OnRep_IsCanHit
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f76cc
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_IsCanHit();

	// Object: Function DFMAbility.ChainHookHitBoxActor.OnHitAndDestroyed
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f76b8
	// Params: [ Num(0) Size(0x0) ]
	void OnHitAndDestroyed();

	// Object: Function DFMAbility.ChainHookHitBoxActor.IsEnemyCast
	// Flags: [Final|Native|Private]
	// Offset: 0xc3f7680
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsEnemyCast();

	// Object: Function DFMAbility.ChainHookHitBoxActor.Init
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f7568
	// Params: [ Num(3) Size(0x14) ]
	void Init(struct AGPCharacter* CHARACTER, struct UChainHookComponent* Hook, float inMaxHP);

	// Object: Function DFMAbility.ChainHookHitBoxActor.GetHitBoxNum
	// Flags: [Final|Native|Public|Const]
	// Offset: 0xc3f7534
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetHitBoxNum();

	// Object: Function DFMAbility.ChainHookHitBoxActor.CloseHitBox
	// Flags: [Final|Native|Public]
	// Offset: 0xc3f7490
	// Params: [ Num(1) Size(0x4) ]
	void CloseHitBox(int32_t Index);
};

// Object: Class DFMAbility.ChainHookItemActor
// Size: 0x430 (Inherited: 0x370)
struct AChainHookItemActor : AActor
{
	DEFINE_UE_CLASS_HELPERS(AChainHookItemActor, "ChainHookItemActor")

	uint8_t bIsUseAnim : 1; // 0x370(0x1), Mask(0x1)
	uint8_t BitPad_0x370_1 : 7; // 0x370(0x1)
	uint8_t Pad_0x371[0x3]; // 0x371(0x3)
	float ChainMeshBaseSize; // 0x374(0x4)
	struct UGPAudioEventAsset* PullBackNoneStartEvent; // 0x378(0x8)
	struct UGPAudioEventAsset* PullBackNoneStopEvent; // 0x380(0x8)
	struct UGPAudioEventAsset* PullBackNoneFinishEvent; // 0x388(0x8)
	struct UGPAudioEventAsset* PullBackItemStartEvent; // 0x390(0x8)
	struct UGPAudioEventAsset* PullBackItemStopEvent; // 0x398(0x8)
