#pragma once

#include "../CoreUObject_classes.hpp"
#include "DFMGameSDK.hpp"
#include "DFMGameplay.hpp"
#include "DFMGlobalDefines.hpp"
#include "Engine.hpp"
#include "GPGameHud.hpp"
#include "GPGameplay.hpp"
#include "GPGlobalDefines.hpp"
#include "GPMassGamePlay.hpp"
#include "GPUserInterface.hpp"
#include "GPUserInterfaceCore.hpp"
#include "GameCore.hpp"
#include "GameplayTags.hpp"
#include "HudFramework.hpp"
#include "InputCore.hpp"
#include "MassEntity.hpp"
#include "SlateCore.hpp"
#include "UITween.hpp"
#include "UMG.hpp"

namespace SDK
{

// Package: DFMGameHud
// Enums: 77
// Structs: 160
// Classes: 1314

struct AActor;
struct AAimlabTargetActor;
struct AAirDropGenerator;
struct AAssembleWeaponActor;
struct ABionicBirdBaseActor;
struct ABionicSpyBaseActor;
struct ABraveGame;
struct ACHARACTER;
struct AController;
struct ADFFixedWeaponPawn;
struct ADFMAICharacter;
struct ADFMCharacter;
struct ADFMGameState;
struct ADFMHelicopter;
struct ADFMJet;
struct ADFMMarkerManager;
struct ADFMPlayerCharacter;
struct ADFMPlayerController;
struct ADFMPlayerState;
struct ADFMSceneWeapon;
struct ADFMTieBreaker;
struct ADFMVehicleBase;
struct ADFMWeapon;
struct ADramaArea;
struct AGPCharacter;
struct AGPCharacterBase;
struct AGPControllableBullet;
struct AGPGameState;
struct AGPInventoryBase;
struct AGPMarkerManager;
struct AGPNetworkPlayerController;
struct AGPPlayerController;
struct AGPPlayerState;
struct AGPQuestMarkerBase;
struct AGPSceneActorReplicator;

struct USOLQuestMarkWindowView;
struct USOLQuestTipConditionBox;
struct ISOLQuestTipHUDInterface;
struct USOLQuestTipHUDView;
struct USOLQuestTipsConditionBoxWidget;
struct USOLQuestTipsHudController;
struct USOLQuestTipsHudView;
struct USOLRemainTimeHudView;
struct USOLScreenMarkerFlagged;
struct USOLScreenMarkerCommon;
struct USOLStartMatchEvacuationInfoHUDView;
struct USOLStartMatchHudController;
struct USOLStartMatchHudView;
struct USOLStartMatchInfoHUDController;
struct USOLStartMatchInfoHUDView;
struct USOLTimelineTipHUDView;
struct USOLVaultUnlockViewHudView;
struct USOLWishItemMarkerHUDView;
struct USOLWishItemMarkerController;
struct USonarDetectMarkerWidget;
struct USonarDetectMassMarkerWidget;
struct USoundVisualizationPanel;
struct UStingerMissileAimingHudController;
struct UStingerMissileAimingHudMarkView;
struct UStingerMissileAimingHudView;
struct USubtitleHudController;
struct USubtitleHudView;
struct UTacticalEquipmentMassMarkerWidget;
struct UTacticalEquipmentRouletteHudView;
struct UTacticalEquipmentRouletteHudView_UIItemInnerContent;
struct UTacticalEquipmentRouletteHudViewController;
struct UTeamHUDControllerBase;
struct UTeamIdWidget;
struct UTeamInfoHUDView;
struct UTeamInfoView;
struct UTelescopeButtonHUD;
struct UTelescopeHUDView;
struct UTextMapItemHUDView;
struct UThreatDetectionHudHudController;
struct UThreatDetectionHudHudView;
struct UThreatDetectionHudView;
struct UTimeLineEventMapHUDView;
struct UTopDirectionIndicatorHUD;
struct UTopDirectionIndicatorHudView;
struct UHudSoundVisualizationArrow;
struct UTopDirectionSoundItemHudView;
struct UTopDirectionSoundPanelHudView;
struct USoundVisualizationArrow;
struct UTopDirectionSoundWidget;
struct UUDFMMobileWeaponRangeFinder;
struct UUnopenExitHudView;
struct UVehicleEmptyRootHudController;
struct UVehicleEmptyRootHudView;
struct UVehicleMassMarkerWidget;
struct UVehicleWidgetManager;
struct UVehicleSkillWidgetManager;
struct UVehicleSubWidgetManager;
struct UVehicleViewHelpFunctionLibrary;
struct UWarfareLoadingView;
struct UWatchFightTransitionHudController;
struct UWatchFightTransitionHudView;
struct UWeaponAssemblyBPLibrary;
struct UWeaponDebugHud_DamageValidateResultItem;
struct UWeaponDebugHud_DamageValidate;
struct UWeaponDebugSettings;
struct UWeaponDebugLogView;
struct UWeaponDebugLogViewNew;
struct UWeaponFireStatDebugLogView;
struct UWeaponHUDBlueprintLibrary;
struct UWeaponInputBase;
struct UWeaponInputHUDComponent;
struct UWeaponInputDefault;
struct UWeaponSkinMiniGame_AimlabHudController;
struct UWeaponSkinMiniGame_AimlabSettlementHudController;
struct UWeaponSkinMiniGame_AimlabHudView;
struct UWeaponSkinMiniGame_AimlabHudView_Op;
struct UWeaponSkinMiniGame_AimlabHudView_End;
struct UWeaponSkinMiniGame_AimlabUIController;
struct UWeaponSkinMiniGame_AimlabSettlementUIController;
struct UWeaponSkinMiniGame_AimlabUIView;
struct UWeaponSkinMiniGame_AimlabUIView_Op;
struct UWeaponSkinMiniGame_AimlabUIView_End;

// Object: Enum DFMGameHud.EDFMWidgetEventType
enum class EDFMWidgetEventType : uint8_t
{
	None = 0,
	UISystemSetting_Close = 1,
	UISystemSetting_Logout = 2,
	UISystemSetting_QuitMatch = 3,
	UISystemSetting_QuitGame = 4,
	Common_LastMsgID = 5,
	EDFMWidgetEventType_MAX = 6
};

// Object: Enum DFMGameHud.EAmmoUpdateType
enum class EAmmoUpdateType : uint8_t
{
	FirstGun = 0,
	SecondGun = 1,
	AbilityItem = 2,
	PVE = 3,
	None = 4,
	EAmmoUpdateType_MAX = 5
};

// Object: Enum DFMGameHud.EWeaponTipsType
enum class EWeaponTipsType : uint8_t
{
	None = 0,
	AmmoTipEmpty = 1,
	StingerNoTarget = 2,
	AmmoTipLow = 3,
	EWeaponTipsType_MAX = 4
};

// Object: Enum DFMGameHud.EAmmoTipState
enum class EAmmoTipState : uint8_t
{
	None = 0,
	Low = 1,
	Empty = 2,
	EAmmoTipState_MAX = 3
};

// Object: Enum DFMGameHud.EAnimDebugType
enum class EAnimDebugType : uint8_t
{
	None = 0,
	Anim = 1,
	EAnimDebugType_MAX = 2
};

// Object: Enum DFMGameHud.EBattlefieldPlayerDeathType
enum class EBattlefieldPlayerDeathType : uint8_t
{
	NONE = 0,
	TeamMate = 1,
	SameCamp = 2,
	EBattlefieldPlayerDeathType_MAX = 3
};

// Object: Enum DFMGameHud.EWeaponIconType
enum class EWeaponIconType : uint8_t
{
	None = 0,
	Default = 1,
	Gun = 2,
	Melee = 3,
	Throw = 4,
	Vehicles = 5,
	FallingDown = 6,
	EWeaponIconType_MAX = 7
};

// Object: Enum DFMGameHud.EBroadcastNameColorType
enum class EBroadcastNameColorType : uint8_t
{
	None = 0,
	Self = 1,
	Team = 2,
	Enemy = 3,
	Game = 4,
	BattleField_Self = 5,
	BattleField_Team = 6,
	BattleField_Camp = 7,
	BattleField_Enemy = 8,
	ObserverModeTeamColor = 9,
	EBroadcastNameColorType_MAX = 10
};

// Object: Enum DFMGameHud.ECommonIconMapZOrder
enum class ECommonIconMapZOrder : uint8_t
{
	Detector = 0,
	Enemy = 1,
	EnemyBeKilled = 2,
	ECommonIconMapZOrder_MAX = 3
};

// Object: Enum DFMGameHud.ECommonIconMapMarkerType
enum class ECommonIconMapMarkerType : uint8_t
{
	None = 0,
	Enemy = 1,
	EnemyBeKilled = 2,
	Detector = 3,
	EnemySpotted = 4,
	ECommonIconMapMarkerType_MAX = 5
};

// Object: Enum DFMGameHud.EDFRouletteActivateType
enum class EDFRouletteActivateType : uint8_t
{
	EImmediately = 0,
	ELongPressed = 1,
	EPressedMove = 2,
	EPlaceHolder1 = 4,
	EPlaceHolder2 = 8,
	EDFRouletteActivateType_MAX = 9
};

// Object: Enum DFMGameHud.ETipsActionPriority
enum class ETipsActionPriority : uint8_t
{
	Default = 1,
	ReleaseRope = 2,
	AbilitySkill = 3,
	CarryBody = 4,
	BionicSpy = 5,
	ZoyaSwarms = 6,
	Firefighting = 7,
	NetRemove = 8,
	PullOutArrow = 9,
	DropCarryBody = 10,
	Assassinate = 11,
	ETipsActionPriority_MAX = 12
};

// Object: Enum DFMGameHud.EActionTipsAnimType
enum class EActionTipsAnimType : uint8_t
{
	OpenParachuteWarning = 0,
	EActionTipsAnimType_Count = 1,
	EActionTipsAnimType_MAX = 2
};

// Object: Enum DFMGameHud.EMainKeyType
enum class EMainKeyType : uint8_t
{
	Keyboard = 0,
	MouseButton = 1,
	MouseWheel = 2,
	MouseAxis = 3,
	Invalid = 10,
	EMainKeyType_MAX = 11
};

// Object: Enum DFMGameHud.ETestEmitterAudioType
enum class ETestEmitterAudioType : uint8_t
{
	DEFAULT = 0,
	FOOTSTEP_RUN = 1,
	FOOTSTEP_WALK = 2,
	FOOTSTEP_SPRINT = 3,
	WEAPON_AK = 4,
	WEAPON_AK_SUP = 5,
	ETestEmitterAudioType_MAX = 6
};

// Object: Enum DFMGameHud.ETestEmitterMoveMode
enum class ETestEmitterMoveMode : uint8_t
{
	Static = 0,
	Circular = 1,
	ETestEmitterMoveMode_MAX = 2
};

// Object: Enum DFMGameHud.ETestEmitterPlayMode
enum class ETestEmitterPlayMode : uint8_t
{
	Loop = 0,
	PlayOnce = 1,
	ETestEmitterPlayMode_MAX = 2
};

// Object: Enum DFMGameHud.EButtonViewState
enum class EButtonViewState : uint8_t
{
	ButtonViewState_None = 0,
	ButtonViewState_Normal = 1,
	ButtonViewState_Activated = 2,
	ButtonViewState_Forbidden = 3,
	ButtonViewState_Cooldown = 4,
	ButtonViewState_MAX = 5
};

// Object: Enum DFMGameHud.ECountDownColorType
enum class ECountDownColorType : uint8_t
{
	None = 0,
	White = 1,
	Red = 2,
	Green = 3,
	ECountDownColorType_MAX = 4
};

// Object: Enum DFMGameHud.ECrosshairFeedbackPlaceType
enum class ECrosshairFeedbackPlaceType : uint8_t
{
	ScreenCenter = 0,
	FrontSight = 1,
	ECrosshairFeedbackPlaceType_MAX = 2
};

// Object: Enum DFMGameHud.EFeedbackAnimType
enum class EFeedbackAnimType : uint8_t
{
	NONE = 0,
	HitHead = 1,
	HitBody = 2,
	KilledWithHead = 3,
	KilledWithBody = 4,
	HitVehicle = 5,
	KillVehicle = 6,
	HitADS = 7,
	HitSkillActor = 8,
	HitVehiclePart = 9,
	HitVehiclePartKill = 10,
	HitVehicleCritical = 11,
	KillVehicleCritical = 12,
	HitVehicleRicochet = 13,
	KillVehicleRicochet = 14,
	EFeedbackAnimType_MAX = 15
};

// Object: Enum DFMGameHud.ECrosshairFeedbackTypes
enum class ECrosshairFeedbackTypes : uint8_t
{
	CrosshairFeedback_Damage = 0,
	CrosshairFeedback_Kill = 1,
	CrosshairFeedback_Shock = 2,
	CrosshairFeedback_Vehicle = 3,
	CrosshairFeedback_Ability = 4,
	CrosshairFeedback_MAX = 5
};

// Object: Enum DFMGameHud.ECustomCrossHairStyle
enum class ECustomCrossHairStyle : uint8_t
{
	Static = 0,
	Dynamic = 1,
	ECustomCrossHairStyle_MAX = 2
};

// Object: Enum DFMGameHud.ECustomCrossHairColor
enum class ECustomCrossHairColor : uint8_t
{
	White = 0,
	Green = 1,
	Cyan = 2,
	Red = 3,
	Yellow = 4,
	ECustomCrossHairColor_MAX = 5
};

// Object: Enum DFMGameHud.ECustomCrossHairCategory
enum class ECustomCrossHairCategory : uint8_t
{
	Circle = 0,
	Point = 1,
	Line = 2,
	Cross = 3,
	Box = 4,
	Trident = 5,
	TShape = 6,
	ECustomCrossHairCategory_MAX = 7
};

// Object: Enum DFMGameHud.ECurveKind
enum class ECurveKind : uint8_t
{
	None = 0,
	Up = 1,
	Down = 2,
	ECurveKind_MAX = 3
};

// Object: Enum DFMGameHud.EFeedbackTipsAnimType
enum class EFeedbackTipsAnimType : uint8_t
{
	None = 0,
	KnockDown = 1,
	HitArmor = 2,
	HitArmorAndDamageHp = 3,
	HitArmorBroken = 4,
	HitHelmet = 5,
	HitHelmetAndDamageHp = 6,
	HitHelmetBroken = 7,
	HitSkillActor = 8,
	BreakShieldGlass = 9,
	CounterProjectile = 10,
	C304Invincible = 11,
	HitButterShieldBroken = 12,
	HitVehiclePart = 13,
	HitVehiclePartBroken = 14,
	EFeedbackTipsAnimType_MAX = 15
};

// Object: Enum DFMGameHud.EHudModuleType
enum class EHudModuleType : uint8_t
{
	None = 0,
	Redeploy = 1,
	EHudModuleType_MAX = 2
};

// Object: Enum DFMGameHud.EOscilloscopeSwipeDirection
enum class EOscilloscopeSwipeDirection : uint8_t
{
	None = 0,
	Clockwise = 1,
	CounterClockwise = 2,
	EOscilloscopeSwipeDirection_MAX = 3
};

// Object: Enum DFMGameHud.EProgressType
enum class EProgressType : uint8_t
{
	Cutting = 0,
	Repairing = 1,
	EProgressType_MAX = 2
};

// Object: Enum DFMGameHud.EWhiteDotAnimaStatus
enum class EWhiteDotAnimaStatus : uint8_t
{
	Small = 0,
	Small2Medium = 1,
	Medium = 2,
	Medium2Small = 3,
	Medium2Tiny = 4,
	Tiny = 5,
	Tiny2Medium = 6,
	LootFailed2Medium = 7,
	EWhiteDotAnimaStatus_MAX = 8
};

// Object: Enum DFMGameHud.EBowControlType
enum class EBowControlType : uint8_t
{
	Bow = 0,
	ThrowBlocking = 1,
	BlastShieldHeavyAttack = 2,
	ToggleSkillWeaponExtraFunc = 3,
	EBowControlType_MAX = 4
};

// Object: Enum DFMGameHud.EFireIconType
enum class EFireIconType : uint8_t
{
	Normal = 0,
	Throw = 1,
	MeleeNotEmptyHand = 2,
	EFireIconType_MAX = 3
};

// Object: Enum DFMGameHud.EHelmetImageType
enum class EHelmetImageType : uint8_t
{
	Surface = 0,
	Damage = 1,
	Border = 2,
	EHelmetImageType_MAX = 3
};

// Object: Enum DFMGameHud.EDFMScopeBtnType
enum class EDFMScopeBtnType : uint8_t
{
	EZoomRate = 0,
	EIconWithArrow = 1,
	EIconWithoutArrow = 2,
	EDFMScopeBtnType_MAX = 3
};

// Object: Enum DFMGameHud.ESkillControlType
enum class ESkillControlType : uint8_t
{
	Bow = 0,
	ThrowBlocking = 1,
	SkillWeaponHeavyAttack = 2,
	ToggleSkillWeaponExtraFunc = 3,
	ESkillControlType_MAX = 4
};

// Object: Enum DFMGameHud.EExpandableButtonType
enum class EExpandableButtonType : uint8_t
{
	None = 0,
	ThrowableWeapon = 1,
	MedicalItem = 2,
	EExpandableButtonType_MAX = 3
};

// Object: Enum DFMGameHud.ETypeState
enum class ETypeState : uint8_t
{
	None = 0,
	NotActive = 1,
	Active = 2,
	ETypeState_MAX = 3
};

// Object: Enum DFMGameHud.EAnimPlayConfig
enum class EAnimPlayConfig : uint8_t
{
	HighConfig = 0,
	LowConfig = 1,
	EAnimPlayConfig_MAX = 2
};

// Object: Enum DFMGameHud.ECurActiveWeaponType
enum class ECurActiveWeaponType : uint8_t
{
	EmptyHand = 0,
	Gun = 1,
	AbilityItem = 2,
	PVEWeapon = 3,
	MeleeWeapon = 4,
	ThrowableWeapon = 5,
	ECurActiveWeaponType_MAX = 6
};

// Object: Enum DFMGameHud.ECancelRescueMySelfType
enum class ECancelRescueMySelfType : uint8_t
{
	None = 0,
	Normal = 1,
	SpeedUp = 2,
	ECancelRescueMySelfType_MAX = 3
};

// Object: Enum DFMGameHud.EVoiceChannelType
enum class EVoiceChannelType : uint8_t
{
	None = 0,
	TeamOutOfGame = 1,
	TeamInGame = 2,
	CampInGame = 3,
	EVoiceChannelType_MAX = 4
};

// Object: Enum DFMGameHud.EMarkerState
enum class EMarkerState : uint8_t
{
	Init = 0,
	Translucent = 1,
	Opaque = 2,
	Flicker = 3,
	Sticky = 4,
	OverrideCanBeBackFlash = 5,
	OverrideHasBeenBackFlash = 6,
	EMarkerState_MAX = 7
};

// Object: Enum DFMGameHud.ESTipsCommonButtonAnimType
enum class ESTipsCommonButtonAnimType : uint8_t
{
	UT_None = 0,
	UT_InLoop = 1,
	UT_InOnce = 2,
	UT_MAX = 3
};

// Object: Enum DFMGameHud.EWeakNetWorkWaitFunctionID
enum class EWeakNetWorkWaitFunctionID : uint8_t
{
	None = 0,
	EPreload = 1,
	ERequestRedeploy = 2,
	ERequestWeaponStore = 3,
	ERequestVehicleModificationRules = 4,
	ERequestUnlockedVehicleAndPartIDs = 5,
	ERequestSwitchVehiclePart = 6,
	EWeakNetWorkWaitFunctionID_MAX = 7
};

// Object: Enum DFMGameHud.EPlayerMarkerType
enum class EPlayerMarkerType : uint8_t
{
	Permanent = 0,
	PermanentAndCovered = 1,
	Aimed = 2,
	AimedAndCovered = 3,
	ScoutMarkPermanent = 4,
	ScoutMarkPermanentAndCovered = 5,
	EPlayerMarkerType_MAX = 6
};

// Object: Enum DFMGameHud.EExitHudType
enum class EExitHudType : uint8_t
{
	NONE = 0,
	ESCAPING = 1,
	UNOPEN = 2,
	EExitHudType_MAX = 3
};

// Object: Enum DFMGameHud.EKillTipWidgetType
enum class EKillTipWidgetType : uint8_t
{
	ETipWidgetType_Kill = 0,
	ETipWidgetType_HeadShot = 1,
	ETipwidgetType_KillStreak = 2,
	EKillTipWidgetType_MAX = 3
};

// Object: Enum DFMGameHud.EKillTipsShowType
enum class EKillTipsShowType : uint8_t
{
	HeadShot = 0,
	MultiKill = 1,
	EKillTipsShowType_MAX = 2
};

// Object: Enum DFMGameHud.ERippleType
enum class ERippleType : uint8_t
{
	None = 0,
	TrackingLoc = 1,
	ERippleType_MAX = 2
};

// Object: Enum DFMGameHud.ESoundWaveSourceType
enum class ESoundWaveSourceType : uint8_t
{
	SilentWalk = 0,
	Run = 1,
	Sprint = 2,
	Gun = 3,
	GunWithSilencer = 4,
	ESoundWaveSourceType_MAX = 5
};

// Object: Enum DFMGameHud.EBodyPartType
enum class EBodyPartType : uint8_t
{
	Head = 0,
	Throax = 1,
	LeftArm = 2,
	RightArm = 3,
	LeftLeg = 4,
	RightLeg = 5,
	EBodyPartType_MAX = 6
};

// Object: Enum DFMGameHud.EMiniMapTipsType
enum class EMiniMapTipsType : uint8_t
{
	None = 0,
	Hide = 1,
	Sneaking = 2,
	Alert = 3,
	Fight = 4,
	EMiniMapTipsType_MAX = 5
};

// Object: Enum DFMGameHud.EImpendingDeathMarkerType
enum class EImpendingDeathMarkerType : uint8_t
{
	None = 0,
	SOL_ImpendingDeath = 1,
	SOL_FirstDeath = 2,
	SOL_Death = 3,
	BT_SameTeamImpendingDeath = 4,
	BT_SameCampImpendingDeath = 5,
	ButterRescuring = 6,
	EImpendingDeathMarkerType_MAX = 7
};

// Object: Enum DFMGameHud.EPlayerReviveButtonState
enum class EPlayerReviveButtonState : uint8_t
{
	None = 0,
	White = 1,
	Green = 2,
	Red = 3,
	Forbidden = 4,
	EPlayerReviveButtonState_MAX = 5
};

// Object: Enum DFMGameHud.ECancelRescueType
enum class ECancelRescueType : uint8_t
{
	None = 0,
	Normal = 1,
	SpeedUp = 2,
	ECancelRescueType_MAX = 3
};

// Object: Enum DFMGameHud.ECharacterSoundInfoType
enum class ECharacterSoundInfoType : uint8_t
{
	NoSound = 0,
	Sprint = 1,
	SilentWalk = 2,
	CrouchRun = 3,
	ProneRun = 4,
	StandRun = 5,
	Gun = 6,
	ECharacterSoundInfoType_MAX = 7
};

// Object: Enum DFMGameHud.EPropsRouletteType
enum class EPropsRouletteType : uint8_t
{
	ENone = 0,
	EFalloutDetector = 1,
	ENightVision = 2,
	EAcquireItemInspect = 3,
	EPropsRouletteType_MAX = 4
};

// Object: Enum DFMGameHud.ERaidLiveTabType
enum class ERaidLiveTabType : uint8_t
{
	None = 0,
	DataBoard = 1,
	Advantages = 2,
	ERaidLiveTabType_MAX = 3
};

// Object: Enum DFMGameHud.ERankSkillUIStyle
enum class ERankSkillUIStyle : uint8_t
{
	E_None = 0,
	E_Ready = 1,
	E_NoReady = 2,
	E_ReadySelected = 3,
	E_NoReadySelected = 4,
	E_MAX = 5
};

// Object: Enum DFMGameHud.ERouletteActionType
enum class ERouletteActionType : uint8_t
{
	RA_None = 0,
	RA_FlashLight = 1,
	RA_OperateLaser = 2,
	RA_OperateMask = 3,
	RA_OperateTool = 4,
	RA_PlayEmote = 5,
	RA_OperateBipod = 6,
	RA_WeaponInspect = 7,
	RA_MAX = 8
};

// Object: Enum DFMGameHud.EShopType
enum class EShopType : uint8_t
{
	EWeaponShop = 0,
	EAmmorShop = 1,
	EPropShop = 2,
	EShopType_MAX = 3
};

// Object: Enum DFMGameHud.ESOLSidePanelType
enum class ESOLSidePanelType : uint8_t
{
	None = 0,
	Quest = 1,
	Wish = 2,
	Contract = 3,
	SeasonQuest = 4,
	SeamlessMapNoContract = 5,
	ESOLSidePanelType_MAX = 6
};

// Object: Enum DFMGameHud.ESOLMapInfoSwitchType
enum class ESOLMapInfoSwitchType : uint8_t
{
	None = 0,
	Boss = 1,
	POI = 2,
	SupplyStation = 3,
	UnlockPoint = 4,
	ESOLMapInfoSwitchType_MAX = 5
};

// Object: Enum DFMGameHud.EEvacuateBtnType
enum class EEvacuateBtnType : uint8_t
{
	Exit = 0,
	Trigger = 1,
	EEvacuateBtnType_MAX = 2
};

// Object: Enum DFMGameHud.ESOLLiveTabType
enum class ESOLLiveTabType : uint8_t
{
	None = 0,
	Exit = 1,
	Quest = 2,
	Resource = 3,
	Key = 4,
	Wish = 5,
	ESOLLiveTabType_MAX = 6
};

// Object: Enum DFMGameHud.EQuestPlayerExitState
enum class EQuestPlayerExitState : uint8_t
{
	None = 0,
	Exist = 1,
	NoExist = 2,
	NoActive = 3,
	EQuestPlayerExitState_MAX = 4
};

// Object: Enum DFMGameHud.ESOLEvacuationEventHUDViewState
enum class ESOLEvacuationEventHUDViewState : uint8_t
{
	Inactive = 0,
	Start = 1,
	Waiting = 2,
	Ready = 3,
	Finish = 4,
	ESOLEvacuationEventHUDViewState_MAX = 5
};

// Object: Enum DFMGameHud.EProgressTipsState
enum class EProgressTipsState : uint8_t
{
	None = 0,
	Normal = 1,
	CannotCopy = 2,
	NotCopy = 3,
	Copied = 4,
	EProgressTipsState_MAX = 5
};

// Object: Enum DFMGameHud.ESOLKillFeedbackIconSubBehavior
enum class ESOLKillFeedbackIconSubBehavior : uint8_t
{
	None = 0,
	Idle_Entry = 1,
	Idle_Exit = 2,
	Show_Entry = 3,
	Show_Idle = 4,
	Show_Move = 5,
	Show_MoveKeep = 6,
	Show_Exit = 7,
	ESOLKillFeedbackIconSubBehavior_MAX = 8
};

// Object: Enum DFMGameHud.ESOLKillFeedbackIconBehavior
enum class ESOLKillFeedbackIconBehavior : uint8_t
{
	Idle = 0,
	Init = 1,
	Pop = 2,
	Wait = 3,
	FadeIn = 4,
	FadeInKeep = 5,
	Show = 6,
	FadeOut = 7,
	FadeOutKeep = 8,
	Exit = 9,
	ESOLKillFeedbackIconBehavior_MAX = 10
};

// Object: Enum DFMGameHud.ESOLKillFeedbackInfoBehavior
enum class ESOLKillFeedbackInfoBehavior : uint8_t
{
	Idle = 0,
	Init = 1,
	Wait = 2,
	FadeIn = 3,
	FadeInKeep = 4,
	Show = 5,
	FadeOut = 6,
	FadeOutKeep = 7,
	Exit = 8,
	ESOLKillFeedbackInfoBehavior_MAX = 9
};

// Object: Enum DFMGameHud.ESOLKillFeedbackSpecialInfoSubBehavior
enum class ESOLKillFeedbackSpecialInfoSubBehavior : uint8_t
{
	None = 0,
	Idle_Entry = 1,
	Idle_Exit = 2,
	Show_Entry = 3,
	Show_Idle = 4,
	Show_Move = 5,
	Show_MoveKeep = 6,
	Show_Exit = 7,
	Show_DirectlyExit = 8,
	ESOLKillFeedbackSpecialInfoSubBehavior_MAX = 9
};

// Object: Enum DFMGameHud.ESOLKillFeedbackSpecialInfoBehavior
enum class ESOLKillFeedbackSpecialInfoBehavior : uint8_t
{
	Idle = 0,
	Init = 1,
	Wait = 2,
	FadeIn = 3,
	FadeInKeep = 4,
	Show = 5,
	FadeOut = 6,
	FadeOutKeep = 7,
	Exit = 8,
	ESOLKillFeedbackSpecialInfoBehavior_MAX = 9
};

// Object: Enum DFMGameHud.ESOLTimelineTipHUDViewState
enum class ESOLTimelineTipHUDViewState : uint8_t
{
	Ready = 0,
	Inactive = 1,
	NoticeBegin = 2,
	NoticeEnd = 3,
	EventBegin = 4,
	EventEnd = 5,
	ESOLTimelineTipHUDViewState_MAX = 6
};

// Object: Enum DFMGameHud.FDebugCommandLineType
enum class EFDebugCommandLineType : uint8_t
{
	Toggle = 0,
	Attribute = 1,
	AttributeInput = 2,
	FDebugCommandLineType_MAX = 3
};

// Object: Enum DFMGameHud.EWeaponDebugType
enum class EWeaponDebugType : uint8_t
{
	None = 0,
	Base = 1,
	Recoil = 2,
	AssistedAiming = 3,
	Anim = 4,
	Effect = 5,
	Audio = 6,
	Setting = 7,
	Modular = 8,
	Spread = 9,
	DataModifier = 10,
	AttributeDisplay = 11,
	Damage = 12,
	AttributeDetailDisplay = 13,
	HotReflashDisplay = 14,
	PreViewTimeLine = 15,
	UI = 16,
	Spawn = 17,
	Mesh = 18,
	EWeaponDebugType_MAX = 19
};

// Object: ScriptStruct DFMGameHud.DFMWidgetEvent
// Size: 0x10 (Inherited: 0x0)
struct FDFMWidgetEvent
{
	struct UWidget* Widget; // 0x0(0x8)
	EDFMWidgetEventType EventType; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
};

// Object: ScriptStruct DFMGameHud.ScoreFeedbackEvent
// Size: 0x60 (Inherited: 0x0)
struct FScoreFeedbackEvent
{
	int32_t ScoreType; // 0x0(0x4)
	int32_t Score; // 0x4(0x4)
	struct FSoftObjectPath Sprite; // 0x8(0x18)
	struct FLinearColor SpriteColor; // 0x20(0x10)
	struct FText Desc; // 0x30(0x18)
	struct FString Audio; // 0x48(0x10)
	int32_t Distance; // 0x58(0x4)
	uint8_t bHighPriority : 1; // 0x5C(0x1), Mask(0x1)
	uint8_t BitPad_0x5C_1 : 7; // 0x5C(0x1)
	uint8_t bHeadKill : 1; // 0x5D(0x1), Mask(0x1)
	uint8_t BitPad_0x5D_1 : 7; // 0x5D(0x1)
	uint8_t Pad_0x5E[0x2]; // 0x5E(0x2)
};

// Object: ScriptStruct DFMGameHud.GameMarkerPool2
// Size: 0x10 (Inherited: 0x0)
struct FGameMarkerPool2
{
	struct TArray<struct UAbilityLockerItemBase*> Widgets; // 0x0(0x10)
};

// Object: ScriptStruct DFMGameHud.ActorTipsConfig
// Size: 0x20 (Inherited: 0x0)
struct FActorTipsConfig
{
	struct AActor* ActorClass; // 0x0(0x8)
	struct UUserWidget* TipsWdigetClass; // 0x8(0x8)
	float HeightOffset; // 0x10(0x4)
	uint8_t bFilterByDistance : 1; // 0x14(0x1), Mask(0x1)
	uint8_t BitPad_0x14_1 : 7; // 0x14(0x1)
	uint8_t Pad_0x15[0x3]; // 0x15(0x3)
	float FilterDistance; // 0x18(0x4)
	uint8_t bFilterByVisibility : 1; // 0x1C(0x1), Mask(0x1)
	uint8_t BitPad_0x1C_1 : 7; // 0x1C(0x1)
	uint8_t Pad_0x1D[0x3]; // 0x1D(0x3)
};

// Object: ScriptStruct DFMGameHud.AIMarkerWidgetConfig
// Size: 0x10 (Inherited: 0x0)
struct FAIMarkerWidgetConfig
{
	struct UPlayerMarkerAIMakerWidget* AIMarkerWidget; // 0x0(0x8)
	float TimeLeft; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct DFMGameHud.AIMsgWidgetInfo
// Size: 0x30 (Inherited: 0x0)
struct FAIMsgWidgetInfo
{
	struct ADFMCharacter* AICharacter; // 0x0(0x8)
	EAIMsgType AIMsgType; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
	struct UAIMsgWidgetBase* MsgWidget; // 0x10(0x8)
	struct UPlayerMarkerAIWarnWidget* MarkerWidget; // 0x18(0x8)
	uint8_t bHasCountDown : 1; // 0x20(0x1), Mask(0x1)
	uint8_t BitPad_0x20_1 : 7; // 0x20(0x1)
	uint8_t Pad_0x21[0x3]; // 0x21(0x3)
	float RemainTime; // 0x24(0x4)
	uint8_t bNeedRemove : 1; // 0x28(0x1), Mask(0x1)
	uint8_t BitPad_0x28_1 : 7; // 0x28(0x1)
	uint8_t bIsFight : 1; // 0x29(0x1), Mask(0x1)
	uint8_t BitPad_0x29_1 : 7; // 0x29(0x1)
	uint8_t bIsSniper : 1; // 0x2A(0x1), Mask(0x1)
	uint8_t BitPad_0x2A_1 : 7; // 0x2A(0x1)
	uint8_t Pad_0x2B[0x5]; // 0x2B(0x5)
};

// Object: ScriptStruct DFMGameHud.AIMsgWidgets
// Size: 0x50 (Inherited: 0x0)
struct FAIMsgWidgets
{
	struct TMap<EAIMsgType, struct FAIMsgWidgetInfo> AIMsgWidgetMap; // 0x0(0x50)
};

// Object: ScriptStruct DFMGameHud.AnimDebugLogInfoBase
// Size: 0x20 (Inherited: 0x0)
struct FAnimDebugLogInfoBase
{
	uint8_t Pad_0x0[0xC]; // 0x0(0xC)
	struct TWeakObjectPtr<struct UWorld> GameWorld; // 0xC(0x8)
	struct TWeakObjectPtr<struct UAnimDebugLogView> DebugView; // 0x14(0x8)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct DFMGameHud.AnimDebugLogInfo
// Size: 0x20 (Inherited: 0x20)
struct FAnimDebugLogInfo : FAnimDebugLogInfoBase
{
};

// Object: ScriptStruct DFMGameHud.AnimDebugLogInfoBaseNew
// Size: 0x18 (Inherited: 0x0)
struct FAnimDebugLogInfoBaseNew
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct TWeakObjectPtr<struct UWorld> GameWorld; // 0x8(0x8)
	struct TWeakObjectPtr<struct UAnimDebugLogViewNew> DebugView; // 0x10(0x8)
};

// Object: ScriptStruct DFMGameHud.AnimDebugLogInfoNew
// Size: 0x18 (Inherited: 0x18)
struct FAnimDebugLogInfoNew : FAnimDebugLogInfoBaseNew
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugLogInfoBase
// Size: 0x20 (Inherited: 0x0)
struct FWeaponDebugLogInfoBase
{
	uint8_t Pad_0x0[0xC]; // 0x0(0xC)
	struct TWeakObjectPtr<struct UWorld> GameWorld; // 0xC(0x8)
	struct TWeakObjectPtr<struct UWeaponDebugLogView> DebugView; // 0x14(0x8)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct DFMGameHud.AssistedAimingDebugViewInfo
// Size: 0x48 (Inherited: 0x20)
struct FAssistedAimingDebugViewInfo : FWeaponDebugLogInfoBase
{
	struct TWeakObjectPtr<struct UAssistedAimingDebugLogView> AssistedAimingDebugView; // 0x1C(0x8)
	float StickyParam; // 0x24(0x4)
	float Friction; // 0x28(0x4)
	float MoveSpeed; // 0x2C(0x4)
	float DistanceHorizontal; // 0x30(0x4)
	float ReduceScale; // 0x34(0x4)
	uint8_t bHitPreventMissEnable : 1; // 0x38(0x1), Mask(0x1)
	int32_t HitContinueMissNumber; // 0x3C(0x4)
	float HitPreventMissStartTime; // 0x40(0x4)
	float HitBulletRadius; // 0x44(0x4)
};

// Object: ScriptStruct DFMGameHud.BigMapQuestTipData
// Size: 0x28 (Inherited: 0x0)
struct FBigMapQuestTipData
{
	struct FString QuestName; // 0x0(0x10)
	struct FString QuestObjectDesc; // 0x10(0x10)
	EGoalType QuestObjType; // 0x20(0x1)
	uint8_t Pad_0x21[0x3]; // 0x21(0x3)
	int32_t RequiredCount; // 0x24(0x4)
};

// Object: ScriptStruct DFMGameHud.BroadcastHudNameColor
// Size: 0x38 (Inherited: 0x0)
struct FBroadcastHudNameColor
{
	struct FSlateColor NameColor; // 0x0(0x28)
	struct FLinearColor OutlineColor; // 0x28(0x10)
};

// Object: ScriptStruct DFMGameHud.CaptureTextInfo
// Size: 0x28 (Inherited: 0x0)
struct FCaptureTextInfo
{
	struct TArray<struct FText> Texts; // 0x0(0x10)
	struct FText CaptureText; // 0x10(0x18)
};

// Object: ScriptStruct DFMGameHud.ChainHookAimingHudTarget
// Size: 0x38 (Inherited: 0x0)
struct FChainHookAimingHudTarget
{
	struct TScriptInterface<IChainHookTakerInterface> Target; // 0x0(0x10)
	float DistanceToCamera; // 0x10(0x4)
	struct FVector2D ScreenLocation; // 0x14(0x8)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	struct TArray<struct FVector2D> EdgeScreenLocation; // 0x20(0x10)
	uint8_t bIsOverlapCenter : 1; // 0x30(0x1), Mask(0x1)
	uint8_t BitPad_0x30_1 : 7; // 0x30(0x1)
	uint8_t bIsNeedShow : 1; // 0x31(0x1), Mask(0x1)
	uint8_t BitPad_0x31_1 : 7; // 0x31(0x1)
	uint8_t bIsInAimRange : 1; // 0x32(0x1), Mask(0x1)
	uint8_t BitPad_0x32_1 : 7; // 0x32(0x1)
	uint8_t Pad_0x33[0x1]; // 0x33(0x1)
	float SortWeight; // 0x34(0x4)
};

// Object: ScriptStruct DFMGameHud.CharacterArmorBarItemView
// Size: 0x3C (Inherited: 0x0)
struct FCharacterArmorBarItemView
{
	struct FLinearColor IncreaseColor; // 0x0(0x10)
	struct FLinearColor DecreaseColor; // 0x10(0x10)
	float CurHealth; // 0x20(0x4)
	float MaxHealth; // 0x24(0x4)
	float CacheLastHealthPercent; // 0x28(0x4)
	float HealthChangeSpeed; // 0x2C(0x4)
	uint8_t bPlayHealthChange : 1; // 0x30(0x1), Mask(0x1)
	uint8_t BitPad_0x30_1 : 7; // 0x30(0x1)
	uint8_t Pad_0x31[0x3]; // 0x31(0x3)
	float PlayHealthChangeFlushThreshold; // 0x34(0x4)
	float BackCountdownTime; // 0x38(0x4)
};

// Object: ScriptStruct DFMGameHud.ArmorStatusDataView
// Size: 0x30 (Inherited: 0x0)
struct FArmorStatusDataView
{
	struct ADFMCharacter* CHARACTER; // 0x0(0x8)
	uint8_t bHelmet : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t bBodyArmor : 1; // 0x9(0x1), Mask(0x1)
	uint8_t BitPad_0x9_1 : 7; // 0x9(0x1)
	uint8_t Pad_0xA[0x2]; // 0xA(0x2)
	float HitAnimSpeed; // 0xC(0x4)
	struct FString OBItemIdStr; // 0x10(0x10)
	int32_t ArmorLevel; // 0x20(0x4)
	float Durability; // 0x24(0x4)
	float MaxDurability; // 0x28(0x4)
	float SrcMaxDurability; // 0x2C(0x4)
};

// Object: ScriptStruct DFMGameHud.CharacterAttrsDebugItemData
// Size: 0x28 (Inherited: 0x0)
struct FCharacterAttrsDebugItemData
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
	float BaseValue; // 0x10(0x4)
	float CurrentValue; // 0x14(0x4)
	struct TArray<struct FAttributeOperateData> Datas; // 0x18(0x10)
};

// Object: ScriptStruct DFMGameHud.CharacterAttrsDebugViewItemData
// Size: 0x28 (Inherited: 0x0)
struct FCharacterAttrsDebugViewItemData
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
	float BaseValue; // 0x10(0x4)
	float CurrentValue; // 0x14(0x4)
	struct TArray<struct FAttributeOperateData> Datas; // 0x18(0x10)
};

// Object: ScriptStruct DFMGameHud.BloodBarDataView
// Size: 0x20 (Inherited: 0x0)
struct FBloodBarDataView
{
	struct FName mKeyPercent; // 0x0(0x8)
	struct FName mKeyPercentDown; // 0x8(0x8)
	float CurHealth; // 0x10(0x4)
	float MaxHealth; // 0x14(0x4)
	uint8_t bAddHealth : 1; // 0x18(0x1), Mask(0x1)
	uint8_t BitPad_0x18_1 : 7; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
	float CurShieldHealth; // 0x1C(0x4)
};

// Object: ScriptStruct DFMGameHud.CharacterBuffListViewData
// Size: 0x80 (Inherited: 0x0)
struct FCharacterBuffListViewData
{
	struct FCharacterBuff BuffData; // 0x0(0x78)
	int32_t Num; // 0x78(0x4)
	uint8_t hasNewData : 1; // 0x7C(0x1), Mask(0x1)
	uint8_t BitPad_0x7C_1 : 7; // 0x7C(0x1)
	uint8_t Pad_0x7D[0x3]; // 0x7D(0x3)
};

// Object: ScriptStruct DFMGameHud.CommonBuffItemDataView
// Size: 0x20 (Inherited: 0x0)
struct FCommonBuffItemDataView
{
	uint32_t BuffId; // 0x0(0x4)
	float BuffStartTime; // 0x4(0x4)
	float BuffTotalTime; // 0x8(0x4)
	int32_t Num; // 0xC(0x4)
	uint8_t bNeedShowBloodDebuff : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t Pad_0x11[0x7]; // 0x11(0x7)
	struct ADFMCharacter* CHARACTER; // 0x18(0x8)
};

// Object: ScriptStruct DFMGameHud.CrosshairState
// Size: 0x30 (Inherited: 0x0)
struct FCrosshairState
{
	float SpreadRadius; // 0x0(0x4)
	float SpreadAlpha; // 0x4(0x4)
	float centerAlpha; // 0x8(0x4)
	float TranslationLerpValue; // 0xC(0x4)
	struct FVector2D translation; // 0x10(0x8)
	struct FLinearColor Color; // 0x18(0x10)
	struct FVector2D imageSize; // 0x28(0x8)
};

// Object: ScriptStruct DFMGameHud.BodyPartPopupInfo
// Size: 0x10 (Inherited: 0x0)
struct FBodyPartPopupInfo
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct DFMGameHud.DamageHudAnimData
// Size: 0x2B0 (Inherited: 0x0)
struct FDamageHudAnimData
{
	struct FRuntimeFloatCurve PositionCurveX; // 0x0(0xA0)
	struct FRuntimeFloatCurve PositionCurveY; // 0xA0(0xA0)
	struct FRuntimeFloatCurve AlphaCurve; // 0x140(0xA0)
	struct FRuntimeFloatCurve ScaleCurve; // 0x1E0(0xA0)
	struct FVector2D InitPosOffset; // 0x280(0x8)
	uint8_t Pad_0x288[0x8]; // 0x288(0x8)
	struct FVector4 RandomPosOffset; // 0x290(0x10)
	float Duration; // 0x2A0(0x4)
	uint8_t bPureRandomLeftRight : 1; // 0x2A4(0x1), Mask(0x1)
	uint8_t BitPad_0x2A4_1 : 7; // 0x2A4(0x1)
	uint8_t RandomWeight; // 0x2A5(0x1)
	uint8_t Pad_0x2A6[0xA]; // 0x2A6(0xA)
};

// Object: ScriptStruct DFMGameHud.MarkerPool
// Size: 0x10 (Inherited: 0x0)
struct FMarkerPool
{
	struct TArray<struct UDeployPointBaseWidget*> Widgets; // 0x0(0x10)
};

// Object: ScriptStruct DFMGameHud.BraveGameConveyDialogConfig
// Size: 0x38 (Inherited: 0x0)
struct FBraveGameConveyDialogConfig
{
	EBraveGameConveyDialogType DialogType; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct FText QuestionText; // 0x8(0x18)
	struct FText AnswerText; // 0x20(0x18)
};

// Object: ScriptStruct DFMGameHud.HDActionTips
// Size: 0x38 (Inherited: 0x0)
struct FHDActionTips
{
	struct FName ActionOrAxisName; // 0x0(0x8)
	float AxisScale; // 0x8(0x4)
	uint8_t bNeedHold : 1; // 0xC(0x1), Mask(0x1)
	uint8_t BitPad_0xC_1 : 7; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	float ActiveWorldTime; // 0x10(0x4)
	float ShowTime; // 0x14(0x4)
	struct FText OverrideFuncName; // 0x18(0x18)
	uint8_t StopCountDownWhenNotOnTop : 1; // 0x30(0x1), Mask(0x1)
	uint8_t BitPad_0x30_1 : 7; // 0x30(0x1)
	uint8_t Pad_0x31[0x3]; // 0x31(0x3)
	float ShowTimeCount; // 0x34(0x4)
};

// Object: ScriptStruct DFMGameHud.ScreenHitAnim
// Size: 0x24 (Inherited: 0x0)
struct FScreenHitAnim
{
	uint8_t Pad_0x0[0x24]; // 0x0(0x24)
};

// Object: ScriptStruct DFMGameHud.AudioTypeDebugArrayStruct
// Size: 0x10 (Inherited: 0x0)
struct FAudioTypeDebugArrayStruct
{
	struct TArray<struct FString> TypesArray; // 0x0(0x10)
};

// Object: ScriptStruct DFMGameHud.ViewCharacterInfo
// Size: 0x30 (Inherited: 0x0)
struct FViewCharacterInfo
{
	struct FBox2D Box; // 0x0(0x14)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct FString CharacterName; // 0x18(0x10)
	struct ACHARACTER* ViewCharacter; // 0x28(0x8)
};

// Object: ScriptStruct DFMGameHud.CrosshairWidgetContext
// Size: 0x28 (Inherited: 0x0)
struct FCrosshairWidgetContext
{
	struct UWidget* Widget; // 0x0(0x8)
	struct FWidgetTransform OriRenderTransform; // 0x8(0x1C)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
};

// Object: ScriptStruct DFMGameHud.DFMCrossHairFeedbackWidgetAnimationConfig
// Size: 0x60 (Inherited: 0x0)
struct FDFMCrossHairFeedbackWidgetAnimationConfig
{
	struct FString BindWidgetAnimName; // 0x0(0x10)
	struct FName BindWidgetName; // 0x10(0x8)
	uint8_t bUseColorConfig : 1; // 0x18(0x1), Mask(0x1)
	uint8_t BitPad_0x18_1 : 7; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
	struct FLinearColor ColorConfig; // 0x1C(0x10)
	uint8_t bReceiveWidgetAnimFinishCallback : 1; // 0x2C(0x1), Mask(0x1)
	uint8_t BitPad_0x2C_1 : 7; // 0x2C(0x1)
	uint8_t bHidePanelWhenFinishAnimation : 1; // 0x2D(0x1), Mask(0x1)
	uint8_t BitPad_0x2D_1 : 7; // 0x2D(0x1)
	uint8_t Pad_0x2E[0x2]; // 0x2E(0x2)
	float StartAtTime; // 0x30(0x4)
	int32_t NumLoopsToPlay; // 0x34(0x4)
	EUMGSequencePlayMode PlayMode; // 0x38(0x1)
	uint8_t Pad_0x39[0x3]; // 0x39(0x3)
	float PlaybackSpeed; // 0x3C(0x4)
	uint8_t bRestoreState : 1; // 0x40(0x1), Mask(0x1)
	uint8_t BitPad_0x40_1 : 7; // 0x40(0x1)
	uint8_t Pad_0x41[0x7]; // 0x41(0x7)
	struct UWidgetAnimation* BindWidgetAnim; // 0x48(0x8)
	uint8_t bReceiveWidgetAnimFromBlueprints : 1; // 0x50(0x1), Mask(0x1)
	uint8_t BitPad_0x50_1 : 7; // 0x50(0x1)
	uint8_t Pad_0x51[0x7]; // 0x51(0x7)
	struct UCanvasPanel* BindWidgetPtr; // 0x58(0x8)
};

// Object: ScriptStruct DFMGameHud.CrossHairAssetInfo
// Size: 0x18 (Inherited: 0x0)
struct FCrossHairAssetInfo
{
	struct UObject* AssetObject; // 0x0(0x8)
	struct UWidget* RootWidget; // 0x8(0x8)
	struct UCrosshairViewProxy* ViewProxy; // 0x10(0x8)
};

// Object: ScriptStruct DFMGameHud.ColorCrosshairRow
// Size: 0x20 (Inherited: 0x8)
struct FColorCrosshairRow : FTableRowBase
{
	struct FLinearColor ColorAndOpacity; // 0x8(0x10)
	struct FName RowDescription; // 0x18(0x8)
};

// Object: ScriptStruct DFMGameHud.DFMFeedbackWidgetAnimationConfig
// Size: 0x30 (Inherited: 0x0)
struct FDFMFeedbackWidgetAnimationConfig
{
	struct FString BindWidgetAnimName; // 0x0(0x10)
	struct FName BindWidgetName; // 0x10(0x8)
	struct UObject* TipsIcon; // 0x18(0x8)
	struct UWidgetAnimation* BindWidgetAnim; // 0x20(0x8)
	struct UWidget* BindWidgetPtr; // 0x28(0x8)
};

// Object: ScriptStruct DFMGameHud.HitPostProcessEffect
// Size: 0x38 (Inherited: 0x0)
struct FHitPostProcessEffect
{
	struct TSoftObjectPtr<UMaterialInstance> EffectMat; // 0x0(0x28)
	float PlayTime; // 0x28(0x4)
	struct FName TimeConName; // 0x2C(0x8)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
};

// Object: ScriptStruct DFMGameHud.HitSuppressByBulletEffect
// Size: 0x70 (Inherited: 0x0)
struct FHitSuppressByBulletEffect
{
	struct FHitPostProcessEffect EnterEffect; // 0x0(0x38)
	struct FHitPostProcessEffect LoopEffect; // 0x38(0x38)
};

// Object: ScriptStruct DFMGameHud.HitViewConf
// Size: 0x40 (Inherited: 0x0)
struct FHitViewConf
{
	struct FGameplayTagContainer HitTag; // 0x0(0x20)
	uint8_t ShouldTick : 1; // 0x20(0x1), Mask(0x1)
	uint8_t BitPad_0x20_1 : 7; // 0x20(0x1)
	uint8_t Pad_0x21[0x7]; // 0x21(0x7)
	struct FSoftClassPath HitViewPath; // 0x28(0x18)
};

// Object: ScriptStruct DFMGameHud.DFMHudMvcConfig
// Size: 0x18 (Inherited: 0x0)
struct FDFMHudMvcConfig
{
	struct UDFMHudMvcFieldBase* FieldClass; // 0x0(0x8)
	struct UDFMHudMvcLogicBase* LogicClass; // 0x8(0x8)
	float TimerTickInterval; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct DFMGameHud.ItemBaseViewInfo
// Size: 0x28 (Inherited: 0x0)
struct FItemBaseViewInfo
{
	struct FGameplayTagContainer Tags; // 0x0(0x20)
	struct UDFMInteractorView_ItemBase* ItemView; // 0x20(0x8)
};

// Object: ScriptStruct DFMGameHud.ItemBaseSoftClassInfo
// Size: 0x50 (Inherited: 0x0)
struct FItemBaseSoftClassInfo
{
	struct FGameplayTagContainer Tags; // 0x0(0x20)
	struct TSoftClassPtr<struct UDFMInteractorView_ItemBase*> ItemClass; // 0x20(0x28)
	uint8_t bPreCreate : 1; // 0x48(0x1), Mask(0x1)
	uint8_t BitPad_0x48_1 : 7; // 0x48(0x1)
	uint8_t Pad_0x49[0x7]; // 0x49(0x7)
};

// Object: ScriptStruct DFMGameHud.NameConfig
// Size: 0x18 (Inherited: 0x0)
struct FNameConfig
{
	struct TArray<struct FUnicodeCharCountItem> CharCountItems; // 0x0(0x10)
	int32_t DefaultLength; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct DFMGameHud.UnicodeCharCountItem
// Size: 0xC (Inherited: 0x0)
struct FUnicodeCharCountItem
{
	float charNum; // 0x0(0x4)
	int32_t minRune; // 0x4(0x4)
	int32_t maxRune; // 0x8(0x4)
};

// Object: ScriptStruct DFMGameHud.LayoutTargetSelector
// Size: 0x8 (Inherited: 0x0)
struct FLayoutTargetSelector
{
	struct FName Name; // 0x0(0x8)
};

// Object: ScriptStruct DFMGameHud.FireIconInfo
// Size: 0x10 (Inherited: 0x0)
struct FFireIconInfo
{
	EFireIconType IconType; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct UObject* IconObj; // 0x8(0x8)
};

// Object: ScriptStruct DFMGameHud.GMMobileInputData
// Size: 0x38 (Inherited: 0x0)
struct FGMMobileInputData
{
	ETouchIndex FingerIndex; // 0x0(0x1)
	EMobileInputPhase Phase; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	struct FVector2D BeginLocation; // 0x4(0x8)
	struct FVector2D Location; // 0xC(0x8)
	struct FVector2D LastLocation; // 0x14(0x8)
	struct FVector2D DeltaMove; // 0x1C(0x8)
	float BeginTime; // 0x24(0x4)
	float UpdateTime; // 0x28(0x4)
	float DeltaTime; // 0x2C(0x4)
	float ForceValue; // 0x30(0x4)
	uint32_t CurrentFrameCount; // 0x34(0x4)
};

// Object: ScriptStruct DFMGameHud.GMMobileInputDataNew
// Size: 0x38 (Inherited: 0x0)
struct FGMMobileInputDataNew
{
	ETouchIndex FingerIndex; // 0x0(0x1)
	EMobileInputPhase Phase; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	struct FVector2D BeginLocation; // 0x4(0x8)
	struct FVector2D Location; // 0xC(0x8)
	struct FVector2D LastLocation; // 0x14(0x8)
	struct FVector2D DeltaMove; // 0x1C(0x8)
	float BeginTime; // 0x24(0x4)
	float UpdateTime; // 0x28(0x4)
	float DeltaTime; // 0x2C(0x4)
	float ForceValue; // 0x30(0x4)
	uint32_t CurrentFrameCount; // 0x34(0x4)
};

// Object: ScriptStruct DFMGameHud.LoadedCache
// Size: 0x10 (Inherited: 0x0)
struct FLoadedCache
{
	struct TArray<struct UObject*> LoadedAssets; // 0x0(0x10)
};

// Object: ScriptStruct DFMGameHud.SonicInfoData
// Size: 0x58 (Inherited: 0x0)
struct FSonicInfoData
{
	struct USonicInfoWidget* Widget; // 0x0(0x8)
	struct FBuffDetectorUpdateData Data; // 0x8(0x50)
};

// Object: ScriptStruct DFMGameHud.JetSliderViewInfo
// Size: 0xC (Inherited: 0x0)
struct FJetSliderViewInfo
{
	float ThrottleSliderViewFixed; // 0x0(0x4)
	float ThrottleSliderViewMin; // 0x4(0x4)
	float ThrottleSliderViewMax; // 0x8(0x4)
};

// Object: ScriptStruct DFMGameHud.DFMVehicleSwitchWeaponButtonInitParamter
// Size: 0x20 (Inherited: 0x0)
struct FDFMVehicleSwitchWeaponButtonInitParamter
{
	struct AGPCharacter* OwnerCharacter; // 0x0(0x8)
	struct AWeaponBase* CurrentWeapon; // 0x8(0x8)
	uint8_t Pad_0x10[0x10]; // 0x10(0x10)
};

// Object: ScriptStruct DFMGameHud.WeaponBarProxyBase
// Size: 0x10 (Inherited: 0x0)
struct FWeaponBarProxyBase
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct UDFMWeaponBarBase* WeaponBar; // 0x8(0x8)
};

// Object: ScriptStruct DFMGameHud.WeaponBarProxy
// Size: 0x48 (Inherited: 0x10)
struct FWeaponBarProxy : FWeaponBarProxyBase
{
	struct TArray<EWeaponItemType> WhiteList; // 0x10(0x10)
	struct TArray<EWeaponItemType> Blacklist; // 0x20(0x10)
	struct TArray<EAttachPosition> AttachPositions; // 0x30(0x10)
	uint8_t bCanBindToPVEWeapon : 1; // 0x40(0x1), Mask(0x1)
	uint8_t BitPad_0x40_1 : 7; // 0x40(0x1)
	uint8_t bCanBindToSkillWeapon : 1; // 0x41(0x1), Mask(0x1)
	uint8_t BitPad_0x41_1 : 7; // 0x41(0x1)
	uint8_t Pad_0x42[0x6]; // 0x42(0x6)
};

// Object: ScriptStruct DFMGameHud.WeaponToolBarTypeHelper
// Size: 0x108 (Inherited: 0x0)
struct FWeaponToolBarTypeHelper
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
	struct UDFTextBlock* SlashSymbol; // 0x10(0x8)
	struct UTextBlock* CarriedAmmoCountText; // 0x18(0x8)
	struct UDFMImage* tmpSlotCompIconImage; // 0x20(0x8)
	struct UImage* Image_147; // 0x28(0x8)
	struct UHorizontalBox* HorizontalBox_1; // 0x30(0x8)
	struct UCanvasPanel* CanvasPanel_280; // 0x38(0x8)
	struct UCanvasPanel* CanvasPanel_203; // 0x40(0x8)
	struct UImage* WeaponSelectionIcon; // 0x48(0x8)
	struct UVerticalBox* DFVerticalBox_1; // 0x50(0x8)
	struct UImage* Image_115; // 0x58(0x8)
	struct UTextBlock* AmmoCountText; // 0x60(0x8)
	struct UDFHorizontalBox* DFHorizontalBox_108; // 0x68(0x8)
	int32_t WeaponBarID; // 0x70(0x4)
	struct FLinearColor LowAmmoColor; // 0x74(0x10)
	struct FLinearColor AmmoColor; // 0x84(0x10)
	struct FLinearColor LowCarriedAmmoColor; // 0x94(0x10)
	struct FLinearColor CarriedAmmoColor; // 0xA4(0x10)
	struct FLinearColor LowAmmoWeaponIconColor; // 0xB4(0x10)
	struct FLinearColor WeaponIconColor; // 0xC4(0x10)
	struct FLinearColor SelectedWeaponIconColor; // 0xD4(0x10)
	struct FLinearColor NotSelectedWeaponIconColor; // 0xE4(0x10)
	struct FLinearColor BgColor; // 0xF4(0x10)
	uint8_t Pad_0x104[0x4]; // 0x104(0x4)
};

// Object: ScriptStruct DFMGameHud.WeaponBarType
// Size: 0x9 (Inherited: 0x0)
struct FWeaponBarType
{
	ETypeState Selected; // 0x0(0x1)
	ETypeState IsNoGuns; // 0x1(0x1)
	ETypeState IsLowBullet; // 0x2(0x1)
	ETypeState IsNoBullet; // 0x3(0x1)
	ETypeState IsNoCarriedBullet; // 0x4(0x1)
	ETypeState IsAddBullet; // 0x5(0x1)
	ETypeState bShowAmmo; // 0x6(0x1)
	ETypeState IsMeleeActivated; // 0x7(0x1)
	ETypeState IsSpecialSkillWeapon; // 0x8(0x1)
};

// Object: ScriptStruct DFMGameHud.MarkerViewData
// Size: 0xE8 (Inherited: 0x0)
struct FMarkerViewData
{
	uint8_t Pad_0x0[0xE8]; // 0x0(0xE8)
};

// Object: ScriptStruct DFMGameHud.NearMedicOrTeammateInfoObject
// Size: 0x18 (Inherited: 0x0)
struct FNearMedicOrTeammateInfoObject
{
	uint64_t PlayerUin; // 0x0(0x8)
	struct AGPCharacter* GPCharacter; // 0x8(0x8)
	int32_t Distance; // 0x10(0x4)
	uint8_t Response : 1; // 0x14(0x1), Mask(0x1)
	uint8_t BitPad_0x14_1 : 7; // 0x14(0x1)
	uint8_t IsTeammate : 1; // 0x15(0x1), Mask(0x1)
	uint8_t BitPad_0x15_1 : 7; // 0x15(0x1)
	uint8_t Pad_0x16[0x2]; // 0x16(0x2)
};

// Object: ScriptStruct DFMGameHud.SkillTipsItemDataRow
// Size: 0x90 (Inherited: 0x10)
struct FSkillTipsItemDataRow : FDescRowBase
{
	struct FName TipName; // 0x10(0x8)
	struct FName HeroId; // 0x18(0x8)
	struct FText TipTextIn; // 0x20(0x18)
	struct FText TipTextLoop; // 0x38(0x18)
	struct FText TipTextOut; // 0x50(0x18)
	int32_t ColorState; // 0x68(0x4)
	uint8_t bNeedScan : 1; // 0x6C(0x1), Mask(0x1)
	uint8_t BitPad_0x6C_1 : 7; // 0x6C(0x1)
	uint8_t Pad_0x6D[0x3]; // 0x6D(0x3)
	float AnimLoopTimeScale; // 0x70(0x4)
	uint8_t Priority; // 0x74(0x1)
	uint8_t bCanBreakSamePriority : 1; // 0x75(0x1), Mask(0x1)
	uint8_t BitPad_0x75_1 : 7; // 0x75(0x1)
	uint8_t Pad_0x76[0x2]; // 0x76(0x2)
	struct TArray<struct FName> MutualTipArray; // 0x78(0x10)
	struct FName NextPlayTip; // 0x88(0x8)
};

// Object: ScriptStruct DFMGameHud.SkillTipsTempDataRow
// Size: 0x98 (Inherited: 0x0)
struct FSkillTipsTempDataRow
{
	struct FSkillTipsItemDataRow TipsData; // 0x0(0x90)
	uint8_t PlayState; // 0x90(0x1)
	uint8_t bIsPlaying : 1; // 0x91(0x1), Mask(0x1)
	uint8_t BitPad_0x91_1 : 7; // 0x91(0x1)
	uint8_t Pad_0x92[0x2]; // 0x92(0x2)
	float EnqueueTime; // 0x94(0x4)
};

// Object: ScriptStruct DFMGameHud.MarkerViewDataNew
// Size: 0xE8 (Inherited: 0x0)
struct FMarkerViewDataNew
{
	uint8_t Pad_0x0[0xE8]; // 0x0(0xE8)
};

// Object: ScriptStruct DFMGameHud.GameMassMarkerPool
// Size: 0x10 (Inherited: 0x0)
struct FGameMassMarkerPool
{
	struct TArray<struct UDFMassMarkerBaseWidget*> Widgets; // 0x0(0x10)
};

// Object: ScriptStruct DFMGameHud.VehicleWeaponColorInfo
// Size: 0x18 (Inherited: 0x0)
struct FVehicleWeaponColorInfo
{
	float MinValue; // 0x0(0x4)
	float MaxValue; // 0x4(0x4)
	struct FLinearColor Color; // 0x8(0x10)
};

// Object: ScriptStruct DFMGameHud.EnemyMarkerSettingDataTableRow
// Size: 0x28 (Inherited: 0x10)
struct FEnemyMarkerSettingDataTableRow : FDescRowBase
{
	struct FName AICharacterNamePool; // 0x10(0x8)
	EDFMGamePlayMode GameMode; // 0x18(0x1)
	EPlayerMarkerType PlayerMarkerType; // 0x19(0x1)
	uint8_t bShowPoint : 1; // 0x1A(0x1), Mask(0x1)
	uint8_t BitPad_0x1A_1 : 7; // 0x1A(0x1)
	uint8_t bShowName : 1; // 0x1B(0x1), Mask(0x1)
	uint8_t BitPad_0x1B_1 : 7; // 0x1B(0x1)
	uint8_t bShowDistance : 1; // 0x1C(0x1), Mask(0x1)
	uint8_t BitPad_0x1C_1 : 7; // 0x1C(0x1)
	uint8_t bShowWarning : 1; // 0x1D(0x1), Mask(0x1)
	uint8_t BitPad_0x1D_1 : 7; // 0x1D(0x1)
	uint8_t Pad_0x1E[0x2]; // 0x1E(0x2)
	int32_t IconType; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
};

// Object: ScriptStruct DFMGameHud.FppSoundInfo
// Size: 0x14 (Inherited: 0x0)
struct FFppSoundInfo
{
	int32_t SoundLevel; // 0x0(0x4)
	struct FLinearColor WaveColor; // 0x4(0x10)
};

// Object: ScriptStruct DFMGameHud.FppSoundLevelParams
// Size: 0xA0 (Inherited: 0x0)
struct FFppSoundLevelParams
{
	struct TMap<struct FName, float> MaterialParamMap; // 0x0(0x50)
	struct TMap<struct FName, struct FLinearColor> MaterialVectorParamMap; // 0x50(0x50)
};

// Object: ScriptStruct DFMGameHud.GameLoadingSubData
// Size: 0x80 (Inherited: 0x0)
struct FGameLoadingSubData
{
	struct FText ModeName; // 0x0(0x18)
	struct FText MapName; // 0x18(0x18)
	struct FText ModeRule; // 0x30(0x18)
	struct TArray<struct FLoadingImageData> Images; // 0x48(0x10)
	struct TArray<struct FLoadingTipsData> Tips; // 0x58(0x10)
	float TimeOfImage; // 0x68(0x4)
	float TimeOfTips; // 0x6C(0x4)
	int32_t CampType; // 0x70(0x4)
	int32_t MapID; // 0x74(0x4)
	uint8_t bShouldShowGuidInfo : 1; // 0x78(0x1), Mask(0x1)
	uint8_t BitPad_0x78_1 : 7; // 0x78(0x1)
	EGPLoadingDestination Destination; // 0x79(0x1)
	uint8_t Pad_0x7A[0x6]; // 0x7A(0x6)
};

// Object: ScriptStruct DFMGameHud.LoadingTipsData
// Size: 0x28 (Inherited: 0x0)
struct FLoadingTipsData
{
	int32_t TipID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FText LoadingTipsContent; // 0x8(0x18)
	float DisplayTime; // 0x20(0x4)
	float ProportionOfTips; // 0x24(0x4)
};

// Object: ScriptStruct DFMGameHud.LoadingImageData
// Size: 0x48 (Inherited: 0x0)
struct FLoadingImageData
{
	int32_t ImageID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FSoftObjectPath ImagePath; // 0x8(0x18)
	struct FText ModeRule; // 0x20(0x18)
	float ProportionOfImage; // 0x38(0x4)
	struct FName MovieRowName; // 0x3C(0x8)
	uint8_t Pad_0x44[0x4]; // 0x44(0x4)
};

// Object: ScriptStruct DFMGameHud.MarkerUIInfo
// Size: 0x40 (Inherited: 0x0)
struct FMarkerUIInfo
{
	struct FText NameText; // 0x0(0x18)
	struct UPaperSprite* IconSprite; // 0x18(0x8)
	struct FText BrokenNameText; // 0x20(0x18)
	struct UPaperSprite* BrokenIconSprite; // 0x38(0x8)
};

// Object: ScriptStruct DFMGameHud.GameMarkerPool
// Size: 0x10 (Inherited: 0x0)
struct FGameMarkerPool
{
	struct TArray<struct UGameMarkerBaseWidget*> Widgets; // 0x0(0x10)
};

// Object: ScriptStruct DFMGameHud.GameMarkerWidgetInfo
// Size: 0x30 (Inherited: 0x0)
struct FGameMarkerWidgetInfo
{
	EDFMGamePlayMode GamePlayMode; // 0x0(0x1)
	EDFMGamePlaySubMode GamePlaySubMode; // 0x1(0x1)
	uint8_t Pad_0x2[0x6]; // 0x2(0x6)
	struct TSoftClassPtr<struct UGameMarkerBaseWidget*> GameMarkerBaseWidget; // 0x8(0x28)
};

// Object: ScriptStruct DFMGameHud.GameMarkerWidgetConfig
// Size: 0x370 (Inherited: 0x0)
struct FGameMarkerWidgetConfig
{
	struct TMap<EFriendlyCharacterMarkerType, struct FGameMarkerWidgetInfo> FriendlyCharacterMarkerWidgetsMap; // 0x0(0x50)
	struct TMap<EEnemyCharacterMarkerType, struct FGameMarkerWidgetInfo> EnemyCharacterMarkerWidgetsMap; // 0x50(0x50)
	struct TMap<ESceneWeaponMarkerType, struct FGameMarkerWidgetInfo> SceneWeaponMarkerWidgetsMap; // 0xA0(0x50)
	struct TMap<EVehicleMarkerType, struct FGameMarkerWidgetInfo> VehicleMarkerWidgetsMap; // 0xF0(0x50)
	struct TMap<ETacticalEquipmentMarkerType, struct FGameMarkerWidgetInfo> TacticalEquipmentMarkerWidgetsMap; // 0x140(0x50)
	struct TMap<EBattleFieldGameModeMarkerType, struct FGameMarkerWidgetInfo> BattleFieldGameModeMarkerWidgetsMap; // 0x190(0x50)
	struct TMap<ESOLGameModeMarkerType, struct FGameMarkerWidgetInfo> SOLGameModeMarkerWidgetsMap; // 0x1E0(0x50)
	struct TMap<EQuestMarkerMarkerType, struct FGameMarkerWidgetInfo> ContractMarkerWidgetsMap; // 0x230(0x50)
	struct TMap<EMapMarkerType, struct FGameMarkerWidgetInfo> MapMarkerWidgetsMap; // 0x280(0x50)
	struct TMap<EMarkingMarkerType, struct FGameMarkerWidgetInfo> MarkingMarkerWidgetsMap; // 0x2D0(0x50)
	struct TMap<EInteractorMarkerType, struct FGameMarkerWidgetInfo> InterActorMarkerWidgetsMap; // 0x320(0x50)
};

// Object: ScriptStruct DFMGameHud.TowerWeaponStateIcon
// Size: 0x28 (Inherited: 0x0)
struct FTowerWeaponStateIcon
{
	struct FSoftObjectPath IconPath; // 0x0(0x18)
	struct FLinearColor IconColor; // 0x18(0x10)
};

// Object: ScriptStruct DFMGameHud.GiantTowerSeatViewInfo
// Size: 0x18 (Inherited: 0x0)
struct FGiantTowerSeatViewInfo
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct UGiantTowerSeatButton* SeatButton; // 0x8(0x8)
	struct UUserWidget* SeatIcon; // 0x10(0x8)
};

// Object: ScriptStruct DFMGameHud.HookAimingHudTarget
// Size: 0x38 (Inherited: 0x0)
struct FHookAimingHudTarget
{
	struct TScriptInterface<IChainHookTakerInterface> Target; // 0x0(0x10)
	float DistanceToCamera; // 0x10(0x4)
	struct FVector2D ScreenLocation; // 0x14(0x8)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	struct TArray<struct FVector2D> EdgeScreenLocation; // 0x20(0x10)
	uint8_t bIsOverlapCenter : 1; // 0x30(0x1), Mask(0x1)
	uint8_t BitPad_0x30_1 : 7; // 0x30(0x1)
	uint8_t bIsNeedShow : 1; // 0x31(0x1), Mask(0x1)
	uint8_t BitPad_0x31_1 : 7; // 0x31(0x1)
	uint8_t bIsInAimRange : 1; // 0x32(0x1), Mask(0x1)
	uint8_t BitPad_0x32_1 : 7; // 0x32(0x1)
	uint8_t Pad_0x33[0x1]; // 0x33(0x1)
	float SortWeight; // 0x34(0x4)
};

// Object: ScriptStruct DFMGameHud.InstancedIconDataMgr
// Size: 0xD0 (Inherited: 0x0)
struct FInstancedIconDataMgr
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct TMap<struct FName, uint8_t> IconActiveOrNotMap; // 0x8(0x50)
	struct TArray<struct FMapInstancedIconData> InstancedIconDataArr; // 0x58(0x10)
	struct TMap<struct FName, int32_t> InstancedIconDataMap; // 0x68(0x50)
	struct TArray<int32_t> DormantInstancedIconIndexArr; // 0xB8(0x10)
	uint8_t Pad_0xC8[0x8]; // 0xC8(0x8)
};

// Object: ScriptStruct DFMGameHud.SafeBoxTextInfo
// Size: 0x18 (Inherited: 0x0)
struct FSafeBoxTextInfo
{
	struct TArray<struct FText> Texts; // 0x0(0x10)
	int32_t CaptureIndex; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct DFMGameHud.KillTipWidgetInfo
// Size: 0x1C8 (Inherited: 0x0)
struct FKillTipWidgetInfo
{
	EKillTipWidgetType TipWidgetType; // 0x0(0x1)
	uint8_t Pad_0x1[0x1C7]; // 0x1(0x1C7)
};

// Object: ScriptStruct DFMGameHud.KillTipsItemPosInfo
// Size: 0x14 (Inherited: 0x0)
struct FKillTipsItemPosInfo
{
	struct FVector2D pos; // 0x0(0x8)
	struct FVector2D Scale; // 0x8(0x8)
	float Opactiy; // 0x10(0x4)
};

// Object: ScriptStruct DFMGameHud.KillTipsViewData
// Size: 0x1 (Inherited: 0x0)
struct FKillTipsViewData
{
	uint8_t Pad_0x0[0x1]; // 0x0(0x1)
};

// Object: ScriptStruct DFMGameHud.MapKeyTypeSettings
// Size: 0x10 (Inherited: 0x0)
struct FMapKeyTypeSettings
{
	struct TArray<struct FMapKeyInfo> KeyInfos; // 0x0(0x10)
};

// Object: ScriptStruct DFMGameHud.MapKeyInfo
// Size: 0x40 (Inherited: 0x0)
struct FMapKeyInfo
{
	uint8_t bInitByDisplayInputActionName : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bInitByActionOrName : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	struct FName ActionOrAxisName; // 0x4(0x8)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TArray<struct FName> KeyNames; // 0x10(0x10)
	struct FText KeyText; // 0x20(0x18)
	uint8_t bIsMarkKey : 1; // 0x38(0x1), Mask(0x1)
	uint8_t BitPad_0x38_1 : 7; // 0x38(0x1)
	uint8_t Pad_0x39[0x7]; // 0x39(0x7)
};

// Object: ScriptStruct DFMGameHud.BigMapClickParameter
// Size: 0x10 (Inherited: 0x0)
struct FBigMapClickParameter
{
	struct FVector2D TargetWorldPosition; // 0x0(0x8)
	struct FVector2D LocationOnCanvas; // 0x8(0x8)
};

// Object: ScriptStruct DFMGameHud.GlitchEffectParameters
// Size: 0x18 (Inherited: 0x0)
struct FGlitchEffectParameters
{
	float ColorClipOffset; // 0x0(0x4)
	float StepLevelClip; // 0x4(0x4)
	float BlockWeight; // 0x8(0x4)
	float MaxPixelSize; // 0xC(0x4)
	float RateParam; // 0x10(0x4)
	float BigMapIconGlitchAlpha; // 0x14(0x4)
};

// Object: ScriptStruct DFMGameHud.MapActorData
// Size: 0x10 (Inherited: 0x0)
struct FMapActorData
{
	struct AActor* WorldActor; // 0x0(0x8)
	uint8_t bWelt : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
};

// Object: ScriptStruct DFMGameHud.SoundWaveInfo
// Size: 0x18 (Inherited: 0x0)
struct FSoundWaveInfo
{
	float BaseValue; // 0x0(0x4)
	float WaveVariance; // 0x4(0x4)
	struct FLinearColor WaveColor; // 0x8(0x10)
};

// Object: ScriptStruct DFMGameHud.MinimanBodyPart
// Size: 0x38 (Inherited: 0x0)
struct FMinimanBodyPart
{
	struct FLinearColor CurrentColor; // 0x0(0x10)
	float FakeHealth; // 0x10(0x4)
	float RealHealth; // 0x14(0x4)
	ECharacterPart PartType; // 0x18(0x1)
	uint8_t Pad_0x19[0x7]; // 0x19(0x7)
	struct TArray<struct FString> SlotNames; // 0x20(0x10)
	float RemainingGlintTime; // 0x30(0x4)
	uint8_t bIsGlint : 1; // 0x34(0x1), Mask(0x1)
	uint8_t BitPad_0x34_1 : 7; // 0x34(0x1)
	uint8_t Pad_0x35[0x3]; // 0x35(0x3)
};

// Object: ScriptStruct DFMGameHud.ObstaclesRow
// Size: 0x20 (Inherited: 0x10)
struct FObstaclesRow : FDescRowBase
{
	struct TArray<struct FObstacleInfo> Obstacles; // 0x10(0x10)
};

// Object: ScriptStruct DFMGameHud.ObstacleInfo
// Size: 0x10 (Inherited: 0x0)
struct FObstacleInfo
{
	struct FVector2D size; // 0x0(0x8)
	float VerticalOffset; // 0x8(0x4)
	float HorizontalOffset; // 0xC(0x4)
};

// Object: ScriptStruct DFMGameHud.BuffInfo4UI
// Size: 0x18 (Inherited: 0x0)
struct FBuffInfo4UI
{
	uint8_t Pad_0x0[0x18]; // 0x0(0x18)
};

// Object: ScriptStruct DFMGameHud.NearMedicOrTeammateInfo
// Size: 0x18 (Inherited: 0x0)
struct FNearMedicOrTeammateInfo
{
	uint64_t PlayerUin; // 0x0(0x8)
	struct AGPCharacter* GPCharacter; // 0x8(0x8)
	int32_t Distance; // 0x10(0x4)
	uint8_t bResponse : 1; // 0x14(0x1), Mask(0x1)
	uint8_t BitPad_0x14_1 : 7; // 0x14(0x1)
	uint8_t IsTeammate : 1; // 0x15(0x1), Mask(0x1)
	uint8_t BitPad_0x15_1 : 7; // 0x15(0x1)
	uint8_t Pad_0x16[0x2]; // 0x16(0x2)
};

// Object: ScriptStruct DFMGameHud.CharacterSoundInfo
// Size: 0x14 (Inherited: 0x0)
struct FCharacterSoundInfo
{
	int32_t SoundLevel; // 0x0(0x4)
	struct FLinearColor WaveColor; // 0x4(0x10)
};

// Object: ScriptStruct DFMGameHud.CharacterSoundLevelParams
// Size: 0xA0 (Inherited: 0x0)
struct FCharacterSoundLevelParams
{
	struct TMap<struct FName, float> MaterialParamMap; // 0x0(0x50)
	struct TMap<struct FName, struct FLinearColor> MaterialVectorParamMap; // 0x50(0x50)
};

// Object: ScriptStruct DFMGameHud.PropsRouletteItemViewData
// Size: 0x50 (Inherited: 0x0)
struct FPropsRouletteItemViewData
{
	uint8_t Pad_0x0[0x38]; // 0x0(0x38)
	struct FSoftObjectPath IconPath; // 0x38(0x18)
};

// Object: ScriptStruct DFMGameHud.RaidSidePanelBtnDataS2
// Size: 0x20 (Inherited: 0x0)
struct FRaidSidePanelBtnDataS2
{
	struct FText Content; // 0x0(0x18)
	uint8_t IsVictory : 1; // 0x18(0x1), Mask(0x1)
	uint8_t BitPad_0x18_1 : 7; // 0x18(0x1)
	uint8_t Pad_0x19[0x7]; // 0x19(0x7)
};

// Object: ScriptStruct DFMGameHud.RaidSidePanelBtnDataS1
// Size: 0x50 (Inherited: 0x0)
struct FRaidSidePanelBtnDataS1
{
	struct FText Title; // 0x0(0x18)
	struct FText Content; // 0x18(0x18)
	uint8_t IsDown : 1; // 0x30(0x1), Mask(0x1)
	uint8_t BitPad_0x30_1 : 7; // 0x30(0x1)
	uint8_t Pad_0x31[0x7]; // 0x31(0x7)
	struct FSoftObjectPath OverwriteRefImgPath; // 0x38(0x18)
};

// Object: ScriptStruct DFMGameHud.AmmoItemWidgets
// Size: 0x20 (Inherited: 0x0)
struct FAmmoItemWidgets
{
	struct UUserWidget* ReloadRouletteItemTextWidget; // 0x0(0x8)
	struct UReloadRouletteItemView* ReloadRouletteItemView; // 0x8(0x8)
	struct UTextBlock* AmmoNumTextWidget; // 0x10(0x8)
	struct UDFMImage* AmmoImageWidget; // 0x18(0x8)
};

// Object: ScriptStruct DFMGameHud.AmmoRouletteItemViewData
// Size: 0x40 (Inherited: 0x0)
struct FAmmoRouletteItemViewData
{
	uint8_t Pad_0x0[0x28]; // 0x0(0x28)
	struct FSoftObjectPath IconPath; // 0x28(0x18)
};

// Object: ScriptStruct DFMGameHud.RouletteDataInfo
// Size: 0x30 (Inherited: 0x10)
struct FRouletteDataInfo : FDescRowBase
{
	struct FName ActionName; // 0x10(0x8)
	ERouletteActionType ActionType; // 0x18(0x1)
	uint8_t bTacticalAction : 1; // 0x19(0x1), Mask(0x1)
	uint8_t BitPad_0x19_1 : 7; // 0x19(0x1)
	uint8_t Pad_0x1A[0x2]; // 0x1A(0x2)
	struct FName AnimOn; // 0x1C(0x8)
	struct FName AnimOff; // 0x24(0x8)
	EGPWeaponInnerEvent WeaponOnEvent; // 0x2C(0x1)
	EGPWeaponInnerEvent WeaponOffEvent; // 0x2D(0x1)
	EWeaponBoolPropertyType WeaponStorePropertyType; // 0x2E(0x1)
	EWeaponAddFunction WeaponAddFunction; // 0x2F(0x1)
};

// Object: ScriptStruct DFMGameHud.RouletteLayoutInfo
// Size: 0x1 (Inherited: 0x0)
struct FRouletteLayoutInfo
{
	uint8_t Pad_0x0[0x1]; // 0x0(0x1)
};

// Object: ScriptStruct DFMGameHud.SeamlessEntryHUDView_InstructionListConfig
// Size: 0x10 (Inherited: 0x0)
struct FSeamlessEntryHUDView_InstructionListConfig
{
	struct TArray<struct FSeamlessEntryHUDView_InstructionConfig> InstructionList; // 0x0(0x10)
};

// Object: ScriptStruct DFMGameHud.SeamlessEntryHUDView_InstructionConfig
// Size: 0x30 (Inherited: 0x0)
struct FSeamlessEntryHUDView_InstructionConfig
{
	struct FText Title; // 0x0(0x18)
	struct UTexture2D* Image; // 0x18(0x8)
	struct TArray<struct FText> Descriptions; // 0x20(0x10)
};

// Object: ScriptStruct DFMGameHud.SeamlessEntryHUDView_InstructionDescConfig
// Size: 0x20 (Inherited: 0x0)
struct FSeamlessEntryHUDView_InstructionDescConfig
{
	ESOLUIIconType UIIcon; // 0x0(0x1)
	ESOLUIColorType UIColor; // 0x1(0x1)
	uint8_t Pad_0x2[0x6]; // 0x2(0x6)
	struct FText Description; // 0x8(0x18)
};

// Object: ScriptStruct DFMGameHud.SkillProcessBarData
// Size: 0x18 (Inherited: 0x0)
struct FSkillProcessBarData
{
	uint8_t Show : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float Time; // 0x4(0x4)
	struct FName Name; // 0x8(0x8)
	int32_t SkillId; // 0x10(0x4)
	int32_t Type; // 0x14(0x4)
};

// Object: ScriptStruct DFMGameHud.SOLCaptureTextInfo
// Size: 0x30 (Inherited: 0x0)
struct FSOLCaptureTextInfo
{
	struct TArray<struct FText> Texts; // 0x0(0x10)
	struct FText CaptureText; // 0x10(0x18)
	int32_t CaptureIndex; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct DFMGameHud.ContractRouteUIData
// Size: 0x8 (Inherited: 0x0)
struct FContractRouteUIData
{
	int32_t ContractID; // 0x0(0x4)
	int32_t RouteUIType; // 0x4(0x4)
};

// Object: ScriptStruct DFMGameHud.ContractCustomPartUIData
// Size: 0x38 (Inherited: 0x0)
struct FContractCustomPartUIData
{
	int32_t ContractID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FText NoticeText; // 0x8(0x18)
	uint8_t bIsUnKnown : 1; // 0x20(0x1), Mask(0x1)
	uint8_t BitPad_0x20_1 : 7; // 0x20(0x1)
	uint8_t Pad_0x21[0x7]; // 0x21(0x7)
	struct USOLContractAccessHUD_CustomPart* CustomPartUIClass; // 0x28(0x8)
	uint8_t Pad_0x30[0x8]; // 0x30(0x8)
};

// Object: ScriptStruct DFMGameHud.EstimatedTimeItemData
// Size: 0x28 (Inherited: 0x0)
struct FEstimatedTimeItemData
{
	struct FVector DeviceLoc; // 0x0(0xC)
	int32_t TotalDuration; // 0xC(0x4)
	struct USOLEstimatedTimeItem* ItemWidget; // 0x10(0x8)
	struct FVector2D StartPos; // 0x18(0x8)
	float ShowTime; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
};

// Object: ScriptStruct DFMGameHud.SOLHealthMainLineInfo
// Size: 0x14 (Inherited: 0x0)
struct FSOLHealthMainLineInfo
{
	struct FVector2D StartPoint; // 0x0(0x8)
	struct FVector2D EndPoint; // 0x8(0x8)
	uint8_t State; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
};

// Object: ScriptStruct DFMGameHud.SOLKillFeedbackEvent
// Size: 0xB8 (Inherited: 0x0)
struct FSOLKillFeedbackEvent
{
	uint8_t Pad_0x0[0xB8]; // 0x0(0xB8)
};

// Object: ScriptStruct DFMGameHud.SOLKillFeedbackPosSetting_Mobile
// Size: 0xC (Inherited: 0x0)
struct FSOLKillFeedbackPosSetting_Mobile
{
	float IconYOffset; // 0x0(0x4)
	float InfoYOffset; // 0x4(0x4)
	float SpecialInfoYOffset; // 0x8(0x4)
};

// Object: ScriptStruct DFMGameHud.SOLKillFeedbackPosSetting_PC
// Size: 0x14 (Inherited: 0x0)
struct FSOLKillFeedbackPosSetting_PC
{
	float IconYOffset; // 0x0(0x4)
	float InfoYOffset; // 0x4(0x4)
	float SpecialInfoYOffset; // 0x8(0x4)
	float ScaleToMobile; // 0xC(0x4)
	float FontScaleToMobile; // 0x10(0x4)
};

// Object: ScriptStruct DFMGameHud.ThreatDetectionNewTargetInfo
// Size: 0xC (Inherited: 0x0)
struct FThreatDetectionNewTargetInfo
{
	uint8_t bIsUse : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bIsValid : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	float RemoveTime; // 0x4(0x4)
	uint32_t TargetGUID; // 0x8(0x4)
};

// Object: ScriptStruct DFMGameHud.ThreatDetectionNewHudInfo
// Size: 0x10 (Inherited: 0x0)
struct FThreatDetectionNewHudInfo
{
	float Time; // 0x0(0x4)
	struct FVector Location; // 0x4(0xC)
};

// Object: ScriptStruct DFMGameHud.ThreatDetectionTargetInfo
// Size: 0xC (Inherited: 0x0)
struct FThreatDetectionTargetInfo
{
	uint8_t bIsUse : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bIsValid : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	float RemoveTime; // 0x4(0x4)
	uint32_t TargetGUID; // 0x8(0x4)
};

// Object: ScriptStruct DFMGameHud.ThreatDetectionHudInfo
// Size: 0x10 (Inherited: 0x0)
struct FThreatDetectionHudInfo
{
	float Time; // 0x0(0x4)
	struct FVector Location; // 0x4(0xC)
};

// Object: ScriptStruct DFMGameHud.SoundVisualizationItem
// Size: 0x10 (Inherited: 0x0)
struct FSoundVisualizationItem
{
	ESoundVisualizationType SoundType; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct UTopDirectionSoundWidget* SoundWidget; // 0x8(0x8)
};

// Object: ScriptStruct DFMGameHud.DirectionItem
// Size: 0x28 (Inherited: 0x0)
struct FDirectionItem
{
	int32_t LowerLimit; // 0x0(0x4)
	int32_t UpperLimit; // 0x4(0x4)
	struct FText DirectionText; // 0x8(0x18)
	uint8_t bEdgeCase : 1; // 0x20(0x1), Mask(0x1)
	uint8_t BitPad_0x20_1 : 7; // 0x20(0x1)
	uint8_t Pad_0x21[0x7]; // 0x21(0x7)
};

// Object: ScriptStruct DFMGameHud.HudSoundVisualizationItem
// Size: 0x10 (Inherited: 0x0)
struct FHudSoundVisualizationItem
{
	ESoundVisualizationType SoundType; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct UTopDirectionSoundItemHudView* SoundWidget; // 0x8(0x8)
};

// Object: ScriptStruct DFMGameHud.HudDirectionItem
// Size: 0x28 (Inherited: 0x0)
struct FHudDirectionItem
{
	int32_t LowerLimit; // 0x0(0x4)
	int32_t UpperLimit; // 0x4(0x4)
	struct FText DirectionText; // 0x8(0x18)
	uint8_t bEdgeCase : 1; // 0x20(0x1), Mask(0x1)
	uint8_t BitPad_0x20_1 : 7; // 0x20(0x1)
	uint8_t Pad_0x21[0x7]; // 0x21(0x7)
};

// Object: ScriptStruct DFMGameHud.HudSoundWidgetAnimParams
// Size: 0xC0 (Inherited: 0x0)
struct FHudSoundWidgetAnimParams
{
	struct TMap<struct FName, float> MaterialParamMap; // 0x0(0x50)
	struct TMap<struct FName, struct FLinearColor> MaterialVectorParamMap; // 0x50(0x50)
	struct FVector2D SoundImageScale; // 0xA0(0x8)
	struct FVector2D IconImageScale; // 0xA8(0x8)
	struct FVector2D UpArrowTranslation; // 0xB0(0x8)
	struct FVector2D DownArrowTranslation; // 0xB8(0x8)
};

// Object: ScriptStruct DFMGameHud.SoundWidgetAnimParams
// Size: 0xC0 (Inherited: 0x0)
struct FSoundWidgetAnimParams
{
	struct TMap<struct FName, float> MaterialParamMap; // 0x0(0x50)
	struct TMap<struct FName, struct FLinearColor> MaterialVectorParamMap; // 0x50(0x50)
	struct FVector2D SoundImageScale; // 0xA0(0x8)
	struct FVector2D IconImageScale; // 0xA8(0x8)
	struct FVector2D UpArrowTranslation; // 0xB0(0x8)
	struct FVector2D DownArrowTranslation; // 0xB8(0x8)
};

// Object: ScriptStruct DFMGameHud.VehicleWidgetRefreshParameter
// Size: 0x10 (Inherited: 0x0)
struct FVehicleWidgetRefreshParameter
{
	struct FString SkillKey; // 0x0(0x10)
};

// Object: ScriptStruct DFMGameHud.VehicleWidgetInfo
// Size: 0x10 (Inherited: 0x0)
struct FVehicleWidgetInfo
{
	struct UUserWidget* Widget; // 0x0(0x8)
	uint8_t bIsShowed : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t bIsReadyToHide : 1; // 0x9(0x1), Mask(0x1)
	uint8_t BitPad_0x9_1 : 7; // 0x9(0x1)
	uint8_t Pad_0xA[0x6]; // 0xA(0x6)
};

// Object: ScriptStruct DFMGameHud.DebugCommandLineItem
// Size: 0x30 (Inherited: 0x0)
struct FDebugCommandLineItem
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct FString Name; // 0x8(0x10)
	struct FString Command; // 0x18(0x10)
	float DefaultValue; // 0x28(0x4)
	EFDebugCommandLineType CommandType; // 0x2C(0x1)
	uint8_t Pad_0x2D[0x3]; // 0x2D(0x3)
};

// Object: ScriptStruct DFMGameHud.WeaponDebugSpawnLogInfo
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugSpawnLogInfo : FWeaponDebugLogInfoBase
{
};

// Object: ScriptStruct DFMGameHud.WeaponPreViewTimeLineLogInfo
// Size: 0x20 (Inherited: 0x20)
struct FWeaponPreViewTimeLineLogInfo : FWeaponDebugLogInfoBase
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugDamageLogInfo
// Size: 0x30 (Inherited: 0x20)
struct FWeaponDebugDamageLogInfo : FWeaponDebugLogInfoBase
{
	uint8_t Pad_0x20[0x10]; // 0x20(0x10)
};

// Object: ScriptStruct DFMGameHud.WeaponDebugAttributeDetailDisplayLogInfo
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugAttributeDetailDisplayLogInfo : FWeaponDebugLogInfoBase
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugAttributeDisplayLogInfo
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugAttributeDisplayLogInfo : FWeaponDebugLogInfoBase
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugModularLogInfo
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugModularLogInfo : FWeaponDebugLogInfoBase
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugDataModifierLogInfo
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugDataModifierLogInfo : FWeaponDebugLogInfoBase
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugAudioLogInfo
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugAudioLogInfo : FWeaponDebugLogInfoBase
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugUILogInfo
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugUILogInfo : FWeaponDebugLogInfoBase
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugEffectLogInfo
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugEffectLogInfo : FWeaponDebugLogInfoBase
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugBaseAttributeLogInfo
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugBaseAttributeLogInfo : FWeaponDebugLogInfoBase
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugMeshLogInfo
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugMeshLogInfo : FWeaponDebugLogInfoBase
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugAnimLogInfo
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugAnimLogInfo : FWeaponDebugLogInfoBase
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugAssistedAimingLogInfo
// Size: 0x60 (Inherited: 0x20)
struct FWeaponDebugAssistedAimingLogInfo : FWeaponDebugLogInfoBase
{
	uint8_t Pad_0x20[0x40]; // 0x20(0x40)
};

// Object: ScriptStruct DFMGameHud.WeaponDebugRecoilLogInfo
// Size: 0x70 (Inherited: 0x20)
struct FWeaponDebugRecoilLogInfo : FWeaponDebugLogInfoBase
{
	uint8_t Pad_0x20[0x50]; // 0x20(0x50)
};

// Object: ScriptStruct DFMGameHud.WeaponDebugLogInfoBaseNew
// Size: 0x20 (Inherited: 0x0)
struct FWeaponDebugLogInfoBaseNew
{
	uint8_t Pad_0x0[0xC]; // 0x0(0xC)
	struct TWeakObjectPtr<struct UWorld> GameWorld; // 0xC(0x8)
	struct TWeakObjectPtr<struct UWeaponDebugLogViewNew> DebugView; // 0x14(0x8)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct DFMGameHud.WeaponDebugSpawnLogInfoNew
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugSpawnLogInfoNew : FWeaponDebugLogInfoBaseNew
{
};

// Object: ScriptStruct DFMGameHud.WeaponPreViewTimeLineLogInfoNew
// Size: 0x20 (Inherited: 0x20)
struct FWeaponPreViewTimeLineLogInfoNew : FWeaponDebugLogInfoBaseNew
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugDamageLogInfoNew
// Size: 0x30 (Inherited: 0x20)
struct FWeaponDebugDamageLogInfoNew : FWeaponDebugLogInfoBaseNew
{
	uint8_t Pad_0x20[0x10]; // 0x20(0x10)
};

// Object: ScriptStruct DFMGameHud.WeaponDebugAttributeDetailDisplayLogInfoNew
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugAttributeDetailDisplayLogInfoNew : FWeaponDebugLogInfoBaseNew
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugAttributeDisplayLogInfoNew
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugAttributeDisplayLogInfoNew : FWeaponDebugLogInfoBaseNew
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugModularLogInfoNew
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugModularLogInfoNew : FWeaponDebugLogInfoBaseNew
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugDataModifierLogInfoNew
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugDataModifierLogInfoNew : FWeaponDebugLogInfoBaseNew
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugAudioLogInfoNew
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugAudioLogInfoNew : FWeaponDebugLogInfoBaseNew
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugUILogInfoNew
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugUILogInfoNew : FWeaponDebugLogInfoBaseNew
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugEffectLogInfoNew
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugEffectLogInfoNew : FWeaponDebugLogInfoBaseNew
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugBaseAttributeLogInfoNew
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugBaseAttributeLogInfoNew : FWeaponDebugLogInfoBaseNew
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugMeshLogInfoNew
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugMeshLogInfoNew : FWeaponDebugLogInfoBaseNew
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugAnimLogInfoNew
// Size: 0x20 (Inherited: 0x20)
struct FWeaponDebugAnimLogInfoNew : FWeaponDebugLogInfoBaseNew
{
};

// Object: ScriptStruct DFMGameHud.WeaponDebugAssistedAimingLogInfoNew
// Size: 0x60 (Inherited: 0x20)
struct FWeaponDebugAssistedAimingLogInfoNew : FWeaponDebugLogInfoBaseNew
{
	uint8_t Pad_0x20[0x40]; // 0x20(0x40)
};

// Object: ScriptStruct DFMGameHud.WeaponDebugRecoilLogInfoNew
// Size: 0x70 (Inherited: 0x20)
struct FWeaponDebugRecoilLogInfoNew : FWeaponDebugLogInfoBaseNew
{
	uint8_t Pad_0x20[0x50]; // 0x20(0x50)
};

// Object: ScriptStruct DFMGameHud.WeaponInputDisableNotice
// Size: 0x20 (Inherited: 0x0)
struct FWeaponInputDisableNotice
{
	struct UUserWidget* TipClass; // 0x0(0x8)
	struct FString TipContent; // 0x8(0x10)
	float Duration; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: Class DFMGameHud.DFMBaseUIView
// Size: 0x460 (Inherited: 0x3F0)
struct UDFMBaseUIView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UDFMBaseUIView, "DFMBaseUIView")

	struct TMap<struct FName, struct UWidgetAnimation*> AnimationsMap; // 0x3F0(0x50)
	uint8_t Pad_0x440[0x10]; // 0x440(0x10)
	uint8_t bIsShow : 1; // 0x450(0x1), Mask(0x1)
	uint8_t BitPad_0x450_1 : 7; // 0x450(0x1)
	uint8_t Pad_0x451[0x3]; // 0x451(0x3)
	float OpenTime; // 0x454(0x4)
	float ShowTime; // 0x458(0x4)
	uint8_t bAutoCollectAnimations : 1; // 0x45C(0x1), Mask(0x1)
	uint8_t BitPad_0x45C_1 : 7; // 0x45C(0x1)
	uint8_t Pad_0x45D[0x3]; // 0x45D(0x3)

	// Object: Function DFMGameHud.DFMBaseUIView.Visible
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55dc98
	// Params: [ Num(0) Size(0x0) ]
	void Visible();

	// Object: Function DFMGameHud.DFMBaseUIView.SetWidgetVisible
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55dbec
	// Params: [ Num(1) Size(0x8) ]
	void SetWidgetVisible(struct UWidget* Widget);

	// Object: Function DFMGameHud.DFMBaseUIView.SetWidgetSelfHitTestInvisibleOrCollapsed
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55dafc
	// Params: [ Num(2) Size(0x9) ]
	void SetWidgetSelfHitTestInvisibleOrCollapsed(struct UWidget* Widget, uint8_t bVisible);

	// Object: Function DFMGameHud.DFMBaseUIView.SetWidgetSelfHitTestInvisible
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55da50
	// Params: [ Num(1) Size(0x8) ]
	void SetWidgetSelfHitTestInvisible(struct UWidget* Widget);

	// Object: Function DFMGameHud.DFMBaseUIView.SetWidgetOpacity
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55d968
	// Params: [ Num(2) Size(0xC) ]
	void SetWidgetOpacity(struct UWidget* Widget, float Opacity);

	// Object: Function DFMGameHud.DFMBaseUIView.SetWidgetHitTestInvisible
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55d8bc
	// Params: [ Num(1) Size(0x8) ]
	void SetWidgetHitTestInvisible(struct UWidget* Widget);

	// Object: Function DFMGameHud.DFMBaseUIView.SetWidgetHidden
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55d810
	// Params: [ Num(1) Size(0x8) ]
	void SetWidgetHidden(struct UWidget* Widget);

	// Object: Function DFMGameHud.DFMBaseUIView.SetWidgetCollapsed
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55d764
	// Params: [ Num(1) Size(0x8) ]
	void SetWidgetCollapsed(struct UWidget* Widget);

	// Object: Function DFMGameHud.DFMBaseUIView.SetOpenTime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd55d750
	// Params: [ Num(0) Size(0x0) ]
	void SetOpenTime();

	// Object: Function DFMGameHud.DFMBaseUIView.SelfHitTestInvisible
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55d734
	// Params: [ Num(0) Size(0x0) ]
	void SelfHitTestInvisible();

	// Object: Function DFMGameHud.DFMBaseUIView.PlayUIAudio
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd55d690
	// Params: [ Num(1) Size(0x8) ]
	void PlayUIAudio(struct FName AudioName);

	// Object: Function DFMGameHud.DFMBaseUIView.HitTestInvisible
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55d674
	// Params: [ Num(0) Size(0x0) ]
	void HitTestInvisible();

	// Object: Function DFMGameHud.DFMBaseUIView.Hidden
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55d658
	// Params: [ Num(0) Size(0x0) ]
	void Hidden();

	// Object: Function DFMGameHud.DFMBaseUIView.GetWidgetFromPath
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55d550
	// Params: [ Num(2) Size(0x18) ]
	struct UWidget* GetWidgetFromPath(struct FString Path);

	// Object: Function DFMGameHud.DFMBaseUIView.CollectAnimations
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55d534
	// Params: [ Num(0) Size(0x0) ]
	void CollectAnimations();

	// Object: Function DFMGameHud.DFMBaseUIView.Collapsed
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd55d518
	// Params: [ Num(0) Size(0x0) ]
	void Collapsed();

	// Object: Function DFMGameHud.DFMBaseUIView.CalculateShowTime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd55d504
	// Params: [ Num(0) Size(0x0) ]
	void CalculateShowTime();
};

// Object: Class DFMGameHud.AbilityBaseEffectView
// Size: 0x3F8 (Inherited: 0x3F0)
struct UAbilityBaseEffectView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UAbilityBaseEffectView, "AbilityBaseEffectView")

	uint8_t Pad_0x3F0[0x8]; // 0x3F0(0x8)
};

// Object: Class DFMGameHud.AbilityDectorMapIconViewController
// Size: 0x2B0 (Inherited: 0x2B0)
struct UAbilityDectorMapIconViewController : UMapIconViewController
{
	DEFINE_UE_CLASS_HELPERS(UAbilityDectorMapIconViewController, "AbilityDectorMapIconViewController")
};

// Object: Class DFMGameHud.AbilityDetectorEnemyItemHudView
// Size: 0x328 (Inherited: 0x2F8)
struct UAbilityDetectorEnemyItemHudView : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UAbilityDetectorEnemyItemHudView, "AbilityDetectorEnemyItemHudView")

	struct AGPCharacter* Target; // 0x2F8(0x8)
	struct UImage* AvatarImg; // 0x300(0x8)
	struct UTextBlock* HealthTextBlock; // 0x308(0x8)
	struct UTextBlock* ArmorTextBlock; // 0x310(0x8)
	uint8_t Pad_0x318[0x10]; // 0x318(0x10)

	// Object: Function DFMGameHud.AbilityDetectorEnemyItemHudView.OnEquipChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd5016a8
	// Params: [ Num(0) Size(0x0) ]
	void OnEquipChanged();

	// Object: Function DFMGameHud.AbilityDetectorEnemyItemHudView.OnCharaterHealthChange
	// Flags: [Final|Native|Protected]
	// Offset: 0xd501590
	// Params: [ Num(3) Size(0x10) ]
	void OnCharaterHealthChange(struct AActor* Owner, int32_t CurrentValue, int32_t MaxValue);

	// Object: Function DFMGameHud.AbilityDetectorEnemyItemHudView.OnCharaterArmorChange
	// Flags: [Final|Native|Protected]
	// Offset: 0xd501478
	// Params: [ Num(3) Size(0x10) ]
	void OnCharaterArmorChange(struct AActor* Owner, int32_t CurrentValue, int32_t MaxValue);

	// Object: Function DFMGameHud.AbilityDetectorEnemyItemHudView.OnAvatarImageLoaded
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0xd5013b8
	// Params: [ Num(1) Size(0x18) ]
	void OnAvatarImageLoaded(const struct FSoftObjectPath& ImagePath);
};

// Object: Class DFMGameHud.AbilityDetectorEnemyItemView
// Size: 0x420 (Inherited: 0x3F0)
struct UAbilityDetectorEnemyItemView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UAbilityDetectorEnemyItemView, "AbilityDetectorEnemyItemView")

	struct AGPCharacter* Target; // 0x3F0(0x8)
	struct UImage* AvatarImg; // 0x3F8(0x8)
	struct UTextBlock* HealthTextBlock; // 0x400(0x8)
	struct UTextBlock* ArmorTextBlock; // 0x408(0x8)
	uint8_t Pad_0x410[0x10]; // 0x410(0x10)

	// Object: Function DFMGameHud.AbilityDetectorEnemyItemView.OnEquipChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd5019b4
	// Params: [ Num(0) Size(0x0) ]
	void OnEquipChanged();

	// Object: Function DFMGameHud.AbilityDetectorEnemyItemView.OnCharaterHealthChange
	// Flags: [Final|Native|Public]
	// Offset: 0xd50189c
	// Params: [ Num(3) Size(0x10) ]
	void OnCharaterHealthChange(struct AActor* Owner, int32_t CurrentValue, int32_t MaxValue);

	// Object: Function DFMGameHud.AbilityDetectorEnemyItemView.OnCharaterArmorChange
	// Flags: [Final|Native|Public]
	// Offset: 0xd501784
	// Params: [ Num(3) Size(0x10) ]
	void OnCharaterArmorChange(struct AActor* Owner, int32_t CurrentValue, int32_t MaxValue);

	// Object: Function DFMGameHud.AbilityDetectorEnemyItemView.OnAvatarImageLoaded
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0xd5016c4
	// Params: [ Num(1) Size(0x18) ]
	void OnAvatarImageLoaded(const struct FSoftObjectPath& ImagePath);
};

// Object: Class DFMGameHud.AbilityDetectorEnemyLstHudHudController
// Size: 0x98 (Inherited: 0x80)
struct UAbilityDetectorEnemyLstHudHudController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UAbilityDetectorEnemyLstHudHudController, "AbilityDetectorEnemyLstHudHudController")

	struct UAbilityDetectorEnemyLstHudHudView* MyView; // 0x80(0x8)
	float LastEndTime; // 0x88(0x4)
	uint8_t bin : 1; // 0x8C(0x1), Mask(0x1)
	uint8_t BitPad_0x8C_1 : 7; // 0x8C(0x1)
	uint8_t Pad_0x8D[0x3]; // 0x8D(0x3)
	struct FTimerHandle Handle; // 0x90(0x8)

	// Object: Function DFMGameHud.AbilityDetectorEnemyLstHudHudController.OnDetectorEnemyChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd5019e4
	// Params: [ Num(2) Size(0x9) ]
	void OnDetectorEnemyChanged(struct AGPCharacter* CHARACTER, uint8_t bShow);

	// Object: Function DFMGameHud.AbilityDetectorEnemyLstHudHudController.EndShow
	// Flags: [Final|Native|Protected]
	// Offset: 0xd5019d0
	// Params: [ Num(0) Size(0x0) ]
	void EndShow();
};

// Object: Class DFMGameHud.AbilityDetectorEnemyLstHudHudView
// Size: 0x498 (Inherited: 0x400)
struct UAbilityDetectorEnemyLstHudHudView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UAbilityDetectorEnemyLstHudHudView, "AbilityDetectorEnemyLstHudHudView")

	struct TArray<EDFMGamePlayMode> GameplayModes; // 0x400(0x10)
	float DelayHideTime; // 0x410(0x4)
	float KeepingTime; // 0x414(0x4)
	struct UHorizontalBox* HorizontalBox_176; // 0x418(0x8)
	struct UAbilityDetectorEnemyItemHudView* WBP_TipNonre_ScoutListHUDItem_C_0; // 0x420(0x8)
	struct UAbilityDetectorEnemyItemHudView* WBP_TipNonre_ScoutListHUDItem_C_1; // 0x428(0x8)
	struct UAbilityDetectorEnemyItemHudView* WBP_TipNonre_ScoutListHUDItem_C_2; // 0x430(0x8)
	struct UAbilityDetectorEnemyItemHudView* WBP_TipNonre_ScoutListHUDItem_C_3; // 0x438(0x8)
	struct UAbilityDetectorEnemyItemHudView* WBP_TipNonre_ScoutListHUDItem_C_4; // 0x440(0x8)
	struct UAbilityDetectorEnemyItemHudView* WBP_TipNonre_ScoutListHUDItem_C_5; // 0x448(0x8)
	struct UCanvasPanel* RootPanel; // 0x450(0x8)
	struct UCanvasPanel* ItemPanel; // 0x458(0x8)
	struct UTextBlock* NotFound; // 0x460(0x8)
	struct UTextBlock* NearBy; // 0x468(0x8)
	struct UWidgetAnimation* Anim_In; // 0x470(0x8)
	struct UWidgetAnimation* Anim_Out; // 0x478(0x8)
	struct TArray<struct UAbilityDetectorEnemyItemHudView*> TipsLst; // 0x480(0x10)
	uint8_t Pad_0x490[0x8]; // 0x490(0x8)
};

// Object: Class DFMGameHud.AbilityDetectorEnemyLstHudView
// Size: 0x4A8 (Inherited: 0x3F0)
struct UAbilityDetectorEnemyLstHudView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UAbilityDetectorEnemyLstHudView, "AbilityDetectorEnemyLstHudView")

	struct TArray<EDFMGamePlayMode> GameplayModes; // 0x3F0(0x10)
	float DelayHideTime; // 0x400(0x4)
	float KeepingTime; // 0x404(0x4)
	uint8_t Pad_0x408[0x8]; // 0x408(0x8)
	struct UHorizontalBox* HorizontalBox_176; // 0x410(0x8)
	struct UAbilityDetectorEnemyItemView* WBP_TipNonre_ScoutListItem_C_0; // 0x418(0x8)
	struct UAbilityDetectorEnemyItemView* WBP_TipNonre_ScoutListItem_C_1; // 0x420(0x8)
	struct UAbilityDetectorEnemyItemView* WBP_TipNonre_ScoutListItem_C_2; // 0x428(0x8)
	struct UAbilityDetectorEnemyItemView* WBP_TipNonre_ScoutListItem_C_3; // 0x430(0x8)
	struct UAbilityDetectorEnemyItemView* WBP_TipNonre_ScoutListItem_C_4; // 0x438(0x8)
	struct UAbilityDetectorEnemyItemView* WBP_TipNonre_ScoutListItem_C_5; // 0x440(0x8)
	struct UCanvasPanel* RootPanel; // 0x448(0x8)
	struct UCanvasPanel* ItemPanel; // 0x450(0x8)
	struct UTextBlock* NotFound; // 0x458(0x8)
	struct UTextBlock* NearBy; // 0x460(0x8)
	struct UWidgetAnimation* Anim_In; // 0x468(0x8)
	struct UWidgetAnimation* Anim_Out; // 0x470(0x8)
	struct TArray<struct UAbilityDetectorEnemyItemView*> TipsLst; // 0x478(0x10)
	uint8_t Pad_0x488[0x10]; // 0x488(0x10)
	struct FTimerHandle Handle; // 0x498(0x8)
	float LastEndTime; // 0x4A0(0x4)
	uint8_t Pad_0x4A4[0x4]; // 0x4A4(0x4)

	// Object: Function DFMGameHud.AbilityDetectorEnemyLstHudView.OnDetectorEnemyChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd501b0c
	// Params: [ Num(2) Size(0x9) ]
	void OnDetectorEnemyChanged(struct AGPCharacter* CHARACTER, uint8_t bShow);

	// Object: Function DFMGameHud.AbilityDetectorEnemyLstHudView.EndShow
	// Flags: [Final|Native|Public]
	// Offset: 0xd501af8
	// Params: [ Num(0) Size(0x0) ]
	void EndShow();
};

// Object: Class DFMGameHud.AbilityDetectorHudController
// Size: 0xA8 (Inherited: 0xA8)
struct UAbilityDetectorHudController : UBaseUIController
{
	DEFINE_UE_CLASS_HELPERS(UAbilityDetectorHudController, "AbilityDetectorHudController")
};

// Object: Class DFMGameHud.MapBaseHUDView
// Size: 0x800 (Inherited: 0x3F0)
struct UMapBaseHUDView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UMapBaseHUDView, "MapBaseHUDView")

	struct UHUDStateManager* HUDStateManager; // 0x3F0(0x8)
	struct AGPPlayerState* ThisPlayerState; // 0x3F8(0x8)
	struct UMapInfoComponent* ThisMapInfoComponent; // 0x400(0x8)
	uint8_t Pad_0x408[0x28]; // 0x408(0x28)
	struct TMap<struct UMapIconViewController*, struct UMapItemHUDView*> CustomMapIconCache; // 0x430(0x50)
	struct TArray<struct UMapIconViewController*> LoadingMapIconViewControllerArr; // 0x480(0x10)
	uint8_t Pad_0x490[0x18]; // 0x490(0x18)
	struct FVector WorldCenter; // 0x4A8(0xC)
	struct FVector WorldExtent; // 0x4B4(0xC)
	struct UCurveFloat* BigMapZoomCurve; // 0x4C0(0x8)
	uint8_t Pad_0x4C8[0x50]; // 0x4C8(0x50)
	struct FVector2D MapSize; // 0x518(0x8)
	float CurrentScale; // 0x520(0x4)
	struct FVector2D CurrentMapUVPos; // 0x524(0x8)
	uint8_t Pad_0x52C[0x4]; // 0x52C(0x4)
	struct UBaseUIController* MapUIController; // 0x530(0x8)
	uint8_t Pad_0x538[0x8]; // 0x538(0x8)
	struct UCanvasPanel* PlayerAndMarkCanvasPanel; // 0x540(0x8)
	struct UMapItemHUDView* RevengeLocationWidget; // 0x548(0x8)
	struct UTimeLineEventMapHUDView* TimeLineEventWidget; // 0x550(0x8)
	uint8_t Pad_0x558[0x50]; // 0x558(0x50)
	struct TMap<struct FVector2D, struct FString> MapNamesStringInfo; // 0x5A8(0x50)
	struct TMap<struct FVector2D, struct UPaperSprite*> MapNamesInfo; // 0x5F8(0x50)
	struct UMaterialInstanceDynamic* MapTextureMID; // 0x648(0x8)
	struct UUIClipMapTexture* ClipMapTexture; // 0x650(0x8)
	struct FName ParamClipMapTex; // 0x658(0x8)
	uint8_t Pad_0x660[0x60]; // 0x660(0x60)
	struct ADFMGameState* CurGameState; // 0x6C0(0x8)
	struct UImage* MapBase; // 0x6C8(0x8)
	uint8_t Pad_0x6D0[0x4]; // 0x6D0(0x4)
	uint8_t bEnableMapBaseVisibilityFeature : 1; // 0x6D4(0x1), Mask(0x1)
	uint8_t BitPad_0x6D4_1 : 7; // 0x6D4(0x1)
	uint8_t Pad_0x6D5[0x3]; // 0x6D5(0x3)
	int32_t CurrentMapType; // 0x6D8(0x4)
	uint8_t Pad_0x6DC[0x2C]; // 0x6DC(0x2C)
	struct UTexture2D* EdgeMaskMapTexture; // 0x708(0x8)
	uint8_t Pad_0x710[0x18]; // 0x710(0x18)
	uint8_t bHasSetMap : 1; // 0x728(0x1), Mask(0x1)
	uint8_t BitPad_0x728_1 : 7; // 0x728(0x1)
	uint8_t Pad_0x729[0x1]; // 0x729(0x1)
	uint8_t bIsBigMap : 1; // 0x72A(0x1), Mask(0x1)
	uint8_t BitPad_0x72A_1 : 7; // 0x72A(0x1)
	uint8_t Pad_0x72B[0x5]; // 0x72B(0x5)
	int32_t TeamID; // 0x730(0x4)
	uint8_t Pad_0x734[0x4]; // 0x734(0x4)
	struct UUserWidget* MapView; // 0x738(0x8)
	struct TArray<struct FVector> MapHiddenInteractorLocArr; // 0x740(0x10)
	uint8_t bIsMapContainerInfoChanged : 1; // 0x750(0x1), Mask(0x1)
	uint8_t BitPad_0x750_1 : 7; // 0x750(0x1)
	uint8_t Pad_0x751[0x7]; // 0x751(0x7)
	struct TArray<struct APlayerExitBase*> AllPlayerExits; // 0x758(0x10)
	struct TSet<struct AInteractorBase*> AllExitTriggers; // 0x768(0x50)
	uint8_t Pad_0x7B8[0x2C]; // 0x7B8(0x2C)
	float UpdateClipMapInterval; // 0x7E4(0x4)
	uint8_t Pad_0x7E8[0x4]; // 0x7E8(0x4)
	int32_t MaxItemCountOneFrame; // 0x7EC(0x4)
	uint8_t Pad_0x7F0[0xD]; // 0x7F0(0xD)
	uint8_t bClearParameterValues : 1; // 0x7FD(0x1), Mask(0x1)
	uint8_t BitPad_0x7FD_1 : 7; // 0x7FD(0x1)
	uint8_t Pad_0x7FE[0x2]; // 0x7FE(0x2)

	// Object: Function DFMGameHud.MapBaseHUDView.OnViewClassLoaded
	// Flags: [Final|Native|Protected]
	// Offset: 0xd611868
	// Params: [ Num(4) Size(0x19) ]
	void OnViewClassLoaded(struct UMapIconViewController* InViewController, uint8_t IsBigMap, struct UObject* ViewBPClass, uint8_t bUseMapInfoSubSys);

	// Object: Function DFMGameHud.MapBaseHUDView.OnTimeLineIntroStateChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd6117c4
	// Params: [ Num(1) Size(0x1) ]
	void OnTimeLineIntroStateChanged(uint8_t EventStateUint);

	// Object: Function DFMGameHud.MapBaseHUDView.OnIconViewControllerAddOrRemove
	// Flags: [Native|Public]
	// Offset: 0xd6116d4
	// Params: [ Num(2) Size(0x9) ]
	void OnIconViewControllerAddOrRemove(struct UMapIconViewController* IconViewController, uint8_t bAdd);

	// Object: Function DFMGameHud.MapBaseHUDView.OnGamePlayModeChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd611630
	// Params: [ Num(1) Size(0x1) ]
	void OnGamePlayModeChanged(EDFMGamePlayMode GamePlayMode);

	// Object: Function DFMGameHud.MapBaseHUDView.OnGameHUDToggleVisible
	// Flags: [Final|Native|Public]
	// Offset: 0xd61158c
	// Params: [ Num(1) Size(0x4) ]
	void OnGameHUDToggleVisible(int32_t Visible);

	// Object: Function DFMGameHud.MapBaseHUDView.OnCustomMapIconRemoved
	// Flags: [Final|Native|Public]
	// Offset: 0xd6114e8
	// Params: [ Num(1) Size(0x8) ]
	void OnCustomMapIconRemoved(struct FName IconName);

	// Object: Function DFMGameHud.MapBaseHUDView.OnClientSeamlessTravelEnd
	// Flags: [Final|Native|Public]
	// Offset: 0xd61143c
	// Params: [ Num(1) Size(0x1) ]
	void OnClientSeamlessTravelEnd(uint8_t bReconnect);

	// Object: Function DFMGameHud.MapBaseHUDView.OnClientMapChange
	// Flags: [Final|Native|Public]
	// Offset: 0xd611428
	// Params: [ Num(0) Size(0x0) ]
	void OnClientMapChange();

	// Object: Function DFMGameHud.MapBaseHUDView.OnAsyncLoadEdgeMaskMapTexture
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0xd611368
	// Params: [ Num(1) Size(0x18) ]
	void OnAsyncLoadEdgeMaskMapTexture(const struct FSoftObjectPath& AssetRef);

	// Object: Function DFMGameHud.MapBaseHUDView.OnAsyncLoadBaseMapTexture
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0xd6112a8
	// Params: [ Num(1) Size(0x18) ]
	void OnAsyncLoadBaseMapTexture(const struct FSoftObjectPath& AssetRef);

	// Object: Function DFMGameHud.MapBaseHUDView.GetOrAddMapItem
	// Flags: [Final|Native|Protected]
	// Offset: 0xd611188
	// Params: [ Num(4) Size(0x20) ]
	struct UMapItemHUDView* GetOrAddMapItem(struct UCanvasPanel* MapWidget, struct UObject* WidgetClass, struct FName Key);

	// Object: Function DFMGameHud.MapBaseHUDView.GetOrAddMapCustomItem
	// Flags: [Final|Native|Protected]
	// Offset: 0xd611098
	// Params: [ Num(3) Size(0x18) ]
	struct UMapItemHUDView* GetOrAddMapCustomItem(struct UMapIconViewController* InViewController, uint8_t bUseMapInfoSubSys);

	// Object: Function DFMGameHud.MapBaseHUDView.GetIsBigMap
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd61107c
	// Params: [ Num(1) Size(0x1) ]
	uint8_t GetIsBigMap();
};

// Object: Class DFMGameHud.BigMapHUDView
// Size: 0xAA0 (Inherited: 0x800)
struct UBigMapHUDView : UMapBaseHUDView
{
	DEFINE_UE_CLASS_HELPERS(UBigMapHUDView, "BigMapHUDView")

	uint8_t Pad_0x800[0x10]; // 0x800(0x10)
	struct UGPAudioEventAsset* MarkSoundEvent; // 0x810(0x8)
	uint8_t Pad_0x818[0x20]; // 0x818(0x20)
	struct UScaleBox* BigMapCanvas; // 0x838(0x8)
	struct UCanvasPanel* BigMapPanel; // 0x840(0x8)
	struct UCanvasPanel* NavigationPanel; // 0x848(0x8)
	struct UCanvasPanel* DefaultCanvasPanel; // 0x850(0x8)
	uint8_t Pad_0x858[0x28]; // 0x858(0x28)
	float DisLimitForBtnImage; // 0x880(0x4)
	uint8_t Pad_0x884[0x4]; // 0x884(0x4)
	struct UBtnImageMapItemHUDView* CurrentImageMapItem; // 0x888(0x8)
	uint8_t Pad_0x890[0x10]; // 0x890(0x10)
	struct UMobilePlayerInput* PlayerInput; // 0x8A0(0x8)
	uint8_t Pad_0x8A8[0x8]; // 0x8A8(0x8)
	struct UPlayerBaseItemView* PlayerMapItemBase; // 0x8B0(0x8)
	uint8_t Pad_0x8B8[0x8]; // 0x8B8(0x8)
	struct UButton* CloseBtn; // 0x8C0(0x8)
	struct UButton* ScaleUpBtn; // 0x8C8(0x8)
	struct UButton* ScaleDownBtn; // 0x8D0(0x8)
	struct UButton* SignSelfBtn; // 0x8D8(0x8)
	struct UButton* MyPositionBtn; // 0x8E0(0x8)
	struct USlider* ScaleSlider; // 0x8E8(0x8)
	struct UDFCommonAddDecSlider* CommonAddDecSlider; // 0x8F0(0x8)
	uint8_t Pad_0x8F8[0x1]; // 0x8F8(0x1)
	uint8_t bSetCommonAddDecSlider : 1; // 0x8F9(0x1), Mask(0x1)
	uint8_t BitPad_0x8F9_1 : 7; // 0x8F9(0x1)
	uint8_t Pad_0x8FA[0x2]; // 0x8FA(0x2)
	float CurrentNormalizedScale; // 0x8FC(0x4)
	float LastNormalizedScale; // 0x900(0x4)
	struct FVector2D CurrentScaleAnchor; // 0x904(0x8)
	float FingerLengthValue; // 0x90C(0x4)
	uint8_t Pad_0x910[0x24]; // 0x910(0x24)
	uint8_t preShouldDraw : 1; // 0x934(0x1), Mask(0x1)
	uint8_t BitPad_0x934_1 : 7; // 0x934(0x1)
	uint8_t preShouldDrawIcon : 1; // 0x935(0x1), Mask(0x1)
	uint8_t BitPad_0x935_1 : 7; // 0x935(0x1)
	uint8_t Pad_0x936[0x2]; // 0x936(0x2)
	float OutTouchDis; // 0x938(0x4)
	uint8_t bTouchOut : 1; // 0x93C(0x1), Mask(0x1)
	uint8_t BitPad_0x93C_1 : 7; // 0x93C(0x1)
	uint8_t Pad_0x93D[0x27]; // 0x93D(0x27)
	uint8_t bUseSmoothScale : 1; // 0x964(0x1), Mask(0x1)
	uint8_t BitPad_0x964_1 : 7; // 0x964(0x1)
	uint8_t Pad_0x965[0x3]; // 0x965(0x3)
	float SmoothScaleTime; // 0x968(0x4)
	uint8_t bIsInSmoothScale : 1; // 0x96C(0x1), Mask(0x1)
	uint8_t BitPad_0x96C_1 : 7; // 0x96C(0x1)
	uint8_t Pad_0x96D[0x3]; // 0x96D(0x3)
	float TimeToSmoothScale; // 0x970(0x4)
	float TimeToSmoothScaleUsed; // 0x974(0x4)
	float ExpectNormalizedScale; // 0x978(0x4)
	float SmoothFromNormalizedScale; // 0x97C(0x4)
	uint8_t Pad_0x980[0x58]; // 0x980(0x58)
	struct FName DisplayInputActionName_A; // 0x9D8(0x8)
	uint8_t Pad_0x9E0[0x4]; // 0x9E0(0x4)
	struct FName DisplayInputActionName_X; // 0x9E4(0x8)
	uint8_t Pad_0x9EC[0x48]; // 0x9EC(0x48)
	float AdjustingMapMovementScale; // 0xA34(0x4)
	uint8_t Pad_0xA38[0x18]; // 0xA38(0x18)
	struct UButton* SendDetectorBtn; // 0xA50(0x8)
	struct UButton* ClearDetectorBtn; // 0xA58(0x8)
	uint8_t Pad_0xA60[0xC]; // 0xA60(0xC)
	struct FName UIAudio_MapClose; // 0xA6C(0x8)
	uint8_t Pad_0xA74[0x8]; // 0xA74(0x8)
	float ChangeScaleSensity; // 0xA7C(0x4)
	struct TArray<struct AMapMultiFloorVolume*> MultiFloorVolumeArr; // 0xA80(0x10)
	struct USOLBigMapHUDView_ContractTipsBtn* WBP_Map_ContractTipsBtn; // 0xA90(0x8)
	struct UMarkingCommonItemHUDView* HoveredMarkingItemHUDView; // 0xA98(0x8)

	// Object: Function DFMGameHud.BigMapHUDView.UpdateTLogData
	// Flags: [Native|Public]
	// Offset: 0xd50f994
	// Params: [ Num(2) Size(0x8) ]
	void UpdateTLogData(EBigMapOperateType OperateType, int32_t AccNum);

	// Object: Function DFMGameHud.BigMapHUDView.StartAutoZoomToLocation
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xd50f82c
	// Params: [ Num(4) Size(0x18) ]
	void StartAutoZoomToLocation(const struct FVector& TargetLocation, float StartScale, float TargetScale, float ZoomTime);

	// Object: Function DFMGameHud.BigMapHUDView.PlayPlayerWaveAnim
	// Flags: [Native|Protected]
	// Offset: 0xd50f778
	// Params: [ Num(1) Size(0x1) ]
	void PlayPlayerWaveAnim(uint8_t bDoPlay);

	// Object: Function DFMGameHud.BigMapHUDView.OnSliderValueChanged
	// Flags: [Native|Public]
	// Offset: 0xd50f6cc
	// Params: [ Num(1) Size(0x4) ]
	void OnSliderValueChanged(float Value);

	// Object: Function DFMGameHud.BigMapHUDView.OnSignClearBtnClick
	// Flags: [Native|Public]
	// Offset: 0xd50f6b0
	// Params: [ Num(0) Size(0x0) ]
	void OnSignClearBtnClick();

	// Object: Function DFMGameHud.BigMapHUDView.OnSetPlayerCenterBtnClick
	// Flags: [Native|Public]
	// Offset: 0xd50f694
	// Params: [ Num(0) Size(0x0) ]
	void OnSetPlayerCenterBtnClick();

	// Object: Function DFMGameHud.BigMapHUDView.OnSendDetectorBtnClick
	// Flags: [Native|Public]
	// Offset: 0xd50f678
	// Params: [ Num(0) Size(0x0) ]
	void OnSendDetectorBtnClick();

	// Object: Function DFMGameHud.BigMapHUDView.OnScrollScaleUp
	// Flags: [Native|Public]
	// Offset: 0xd50f65c
	// Params: [ Num(0) Size(0x0) ]
	void OnScrollScaleUp();

	// Object: Function DFMGameHud.BigMapHUDView.OnScrollScaleDown
	// Flags: [Native|Public]
	// Offset: 0xd50f640
	// Params: [ Num(0) Size(0x0) ]
	void OnScrollScaleDown();

	// Object: Function DFMGameHud.BigMapHUDView.OnScaleUpBtnClick
	// Flags: [Native|Public]
	// Offset: 0xd50f624
	// Params: [ Num(0) Size(0x0) ]
	void OnScaleUpBtnClick();

	// Object: Function DFMGameHud.BigMapHUDView.OnScaleDownBtnClick
	// Flags: [Native|Public]
	// Offset: 0xd50f608
	// Params: [ Num(0) Size(0x0) ]
	void OnScaleDownBtnClick();

	// Object: Function DFMGameHud.BigMapHUDView.OnInputAxisMapMarkerMovesTurn
	// Flags: [Final|Native|Public]
	// Offset: 0xd50f564
	// Params: [ Num(1) Size(0x4) ]
	void OnInputAxisMapMarkerMovesTurn(float Value);

	// Object: Function DFMGameHud.BigMapHUDView.OnInputAxisMapMarkerMovesLookUp
	// Flags: [Final|Native|Public]
	// Offset: 0xd50f4c0
	// Params: [ Num(1) Size(0x4) ]
	void OnInputAxisMapMarkerMovesLookUp(float Value);

	// Object: Function DFMGameHud.BigMapHUDView.OnClearMapSign
	// Flags: [Native|Public]
	// Offset: 0xd50f4a4
	// Params: [ Num(0) Size(0x0) ]
	void OnClearMapSign();

	// Object: Function DFMGameHud.BigMapHUDView.OnClearDetectorBtnClick
	// Flags: [Final|Native|Public]
	// Offset: 0xd50f490
	// Params: [ Num(0) Size(0x0) ]
	void OnClearDetectorBtnClick();

	// Object: Function DFMGameHud.BigMapHUDView.OnBtnBigMapOnClick
	// Flags: [Native|Public]
	// Offset: 0xd50f474
	// Params: [ Num(0) Size(0x0) ]
	void OnBtnBigMapOnClick();

	// Object: Function DFMGameHud.BigMapHUDView.HandleInputTypeChanged
	// Flags: [Native|Public]
	// Offset: 0xd50f3c8
	// Params: [ Num(1) Size(0x1) ]
	void HandleInputTypeChanged(EGPInputType InputType);

	// Object: Function DFMGameHud.BigMapHUDView.ConvertRealWorldDistToScale
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd50f31c
	// Params: [ Num(2) Size(0x8) ]
	float ConvertRealWorldDistToScale(float InRealWorldDist);

	// Object: Function DFMGameHud.BigMapHUDView.CancelAutoZoom
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd50f300
	// Params: [ Num(0) Size(0x0) ]
	void CancelAutoZoom();
};

// Object: Class DFMGameHud.AbilityDetectorHudView
// Size: 0xAB0 (Inherited: 0xAA0)
struct UAbilityDetectorHudView : UBigMapHUDView
{
	DEFINE_UE_CLASS_HELPERS(UAbilityDetectorHudView, "AbilityDetectorHudView")

	struct UWidget* DetectorMainAnimWidget; // 0xAA0(0x8)
	float AutoZoomTimeConfig; // 0xAA8(0x4)
	uint8_t Pad_0xAAC[0x4]; // 0xAAC(0x4)

	// Object: Function DFMGameHud.AbilityDetectorHudView.OnDetectorMapShow
	// Flags: [Final|Native|Public]
	// Offset: 0xd501ff8
	// Params: [ Num(1) Size(0x1) ]
	void OnDetectorMapShow(uint8_t Show);

	// Object: Function DFMGameHud.AbilityDetectorHudView.OnDetectorClose
	// Flags: [Final|Native|Public]
	// Offset: 0xd501fe4
	// Params: [ Num(0) Size(0x0) ]
	void OnDetectorClose();

	// Object: Function DFMGameHud.AbilityDetectorHudView.BP_UpdateLeft
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_UpdateLeft(int32_t leftNum);

	// Object: Function DFMGameHud.AbilityDetectorHudView.BP_SendDetector
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd501fd0
	// Params: [ Num(0) Size(0x0) ]
	void BP_SendDetector();

	// Object: Function DFMGameHud.AbilityDetectorHudView.BP_PlayExitAnim
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_PlayExitAnim(uint8_t Show);

	// Object: Function DFMGameHud.AbilityDetectorHudView.BP_PlaceProbePoint
	// Flags: [Native|Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0xd501f24
	// Params: [ Num(1) Size(0x4) ]
	void BP_PlaceProbePoint(int32_t Index);

	// Object: Function DFMGameHud.AbilityDetectorHudView.BP_OnDetectorMapShow
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_OnDetectorMapShow(uint8_t Show);

	// Object: Function DFMGameHud.AbilityDetectorHudView.BP_CancelProbePoint
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd501e80
	// Params: [ Num(1) Size(0x4) ]
	void BP_CancelProbePoint(int32_t Index);

	// Object: Function DFMGameHud.AbilityDetectorHudView.BP_AfterPlayExitAnim
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd501dd4
	// Params: [ Num(1) Size(0x1) ]
	void BP_AfterPlayExitAnim(uint8_t Show);
};

// Object: Class DFMGameHud.AbilityDetectorHudViewEx
// Size: 0xAB8 (Inherited: 0xAA0)
struct UAbilityDetectorHudViewEx : UBigMapHUDView
{
	DEFINE_UE_CLASS_HELPERS(UAbilityDetectorHudViewEx, "AbilityDetectorHudViewEx")

	struct UWidget* DetectorMainAnimWidget; // 0xAA0(0x8)
	struct UUserWidget* SkillsPrologueAnimMain; // 0xAA8(0x8)
	float AutoZoomTimeConfig; // 0xAB0(0x4)
	uint8_t Pad_0xAB4[0x4]; // 0xAB4(0x4)

	// Object: Function DFMGameHud.AbilityDetectorHudViewEx.OnDetectorMapShow
	// Flags: [Final|Native|Public]
	// Offset: 0xd5024c0
	// Params: [ Num(1) Size(0x1) ]
	void OnDetectorMapShow(uint8_t Show);

	// Object: Function DFMGameHud.AbilityDetectorHudViewEx.OnDetectorClose
	// Flags: [Final|Native|Public]
	// Offset: 0xd5024ac
	// Params: [ Num(0) Size(0x0) ]
	void OnDetectorClose();

	// Object: Function DFMGameHud.AbilityDetectorHudViewEx.BP_UpdateLeft
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_UpdateLeft(int32_t leftNum);

	// Object: Function DFMGameHud.AbilityDetectorHudViewEx.BP_SendDetector
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd502498
	// Params: [ Num(0) Size(0x0) ]
	void BP_SendDetector();

	// Object: Function DFMGameHud.AbilityDetectorHudViewEx.BP_PlayExitAnim
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_PlayExitAnim(uint8_t Show);

	// Object: Function DFMGameHud.AbilityDetectorHudViewEx.BP_PlaceProbePoint
	// Flags: [Native|Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0xd5023ec
	// Params: [ Num(1) Size(0x4) ]
	void BP_PlaceProbePoint(int32_t Index);

	// Object: Function DFMGameHud.AbilityDetectorHudViewEx.BP_OnDetectorMapShow
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_OnDetectorMapShow(uint8_t Show);

	// Object: Function DFMGameHud.AbilityDetectorHudViewEx.BP_CancelProbePoint
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd502348
	// Params: [ Num(1) Size(0x4) ]
	void BP_CancelProbePoint(int32_t Index);

	// Object: Function DFMGameHud.AbilityDetectorHudViewEx.BP_AfterPlayExitAnim
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd50229c
	// Params: [ Num(1) Size(0x1) ]
	void BP_AfterPlayExitAnim(uint8_t Show);
};

// Object: Class DFMGameHud.MapItemHUDView
// Size: 0x468 (Inherited: 0x3F0)
struct UMapItemHUDView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UMapItemHUDView, "MapItemHUDView")

	struct UMapIconViewController* IconController; // 0x3F0(0x8)
	struct UMapBaseHUDView* MapHUDView; // 0x3F8(0x8)
	struct UDFMapBaseHUDView* DFMapHUDView; // 0x400(0x8)
	uint8_t bNeedTick : 1; // 0x408(0x1), Mask(0x1)
	uint8_t BitPad_0x408_1 : 7; // 0x408(0x1)
	uint8_t bIsVisible : 1; // 0x409(0x1), Mask(0x1)
	uint8_t BitPad_0x409_1 : 7; // 0x409(0x1)
	ESlateVisibility DefaultIconVisibility; // 0x40A(0x1)
	uint8_t Pad_0x40B[0x1]; // 0x40B(0x1)
	int32_t ZOrder; // 0x40C(0x4)
	uint8_t Pad_0x410[0xC]; // 0x410(0xC)
	uint8_t bIsSelected : 1; // 0x41C(0x1), Mask(0x1)
	uint8_t BitPad_0x41C_1 : 7; // 0x41C(0x1)
	uint8_t bIsTracking : 1; // 0x41D(0x1), Mask(0x1)
	uint8_t BitPad_0x41D_1 : 7; // 0x41D(0x1)
	uint8_t bIsMarkedLocally : 1; // 0x41E(0x1), Mask(0x1)
	uint8_t BitPad_0x41E_1 : 7; // 0x41E(0x1)
	uint8_t bIsSnapToBoundary : 1; // 0x41F(0x1), Mask(0x1)
	uint8_t BitPad_0x41F_1 : 7; // 0x41F(0x1)
	struct USelectedFrameWidget* SelectedFrameWidgetPtr; // 0x420(0x8)
	struct UFlaggedFrameWidget* FlaggedFrameWidgetPtr; // 0x428(0x8)
	struct UEdgeTrackingWidget* EdgeTrackingWidgetPtr; // 0x430(0x8)
	struct UMapItemRangeHUDView* ItemRangeWidgetPtr; // 0x438(0x8)
	struct UEvacuteTimeWidget* EvacuteTimeWidgetPtr; // 0x440(0x8)
	struct UAnimTrackingWidget* AnimTrackingWidgetPtr; // 0x448(0x8)
	struct UMapItemProgressWidget* ItemProgressWidgetPtr; // 0x450(0x8)
	struct UMapItemRippleHUDView* RippleWidgetPtr; // 0x458(0x8)
	uint8_t Pad_0x460[0x6]; // 0x460(0x6)
	uint8_t bUseCacheRelativeTransformOptimize : 1; // 0x466(0x1), Mask(0x1)
	uint8_t BitPad_0x466_1 : 7; // 0x466(0x1)
	uint8_t bCanBeRemovedWhenBigMapClosed : 1; // 0x467(0x1), Mask(0x1)
	uint8_t BitPad_0x467_1 : 7; // 0x467(0x1)

	// Object: Function DFMGameHud.MapItemHUDView.TryMarkMapTarget
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd6141b4
	// Params: [ Num(1) Size(0x1) ]
	void TryMarkMapTarget(uint8_t bAdd);

	// Object: Function DFMGameHud.MapItemHUDView.SetIconTranslation
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xd6140fc
	// Params: [ Num(1) Size(0x8) ]
	void SetIconTranslation(const struct FVector2D& InTranslation);

	// Object: Function DFMGameHud.MapItemHUDView.SetIconRotateAngle
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd614050
	// Params: [ Num(1) Size(0x4) ]
	void SetIconRotateAngle(float InAngle);

	// Object: Function DFMGameHud.MapItemHUDView.SetFlaggedFrameWidget
	// Flags: [Native|Public]
	// Offset: 0xd613f9c
	// Params: [ Num(1) Size(0x1) ]
	void SetFlaggedFrameWidget(uint8_t bShowFlaggedFrame);

	// Object: Function DFMGameHud.MapItemHUDView.OnTrackMapTargetSucceed
	// Flags: [Native|Public|HasOutParms]
	// Offset: 0xf591970
	// Params: [ Num(3) Size(0xD) ]
	void OnTrackMapTargetSucceed(uint8_t MapSignTypeInt, const struct FName& Name, uint8_t bSucceed);

	// Object: Function DFMGameHud.MapItemHUDView.OnSelectMapTarget
	// Flags: [Native|Public|HasOutParms]
	// Offset: 0xf0e3e50
	// Params: [ Num(3) Size(0x18) ]
	void OnSelectMapTarget(uint8_t MapSignTypeInt, const struct FName& TargetName, struct UMapIconViewController* IconViewController);

	// Object: Function DFMGameHud.MapItemHUDView.OnSelectBtnClicked
	// Flags: [Native|Public]
	// Offset: 0xd613f80
	// Params: [ Num(0) Size(0x0) ]
	void OnSelectBtnClicked();

	// Object: Function DFMGameHud.MapItemHUDView.OnItemWidgetUnHovered
	// Flags: [Final|Native|Public]
	// Offset: 0xd613f6c
	// Params: [ Num(0) Size(0x0) ]
	void OnItemWidgetUnHovered();

	// Object: Function DFMGameHud.MapItemHUDView.OnItemWidgetHovered
	// Flags: [Final|Native|Public]
	// Offset: 0xd613f58
	// Params: [ Num(0) Size(0x0) ]
	void OnItemWidgetHovered();

	// Object: Function DFMGameHud.MapItemHUDView.OnIconControllerInited
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void OnIconControllerInited();

	// Object: Function DFMGameHud.MapItemHUDView.OnControllerUpdated
	// Flags: [Native|Public]
	// Offset: 0xd613f3c
	// Params: [ Num(0) Size(0x0) ]
	void OnControllerUpdated();

	// Object: Function DFMGameHud.MapItemHUDView.OnControllerTracked
	// Flags: [Native|Public]
	// Offset: 0xd613e88
	// Params: [ Num(1) Size(0x1) ]
	void OnControllerTracked(uint8_t InIsTracking);

	// Object: Function DFMGameHud.MapItemHUDView.OnControllerSelected
	// Flags: [Native|Public]
	// Offset: 0xd613dd4
	// Params: [ Num(1) Size(0x1) ]
	void OnControllerSelected(uint8_t InIsSelected);

	// Object: Function DFMGameHud.MapItemHUDView.OnControllerRemoved
	// Flags: [Native|Public]
	// Offset: 0xd613db8
	// Params: [ Num(0) Size(0x0) ]
	void OnControllerRemoved();

	// Object: Function DFMGameHud.MapItemHUDView.GetIsOnBigMap
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd613d80
	// Params: [ Num(1) Size(0x1) ]
	uint8_t GetIsOnBigMap();

	// Object: Function DFMGameHud.MapItemHUDView.GetHoverItemRecursively
	// Flags: [Final|Native|Public]
	// Offset: 0xd613cd4
	// Params: [ Num(2) Size(0x10) ]
	struct UWidget* GetHoverItemRecursively(struct UUserWidget* RootWidget);

	// Object: Function DFMGameHud.MapItemHUDView.DoTick
	// Flags: [Native|Public]
	// Offset: 0xd613c28
	// Params: [ Num(1) Size(0x4) ]
	void DoTick(float DeltaTime);

	// Object: Function DFMGameHud.MapItemHUDView.BP_OnTracking
	// Flags: [Native|Event|Public|BlueprintEvent]
	// Offset: 0xf6a9b18
	// Params: [ Num(1) Size(0x1) ]
	void BP_OnTracking(uint8_t bDoTracking);

	// Object: Function DFMGameHud.MapItemHUDView.BP_OnSnapToBoundaryStatusChanged
	// Flags: [Native|Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0xf432e7c
	// Params: [ Num(1) Size(0x1) ]
	void BP_OnSnapToBoundaryStatusChanged(uint8_t bSnapToBoundary);

	// Object: Function DFMGameHud.MapItemHUDView.BP_OnSelectChanged
	// Flags: [Native|Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0xf32e888
	// Params: [ Num(1) Size(0x1) ]
	void BP_OnSelectChanged(uint8_t bInSelect);

	// Object: Function DFMGameHud.MapItemHUDView.BP_OnControllerUpdated
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_OnControllerUpdated();

	// Object: Function DFMGameHud.MapItemHUDView.BP_OnControllerRemoved
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_OnControllerRemoved();
};

// Object: Class DFMGameHud.AbilityDetectorMapItemHUDView
// Size: 0x468 (Inherited: 0x468)
struct UAbilityDetectorMapItemHUDView : UMapItemHUDView
{
	DEFINE_UE_CLASS_HELPERS(UAbilityDetectorMapItemHUDView, "AbilityDetectorMapItemHUDView")

	// Object: Function DFMGameHud.AbilityDetectorMapItemHUDView.UpdateMarkerType
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void UpdateMarkerType(EGPQuestActionMarkerType Type);

	// Object: Function DFMGameHud.AbilityDetectorMapItemHUDView.UpdateIconState
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(2) Size(0x8) ]
	void UpdateIconState(int32_t IconType, int32_t Index);
};

// Object: Class DFMGameHud.AbilityEngineerVehicleHudController
// Size: 0xA8 (Inherited: 0xA8)
struct UAbilityEngineerVehicleHudController : UBaseUIController
{
	DEFINE_UE_CLASS_HELPERS(UAbilityEngineerVehicleHudController, "AbilityEngineerVehicleHudController")

	// Object: Function DFMGameHud.AbilityEngineerVehicleHudController.OnVehicleOperate
	// Flags: [Final|Native|Protected]
	// Offset: 0xd5026d0
	// Params: [ Num(3) Size(0x18) ]
	void OnVehicleOperate(uint8_t On, struct AActor* Actor, struct ACHARACTER* CHARACTER);
};

// Object: Class DFMGameHud.MobileControlPadView
// Size: 0x478 (Inherited: 0x3F0)
struct UMobileControlPadView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UMobileControlPadView, "MobileControlPadView")

	float TouchAreaOffset; // 0x3EC(0x4)
	struct FName TouchImageName; // 0x3F0(0x8)
	struct FName RotationLimitImageName; // 0x3F8(0x8)
	uint8_t bHasRotationLimit : 1; // 0x400(0x1), Mask(0x1)
	uint8_t BitPad_0x404_1 : 7; // 0x404(0x1)
	uint8_t Pad_0x405[0x3]; // 0x405(0x3)
	struct AGPPlayerController* GPPlayerController; // 0x408(0x8)
	struct AGPCharacter* GPCharacter; // 0x410(0x8)
	struct UMobilePlayerInput* MobilePlayerInput; // 0x418(0x8)
	struct UGPInputManager* InputManager; // 0x420(0x8)
	struct UMobileGameHandle* GameHandle; // 0x428(0x8)
	struct UClientControlSetting* CtlSetting; // 0x430(0x8)
	struct UImage* TouchImage; // 0x438(0x8)
	struct UImage* RotationLimitImage; // 0x440(0x8)
	struct AGPCharacter* OldCharacter; // 0x448(0x8)
	uint8_t bOverlapFlag : 1; // 0x450(0x1), Mask(0x1)
	uint8_t BitPad_0x450_1 : 7; // 0x450(0x1)
	uint8_t Pad_0x451[0x27]; // 0x451(0x27)

	// Object: Function DFMGameHud.MobileControlPadView.SetFingerIndex
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xd61cb4c
	// Params: [ Num(1) Size(0x70) ]
	void SetFingerIndex(const struct FPointerEvent& InTouchEvent);

	// Object: Function DFMGameHud.MobileControlPadView.OnTouchFingerStatusChangedEvent
	// Flags: [Native|Public|HasDefaults]
	// Offset: 0xefddfc8
	// Params: [ Num(3) Size(0xC) ]
	void OnTouchFingerStatusChangedEvent(EMobileControlButtonType ControlButtonType, EMobileTouchType TouchType, struct FVector2D Location);

	// Object: Function DFMGameHud.MobileControlPadView.OnControllerUnPossessPawn
	// Flags: [Final|Native|Public]
	// Offset: 0xf43a534
	// Params: [ Num(1) Size(0x8) ]
	void OnControllerUnPossessPawn(struct APlayerController* Controller);

	// Object: Function DFMGameHud.MobileControlPadView.OnControllerPossessPawn
	// Flags: [Final|Native|Public]
	// Offset: 0xd61ca70
	// Params: [ Num(2) Size(0x10) ]
	void OnControllerPossessPawn(struct APlayerController* Controller, struct APawn* Pawn);

	// Object: Function DFMGameHud.MobileControlPadView.OnControlButtonReleased
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xd61c9c8
	// Params: [ Num(1) Size(0x8) ]
	void OnControlButtonReleased(struct FVector2D Location);

	// Object: Function DFMGameHud.MobileControlPadView.OnControlButtonPressed
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd61c9ac
	// Params: [ Num(0) Size(0x0) ]
	void OnControlButtonPressed();

	// Object: Function DFMGameHud.MobileControlPadView.GetTouchPixelPositionByTouchEvent
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xd61c848
	// Params: [ Num(2) Size(0x78) ]
	struct FVector2D GetTouchPixelPositionByTouchEvent(const struct FPointerEvent& InTouchEvent);

	// Object: Function DFMGameHud.MobileControlPadView.GetClientControlSetting
	// Flags: [Final|Native|Public]
	// Offset: 0xd61c814
	// Params: [ Num(1) Size(0x8) ]
	struct UClientControlSetting* GetClientControlSetting();

	// Object: Function DFMGameHud.MobileControlPadView.CheckIfInRectangleWidget
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xd61c72c
	// Params: [ Num(3) Size(0x11) ]
	uint8_t CheckIfInRectangleWidget(struct UWidget* CheckWidget, struct FVector2D TouchLocation);

	// Object: Function DFMGameHud.MobileControlPadView.CheckIfInCircleWidget
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xd61c644
	// Params: [ Num(3) Size(0x11) ]
	uint8_t CheckIfInCircleWidget(struct UWidget* CheckWidget, struct FVector2D TouchLocation);
};

// Object: Class DFMGameHud.AbilityEngineerVehicleHudView
// Size: 0x480 (Inherited: 0x478)
struct UAbilityEngineerVehicleHudView : UMobileControlPadView
{
	DEFINE_UE_CLASS_HELPERS(UAbilityEngineerVehicleHudView, "AbilityEngineerVehicleHudView")

	struct TWeakObjectPtr<struct AActor> OwnerVehicle; // 0x478(0x8)

	// Object: Function DFMGameHud.AbilityEngineerVehicleHudView.OnOwnerOperaterBeDamaged
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd502bf4
	// Params: [ Num(2) Size(0xD8) ]
	void OnOwnerOperaterBeDamaged(float Damage, const struct FTakeHitInfo& TakeHitInfo);

	// Object: Function DFMGameHud.AbilityEngineerVehicleHudView.OnEnginVehicleLowPower
	// Flags: [Final|Native|Public]
	// Offset: 0xd502b50
	// Params: [ Num(1) Size(0x8) ]
	void OnEnginVehicleLowPower(struct AGPCharacter* Operator);

	// Object: Function DFMGameHud.AbilityEngineerVehicleHudView.OnEnginVehicleDestroy
	// Flags: [Final|Native|Public]
	// Offset: 0xd502aac
	// Params: [ Num(1) Size(0x8) ]
	void OnEnginVehicleDestroy(struct AGPCharacter* Operator);

	// Object: Function DFMGameHud.AbilityEngineerVehicleHudView.GetGamePlayMode
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd502a78
	// Params: [ Num(1) Size(0x1) ]
	EDFMGamePlayMode GetGamePlayMode();

	// Object: Function DFMGameHud.AbilityEngineerVehicleHudView.BP_StaticFindObjectFast
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0xd502930
	// Params: [ Num(3) Size(0x20) ]
	struct AActor* BP_StaticFindObjectFast(struct UObject* ActorClass, struct FString ActorName);

	// Object: Function DFMGameHud.AbilityEngineerVehicleHudView.BP_OnOwnerOperaterBeDamaged
	// Flags: [Event|Public|HasOutParms|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(2) Size(0xD8) ]
	void BP_OnOwnerOperaterBeDamaged(float Damage, const struct FTakeHitInfo& TakeHitInfo);

	// Object: Function DFMGameHud.AbilityEngineerVehicleHudView.BP_OnEnginVehicleLowPower
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_OnEnginVehicleLowPower();

	// Object: Function DFMGameHud.AbilityEngineerVehicleHudView.BP_OnEnginVehicleDestroy
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_OnEnginVehicleDestroy();
};

// Object: Class DFMGameHud.AbilityLockerItemBase
// Size: 0x300 (Inherited: 0x2F8)
struct UAbilityLockerItemBase : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UAbilityLockerItemBase, "AbilityLockerItemBase")

	struct UGPAbilityLockerDataBase* Data; // 0x2F8(0x8)
};

// Object: Class DFMGameHud.AbilityLockerCommonItem
// Size: 0x340 (Inherited: 0x300)
struct UAbilityLockerCommonItem : UAbilityLockerItemBase
{
	DEFINE_UE_CLASS_HELPERS(UAbilityLockerCommonItem, "AbilityLockerCommonItem")

	struct UWidgetAnimation* StartLock; // 0x300(0x8)
	struct UWidgetAnimation* LockEnd; // 0x308(0x8)
	struct UUserWidget* WBP_SpecialAiming_mark; // 0x310(0x8)
	struct AActor* Target; // 0x318(0x8)
	uint8_t Pad_0x320[0x10]; // 0x320(0x10)
	struct UGPAbilityCommonLockerData* LockerData; // 0x330(0x8)
	uint8_t Pad_0x338[0x8]; // 0x338(0x8)
};

// Object: Class DFMGameHud.AbilityLockerLaserPointerItem
// Size: 0x340 (Inherited: 0x300)
struct UAbilityLockerLaserPointerItem : UAbilityLockerItemBase
{
	DEFINE_UE_CLASS_HELPERS(UAbilityLockerLaserPointerItem, "AbilityLockerLaserPointerItem")

	struct UWidgetAnimation* StartLock; // 0x300(0x8)
	struct UWidgetAnimation* LockEnd; // 0x308(0x8)
	struct UUserWidget* WBP_SpecialAiming_mark; // 0x310(0x8)
	struct AActor* Target; // 0x318(0x8)
	uint8_t Pad_0x320[0x10]; // 0x320(0x10)
	struct UGPAbilityLaserPointerLockerData* LockerData; // 0x330(0x8)
	uint8_t Pad_0x338[0x8]; // 0x338(0x8)
};

// Object: Class DFMGameHud.AbilityLockerView
// Size: 0x4E8 (Inherited: 0x3F0)
struct UAbilityLockerView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UAbilityLockerView, "AbilityLockerView")

	struct UCanvasPanel* MarkerCanvas; // 0x3F0(0x8)
	struct TMap<EGPAbilityLockerType, struct FGameMarkerPool2> MarkerUsingPool; // 0x3F8(0x50)
	struct TMap<EGPAbilityLockerType, struct FGameMarkerPool2> MarkerNotUsePool; // 0x448(0x50)
	struct TMap<EGPAbilityLockerType, struct UAbilityLockerItemBase*> MarkerWidgetsMap; // 0x498(0x50)

	// Object: Function DFMGameHud.AbilityLockerView.RemoveWidgetFromUsingPool
	// Flags: [Final|Native|Public]
	// Offset: 0xd503540
	// Params: [ Num(2) Size(0x8) ]
	void RemoveWidgetFromUsingPool(EGPAbilityLockerType MarkerType, int32_t Index);

	// Object: Function DFMGameHud.AbilityLockerView.RemoveWidgetFromNotUsePool
	// Flags: [Final|Native|Public]
	// Offset: 0xd503460
	// Params: [ Num(2) Size(0x8) ]
	void RemoveWidgetFromNotUsePool(EGPAbilityLockerType MarkerType, int32_t Index);

	// Object: Function DFMGameHud.AbilityLockerView.RemoveMarker
	// Flags: [Final|Native|Public]
	// Offset: 0xd50333c
	// Params: [ Num(3) Size(0x11) ]
	void RemoveMarker(EGPAbilityLockerType MarkerType, struct UUserWidget* MarkerToRemove, uint8_t bPlayOutAnim);

	// Object: Function DFMGameHud.AbilityLockerView.RemoveLocker
	// Flags: [Final|Native|Public]
	// Offset: 0xd50325c
	// Params: [ Num(2) Size(0x10) ]
	void RemoveLocker(EGPAbilityLockerType LockerType, struct UUserWidget* MarkerToRemove);

	// Object: Function DFMGameHud.AbilityLockerView.MarkersTick
	// Flags: [Final|Native|Public]
	// Offset: 0xd5031b8
	// Params: [ Num(1) Size(0x4) ]
	void MarkersTick(float InDeltaTime);

	// Object: Function DFMGameHud.AbilityLockerView.AddToUsingPool
	// Flags: [Final|Native|Public]
	// Offset: 0xd5030d8
	// Params: [ Num(2) Size(0x10) ]
	void AddToUsingPool(EGPAbilityLockerType MarkerType, struct UAbilityLockerItemBase* Widget);

	// Object: Function DFMGameHud.AbilityLockerView.AddToNotUsePool
	// Flags: [Final|Native|Public]
	// Offset: 0xd502ff8
	// Params: [ Num(2) Size(0x10) ]
	void AddToNotUsePool(EGPAbilityLockerType MarkerType, struct UAbilityLockerItemBase* Widget);

	// Object: Function DFMGameHud.AbilityLockerView.AddMarker
	// Flags: [Final|Native|Public]
	// Offset: 0xd502f4c
	// Params: [ Num(2) Size(0x10) ]
	struct UAbilityLockerItemBase* AddMarker(EGPAbilityLockerType MarkerType);

	// Object: Function DFMGameHud.AbilityLockerView.AddLocker
	// Flags: [Final|Native|Public]
	// Offset: 0xd502e64
	// Params: [ Num(3) Size(0x18) ]
	struct UUserWidget* AddLocker(EGPAbilityLockerType LockerType, struct UGPAbilityLockerDataBase* Data);
};

// Object: Class DFMGameHud.AbilityRobotMapItemHUDView
// Size: 0x498 (Inherited: 0x468)
struct UAbilityRobotMapItemHUDView : UMapItemHUDView
{
	DEFINE_UE_CLASS_HELPERS(UAbilityRobotMapItemHUDView, "AbilityRobotMapItemHUDView")

	struct UCanvasPanel* DFCanvasPanel_Default; // 0x468(0x8)
	struct UImage* DFMImage_Icon; // 0x470(0x8)
	uint8_t Pad_0x478[0x20]; // 0x478(0x20)
};

// Object: Class DFMGameHud.ActivityDebugHudView
// Size: 0x420 (Inherited: 0x400)
struct UActivityDebugHudView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UActivityDebugHudView, "ActivityDebugHudView")

	struct URichTextBlock* RichTextBlock_CurActivityObjItemInfo; // 0x400(0x8)
	struct URichTextBlock* RichTextBlock_ActivityChangeHistory; // 0x408(0x8)
	struct UDFMPlayerActivityComponent* PlayerActivityComponent; // 0x410(0x8)
	float TickInterval; // 0x418(0x4)
	float TickCountDown; // 0x41C(0x4)

	// Object: Function DFMGameHud.ActivityDebugHudView.OnUpdateGMView
	// Flags: [Final|Native|Public]
	// Offset: 0xd503640
	// Params: [ Num(0) Size(0x0) ]
	void OnUpdateGMView();
};

// Object: Class DFMGameHud.ActorLocationTipsWidget
// Size: 0x2F8 (Inherited: 0x2F8)
struct UActorLocationTipsWidget : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UActorLocationTipsWidget, "ActorLocationTipsWidget")

	// Object: Function DFMGameHud.ActorLocationTipsWidget.UpdateView
	// Flags: [Native|Public]
	// Offset: 0xd5036e4
	// Params: [ Num(1) Size(0x8) ]
	void UpdateView(struct AActor* Actor);

	// Object: Function DFMGameHud.ActorLocationTipsWidget.BP_UpdateView
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x8) ]
	void BP_UpdateView(struct AActor* Actor);
};

// Object: Class DFMGameHud.ActorLocationTipsView
// Size: 0x508 (Inherited: 0x3F0)
struct UActorLocationTipsView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UActorLocationTipsView, "ActorLocationTipsView")

	struct TArray<struct FActorTipsConfig> ActorConfig; // 0x3F0(0x10)
	struct UCanvasPanel* RootPanel; // 0x400(0x8)
	uint8_t Pad_0x408[0x50]; // 0x408(0x50)
	struct TMap<struct UObject*, struct UCanvasPanel*> SubPanelMap; // 0x458(0x50)
	uint8_t Pad_0x4A8[0x60]; // 0x4A8(0x60)
};

// Object: Class DFMGameHud.AdjustableMapItemBase
// Size: 0x490 (Inherited: 0x468)
struct UAdjustableMapItemBase : UMapItemHUDView
{
	DEFINE_UE_CLASS_HELPERS(UAdjustableMapItemBase, "AdjustableMapItemBase")

	uint8_t Pad_0x468[0x28]; // 0x468(0x28)

	// Object: Function DFMGameHud.AdjustableMapItemBase.OnMiniMapClipUpdate
	// Flags: [Native|Public|HasOutParms|HasDefaults]
	// Offset: 0xd505fdc
	// Params: [ Num(2) Size(0xC) ]
	void OnMiniMapClipUpdate(const struct FVector2D& MiniMapCenterAbsolutePos, const float& MiniMapPixelRadius);

	// Object: Function DFMGameHud.AdjustableMapItemBase.OnMapCurrentScaleChanged
	// Flags: [Native|Public]
	// Offset: 0xd505eb4
	// Params: [ Num(3) Size(0xC) ]
	void OnMapCurrentScaleChanged(uint8_t bIsBigMap, float CurrentScale, float PixelsPerCentimeter);
};

// Object: Class DFMGameHud.MobileControlPadHudView
// Size: 0x488 (Inherited: 0x400)
struct UMobileControlPadHudView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UMobileControlPadHudView, "MobileControlPadHudView")

	float TouchAreaOffset; // 0x3FC(0x4)
	struct FName TouchImageName; // 0x400(0x8)
	struct FName RotationLimitImageName; // 0x408(0x8)
	uint8_t bHasRotationLimit : 1; // 0x410(0x1), Mask(0x1)
	uint8_t BitPad_0x414_1 : 7; // 0x414(0x1)
	uint8_t Pad_0x415[0x3]; // 0x415(0x3)
	struct AGPPlayerController* GPPlayerController; // 0x418(0x8)
	struct AGPCharacter* GPCharacter; // 0x420(0x8)
	struct UMobilePlayerInput* MobilePlayerInput; // 0x428(0x8)
	struct UGPInputManager* InputManager; // 0x430(0x8)
	struct UMobileGameHandle* GameHandle; // 0x438(0x8)
	struct UClientControlSetting* CtlSetting; // 0x440(0x8)
	struct UImage* TouchImage; // 0x448(0x8)
	struct UImage* RotationLimitImage; // 0x450(0x8)
	struct AGPCharacter* OldCharacter; // 0x458(0x8)
	uint8_t bOverlapFlag : 1; // 0x460(0x1), Mask(0x1)
	uint8_t BitPad_0x460_1 : 7; // 0x460(0x1)
	uint8_t Pad_0x461[0x27]; // 0x461(0x27)

	// Object: Function DFMGameHud.MobileControlPadHudView.SetFingerIndex
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xd61c4b8
	// Params: [ Num(1) Size(0x70) ]
	void SetFingerIndex(const struct FPointerEvent& InTouchEvent);

	// Object: Function DFMGameHud.MobileControlPadHudView.OnTouchFingerStatusChangedEvent
	// Flags: [Native|Public|HasDefaults]
	// Offset: 0xeffa160
	// Params: [ Num(3) Size(0xC) ]
	void OnTouchFingerStatusChangedEvent(EMobileControlButtonType ControlButtonType, EMobileTouchType TouchType, struct FVector2D Location);

	// Object: Function DFMGameHud.MobileControlPadHudView.OnHUDShowCompletedAtStartInGame
	// Flags: [Native|Public]
	// Offset: 0xf7d3b68
	// Params: [ Num(0) Size(0x0) ]
	void OnHUDShowCompletedAtStartInGame();

	// Object: Function DFMGameHud.MobileControlPadHudView.OnControllerUnPossessPawn
	// Flags: [Final|Native|Public]
	// Offset: 0xd61c414
	// Params: [ Num(1) Size(0x8) ]
	void OnControllerUnPossessPawn(struct APlayerController* Controller);

	// Object: Function DFMGameHud.MobileControlPadHudView.OnControllerPossessPawn
	// Flags: [Final|Native|Public]
	// Offset: 0xd61c338
	// Params: [ Num(2) Size(0x10) ]
	void OnControllerPossessPawn(struct APlayerController* Controller, struct APawn* Pawn);

	// Object: Function DFMGameHud.MobileControlPadHudView.OnControlButtonReleased
	// Flags: [Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xd61c290
	// Params: [ Num(1) Size(0x8) ]
	void OnControlButtonReleased(struct FVector2D Location);

	// Object: Function DFMGameHud.MobileControlPadHudView.OnControlButtonPressed
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xd61c274
	// Params: [ Num(0) Size(0x0) ]
	void OnControlButtonPressed();

	// Object: Function DFMGameHud.MobileControlPadHudView.GetTouchPixelPositionByTouchEvent
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xd61c110
	// Params: [ Num(2) Size(0x78) ]
	struct FVector2D GetTouchPixelPositionByTouchEvent(const struct FPointerEvent& InTouchEvent);

	// Object: Function DFMGameHud.MobileControlPadHudView.GetClientControlSetting
	// Flags: [Final|Native|Public]
	// Offset: 0xd61c0dc
	// Params: [ Num(1) Size(0x8) ]
	struct UClientControlSetting* GetClientControlSetting();

	// Object: Function DFMGameHud.MobileControlPadHudView.CheckIfInRectangleWidget
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xd61bff4
	// Params: [ Num(3) Size(0x11) ]
	uint8_t CheckIfInRectangleWidget(struct UWidget* CheckWidget, struct FVector2D TouchLocation);

	// Object: Function DFMGameHud.MobileControlPadHudView.CheckIfInCircleWidget
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0xd61bf0c
	// Params: [ Num(3) Size(0x11) ]
	uint8_t CheckIfInCircleWidget(struct UWidget* CheckWidget, struct FVector2D TouchLocation);
};

// Object: Class DFMGameHud.AILabDebugNewHudView
// Size: 0x490 (Inherited: 0x488)
struct UAILabDebugNewHudView : UMobileControlPadHudView
{
	DEFINE_UE_CLASS_HELPERS(UAILabDebugNewHudView, "AILabDebugNewHudView")

	struct UAILabOBTeamItemView* AILabDeTeamItem; // 0x488(0x8)

	// Object: Function DFMGameHud.AILabDebugNewHudView.OnUinInfoChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd5061a4
	// Params: [ Num(0) Size(0x0) ]
	void OnUinInfoChanged();
};

// Object: Class DFMGameHud.AILabDebugView
// Size: 0x450 (Inherited: 0x448)
struct UAILabDebugView : UMobileGamePadView
{
	DEFINE_UE_CLASS_HELPERS(UAILabDebugView, "AILabDebugView")

	struct UAILabOBTeamItemView* AILabDeTeamItem; // 0x448(0x8)

	// Object: Function DFMGameHud.AILabDebugView.OnUinInfoChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd5061c0
	// Params: [ Num(0) Size(0x0) ]
	void OnUinInfoChanged();
};

// Object: Class DFMGameHud.AILabOBHudView
// Size: 0x4F8 (Inherited: 0x3F0)
struct UAILabOBHudView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UAILabOBHudView, "AILabOBHudView")

	struct UAILabOBTeamItemView* AILabTeamItem_00; // 0x3F0(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_01; // 0x3F8(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_02; // 0x400(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_03; // 0x408(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_10; // 0x410(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_11; // 0x418(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_12; // 0x420(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_13; // 0x428(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_20; // 0x430(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_21; // 0x438(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_22; // 0x440(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_23; // 0x448(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_30; // 0x450(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_31; // 0x458(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_32; // 0x460(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_33; // 0x468(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem; // 0x470(0x8)
	struct UAILabOBTeamItemView* AITeamItem; // 0x478(0x8)
	struct UAILabOBTeamItemView* AILabControlTeamItem; // 0x480(0x8)
	struct UAILabStyleView* AILabStyleItem; // 0x488(0x8)
	struct TArray<struct UAILabOBTeamItemView*> AllPlayerTeamInfo; // 0x490(0x10)
	uint8_t Pad_0x4A0[0x28]; // 0x4A0(0x28)
	struct FString CurrentSpectatorName; // 0x4C8(0x10)
	struct FString CurrentSpectatorUin; // 0x4D8(0x10)
	struct TArray<struct ADFMCharacter*> AllClientCharacters; // 0x4E8(0x10)

	// Object: Function DFMGameHud.AILabOBHudView.OnSpectateBriefInfoChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd50622c
	// Params: [ Num(0) Size(0x0) ]
	void OnSpectateBriefInfoChanged();

	// Object: Function DFMGameHud.AILabOBHudView.OnSpectateBriefInfoArrived
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void OnSpectateBriefInfoArrived();

	// Object: Function DFMGameHud.AILabOBHudView.OnRightClicked
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd506218
	// Params: [ Num(0) Size(0x0) ]
	void OnRightClicked();

	// Object: Function DFMGameHud.AILabOBHudView.OnLeftClicked
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd506204
	// Params: [ Num(0) Size(0x0) ]
	void OnLeftClicked();

	// Object: Function DFMGameHud.AILabOBHudView.OnExitClicked
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd5061f0
	// Params: [ Num(0) Size(0x0) ]
	void OnExitClicked();

	// Object: Function DFMGameHud.AILabOBHudView.OnCurrentSpectateBriefInfoChanged
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void OnCurrentSpectateBriefInfoChanged();

	// Object: Function DFMGameHud.AILabOBHudView.GetDataFromServer
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd5061dc
	// Params: [ Num(0) Size(0x0) ]
	void GetDataFromServer();
};

// Object: Class DFMGameHud.AILabOBNewHudView
// Size: 0x508 (Inherited: 0x400)
struct UAILabOBNewHudView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UAILabOBNewHudView, "AILabOBNewHudView")

	struct UAILabOBTeamItemView* AILabTeamItem_00; // 0x400(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_01; // 0x408(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_02; // 0x410(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_03; // 0x418(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_10; // 0x420(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_11; // 0x428(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_12; // 0x430(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_13; // 0x438(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_20; // 0x440(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_21; // 0x448(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_22; // 0x450(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_23; // 0x458(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_30; // 0x460(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_31; // 0x468(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_32; // 0x470(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem_33; // 0x478(0x8)
	struct UAILabOBTeamItemView* AILabTeamItem; // 0x480(0x8)
	struct UAILabOBTeamItemView* AITeamItem; // 0x488(0x8)
	struct UAILabOBTeamItemView* AILabControlTeamItem; // 0x490(0x8)
	struct UAILabStyleView* AILabStyleItem; // 0x498(0x8)
	struct TArray<struct UAILabOBTeamItemView*> AllPlayerTeamInfo; // 0x4A0(0x10)
	uint8_t Pad_0x4B0[0x28]; // 0x4B0(0x28)
	struct FString CurrentSpectatorName; // 0x4D8(0x10)
	struct FString CurrentSpectatorUin; // 0x4E8(0x10)
	struct TArray<struct ADFMCharacter*> AllClientCharacters; // 0x4F8(0x10)

	// Object: Function DFMGameHud.AILabOBNewHudView.OnSpectateBriefInfoChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd5063f8
	// Params: [ Num(0) Size(0x0) ]
	void OnSpectateBriefInfoChanged();

	// Object: Function DFMGameHud.AILabOBNewHudView.OnSpectateBriefInfoArrived
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void OnSpectateBriefInfoArrived();

	// Object: Function DFMGameHud.AILabOBNewHudView.OnRightClicked
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd5063e4
	// Params: [ Num(0) Size(0x0) ]
	void OnRightClicked();

	// Object: Function DFMGameHud.AILabOBNewHudView.OnLeftClicked
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd5063d0
	// Params: [ Num(0) Size(0x0) ]
	void OnLeftClicked();

	// Object: Function DFMGameHud.AILabOBNewHudView.OnExitClicked
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd5063bc
	// Params: [ Num(0) Size(0x0) ]
	void OnExitClicked();

	// Object: Function DFMGameHud.AILabOBNewHudView.OnCurrentSpectateBriefInfoChanged
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void OnCurrentSpectateBriefInfoChanged();

	// Object: Function DFMGameHud.AILabOBNewHudView.GetDataFromServer
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd5063a8
	// Params: [ Num(0) Size(0x0) ]
	void GetDataFromServer();
};

// Object: Class DFMGameHud.AILabOBTeamItemView
// Size: 0x340 (Inherited: 0x2F8)
struct UAILabOBTeamItemView : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UAILabOBTeamItemView, "AILabOBTeamItemView")

	struct UComboBoxString* ComboBoxString_Team; // 0x2F8(0x8)
	struct UAILabOBHudView* ParentWidget; // 0x300(0x8)
	struct UAILabOBNewHudView* NewParentWidget; // 0x308(0x8)
	int32_t MyTeamID; // 0x310(0x4)
	int32_t CampId; // 0x314(0x4)
	struct TArray<struct FSpectatorBriefInfo> AllBriefInfo; // 0x318(0x10)
	struct TArray<struct FString> DropDownListItem; // 0x328(0x10)
	uint8_t Pad_0x338[0x4]; // 0x338(0x4)
	int32_t Uin; // 0x33C(0x4)

	// Object: Function DFMGameHud.AILabOBTeamItemView.OnUinClicked
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd5066b4
	// Params: [ Num(1) Size(0x10) ]
	void OnUinClicked(struct FString Value);

	// Object: Function DFMGameHud.AILabOBTeamItemView.OnItemClicked
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd5065bc
	// Params: [ Num(1) Size(0x10) ]
	void OnItemClicked(struct FString Value);

	// Object: Function DFMGameHud.AILabOBTeamItemView.OnControlItemClicked
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd5064c4
	// Params: [ Num(1) Size(0x10) ]
	void OnControlItemClicked(struct FString Value);
};

// Object: Class DFMGameHud.AILabStyleView
// Size: 0x328 (Inherited: 0x2F8)
struct UAILabStyleView : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UAILabStyleView, "AILabStyleView")

	struct UComboBoxString* ComboBoxString_Team; // 0x2F8(0x8)
	struct UAILabOBHudView* ParentWidget; // 0x300(0x8)
	struct UAILabOBNewHudView* NewParentWidget; // 0x308(0x8)
	int32_t Style; // 0x310(0x4)
	uint8_t Pad_0x314[0x4]; // 0x314(0x4)
	struct TArray<struct FString> DropDownListItem; // 0x318(0x10)

	// Object: Function DFMGameHud.AILabStyleView.OnItemClicked
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd5067b4
	// Params: [ Num(1) Size(0x10) ]
	void OnItemClicked(struct FString Value);
};

// Object: Class DFMGameHud.AIMsgHUDView
// Size: 0x4C8 (Inherited: 0x3F0)
struct UAIMsgHUDView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UAIMsgHUDView, "AIMsgHUDView")

	struct UAIMsgVisionDirWidget* VisionDirMsgWidget; // 0x3F0(0x8)
	float SafeRatio; // 0x3F8(0x4)
	float AlertMsgLastTime; // 0x3FC(0x4)
	float FightMsgLastTime; // 0x400(0x4)
	uint8_t Pad_0x404[0x4]; // 0x404(0x4)
	struct UCanvasPanel* ViewPanel; // 0x408(0x8)
	struct TMap<struct ADFMCharacter*, struct FAIMsgWidgets> AIMsgMap; // 0x410(0x50)
	struct UDFMCharacterAmbientAudioFSM* DFMCharacterAmbientAudioFSM; // 0x460(0x8)
	struct UDFMProcessAIMsgComponent* ProcessAIMsgComponent; // 0x468(0x8)
	uint8_t Pad_0x470[0x8]; // 0x470(0x8)
	struct TMap<struct ADFMCharacter*, struct UPlayerMarkerAIMakerWidget*> AIMarkerMap; // 0x478(0x50)

	// Object: Function DFMGameHud.AIMsgHUDView.PlayerControllerChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd506bec
	// Params: [ Num(1) Size(0x8) ]
	void PlayerControllerChanged(struct APlayerController* NewController);

	// Object: Function DFMGameHud.AIMsgHUDView.OnCharacterBeHit
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd506a58
	// Params: [ Num(2) Size(0xD8) ]
	void OnCharacterBeHit(float Damage, const struct FTakeHitInfo& TakeHitInfo);

	// Object: Function DFMGameHud.AIMsgHUDView.HUDProcessAIMsg
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd5068e4
	// Params: [ Num(4) Size(0x18) ]
	void HUDProcessAIMsg(struct ADFMCharacter* AICharacter, EAIMsgType MsgType, uint8_t bAIFocusOnMe, const struct FAIMsgExtendInfo& AIMsgExtendInfo);
};

// Object: Class DFMGameHud.AIMsgWidgetBase
// Size: 0x300 (Inherited: 0x2F8)
struct UAIMsgWidgetBase : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UAIMsgWidgetBase, "AIMsgWidgetBase")

	uint8_t bCurrentCanRemove : 1; // 0x2F8(0x1), Mask(0x1)
	uint8_t BitPad_0x2F8_1 : 7; // 0x2F8(0x1)
	uint8_t bInFightStatus : 1; // 0x2F9(0x1), Mask(0x1)
	uint8_t BitPad_0x2F9_1 : 7; // 0x2F9(0x1)
	uint8_t Pad_0x2FA[0x6]; // 0x2FA(0x6)

	// Object: Function DFMGameHud.AIMsgWidgetBase.BPStartRemoveMsgWidget
	// Flags: [Native|Event|Public|BlueprintEvent]
	// Offset: 0xd506f0c
	// Params: [ Num(1) Size(0x1) ]
	void BPStartRemoveMsgWidget(uint8_t bIsFight);
};

// Object: Class DFMGameHud.AIMsgMarkWidget
// Size: 0x310 (Inherited: 0x300)
struct UAIMsgMarkWidget : UAIMsgWidgetBase
{
	DEFINE_UE_CLASS_HELPERS(UAIMsgMarkWidget, "AIMsgMarkWidget")

	struct UCanvasPanel* ArrowRotation; // 0x300(0x8)
	struct UImage* Exclamation; // 0x308(0x8)

	// Object: Function DFMGameHud.AIMsgMarkWidget.UpdateMsgMarkColor
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void UpdateMsgMarkColor(EAIMsgType AIMsgType);

	// Object: Function DFMGameHud.AIMsgMarkWidget.UpdateAppearance
	// Flags: [Native|Event|Public|HasDefaults|BlueprintEvent]
	// Offset: 0xd506ca4
	// Params: [ Num(3) Size(0x10) ]
	void UpdateAppearance(uint8_t bOutScreen, struct FVector2D ExclamationScale, float Angle);
};

// Object: Class DFMGameHud.AIMsgVisionDirWidget
// Size: 0x300 (Inherited: 0x300)
struct UAIMsgVisionDirWidget : UAIMsgWidgetBase
{
	DEFINE_UE_CLASS_HELPERS(UAIMsgVisionDirWidget, "AIMsgVisionDirWidget")
};

// Object: Class DFMGameHud.AlliesIconHUDView
// Size: 0x470 (Inherited: 0x468)
struct UAlliesIconHUDView : UMapItemHUDView
{
	DEFINE_UE_CLASS_HELPERS(UAlliesIconHUDView, "AlliesIconHUDView")

	struct UWidgetSwitcher* AllySwitcher; // 0x468(0x8)
};

// Object: Class DFMGameHud.AmmoAddTips
// Size: 0x480 (Inherited: 0x3F0)
struct UAmmoAddTips : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UAmmoAddTips, "AmmoAddTips")

	struct UImage* Image; // 0x3F0(0x8)
	struct UImage* Image_1; // 0x3F8(0x8)
	struct UImage* Image_2; // 0x400(0x8)
	struct UImage* Image_3; // 0x408(0x8)
	struct UImage* Image_4; // 0x410(0x8)
	struct UImage* Image_5; // 0x418(0x8)
	struct URichTextBlock* wRichText_1; // 0x420(0x8)
	struct URichTextBlock* wRichText_2; // 0x428(0x8)
	struct URichTextBlock* wRichText_3; // 0x430(0x8)
	struct URichTextBlock* wRichText_4; // 0x438(0x8)
	struct URichTextBlock* wRichText_5; // 0x440(0x8)
	struct URichTextBlock* wRichText_6; // 0x448(0x8)
	struct UCanvasPanel* CanvasPanel_0; // 0x450(0x8)
	struct UWidgetAnimation* WeaponAnimIn; // 0x458(0x8)
	struct UWidgetAnimation* WeaponAnimOut; // 0x460(0x8)
	uint8_t Pad_0x468[0x8]; // 0x468(0x8)
	struct TArray<struct FLinearColor> BulletColorByLevel; // 0x470(0x10)

	// Object: Function DFMGameHud.AmmoAddTips.OnShowTips
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd506ff8
	// Params: [ Num(1) Size(0x10) ]
	void OnShowTips(const struct TArray<int32_t>& BulletLevelArray);
};

// Object: Class DFMGameHud.DFControllerRouletteBase
// Size: 0x480 (Inherited: 0x3F0)
struct UDFControllerRouletteBase : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UDFControllerRouletteBase, "DFControllerRouletteBase")

	struct TArray<EGameHUDSate> UnfocusingGameHUDStates; // 0x3F0(0x10)
	float RouletteInnerRadius; // 0x400(0x4)
	float RouletteOuterRadius; // 0x404(0x4)
	float LongPressTime; // 0x408(0x4)
	int32_t PressedMovePixelTolerance; // 0x40C(0x4)
	float RouletteInnerMouseBlockRadius; // 0x410(0x4)
	float RouletteInnerRadius_HD; // 0x414(0x4)
	float RouletteOuterRadius_HD; // 0x418(0x4)
	float LongPressTime_HD; // 0x41C(0x4)
	int32_t PressedMovePixelTolerance_HD; // 0x420(0x4)
	int32_t RouletteNum; // 0x424(0x4)
	float RouletteStartAngle; // 0x428(0x4)
	EDFRouletteType RouletteType; // 0x42C(0x1)
	uint8_t RouletteActivateType; // 0x42D(0x1)
	uint8_t Pad_0x42E[0x2]; // 0x42E(0x2)
	float DeltaPieceAngle; // 0x430(0x4)
	uint8_t bWaitingPressedMove : 1; // 0x434(0x1), Mask(0x1)
	uint8_t BitPad_0x434_1 : 7; // 0x434(0x1)
	uint8_t Pad_0x435[0x3]; // 0x435(0x3)
	struct FVector2D PressedStartPosition; // 0x438(0x8)
	uint8_t bDragging : 1; // 0x440(0x1), Mask(0x1)
	uint8_t BitPad_0x440_1 : 7; // 0x440(0x1)
	uint8_t Pad_0x441[0x3]; // 0x441(0x3)
	struct FVector2D CurPressedPosition; // 0x444(0x8)
	float RadiusFactor; // 0x44C(0x4)
	int32_t RouletteIndex; // 0x450(0x4)
	struct FVector2D DynamicCenter; // 0x454(0x8)
	uint8_t Pad_0x45C[0x4]; // 0x45C(0x4)
	struct FTimerHandle LongPressTimerHandle; // 0x460(0x8)
	struct FVector2D GamepadStickOffset; // 0x468(0x8)
	uint8_t bShouldKeepSelected_Gamepad : 1; // 0x470(0x1), Mask(0x1)
	uint8_t BitPad_0x470_1 : 7; // 0x470(0x1)
	uint8_t Pad_0x471[0x3]; // 0x471(0x3)
	float MovedAngleOffset_Gamepad; // 0x474(0x4)
	struct UCommonRouletteInfoView* CommonRouletteInfoView; // 0x478(0x8)

	// Object: Function DFMGameHud.DFControllerRouletteBase.UpdateDragOffsetGamepad
	// Flags: [Final|Native|Public]
	// Offset: 0xd53d074
	// Params: [ Num(0) Size(0x0) ]
	void UpdateDragOffsetGamepad();

	// Object: Function DFMGameHud.DFControllerRouletteBase.UpdateDragOffset
	// Flags: [Final|Native|Public]
	// Offset: 0xd53d060
	// Params: [ Num(0) Size(0x0) ]
	void UpdateDragOffset();

	// Object: Function DFMGameHud.DFControllerRouletteBase.UpdateCommandRadius
	// Flags: [Final|Native|Public]
	// Offset: 0xd53d04c
	// Params: [ Num(0) Size(0x0) ]
	void UpdateCommandRadius();

	// Object: Function DFMGameHud.DFControllerRouletteBase.TryDeactivateRoulette
	// Flags: [Final|Native|Public]
	// Offset: 0xd53cfa0
	// Params: [ Num(1) Size(0x1) ]
	void TryDeactivateRoulette(uint8_t bApplySelected);

	// Object: Function DFMGameHud.DFControllerRouletteBase.TryActivateRoulette
	// Flags: [Final|Native|Public]
	// Offset: 0xd53cf8c
	// Params: [ Num(0) Size(0x0) ]
	void TryActivateRoulette();

	// Object: Function DFMGameHud.DFControllerRouletteBase.ToggleDragState
	// Flags: [Final|Native|Public]
	// Offset: 0xd53cee0
	// Params: [ Num(1) Size(0x1) ]
	void ToggleDragState(uint8_t InbDragging);

	// Object: Function DFMGameHud.DFControllerRouletteBase.StartLongPressTimer
	// Flags: [Final|Native|Public]
	// Offset: 0xd53cecc
	// Params: [ Num(0) Size(0x0) ]
	void StartLongPressTimer();

	// Object: Function DFMGameHud.DFControllerRouletteBase.ShowRoulettePanel
	// Flags: [Final|Native|Public]
	// Offset: 0xd53ceb8
	// Params: [ Num(0) Size(0x0) ]
	void ShowRoulettePanel();

	// Object: Function DFMGameHud.DFControllerRouletteBase.SetRouletteType
	// Flags: [Final|Native|Public]
	// Offset: 0xd53cdd8
	// Params: [ Num(2) Size(0x2) ]
	void SetRouletteType(EDFRouletteType InRouletteType, uint8_t InRouletteActivateType);

	// Object: Function DFMGameHud.DFControllerRouletteBase.SetCommonRouletteInfoView
	// Flags: [Final|Native|Public]
	// Offset: 0xd53cd34
	// Params: [ Num(1) Size(0x8) ]
	void SetCommonRouletteInfoView(struct UCommonRouletteInfoView* InfoView);

	// Object: Function DFMGameHud.DFControllerRouletteBase.ReleaseLongPressTimer
	// Flags: [Final|Native|Public]
	// Offset: 0xd53cd20
	// Params: [ Num(0) Size(0x0) ]
	void ReleaseLongPressTimer();

	// Object: Function DFMGameHud.DFControllerRouletteBase.OnUpdateDragOffset
	// Flags: [Native|Public|HasDefaults]
	// Offset: 0xd53cc04
	// Params: [ Num(3) Size(0x10) ]
	void OnUpdateDragOffset(struct FVector2D InDirVector, float InRadiusFactor, float InAngle);

	// Object: Function DFMGameHud.DFControllerRouletteBase.OnShowRoulettePanel
	// Flags: [Native|Public]
	// Offset: 0xd53cbe8
	// Params: [ Num(0) Size(0x0) ]
	void OnShowRoulettePanel();

	// Object: Function DFMGameHud.DFControllerRouletteBase.OnProcessRouletteOperationY
	// Flags: [Final|Native|Public]
	// Offset: 0xd53cb44
	// Params: [ Num(1) Size(0x4) ]
	void OnProcessRouletteOperationY(float Value);

	// Object: Function DFMGameHud.DFControllerRouletteBase.OnProcessRouletteOperationX
	// Flags: [Final|Native|Public]
	// Offset: 0xd53caa0
	// Params: [ Num(1) Size(0x4) ]
	void OnProcessRouletteOperationX(float Value);

	// Object: Function DFMGameHud.DFControllerRouletteBase.OnLongPressTimeOut
	// Flags: [Final|Native|Public]
	// Offset: 0xd53ca8c
	// Params: [ Num(0) Size(0x0) ]
	void OnLongPressTimeOut();

	// Object: Function DFMGameHud.DFControllerRouletteBase.OnInputTypeChanged
	// Flags: [Native|Public]
	// Offset: 0xd53c9e0
	// Params: [ Num(1) Size(0x1) ]
	void OnInputTypeChanged(EGPInputType InputType);

	// Object: Function DFMGameHud.DFControllerRouletteBase.OnInputModeChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd53c900
	// Params: [ Num(2) Size(0x2) ]
	void OnInputModeChanged(EGPInputModeType OldType, EGPInputModeType NewType);

	// Object: Function DFMGameHud.DFControllerRouletteBase.OnHideRoulettePanel
	// Flags: [Native|Public]
	// Offset: 0xd53c8e4
	// Params: [ Num(0) Size(0x0) ]
	void OnHideRoulettePanel();

	// Object: Function DFMGameHud.DFControllerRouletteBase.OnGameHudStateAdded
	// Flags: [Native|Public]
	// Offset: 0xd53c838
	// Params: [ Num(1) Size(0x1) ]
	void OnGameHudStateAdded(EGameHUDSate State);

	// Object: Function DFMGameHud.DFControllerRouletteBase.OnDragEnd
	// Flags: [Native|Public]
	// Offset: 0xd53c81c
	// Params: [ Num(0) Size(0x0) ]
	void OnDragEnd();

	// Object: Function DFMGameHud.DFControllerRouletteBase.OnAddUnfocusingGameHUDState
	// Flags: [Native|Public]
	// Offset: 0xd53c770
	// Params: [ Num(1) Size(0x1) ]
	void OnAddUnfocusingGameHUDState(EGameHUDSate AddState);

	// Object: Function DFMGameHud.DFControllerRouletteBase.IsActivatedImmediately
	// Flags: [Native|Public]
	// Offset: 0xd53c730
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsActivatedImmediately();

	// Object: Function DFMGameHud.DFControllerRouletteBase.IsActivatedByPressedMove
	// Flags: [Native|Public]
	// Offset: 0xd53c6f0
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsActivatedByPressedMove();

	// Object: Function DFMGameHud.DFControllerRouletteBase.IsActivatedByLongPressed
	// Flags: [Native|Public]
	// Offset: 0xd53c6b0
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsActivatedByLongPressed();

	// Object: Function DFMGameHud.DFControllerRouletteBase.HideRoulettePanel
	// Flags: [Final|Native|Public]
	// Offset: 0xd53c69c
	// Params: [ Num(0) Size(0x0) ]
	void HideRoulettePanel();

	// Object: Function DFMGameHud.DFControllerRouletteBase.GetPressedStartLocation
	// Flags: [Native|Public|HasDefaults]
	// Offset: 0xd53c660
	// Params: [ Num(1) Size(0x8) ]
	struct FVector2D GetPressedStartLocation();

	// Object: Function DFMGameHud.DFControllerRouletteBase.GetMobileCurPressedLocation
	// Flags: [Native|Public|HasDefaults]
	// Offset: 0xd53c624
	// Params: [ Num(1) Size(0x8) ]
	struct FVector2D GetMobileCurPressedLocation();

	// Object: Function DFMGameHud.DFControllerRouletteBase.GetLongPressTime
	// Flags: [Final|Native|Public]
	// Offset: 0xd53c5f0
	// Params: [ Num(1) Size(0x4) ]
	float GetLongPressTime();

	// Object: Function DFMGameHud.DFControllerRouletteBase.GetCurPressedLocation
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xd53c5bc
	// Params: [ Num(1) Size(0x8) ]
	struct FVector2D GetCurPressedLocation();

	// Object: Function DFMGameHud.DFControllerRouletteBase.DrawDebugImage
	// Flags: [Final|Native|Public|HasOutParms|Const]
	// Offset: 0xd53c504
	// Params: [ Num(1) Size(0x30) ]
	void DrawDebugImage(struct FPaintContext& PaintContext);

	// Object: Function DFMGameHud.DFControllerRouletteBase.CalculateAngle
	// Flags: [Final|Native|Static|Public|HasDefaults]
	// Offset: 0xd53c42c
	// Params: [ Num(3) Size(0x14) ]
	static float CalculateAngle(struct FVector2D InVectorA, struct FVector2D InVectorB);
};

// Object: Class DFMGameHud.AmmoRouletteHDHUDView
// Size: 0x598 (Inherited: 0x480)
struct UAmmoRouletteHDHUDView : UDFControllerRouletteBase
{
	DEFINE_UE_CLASS_HELPERS(UAmmoRouletteHDHUDView, "AmmoRouletteHDHUDView")

	struct UDFMWeaponDataComponentAmmo_Item* DCAmmo_Item; // 0x480(0x8)
	struct TArray<struct FInventoryItemInfo> AmmoSortedList; // 0x488(0x10)
	struct UReloadRouletteItemView* WBP_ReloadRouletteItem_New_0; // 0x498(0x8)
	struct UReloadRouletteItemView* WBP_ReloadRouletteItem_New_1; // 0x4A0(0x8)
	struct UReloadRouletteItemView* WBP_ReloadRouletteItem_New_2; // 0x4A8(0x8)
	struct UReloadRouletteItemView* WBP_ReloadRouletteItem_New_3; // 0x4B0(0x8)
	struct UReloadRouletteItemView* WBP_ReloadRouletteItem_New_4; // 0x4B8(0x8)
	struct UUserWidget* WBP_ReloadRouletteText_New_0; // 0x4C0(0x8)
	struct UUserWidget* WBP_ReloadRouletteText_New_1; // 0x4C8(0x8)
	struct UUserWidget* WBP_ReloadRouletteText_New_2; // 0x4D0(0x8)
	struct UUserWidget* WBP_ReloadRouletteText_New_3; // 0x4D8(0x8)
	struct UUserWidget* WBP_ReloadRouletteText_New_4; // 0x4E0(0x8)
	struct UTextBlock* wtCenterText; // 0x4E8(0x8)
	struct UDFHorizontalBox* DFHorizontalBox_UseKeyTip; // 0x4F0(0x8)
	struct UImage* SelectedImg; // 0x4F8(0x8)
	struct UImage* SliderImg; // 0x500(0x8)
	struct UImage* TouchPoint; // 0x508(0x8)
	struct UImage* DebugTouchPoint; // 0x510(0x8)
	uint8_t bEnableDebugPoint : 1; // 0x518(0x1), Mask(0x1)
	uint8_t BitPad_0x518_1 : 7; // 0x518(0x1)
	uint8_t Pad_0x519[0x7]; // 0x519(0x7)
	struct UGPInputReloadLogic* ReloadLogic; // 0x520(0x8)
	uint8_t bPressedCancelRouletteInCurPressing : 1; // 0x528(0x1), Mask(0x1)
	uint8_t BitPad_0x528_1 : 7; // 0x528(0x1)
	uint8_t bUseRadiusRatio : 1; // 0x529(0x1), Mask(0x1)
	uint8_t BitPad_0x529_1 : 7; // 0x529(0x1)
	uint8_t Pad_0x52A[0x2]; // 0x52A(0x2)
	float ForbidRadiusRatio; // 0x52C(0x4)
	float InnerRadiusRatio; // 0x530(0x4)
	float OuterRadiusRatio; // 0x534(0x4)
	int32_t LastRouletteIndex; // 0x538(0x4)
	int32_t LastSortedAmmoIndex; // 0x53C(0x4)
	struct TArray<struct UUserWidget*> ReloadRouletteTextItems; // 0x540(0x10)
	struct TArray<struct UTextBlock*> ReloadRouletteTexts; // 0x550(0x10)
	struct TArray<struct UDFMImage*> ReloadRouletteImages; // 0x560(0x10)
	struct TArray<struct UReloadRouletteItemView*> ReloadRouletteItems; // 0x570(0x10)
	struct FText AmmoInfoText; // 0x580(0x18)

	// Object: Function DFMGameHud.AmmoRouletteHDHUDView.SetPendingAmmoType
	// Flags: [Final|Native|Public]
	// Offset: 0xd507380
	// Params: [ Num(0) Size(0x0) ]
	void SetPendingAmmoType();

	// Object: Function DFMGameHud.AmmoRouletteHDHUDView.OnSolPreSettlement
	// Flags: [Final|Native|Public]
	// Offset: 0xd50736c
	// Params: [ Num(0) Size(0x0) ]
	void OnSolPreSettlement();

	// Object: Function DFMGameHud.AmmoRouletteHDHUDView.OnReloadBtnUpOrConfirmSelected
	// Flags: [Final|Native|Public]
	// Offset: 0xd507358
	// Params: [ Num(0) Size(0x0) ]
	void OnReloadBtnUpOrConfirmSelected();

	// Object: Function DFMGameHud.AmmoRouletteHDHUDView.OnReloadBtnUp
	// Flags: [Final|Native|Public]
	// Offset: 0xd507344
	// Params: [ Num(0) Size(0x0) ]
	void OnReloadBtnUp();

	// Object: Function DFMGameHud.AmmoRouletteHDHUDView.OnReloadBtnDown
	// Flags: [Final|Native|Public]
	// Offset: 0xd507330
	// Params: [ Num(0) Size(0x0) ]
	void OnReloadBtnDown();

	// Object: Function DFMGameHud.AmmoRouletteHDHUDView.OnConfirmAmmoRouletteBtnDown
	// Flags: [Final|Native|Public]
	// Offset: 0xd50731c
	// Params: [ Num(0) Size(0x0) ]
	void OnConfirmAmmoRouletteBtnDown();

	// Object: Function DFMGameHud.AmmoRouletteHDHUDView.OnClientCharacterDead
	// Flags: [Final|Native|Public]
	// Offset: 0xd507278
	// Params: [ Num(1) Size(0x8) ]
	void OnClientCharacterDead(struct AGPCharacterBase* CHARACTER);

	// Object: Function DFMGameHud.AmmoRouletteHDHUDView.OnCancelAmmoRouletteBtnDown
	// Flags: [Final|Native|Public]
	// Offset: 0xd507264
	// Params: [ Num(0) Size(0x0) ]
	void OnCancelAmmoRouletteBtnDown();

	// Object: Function DFMGameHud.AmmoRouletteHDHUDView.OnActiveWeaponChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd507250
	// Params: [ Num(0) Size(0x0) ]
	void OnActiveWeaponChanged();

	// Object: Function DFMGameHud.AmmoRouletteHDHUDView.InitRouletteItems
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd50719c
	// Params: [ Num(1) Size(0x1) ]
	void InitRouletteItems(uint8_t& bShouldShowPanel);

	// Object: Function DFMGameHud.AmmoRouletteHDHUDView.GetAmmoSortedList
	// Flags: [Final|Native|Public]
	// Offset: 0xd50712c
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<struct FInventoryItemInfo> GetAmmoSortedList();

	// Object: Function DFMGameHud.AmmoRouletteHDHUDView.BP_SetPCType
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetPCType(int32_t InType);
};

// Object: Class DFMGameHud.ReloadRouletteHUDView
// Size: 0x598 (Inherited: 0x3F0)
struct UReloadRouletteHUDView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UReloadRouletteHUDView, "ReloadRouletteHUDView")

	uint8_t Pad_0x3F0[0x8]; // 0x3F0(0x8)
	struct TArray<EGameHUDSate> InvisibleFocusHUDState; // 0x3F8(0x10)
	struct UReloadRouletteItemView* WBP_ReloadRouletteItem; // 0x408(0x8)
	struct UReloadRouletteItemView* WBP_ReloadRouletteItem_1; // 0x410(0x8)
	struct UReloadRouletteItemView* WBP_ReloadRouletteItem_2; // 0x418(0x8)
	struct UReloadRouletteItemView* WBP_ReloadRouletteItem_3; // 0x420(0x8)
	struct UUserWidget* WBP_ReloadRouletteText; // 0x428(0x8)
	struct UUserWidget* WBP_ReloadRouletteText_1; // 0x430(0x8)
	struct UUserWidget* WBP_ReloadRouletteText_2; // 0x438(0x8)
	struct UUserWidget* WBP_ReloadRouletteText_3; // 0x440(0x8)
	struct UTextBlock* wtCenterText; // 0x448(0x8)
	struct UTextBlock* wtSubText; // 0x450(0x8)
	struct UVerticalBox* VerticalBox_1; // 0x458(0x8)
	struct UImage* DFImage_8; // 0x460(0x8)
	struct UImage* TouchPoint; // 0x468(0x8)
	struct UCommonRouletteInfoView* WBP_CommonRouletteInfo; // 0x470(0x8)
	struct UWidgetAnimation* Anim_RotateRight; // 0x478(0x8)
	struct UWidgetAnimation* Anim_RotateLeft; // 0x480(0x8)
	float InnerRadius; // 0x488(0x4)
	float OuterRadius; // 0x48C(0x4)
	uint8_t bEnableDebugView : 1; // 0x490(0x1), Mask(0x1)
	uint8_t BitPad_0x490_1 : 7; // 0x490(0x1)
	uint8_t Pad_0x491[0x7]; // 0x491(0x7)
	struct TMap<int32_t, struct FText> NameTextMap; // 0x498(0x50)
	struct FText CancelText; // 0x4E8(0x18)
	struct FVector2D CurrentCenterPos; // 0x500(0x8)
	struct FVector2D CurrentTouchPointPos; // 0x508(0x8)
	struct UGPInputReloadLogic* ReloadLogic; // 0x510(0x8)
	struct TArray<struct FInventoryItemInfo> AmmoSortedList; // 0x518(0x10)
	struct FText AmmoInfoText; // 0x528(0x18)
	struct TArray<struct UReloadRouletteItemView*> ReloadRouletteItems; // 0x540(0x10)
	struct UDFMWeaponDataComponentAmmo_Item* DCAmmo_Item; // 0x550(0x8)
	struct TArray<struct UUserWidget*> ReloadRouletteTextItems; // 0x558(0x10)
	struct TArray<struct UTextBlock*> ReloadRouletteTexts; // 0x568(0x10)
	struct TArray<struct UDFMImage*> ReloadRouletteImages; // 0x578(0x10)
	uint8_t Pad_0x588[0x10]; // 0x588(0x10)

	// Object: Function DFMGameHud.ReloadRouletteHUDView.OnTouchPointNumChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd507674
	// Params: [ Num(1) Size(0x4) ]
	void OnTouchPointNumChanged(int32_t TouchPointNum);

	// Object: Function DFMGameHud.ReloadRouletteHUDView.OnSolPreSettlement
	// Flags: [Final|Native|Public]
	// Offset: 0xd507660
	// Params: [ Num(0) Size(0x0) ]
	void OnSolPreSettlement();

	// Object: Function DFMGameHud.ReloadRouletteHUDView.OnGameHudStateAdded
	// Flags: [Final|Native|Public]
	// Offset: 0xd5075bc
	// Params: [ Num(1) Size(0x1) ]
	void OnGameHudStateAdded(EGameHUDSate State);

	// Object: Function DFMGameHud.ReloadRouletteHUDView.OnClientPlayerMatchOver
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd507508
	// Params: [ Num(1) Size(0x1) ]
	void OnClientPlayerMatchOver(const EMatchOverReason& MatchOverReason);

	// Object: Function DFMGameHud.ReloadRouletteHUDView.OnClientCharacterDead
	// Flags: [Final|Native|Public]
	// Offset: 0xd507464
	// Params: [ Num(1) Size(0x8) ]
	void OnClientCharacterDead(struct AGPCharacterBase* CHARACTER);

	// Object: Function DFMGameHud.ReloadRouletteHUDView.OnActiveWeaponChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd507450
	// Params: [ Num(0) Size(0x0) ]
	void OnActiveWeaponChanged();

	// Object: Function DFMGameHud.ReloadRouletteHUDView.InitFocusInvisibleHudState
	// Flags: [Final|Native|Public]
	// Offset: 0xd50743c
	// Params: [ Num(0) Size(0x0) ]
	void InitFocusInvisibleHudState();

	// Object: Function DFMGameHud.ReloadRouletteHUDView.BP_SetType
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetType(int32_t InType);
};

// Object: Class DFMGameHud.ReloadRouletteItemView
// Size: 0x2F8 (Inherited: 0x2F8)
struct UReloadRouletteItemView : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UReloadRouletteItemView, "ReloadRouletteItemView")

	// Object: Function DFMGameHud.ReloadRouletteItemView.BPSetType
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(2) Size(0x8) ]
	void BPSetType(uint8_t Selected, int32_t InType);

	// Object: Function DFMGameHud.ReloadRouletteItemView.BPSetSelected
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BPSetSelected(uint8_t Selected);

	// Object: Function DFMGameHud.ReloadRouletteItemView.BPSetAmmoColor
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BPSetAmmoColor(int32_t InType);
};

// Object: Class DFMGameHud.DFMMobileWeaponViewBase
// Size: 0x488 (Inherited: 0x478)
struct UDFMMobileWeaponViewBase : UMobileControlPadView
{
	DEFINE_UE_CLASS_HELPERS(UDFMMobileWeaponViewBase, "DFMMobileWeaponViewBase")

	struct UWeaponHudModel* CurWeaponHudModel; // 0x478(0x8)
	uint8_t Pad_0x480[0x8]; // 0x480(0x8)

	// Object: Function DFMGameHud.DFMMobileWeaponViewBase.OnAmmoCountChanged
	// Flags: [Native|Protected]
	// Offset: 0xd5c3f1c
	// Params: [ Num(0) Size(0x0) ]
	void OnAmmoCountChanged();

	// Object: Function DFMGameHud.DFMMobileWeaponViewBase.OnActiveWeaponChanged
	// Flags: [Native|Protected]
	// Offset: 0xd5c3f00
	// Params: [ Num(0) Size(0x0) ]
	void OnActiveWeaponChanged();
};

// Object: Class DFMGameHud.AmmoStatusHud
// Size: 0x4E0 (Inherited: 0x488)
struct UAmmoStatusHud : UDFMMobileWeaponViewBase
{
	DEFINE_UE_CLASS_HELPERS(UAmmoStatusHud, "AmmoStatusHud")

	struct UCanvasPanel* CanvasPanel_0; // 0x488(0x8)
	struct UDFImage* DFImage_87; // 0x490(0x8)
	struct UTextBlock* TextBlock_48; // 0x498(0x8)
	struct UWidgetAnimation* WeaponAnimLoop; // 0x4A0(0x8)
	uint8_t Pad_0x4A8[0x28]; // 0x4A8(0x28)
	struct TArray<struct FText> TextArray; // 0x4D0(0x10)

	// Object: Function DFMGameHud.AmmoStatusHud.OnWeaponStartFireFailed
	// Flags: [Final|Native|Protected]
	// Offset: 0xd509b10
	// Params: [ Num(1) Size(0x1) ]
	void OnWeaponStartFireFailed(uint8_t Ret);

	// Object: Function DFMGameHud.AmmoStatusHud.BPSetType
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BPSetType(int32_t InType);
};

// Object: Class DFMGameHud.AmmoStatusHudController
// Size: 0x90 (Inherited: 0x80)
struct UAmmoStatusHudController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UAmmoStatusHudController, "AmmoStatusHudController")

	struct UAmmoStatusHudView* CachedView; // 0x80(0x8)
	struct FName AmmoStatusHUDName; // 0x88(0x8)

	// Object: Function DFMGameHud.AmmoStatusHudController.OnWeaponStartFireFailed
	// Flags: [Final|Native|Public]
	// Offset: 0xd509be4
	// Params: [ Num(1) Size(0x1) ]
	void OnWeaponStartFireFailed(uint8_t Ret);

	// Object: Function DFMGameHud.AmmoStatusHudController.OnAmmoCountChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd509bd0
	// Params: [ Num(0) Size(0x0) ]
	void OnAmmoCountChanged();

	// Object: Function DFMGameHud.AmmoStatusHudController.OnActiveWeaponChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd509bbc
	// Params: [ Num(0) Size(0x0) ]
	void OnActiveWeaponChanged();
};

// Object: Class DFMGameHud.AmmoStatusHudView
// Size: 0x4F0 (Inherited: 0x488)
struct UAmmoStatusHudView : UMobileControlPadHudView
{
	DEFINE_UE_CLASS_HELPERS(UAmmoStatusHudView, "AmmoStatusHudView")

	struct UWeaponHudModel* CurWeaponHudModel; // 0x488(0x8)
	struct TWeakObjectPtr<struct AWeaponBase> CurWeapon; // 0x490(0x8)
	struct UCanvasPanel* CanvasPanel_0; // 0x498(0x8)
	struct UDFImage* DFImage_87; // 0x4A0(0x8)
	struct UTextBlock* TextBlock_48; // 0x4A8(0x8)
	struct UWidgetAnimation* WeaponAnimLoop; // 0x4B0(0x8)
	uint8_t Pad_0x4B8[0x20]; // 0x4B8(0x20)
	EWeaponTipsType CurWeaponTipsType; // 0x4D8(0x1)
	uint8_t Pad_0x4D9[0x7]; // 0x4D9(0x7)
	struct TArray<struct FText> TextArray; // 0x4E0(0x10)

	// Object: Function DFMGameHud.AmmoStatusHudView.OnWeaponStartFireFailed
	// Flags: [Final|Native|Public]
	// Offset: 0xf793ae0
	// Params: [ Num(1) Size(0x1) ]
	void OnWeaponStartFireFailed(uint8_t Ret);

	// Object: Function DFMGameHud.AmmoStatusHudView.OnAmmoCountChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xf0ef3c8
	// Params: [ Num(0) Size(0x0) ]
	void OnAmmoCountChanged();

	// Object: Function DFMGameHud.AmmoStatusHudView.OnActiveWeaponChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xf1737a0
	// Params: [ Num(0) Size(0x0) ]
	void OnActiveWeaponChanged();

	// Object: Function DFMGameHud.AmmoStatusHudView.BPSetType
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BPSetType(int32_t InType);
};

// Object: Class DFMGameHud.AnimShowSettings
// Size: 0x48 (Inherited: 0x28)
struct UAnimShowSettings : UObject
{
	DEFINE_UE_CLASS_HELPERS(UAnimShowSettings, "AnimShowSettings")

	uint8_t bShowFPP : 1; // 0x28(0x1), Mask(0x1)
	uint8_t BitPad_0x28_1 : 7; // 0x28(0x1)
	uint8_t bShowTPP : 1; // 0x29(0x1), Mask(0x1)
	uint8_t BitPad_0x29_1 : 7; // 0x29(0x1)
	uint8_t bShowMontage : 1; // 0x2A(0x1), Mask(0x1)
	uint8_t BitPad_0x2A_1 : 7; // 0x2A(0x1)
	uint8_t bShowBSDetail : 1; // 0x2B(0x1), Mask(0x1)
	uint8_t BitPad_0x2B_1 : 7; // 0x2B(0x1)
	uint8_t bShowCurves : 1; // 0x2C(0x1), Mask(0x1)
	uint8_t BitPad_0x2C_1 : 7; // 0x2C(0x1)
	uint8_t bShowVars : 1; // 0x2D(0x1), Mask(0x1)
	uint8_t BitPad_0x2D_1 : 7; // 0x2D(0x1)
	uint8_t bShowEvals : 1; // 0x2E(0x1), Mask(0x1)
	uint8_t BitPad_0x2E_1 : 7; // 0x2E(0x1)
	uint8_t bShowWpn : 1; // 0x2F(0x1), Mask(0x1)
	uint8_t BitPad_0x2F_1 : 7; // 0x2F(0x1)
	uint8_t bShowInput : 1; // 0x30(0x1), Mask(0x1)
	uint8_t BitPad_0x30_1 : 7; // 0x30(0x1)
	uint8_t Pad_0x31[0x7]; // 0x31(0x7)
	struct FString SearchString; // 0x38(0x10)
};

// Object: Class DFMGameHud.AnimDebugLogView
// Size: 0x520 (Inherited: 0x448)
struct UAnimDebugLogView : UMobileGamePadView
{
	DEFINE_UE_CLASS_HELPERS(UAnimDebugLogView, "AnimDebugLogView")

	uint8_t Pad_0x448[0x20]; // 0x448(0x20)
	struct URichTextBlock* RichTextBlockLog; // 0x468(0x8)
	EAnimDebugType DebugType; // 0x470(0x1)
	uint8_t Pad_0x471[0x7]; // 0x471(0x7)
	struct UEditableTextBox* RichTextBlockLogFilterText; // 0x478(0x8)
	struct UEditableTextBox* SearchTextBox; // 0x480(0x8)
	struct UComboBoxString* SelectCharacterCmd; // 0x488(0x8)
	uint8_t Pad_0x490[0x20]; // 0x490(0x20)
	struct UCheckbox* AnimShowFPPCheckBox; // 0x4B0(0x8)
	struct UCheckbox* AnimShowTPPCheckBox; // 0x4B8(0x8)
	struct UCheckbox* AnimShowMontageCheckBox; // 0x4C0(0x8)
	struct UCheckbox* AnimShowBSDetailCheckBox; // 0x4C8(0x8)
	struct UCheckbox* AnimShowCurvesCheckBox; // 0x4D0(0x8)
	struct UCheckbox* AnimShowVarsCheckBox; // 0x4D8(0x8)
	struct UCheckbox* AnimShowEvalsCheckBox; // 0x4E0(0x8)
	struct UCheckbox* AnimShowWpnCheckBox; // 0x4E8(0x8)
	struct UCheckbox* AnimShowInputCheckBox; // 0x4F0(0x8)
	struct TArray<struct AActor*> AllActors; // 0x4F8(0x10)
	int32_t CurrentActorId; // 0x508(0x4)
	uint8_t Pad_0x50C[0x14]; // 0x50C(0x14)

	// Object: Function DFMGameHud.AnimDebugLogView.ShowGyroDebugMsg
	// Flags: [Final|Native|Protected|HasOutParms|BlueprintCallable]
	// Offset: 0xd50a9a4
	// Params: [ Num(1) Size(0x10) ]
	void ShowGyroDebugMsg(struct FString& Ret);

	// Object: Function DFMGameHud.AnimDebugLogView.ShowDebugPanel
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd50a8bc
	// Params: [ Num(2) Size(0x2) ]
	void ShowDebugPanel(uint8_t Show, EAnimDebugType ShowDebugType);

	// Object: Function DFMGameHud.AnimDebugLogView.ShowCommonDebugMsg
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xd50a7ec
	// Params: [ Num(1) Size(0x18) ]
	struct FText ShowCommonDebugMsg();

	// Object: Function DFMGameHud.AnimDebugLogView.SelectCharacterOnSelectionChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50a6b8
	// Params: [ Num(2) Size(0x11) ]
	void SelectCharacterOnSelectionChanged(struct FString SelectedItem, ESelectInfo SelectionType);

	// Object: Function DFMGameHud.AnimDebugLogView.SearchTextBoxCommitted
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0xd50a568
	// Params: [ Num(2) Size(0x19) ]
	void SearchTextBoxCommitted(const struct FText& Text, ETextCommit CommitMethod);

	// Object: Function DFMGameHud.AnimDebugLogView.RefreshLimitValDebugHud
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void RefreshLimitValDebugHud();

	// Object: Function DFMGameHud.AnimDebugLogView.OnShowDebugPanel
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(2) Size(0x2) ]
	void OnShowDebugPanel(uint8_t Show, EAnimDebugType ShowDebugType);

	// Object: Function DFMGameHud.AnimDebugLogView.ExecHotReflash
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd50a464
	// Params: [ Num(2) Size(0x11) ]
	uint8_t ExecHotReflash(struct FString JsonString);

	// Object: Function DFMGameHud.AnimDebugLogView.AnimShowWpnCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50a3b8
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowWpnCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogView.AnimShowVarsCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50a30c
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowVarsCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogView.AnimShowTPPCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50a260
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowTPPCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogView.AnimShowMontageCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50a1b4
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowMontageCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogView.AnimShowInputCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50a108
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowInputCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogView.AnimShowFPPCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50a05c
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowFPPCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogView.AnimShowEvalsCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd509fb0
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowEvalsCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogView.AnimShowCurvesCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd509f04
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowCurvesCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogView.AnimShowBSDetailCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd509e58
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowBSDetailCheckBoxChanged(uint8_t bIsChecked);
};

// Object: Class DFMGameHud.AccessAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UAccessAnimInstance : UAnimInstance
{
	DEFINE_UE_CLASS_HELPERS(UAccessAnimInstance, "AccessAnimInstance")
};

// Object: Class DFMGameHud.AnimShowSettingsNew
// Size: 0x48 (Inherited: 0x28)
struct UAnimShowSettingsNew : UObject
{
	DEFINE_UE_CLASS_HELPERS(UAnimShowSettingsNew, "AnimShowSettingsNew")

	uint8_t bShowFPP : 1; // 0x28(0x1), Mask(0x1)
	uint8_t BitPad_0x28_1 : 7; // 0x28(0x1)
	uint8_t bShowTPP : 1; // 0x29(0x1), Mask(0x1)
	uint8_t BitPad_0x29_1 : 7; // 0x29(0x1)
	uint8_t bShowMontage : 1; // 0x2A(0x1), Mask(0x1)
	uint8_t BitPad_0x2A_1 : 7; // 0x2A(0x1)
	uint8_t bShowBSDetail : 1; // 0x2B(0x1), Mask(0x1)
	uint8_t BitPad_0x2B_1 : 7; // 0x2B(0x1)
	uint8_t bShowCurves : 1; // 0x2C(0x1), Mask(0x1)
	uint8_t BitPad_0x2C_1 : 7; // 0x2C(0x1)
	uint8_t bShowVars : 1; // 0x2D(0x1), Mask(0x1)
	uint8_t BitPad_0x2D_1 : 7; // 0x2D(0x1)
	uint8_t bShowEvals : 1; // 0x2E(0x1), Mask(0x1)
	uint8_t BitPad_0x2E_1 : 7; // 0x2E(0x1)
	uint8_t bShowWpn : 1; // 0x2F(0x1), Mask(0x1)
	uint8_t BitPad_0x2F_1 : 7; // 0x2F(0x1)
	uint8_t bShowInput : 1; // 0x30(0x1), Mask(0x1)
	uint8_t BitPad_0x30_1 : 7; // 0x30(0x1)
	uint8_t Pad_0x31[0x7]; // 0x31(0x7)
	struct FString SearchString; // 0x38(0x10)
};

// Object: Class DFMGameHud.AnimDebugLogViewNew
// Size: 0x550 (Inherited: 0x488)
struct UAnimDebugLogViewNew : UMobileControlPadHudView
{
	DEFINE_UE_CLASS_HELPERS(UAnimDebugLogViewNew, "AnimDebugLogViewNew")

	uint8_t Pad_0x488[0x18]; // 0x488(0x18)
	struct URichTextBlock* RichTextBlockLog; // 0x4A0(0x8)
	struct UEditableTextBox* RichTextBlockLogFilterText; // 0x4A8(0x8)
	struct UEditableTextBox* SearchTextBox; // 0x4B0(0x8)
	struct UComboBoxString* SelectCharacterCmd; // 0x4B8(0x8)
	uint8_t Pad_0x4C0[0x20]; // 0x4C0(0x20)
	struct UCheckbox* AnimShowFPPCheckBox; // 0x4E0(0x8)
	struct UCheckbox* AnimShowTPPCheckBox; // 0x4E8(0x8)
	struct UCheckbox* AnimShowMontageCheckBox; // 0x4F0(0x8)
	struct UCheckbox* AnimShowBSDetailCheckBox; // 0x4F8(0x8)
	struct UCheckbox* AnimShowCurvesCheckBox; // 0x500(0x8)
	struct UCheckbox* AnimShowVarsCheckBox; // 0x508(0x8)
	struct UCheckbox* AnimShowEvalsCheckBox; // 0x510(0x8)
	struct UCheckbox* AnimShowWpnCheckBox; // 0x518(0x8)
	struct UCheckbox* AnimShowInputCheckBox; // 0x520(0x8)
	struct TArray<struct AActor*> AllActors; // 0x528(0x10)
	int32_t CurrentActorId; // 0x538(0x4)
	uint8_t Pad_0x53C[0x14]; // 0x53C(0x14)

	// Object: Function DFMGameHud.AnimDebugLogViewNew.ShowGyroDebugMsg
	// Flags: [Final|Native|Protected|HasOutParms|BlueprintCallable]
	// Offset: 0xd50b6fc
	// Params: [ Num(1) Size(0x10) ]
	void ShowGyroDebugMsg(struct FString& Ret);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.ShowDebugPanel
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd50b650
	// Params: [ Num(1) Size(0x1) ]
	void ShowDebugPanel(uint8_t Show);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.ShowCommonDebugMsg
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xd50b580
	// Params: [ Num(1) Size(0x18) ]
	struct FText ShowCommonDebugMsg();

	// Object: Function DFMGameHud.AnimDebugLogViewNew.SelectCharacterOnSelectionChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50b44c
	// Params: [ Num(2) Size(0x11) ]
	void SelectCharacterOnSelectionChanged(struct FString SelectedItem, ESelectInfo SelectionType);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.SearchTextBoxCommitted
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0xd50b2fc
	// Params: [ Num(2) Size(0x19) ]
	void SearchTextBoxCommitted(const struct FText& Text, ETextCommit CommitMethod);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.RefreshLimitValDebugHud
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void RefreshLimitValDebugHud();

	// Object: Function DFMGameHud.AnimDebugLogViewNew.OnShowDebugPanel
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void OnShowDebugPanel(uint8_t Show);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.ExecHotReflash
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd50b1f8
	// Params: [ Num(2) Size(0x11) ]
	uint8_t ExecHotReflash(struct FString JsonString);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.AnimShowWpnCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50b14c
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowWpnCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.AnimShowVarsCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50b0a0
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowVarsCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.AnimShowTPPCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50aff4
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowTPPCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.AnimShowMontageCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50af48
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowMontageCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.AnimShowInputCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50ae9c
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowInputCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.AnimShowFPPCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50adf0
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowFPPCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.AnimShowEvalsCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50ad44
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowEvalsCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.AnimShowCurvesCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50ac98
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowCurvesCheckBoxChanged(uint8_t bIsChecked);

	// Object: Function DFMGameHud.AnimDebugLogViewNew.AnimShowBSDetailCheckBoxChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50abec
	// Params: [ Num(1) Size(0x1) ]
	void AnimShowBSDetailCheckBoxChanged(uint8_t bIsChecked);
};

// Object: Class DFMGameHud.AccessAnimInstanceNew
// Size: 0x270 (Inherited: 0x270)
struct UAccessAnimInstanceNew : UAnimInstance
{
	DEFINE_UE_CLASS_HELPERS(UAccessAnimInstanceNew, "AccessAnimInstanceNew")
};

// Object: Class DFMGameHud.AnimTrackingWidget
// Size: 0x2F8 (Inherited: 0x2F8)
struct UAnimTrackingWidget : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UAnimTrackingWidget, "AnimTrackingWidget")

	// Object: Function DFMGameHud.AnimTrackingWidget.BP_PlayTrackingAnimation
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_PlayTrackingAnimation();
};

// Object: Class DFMGameHud.ArenaTestUIView
// Size: 0x448 (Inherited: 0x3F0)
struct UArenaTestUIView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UArenaTestUIView, "ArenaTestUIView")

	struct UTextBlock* RoundCountingTimeText; // 0x3F0(0x8)
	struct UTextBlock* RoundCountText; // 0x3F8(0x8)
	struct UTextBlock* PlayerScoreText; // 0x400(0x8)
	struct UTextBlock* TeamRoundScoreText; // 0x408(0x8)
	struct UTextBlock* PrepareCountingTimeText; // 0x410(0x8)
	struct UTextBlock* SettlementCountingTimeText; // 0x418(0x8)
	uint8_t Pad_0x420[0x28]; // 0x420(0x28)

	// Object: Function DFMGameHud.ArenaTestUIView.OnPlayerArenaScoreChange
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50b918
	// Params: [ Num(1) Size(0x4) ]
	void OnPlayerArenaScoreChange(int32_t PlayerArenaScore);
};

// Object: Class DFMGameHud.AssistedAimingDebugLogView
// Size: 0x498 (Inherited: 0x448)
struct UAssistedAimingDebugLogView : UMobileGamePadView
{
	DEFINE_UE_CLASS_HELPERS(UAssistedAimingDebugLogView, "AssistedAimingDebugLogView")

	struct FAssistedAimingDebugViewInfo LogAssistedAimingInfo; // 0x448(0x48)
	uint8_t bEnableRecoilGraph : 1; // 0x490(0x1), Mask(0x1)
	uint8_t BitPad_0x490_1 : 7; // 0x490(0x1)
	uint8_t Pad_0x491[0x7]; // 0x491(0x7)

	// Object: Function DFMGameHud.AssistedAimingDebugLogView.OnRotateStickyLogInfo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd50b9d0
	// Params: [ Num(9) Size(0x24) ]
	void OnRotateStickyLogInfo(float StickyParam, float Friction, float MoveSpeed, float DistanceHorizontal, float ReduceScale, uint8_t bHitPreventMissEnable, int32_t HitContinueMissNumber, float HitPreventMissStartTime, float HitBulletRadius);
};

// Object: Class DFMGameHud.BallisticTargetHUDView
// Size: 0x4A0 (Inherited: 0x3F0)
struct UBallisticTargetHUDView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBallisticTargetHUDView, "BallisticTargetHUDView")

	struct FSlateBrush CraterBrush; // 0x3F0(0x90)
	struct FVector2D CraterSize; // 0x480(0x8)
	struct UCanvasPanel* GraphPanel; // 0x488(0x8)
	struct TArray<struct UImage*> Craters; // 0x490(0x10)

	// Object: Function DFMGameHud.BallisticTargetHUDView.ResetCraters
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xd50bda4
	// Params: [ Num(0) Size(0x0) ]
	void ResetCraters();

	// Object: Function DFMGameHud.BallisticTargetHUDView.DrawBallistics
	// Flags: [Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xd50bc70
	// Params: [ Num(3) Size(0x18) ]
	void DrawBallistics(const struct FVector2D& HitRelativeLocation, struct UImage* BallisticsImage, const struct FVector2D& offset);
};

// Object: Class DFMGameHud.PlayerBaseIconViewController
// Size: 0x360 (Inherited: 0x2B0)
struct UPlayerBaseIconViewController : UMapIconViewController
{
	DEFINE_UE_CLASS_HELPERS(UPlayerBaseIconViewController, "PlayerBaseIconViewController")

	struct AGPPlayerState* LocalPS; // 0x2A8(0x8)
	struct AGPPlayerState* PlayerStateForThis; // 0x2B0(0x8)
	uint8_t Pad_0x2C0[0x88]; // 0x2C0(0x88)
	struct AGPSceneActorReplicator* SceneActorReplicator; // 0x348(0x8)
	uint8_t Pad_0x350[0x10]; // 0x350(0x10)

	// Object: Function DFMGameHud.PlayerBaseIconViewController.InGlitchVolumeChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd620c0c
	// Params: [ Num(1) Size(0x8) ]
	void InGlitchVolumeChanged(struct AGPPlayerState* InPlayerState);
};

// Object: Class DFMGameHud.PlayerDeathBaseIconController
// Size: 0x360 (Inherited: 0x360)
struct UPlayerDeathBaseIconController : UPlayerBaseIconViewController
{
	DEFINE_UE_CLASS_HELPERS(UPlayerDeathBaseIconController, "PlayerDeathBaseIconController")
};

// Object: Class DFMGameHud.BattlefieldPlayerDeathIconViewController
// Size: 0x360 (Inherited: 0x360)
struct UBattlefieldPlayerDeathIconViewController : UPlayerDeathBaseIconController
{
	DEFINE_UE_CLASS_HELPERS(UBattlefieldPlayerDeathIconViewController, "BattlefieldPlayerDeathIconViewController")
};

// Object: Class DFMGameHud.BattlefieldPlayerDeathItemView
// Size: 0x478 (Inherited: 0x468)
struct UBattlefieldPlayerDeathItemView : UMapItemHUDView
{
	DEFINE_UE_CLASS_HELPERS(UBattlefieldPlayerDeathItemView, "BattlefieldPlayerDeathItemView")

	struct UCanvasPanel* DFCanvasPanel_Default; // 0x468(0x8)
	struct UImage* BaseImg; // 0x470(0x8)
};

// Object: Class DFMGameHud.BattlefieldPlayerIconViewController
// Size: 0x4F0 (Inherited: 0x360)
struct UBattlefieldPlayerIconViewController : UPlayerBaseIconViewController
{
	DEFINE_UE_CLASS_HELPERS(UBattlefieldPlayerIconViewController, "BattlefieldPlayerIconViewController")

	uint8_t Pad_0x360[0x190]; // 0x360(0x190)

	// Object: Function DFMGameHud.BattlefieldPlayerIconViewController.OnTeamIdentityReplicate
	// Flags: [Final|Native|Public]
	// Offset: 0xd50bef0
	// Params: [ Num(1) Size(0x8) ]
	void OnTeamIdentityReplicate(struct AGPPlayerState* AGPPlayerState);

	// Object: Function DFMGameHud.BattlefieldPlayerIconViewController.OnPlayerArmedForceChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xf65b6cc
	// Params: [ Num(0) Size(0x0) ]
	void OnPlayerArmedForceChanged();
};

// Object: Class DFMGameHud.PlayerBaseItemView
// Size: 0x4C0 (Inherited: 0x468)
struct UPlayerBaseItemView : UMapItemHUDView
{
	DEFINE_UE_CLASS_HELPERS(UPlayerBaseItemView, "PlayerBaseItemView")

	struct UImage* ViewAngleImg; // 0x468(0x8)
	struct UImage* PublicItem; // 0x470(0x8)
	struct UImage* ArrowImg; // 0x478(0x8)
	struct UTextBlock* PlayerNum; // 0x480(0x8)
	struct UImage* AbilityImg; // 0x488(0x8)
	uint8_t Pad_0x490[0x8]; // 0x490(0x8)
	float AdditionIconRotateAngle; // 0x498(0x4)
	uint8_t Pad_0x49C[0x4]; // 0x49C(0x4)
	struct UPlayerBaseIconViewController* PlayerIconCtrl; // 0x4A0(0x8)
	uint8_t Pad_0x4A8[0x18]; // 0x4A8(0x18)

	// Object: Function DFMGameHud.PlayerBaseItemView.BP_LocalCharacterShowIn
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_LocalCharacterShowIn();
};

// Object: Class DFMGameHud.BattlefieldPlayerItemView
// Size: 0x508 (Inherited: 0x4C0)
struct UBattlefieldPlayerItemView : UPlayerBaseItemView
{
	DEFINE_UE_CLASS_HELPERS(UBattlefieldPlayerItemView, "BattlefieldPlayerItemView")

	struct UBattlefieldPlayerIconViewController* BFPlayerIconCtrl; // 0x4C0(0x8)
	uint8_t Pad_0x4C8[0x8]; // 0x4C8(0x8)
	struct UPaperSprite* Sprite_CQB; // 0x4D0(0x8)
	struct UPaperSprite* Sprite_Medic; // 0x4D8(0x8)
	struct UPaperSprite* Sprite_Gunner; // 0x4E0(0x8)
	struct UPaperSprite* Sprite_Sniper; // 0x4E8(0x8)
	struct UPaperSprite* Sprite_Commander; // 0x4F0(0x8)
	uint8_t Pad_0x4F8[0x10]; // 0x4F8(0x10)

	// Object: Function DFMGameHud.BattlefieldPlayerItemView.BP_SetLocalPlayerOrTeamMateType
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(3) Size(0x9) ]
	void BP_SetLocalPlayerOrTeamMateType(uint8_t bIsLocalPlayer, int32_t InCommanderSet, uint8_t bTeamLeader);
};

// Object: Class DFMGameHud.BattleFieldSafeAreaScreenEffectHUD
// Size: 0x500 (Inherited: 0x3F0)
struct UBattleFieldSafeAreaScreenEffectHUD : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldSafeAreaScreenEffectHUD, "BattleFieldSafeAreaScreenEffectHUD")

	struct TSoftObjectPtr<UMaterialInstance> LeaveSafeAreaStartMI; // 0x3F0(0x28)
	struct TSoftObjectPtr<UMaterialInstance> LeaveSafeAreaLoopMI; // 0x418(0x28)
	struct TSoftObjectPtr<UMaterialInstance> LeaveSafeAreaEndMI; // 0x440(0x28)
	struct AGPCharacter* GPCharacter; // 0x468(0x8)
	uint8_t Pad_0x470[0x30]; // 0x470(0x30)
	float SafeAreaFadeInTime; // 0x4A0(0x4)
	float SafeAreaFadeOutTime; // 0x4A4(0x4)
	float SafeAreaFadeDeltaTime; // 0x4A8(0x4)
	float CountDownRefreshDeltaTime; // 0x4AC(0x4)
	float GuideRefreshFrequency; // 0x4B0(0x4)
	uint8_t Pad_0x4B4[0x4]; // 0x4B4(0x4)
	struct UTextBlock* HintText; // 0x4B8(0x8)
	struct UImage* ArrowImage; // 0x4C0(0x8)
	struct UTextBlock* CountDown; // 0x4C8(0x8)
	struct UWidgetAnimation* NumbAnim; // 0x4D0(0x8)
	struct UWidgetAnimation* WBP_TipsNonres_OutGamingArea_in; // 0x4D8(0x8)
	struct UWidgetAnimation* WBP_TipsNonres_OutGamingArea_loop; // 0x4E0(0x8)
	struct UWidgetAnimation* WBP_TipsNonres_OutGamingArea_out; // 0x4E8(0x8)
	struct FLinearColor ArrowImageColor; // 0x4F0(0x10)

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHUD.OnMatchOver
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd50eb18
	// Params: [ Num(1) Size(0x1) ]
	void OnMatchOver(const EMatchOverReason& MatchOverReason);

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHUD.OnCountingTimeEnd
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50ea74
	// Params: [ Num(1) Size(0x4) ]
	void OnCountingTimeEnd(float InCountingTime);

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHUD.OnCountingTimeChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50e9d0
	// Params: [ Num(1) Size(0x4) ]
	void OnCountingTimeChanged(float CountingTime);

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHUD.OnControllerPossessPawn
	// Flags: [Final|Native|Public]
	// Offset: 0xd50e8f4
	// Params: [ Num(2) Size(0x10) ]
	void OnControllerPossessPawn(struct APlayerController* Controller, struct APawn* Pawn);

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHUD.CountDownBegin
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50e850
	// Params: [ Num(1) Size(0x4) ]
	void CountDownBegin(float InCountDownTime);

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHUD.CharacterImpendingDeath
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50e7ac
	// Params: [ Num(1) Size(0x8) ]
	void CharacterImpendingDeath(struct AGPCharacterBase* GPChar);

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHUD.CharacterDied
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50e708
	// Params: [ Num(1) Size(0x8) ]
	void CharacterDied(struct AGPCharacterBase* GPChar);
};

// Object: Class DFMGameHud.BattleFieldSafeAreaScreenEffectHudController
// Size: 0x88 (Inherited: 0x80)
struct UBattleFieldSafeAreaScreenEffectHudController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldSafeAreaScreenEffectHudController, "BattleFieldSafeAreaScreenEffectHudController")

	struct UBattleFieldSafeAreaScreenEffectHudView* SafeAreaView; // 0x80(0x8)
};

// Object: Class DFMGameHud.BattleFieldSafeAreaScreenEffectHudView
// Size: 0x510 (Inherited: 0x400)
struct UBattleFieldSafeAreaScreenEffectHudView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBattleFieldSafeAreaScreenEffectHudView, "BattleFieldSafeAreaScreenEffectHudView")

	struct TSoftObjectPtr<UMaterialInstance> LeaveSafeAreaStartMI; // 0x400(0x28)
	struct TSoftObjectPtr<UMaterialInstance> LeaveSafeAreaLoopMI; // 0x428(0x28)
	struct TSoftObjectPtr<UMaterialInstance> LeaveSafeAreaEndMI; // 0x450(0x28)
	struct AGPCharacter* GPCharacter; // 0x478(0x8)
	uint8_t Pad_0x480[0x30]; // 0x480(0x30)
	float SafeAreaFadeInTime; // 0x4B0(0x4)
	float SafeAreaFadeOutTime; // 0x4B4(0x4)
	float SafeAreaFadeDeltaTime; // 0x4B8(0x4)
	float CountDownRefreshDeltaTime; // 0x4BC(0x4)
	float GuideRefreshFrequency; // 0x4C0(0x4)
	uint8_t Pad_0x4C4[0x4]; // 0x4C4(0x4)
	struct UTextBlock* HintText; // 0x4C8(0x8)
	struct UImage* ArrowImage; // 0x4D0(0x8)
	struct UTextBlock* CountDown; // 0x4D8(0x8)
	struct UWidgetAnimation* NumbAnim; // 0x4E0(0x8)
	struct UWidgetAnimation* WBP_TipsNonres_OutGamingArea_in; // 0x4E8(0x8)
	struct UWidgetAnimation* WBP_TipsNonres_OutGamingArea_loop; // 0x4F0(0x8)
	struct UWidgetAnimation* WBP_TipsNonres_OutGamingArea_out; // 0x4F8(0x8)
	struct FLinearColor ArrowImageColor; // 0x500(0x10)

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHudView.OnMatchOver
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd50f164
	// Params: [ Num(1) Size(0x1) ]
	void OnMatchOver(const EMatchOverReason& MatchOverReason);

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHudView.OnCountingTimeEnd
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50f0c0
	// Params: [ Num(1) Size(0x4) ]
	void OnCountingTimeEnd(float InCountingTime);

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHudView.OnCountingTimeChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50f01c
	// Params: [ Num(1) Size(0x4) ]
	void OnCountingTimeChanged(float CountingTime);

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHudView.OnControllerPossessPawn
	// Flags: [Final|Native|Public]
	// Offset: 0xd50ef40
	// Params: [ Num(2) Size(0x10) ]
	void OnControllerPossessPawn(struct APlayerController* Controller, struct APawn* Pawn);

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHudView.CountDownBegin
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50ee9c
	// Params: [ Num(1) Size(0x4) ]
	void CountDownBegin(float InCountDownTime);

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHudView.CharacterImpendingDeath
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50edf8
	// Params: [ Num(1) Size(0x8) ]
	void CharacterImpendingDeath(struct AGPCharacterBase* GPChar);

	// Object: Function DFMGameHud.BattleFieldSafeAreaScreenEffectHudView.CharacterDied
	// Flags: [Final|Native|Protected]
	// Offset: 0xd50ed54
	// Params: [ Num(1) Size(0x8) ]
	void CharacterDied(struct AGPCharacterBase* GPChar);
};

// Object: Class DFMGameHud.BattleStatusHud
// Size: 0x410 (Inherited: 0x3F0)
struct UBattleStatusHud : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBattleStatusHud, "BattleStatusHud")

	uint8_t Pad_0x3F0[0x10]; // 0x3F0(0x10)
	struct UBaseBattleStatusItem* CurrentActiveWidget; // 0x400(0x8)
	uint8_t Pad_0x408[0x8]; // 0x408(0x8)

	// Object: Function DFMGameHud.BattleStatusHud.RefreshSneakView
	// Flags: [Final|Native|Private]
	// Offset: 0xd50f2cc
	// Params: [ Num(0) Size(0x0) ]
	void RefreshSneakView();

	// Object: Function DFMGameHud.BattleStatusHud.OnCharacterReloading
	// Flags: [Final|Native|Private]
	// Offset: 0xd50f220
	// Params: [ Num(1) Size(0x1) ]
	void OnCharacterReloading(uint8_t bIsEnter);
};

// Object: Class DFMGameHud.BaseBattleStatusItem
// Size: 0x2F8 (Inherited: 0x2F8)
struct UBaseBattleStatusItem : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UBaseBattleStatusItem, "BaseBattleStatusItem")

	// Object: Function DFMGameHud.BaseBattleStatusItem.BPShow
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BPShow();

	// Object: Function DFMGameHud.BaseBattleStatusItem.BPHide
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BPHide();
};

// Object: Class DFMGameHud.BigMapHUDViewSafeHouse
// Size: 0xAA0 (Inherited: 0xAA0)
struct UBigMapHUDViewSafeHouse : UBigMapHUDView
{
	DEFINE_UE_CLASS_HELPERS(UBigMapHUDViewSafeHouse, "BigMapHUDViewSafeHouse")
};

// Object: Class DFMGameHud.BigMapQuestTipHUDView
// Size: 0x4D0 (Inherited: 0x468)
struct UBigMapQuestTipHUDView : UMapItemHUDView
{
	DEFINE_UE_CLASS_HELPERS(UBigMapQuestTipHUDView, "BigMapQuestTipHUDView")

	struct UTextBlock* QuestNameText; // 0x468(0x8)
	struct UButton* CheckButton; // 0x470(0x8)
	int64_t QuestID; // 0x478(0x8)
	struct FName QuestIDName; // 0x480(0x8)
	int64_t QuestObjectionID; // 0x488(0x8)
	float ObjectionTimeLimit; // 0x490(0x4)
	ESOLQuestState QuestState; // 0x494(0x1)
	ESOLQuestObjectionState QuestObjState; // 0x495(0x1)
	uint8_t bCurrentTracked : 1; // 0x496(0x1), Mask(0x1)
	uint8_t BitPad_0x496_1 : 7; // 0x496(0x1)
	uint8_t bHasComplete : 1; // 0x497(0x1), Mask(0x1)
	uint8_t BitPad_0x497_1 : 7; // 0x497(0x1)
	uint8_t bHasInited : 1; // 0x498(0x1), Mask(0x1)
	uint8_t BitPad_0x498_1 : 7; // 0x498(0x1)
	uint8_t Pad_0x499[0x7]; // 0x499(0x7)
	struct USOLPlayerQuestComponent* PlayerQuestComponent; // 0x4A0(0x8)
	struct FBigMapQuestTipData BigMapQuestTipData; // 0x4A8(0x28)

	// Object: Function DFMGameHud.BigMapQuestTipHUDView.OnQuestUpdate
	// Flags: [Final|Native|Public]
	// Offset: 0xd5105f8
	// Params: [ Num(2) Size(0x9) ]
	void OnQuestUpdate(int64_t UpdateQuestId, uint8_t ObjType);

	// Object: Function DFMGameHud.BigMapQuestTipHUDView.OnQuestObjectionUpdate
	// Flags: [Final|Native|Public]
	// Offset: 0xd5104a4
	// Params: [ Num(4) Size(0x12) ]
	void OnQuestObjectionUpdate(int64_t UpdateQuestId, int64_t UpdateQuestObjId, uint8_t ObjectionState, uint8_t ObjType);

	// Object: Function DFMGameHud.BigMapQuestTipHUDView.OnClientQuestObjectiveTimerUpdate
	// Flags: [Final|Native|Public]
	// Offset: 0xd51038c
	// Params: [ Num(3) Size(0x14) ]
	void OnClientQuestObjectiveTimerUpdate(int64_t InQuestId, int64_t InQuestObjectiveId, float InTimeRemain);

	// Object: Function DFMGameHud.BigMapQuestTipHUDView.OnCheckButtonClicked
	// Flags: [Final|Native|Public]
	// Offset: 0xd510378
	// Params: [ Num(0) Size(0x0) ]
	void OnCheckButtonClicked();

	// Object: Function DFMGameHud.BigMapQuestTipHUDView.InitQuestView
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd5101fc
	// Params: [ Num(2) Size(0x91) ]
	uint8_t InitQuestView(const struct FSOLQuest& Quest);

	// Object: Function DFMGameHud.BigMapQuestTipHUDView.HandleTrackSucceed
	// Flags: [Final|Native|Public]
	// Offset: 0xd5100a0
	// Params: [ Num(4) Size(0x12) ]
	void HandleTrackSucceed(int64_t QId, int64_t ObjId, uint8_t bTrack, uint8_t ObjState);

	// Object: Function DFMGameHud.BigMapQuestTipHUDView.BP_UpdateQuestData
	// Flags: [Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x90) ]
	void BP_UpdateQuestData(const struct FSOLQuest& QuestInfo);

	// Object: Function DFMGameHud.BigMapQuestTipHUDView.BP_UpdateObjectionData
	// Flags: [Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x88) ]
	void BP_UpdateObjectionData(const struct FSOLQuestObjection& QuestObjection);

	// Object: Function DFMGameHud.BigMapQuestTipHUDView.BP_SetIsSelected
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_SetIsSelected(uint8_t bInSelect);

	// Object: Function DFMGameHud.BigMapQuestTipHUDView.BP_InitQuestData
	// Flags: [Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x90) ]
	void BP_InitQuestData(const struct FSOLQuest& InQuest);
};

// Object: Class DFMGameHud.BionicBirdHudHudController
// Size: 0x80 (Inherited: 0x80)
struct UBionicBirdHudHudController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UBionicBirdHudHudController, "BionicBirdHudHudController")

	uint8_t bEnableLockCharacter : 1; // 0x79(0x1), Mask(0x1)

	// Object: Function DFMGameHud.BionicBirdHudHudController.TryStopLockLocalCharacter
	// Flags: [Final|Native|Public]
	// Offset: 0xd510750
	// Params: [ Num(0) Size(0x0) ]
	void TryStopLockLocalCharacter();

	// Object: Function DFMGameHud.BionicBirdHudHudController.TickLockLocalCharacter
	// Flags: [Final|Native|Public]
	// Offset: 0xd51073c
	// Params: [ Num(0) Size(0x0) ]
	void TickLockLocalCharacter();

	// Object: Function DFMGameHud.BionicBirdHudHudController.InitTickLockLocalCharacterFlag
	// Flags: [Final|Native|Public]
	// Offset: 0xd510728
	// Params: [ Num(0) Size(0x0) ]
	void InitTickLockLocalCharacterFlag();
};

// Object: Class DFMGameHud.BionicBirdHudHudView
// Size: 0x490 (Inherited: 0x400)
struct UBionicBirdHudHudView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBionicBirdHudHudView, "BionicBirdHudHudView")

	uint8_t bDoFlush : 1; // 0x3FB(0x1), Mask(0x1)
	uint8_t bDoFlush_HD : 1; // 0x3FC(0x1), Mask(0x1)
	uint8_t bForceGC : 1; // 0x3FD(0x1), Mask(0x1)
	uint8_t bForceGC_HD : 1; // 0x3FE(0x1), Mask(0x1)
	float FlushDelay; // 0x400(0x4)
	float SafeCheckCloseDelay; // 0x404(0x4)
	float TargetIconWorldOffset; // 0x408(0x4)
	int32_t SpySkillID; // 0x40C(0x4)
	struct FName BaseScreenEffName; // 0x410(0x8)
	struct FName SprintScreenEffName; // 0x418(0x8)
	struct UCanvasPanel* MarkerPanel; // 0x420(0x8)
	struct FHudAnimationNameSelector DestroyFadeOutAnimationName; // 0x428(0x8)
	struct FHudAnimationNameSelector NormalFadeOutAnimationName; // 0x430(0x8)
	float Speed; // 0x438(0x4)
	float Height; // 0x43C(0x4)
	float CurrentEnergy; // 0x440(0x4)
	float CurrentRoll; // 0x444(0x4)
	float YawControl; // 0x448(0x4)
	float PitchControl; // 0x44C(0x4)
	uint8_t bIsThrowableAttach : 1; // 0x450(0x1), Mask(0x1)
	uint8_t BitPad_0x450_5 : 3; // 0x450(0x1)
	uint8_t bHasLaunched : 1; // 0x451(0x1), Mask(0x1)
	uint8_t BitPad_0x451_1 : 7; // 0x451(0x1)
	uint8_t Pad_0x452[0x2]; // 0x452(0x2)
	struct FVector2D LandingPointLocation; // 0x454(0x8)
	uint8_t bIsClientLaunched : 1; // 0x45C(0x1), Mask(0x1)
	uint8_t BitPad_0x45C_1 : 7; // 0x45C(0x1)
	uint8_t Pad_0x45D[0x3]; // 0x45D(0x3)
	struct UImage* DirectionBar; // 0x460(0x8)
	struct UMaterialInstanceDynamic* DirectionBarMaterial; // 0x468(0x8)
	uint8_t bIsOb : 1; // 0x470(0x1), Mask(0x1)
	uint8_t BitPad_0x470_1 : 7; // 0x470(0x1)
	uint8_t bIsReplay : 1; // 0x471(0x1), Mask(0x1)
	uint8_t BitPad_0x471_1 : 7; // 0x471(0x1)
	uint8_t Pad_0x472[0x2]; // 0x472(0x2)
	int32_t Skill2Type; // 0x474(0x4)
	uint8_t bIsBirdSprint : 1; // 0x478(0x1), Mask(0x1)
	uint8_t BitPad_0x478_1 : 7; // 0x478(0x1)
	uint8_t bIsBirdDestroyed : 1; // 0x479(0x1), Mask(0x1)
	uint8_t BitPad_0x479_1 : 7; // 0x479(0x1)
	uint8_t bInOpenWorldStage : 1; // 0x47A(0x1), Mask(0x1)
	uint8_t BitPad_0x47A_1 : 7; // 0x47A(0x1)
	uint8_t Pad_0x47B[0x5]; // 0x47B(0x5)
	struct FTimerHandle FlushTimerHandle; // 0x480(0x8)
	float SafeCheckCloseTime; // 0x488(0x4)
	uint8_t Pad_0x48C[0x4]; // 0x48C(0x4)

	// Object: Function DFMGameHud.BionicBirdHudHudView.UpdateViewTargetData
	// Flags: [Final|Native|Public]
	// Offset: 0xd510b4c
	// Params: [ Num(1) Size(0x8) ]
	void UpdateViewTargetData(struct ABionicBirdBaseActor* BionicBird);

	// Object: Function DFMGameHud.BionicBirdHudHudView.UpdateTargetData
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xd510a64
	// Params: [ Num(2) Size(0x10) ]
	void UpdateTargetData(uint8_t bHasTarget, struct FVector TargetLocation);

	// Object: Function DFMGameHud.BionicBirdHudHudView.UpdateSkillType
	// Flags: [Final|Native|Public]
	// Offset: 0xd510a50
	// Params: [ Num(0) Size(0x0) ]
	void UpdateSkillType();

	// Object: Function DFMGameHud.BionicBirdHudHudView.UpdateHUDData
	// Flags: [Final|Native|Public]
	// Offset: 0xd5109ac
	// Params: [ Num(1) Size(0x8) ]
	void UpdateHUDData(struct ABionicBirdBaseActor* BionicBird);

	// Object: Function DFMGameHud.BionicBirdHudHudView.UpdateDirectionBar
	// Flags: [Final|Native|Public]
	// Offset: 0xd510998
	// Params: [ Num(0) Size(0x0) ]
	void UpdateDirectionBar();

	// Object: Function DFMGameHud.BionicBirdHudHudView.TryStopLockLocalCharacter
	// Flags: [Final|Native|Public]
	// Offset: 0xd510984
	// Params: [ Num(0) Size(0x0) ]
	void TryStopLockLocalCharacter();

	// Object: Function DFMGameHud.BionicBirdHudHudView.TrySafeCheckClose
	// Flags: [Final|Native|Public]
	// Offset: 0xd510970
	// Params: [ Num(0) Size(0x0) ]
	void TrySafeCheckClose();

	// Object: Function DFMGameHud.BionicBirdHudHudView.TryRemoveScreenEffect
	// Flags: [Final|Native|Public]
	// Offset: 0xd51095c
	// Params: [ Num(0) Size(0x0) ]
	void TryRemoveScreenEffect();

	// Object: Function DFMGameHud.BionicBirdHudHudView.TryRemoveBaseHudState
	// Flags: [Final|Native|Public]
	// Offset: 0xd510948
	// Params: [ Num(0) Size(0x0) ]
	void TryRemoveBaseHudState();

	// Object: Function DFMGameHud.BionicBirdHudHudView.TryForceGC
	// Flags: [Final|Native|Public]
	// Offset: 0xd510934
	// Params: [ Num(0) Size(0x0) ]
	void TryForceGC();

	// Object: Function DFMGameHud.BionicBirdHudHudView.TryAddSprintScreenEffect
	// Flags: [Final|Native|Public]
	// Offset: 0xd510920
	// Params: [ Num(0) Size(0x0) ]
	void TryAddSprintScreenEffect();

	// Object: Function DFMGameHud.BionicBirdHudHudView.TryAddBaseScreenEffect
	// Flags: [Final|Native|Public]
	// Offset: 0xd51090c
	// Params: [ Num(0) Size(0x0) ]
	void TryAddBaseScreenEffect();

	// Object: Function DFMGameHud.BionicBirdHudHudView.TickSafeCheckOB
	// Flags: [Final|Native|Public]
	// Offset: 0xd5108f8
	// Params: [ Num(0) Size(0x0) ]
	void TickSafeCheckOB();

	// Object: Function DFMGameHud.BionicBirdHudHudView.StopFlushTimer
	// Flags: [Final|Native|Public]
	// Offset: 0xd5108e4
	// Params: [ Num(0) Size(0x0) ]
	void StopFlushTimer();

	// Object: Function DFMGameHud.BionicBirdHudHudView.StartFlushTimer
	// Flags: [Final|Native|Public]
	// Offset: 0xd5108d0
	// Params: [ Num(0) Size(0x0) ]
	void StartFlushTimer();

	// Object: Function DFMGameHud.BionicBirdHudHudView.SafeCheckClose
	// Flags: [Final|Native|Public]
	// Offset: 0xd5108bc
	// Params: [ Num(0) Size(0x0) ]
	void SafeCheckClose();

	// Object: Function DFMGameHud.BionicBirdHudHudView.OpenWorldExitStage
	// Flags: [Final|Native|Public]
	// Offset: 0xd5108a8
	// Params: [ Num(0) Size(0x0) ]
	void OpenWorldExitStage();

	// Object: Function DFMGameHud.BionicBirdHudHudView.OpenWorldEnterStage
	// Flags: [Final|Native|Public]
	// Offset: 0xd510894
	// Params: [ Num(0) Size(0x0) ]
	void OpenWorldEnterStage();

	// Object: Function DFMGameHud.BionicBirdHudHudView.OnStartSprint
	// Flags: [Final|Native|Public]
	// Offset: 0xd510880
	// Params: [ Num(0) Size(0x0) ]
	void OnStartSprint();

	// Object: Function DFMGameHud.BionicBirdHudHudView.InputAction
	// Flags: [Final|Native|Public]
	// Offset: 0xd5107dc
	// Params: [ Num(1) Size(0x2) ]
	void InputAction(EInputActionType InputActionType);

	// Object: Function DFMGameHud.BionicBirdHudHudView.DoFlushTimer
	// Flags: [Final|Native|Public]
	// Offset: 0xd5107c8
	// Params: [ Num(0) Size(0x0) ]
	void DoFlushTimer();

	// Object: Function DFMGameHud.BionicBirdHudHudView.CheckIsReplay
	// Flags: [Final|Native|Public]
	// Offset: 0xd5107b4
	// Params: [ Num(0) Size(0x0) ]
	void CheckIsReplay();

	// Object: Function DFMGameHud.BionicBirdHudHudView.CheckIsOB
	// Flags: [Final|Native|Public]
	// Offset: 0xd5107a0
	// Params: [ Num(0) Size(0x0) ]
	void CheckIsOB();

	// Object: Function DFMGameHud.BionicBirdHudHudView.BP_UpdateUI
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_UpdateUI();

	// Object: Function DFMGameHud.BionicBirdHudHudView.BP_UpdateTargetData
	// Flags: [Event|Public|HasDefaults|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(2) Size(0xC) ]
	void BP_UpdateTargetData(uint8_t bHasTarget, struct FVector2D TargetLocation);

	// Object: Function DFMGameHud.BionicBirdHudHudView.BP_UpdateSkill2Type
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_UpdateSkill2Type(int32_t Type);

	// Object: Function DFMGameHud.BionicBirdHudHudView.BP_StopControl
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_StopControl(uint8_t bIsExplode);

	// Object: Function DFMGameHud.BionicBirdHudHudView.BP_StartControl
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_StartControl();

	// Object: Function DFMGameHud.BionicBirdHudHudView.BP_Sprint
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd51078c
	// Params: [ Num(0) Size(0x0) ]
	void BP_Sprint();

	// Object: Function DFMGameHud.BionicBirdHudHudView.BP_SetSprint
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_SetSprint(uint8_t bSprint);

	// Object: Function DFMGameHud.BionicBirdHudHudView.BP_SetIsReplay
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_SetIsReplay(uint8_t bCurrIsReplay);

	// Object: Function DFMGameHud.BionicBirdHudHudView.BP_SetIsOB
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_SetIsOB(uint8_t bCurrIsOB);

	// Object: Function DFMGameHud.BionicBirdHudHudView.BP_GetMainSkillItem
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x8) ]
	struct UDFMMobileSkillItem* BP_GetMainSkillItem();

	// Object: Function DFMGameHud.BionicBirdHudHudView.BP_Exit
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd510778
	// Params: [ Num(0) Size(0x0) ]
	void BP_Exit();
};

// Object: Class DFMGameHud.BionicBirdHudView
// Size: 0x480 (Inherited: 0x3F0)
struct UBionicBirdHudView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBionicBirdHudView, "BionicBirdHudView")

	uint8_t bDoFlush : 1; // 0x3E9(0x1), Mask(0x1)
	uint8_t bDoFlush_HD : 1; // 0x3EA(0x1), Mask(0x1)
	uint8_t bForceGC : 1; // 0x3EB(0x1), Mask(0x1)
	uint8_t bForceGC_HD : 1; // 0x3EC(0x1), Mask(0x1)
	float FlushDelay; // 0x3F0(0x4)
	float SafeCheckCloseDelay; // 0x3F4(0x4)
	float TargetIconWorldOffset; // 0x3F8(0x4)
	int32_t SpySkillID; // 0x3FC(0x4)
	struct FName BaseScreenEffName; // 0x400(0x8)
	struct FName SprintScreenEffName; // 0x408(0x8)
	struct UCanvasPanel* MarkerPanel; // 0x410(0x8)
	struct FAnimationNameSelector DestroyFadeOutAnimationName; // 0x418(0x8)
	struct FAnimationNameSelector NormalFadeOutAnimationName; // 0x420(0x8)
	float Speed; // 0x428(0x4)
	float Height; // 0x42C(0x4)
	float CurrentEnergy; // 0x430(0x4)
	float CurrentRoll; // 0x434(0x4)
	float YawControl; // 0x438(0x4)
	float PitchControl; // 0x43C(0x4)
	uint8_t bIsThrowableAttach : 1; // 0x440(0x1), Mask(0x1)
	uint8_t BitPad_0x440_5 : 3; // 0x440(0x1)
	uint8_t bHasLaunched : 1; // 0x441(0x1), Mask(0x1)
	uint8_t BitPad_0x441_1 : 7; // 0x441(0x1)
	uint8_t Pad_0x442[0x2]; // 0x442(0x2)
	struct FVector2D LandingPointLocation; // 0x444(0x8)
	uint8_t bIsClientLaunched : 1; // 0x44C(0x1), Mask(0x1)
	uint8_t BitPad_0x44C_1 : 7; // 0x44C(0x1)
	uint8_t Pad_0x44D[0x3]; // 0x44D(0x3)
	struct UImage* DirectionBar; // 0x450(0x8)
	struct UMaterialInstanceDynamic* DirectionBarMaterial; // 0x458(0x8)
	uint8_t bIsOb : 1; // 0x460(0x1), Mask(0x1)
	uint8_t BitPad_0x460_1 : 7; // 0x460(0x1)
	uint8_t bEnableLockCharacter : 1; // 0x461(0x1), Mask(0x1)
	uint8_t BitPad_0x461_1 : 7; // 0x461(0x1)
	uint8_t Pad_0x462[0x2]; // 0x462(0x2)
	int32_t Skill2Type; // 0x464(0x4)
	uint8_t bIsBirdSprint : 1; // 0x468(0x1), Mask(0x1)
	uint8_t BitPad_0x468_1 : 7; // 0x468(0x1)
	uint8_t bIsBirdDestroyed : 1; // 0x469(0x1), Mask(0x1)
	uint8_t BitPad_0x469_1 : 7; // 0x469(0x1)
	uint8_t bInOpenWorldStage : 1; // 0x46A(0x1), Mask(0x1)
	uint8_t BitPad_0x46A_1 : 7; // 0x46A(0x1)
	uint8_t Pad_0x46B[0x5]; // 0x46B(0x5)
	struct FTimerHandle FlushTimerHandle; // 0x470(0x8)
	float SafeCheckCloseTime; // 0x478(0x4)
	uint8_t Pad_0x47C[0x4]; // 0x47C(0x4)

	// Object: Function DFMGameHud.BionicBirdHudView.UpdateViewTargetData
	// Flags: [Final|Native|Public]
	// Offset: 0xd512f04
	// Params: [ Num(1) Size(0x8) ]
	void UpdateViewTargetData(struct ABionicBirdBaseActor* BionicBird);

	// Object: Function DFMGameHud.BionicBirdHudView.UpdateTargetData
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0xd512e1c
	// Params: [ Num(2) Size(0x10) ]
	void UpdateTargetData(uint8_t bHasTarget, struct FVector TargetLocation);

	// Object: Function DFMGameHud.BionicBirdHudView.UpdateSkillType
	// Flags: [Final|Native|Private]
	// Offset: 0xd512e08
	// Params: [ Num(0) Size(0x0) ]
	void UpdateSkillType();

	// Object: Function DFMGameHud.BionicBirdHudView.UpdateHUDData
	// Flags: [Final|Native|Public]
	// Offset: 0xd512d64
	// Params: [ Num(1) Size(0x8) ]
	void UpdateHUDData(struct ABionicBirdBaseActor* BionicBird);

	// Object: Function DFMGameHud.BionicBirdHudView.UpdateDirectionBar
	// Flags: [Final|Native|Private]
	// Offset: 0xd512d50
	// Params: [ Num(0) Size(0x0) ]
	void UpdateDirectionBar();

	// Object: Function DFMGameHud.BionicBirdHudView.TryStopLockLocalCharacter
	// Flags: [Final|Native|Private]
	// Offset: 0xd512d3c
	// Params: [ Num(0) Size(0x0) ]
	void TryStopLockLocalCharacter();

	// Object: Function DFMGameHud.BionicBirdHudView.TrySafeCheckClose
	// Flags: [Final|Native|Private]
	// Offset: 0xd512d28
	// Params: [ Num(0) Size(0x0) ]
	void TrySafeCheckClose();

	// Object: Function DFMGameHud.BionicBirdHudView.TryRemoveScreenEffect
	// Flags: [Final|Native|Private]
	// Offset: 0xd512d14
	// Params: [ Num(0) Size(0x0) ]
	void TryRemoveScreenEffect();

	// Object: Function DFMGameHud.BionicBirdHudView.TryForceGC
	// Flags: [Final|Native|Private]
	// Offset: 0xd512d00
	// Params: [ Num(0) Size(0x0) ]
	void TryForceGC();

	// Object: Function DFMGameHud.BionicBirdHudView.TryAddSprintScreenEffect
	// Flags: [Final|Native|Private]
	// Offset: 0xd512cec
	// Params: [ Num(0) Size(0x0) ]
	void TryAddSprintScreenEffect();

	// Object: Function DFMGameHud.BionicBirdHudView.TryAddBaseScreenEffect
	// Flags: [Final|Native|Private]
	// Offset: 0xd512cd8
	// Params: [ Num(0) Size(0x0) ]
	void TryAddBaseScreenEffect();

	// Object: Function DFMGameHud.BionicBirdHudView.TickSafeCheckOB
	// Flags: [Final|Native|Private]
	// Offset: 0xd512cc4
	// Params: [ Num(0) Size(0x0) ]
	void TickSafeCheckOB();

	// Object: Function DFMGameHud.BionicBirdHudView.TickLockLocalCharacter
	// Flags: [Final|Native|Private]
	// Offset: 0xd512cb0
	// Params: [ Num(0) Size(0x0) ]
	void TickLockLocalCharacter();

	// Object: Function DFMGameHud.BionicBirdHudView.StopFlushTimer
	// Flags: [Final|Native|Private]
	// Offset: 0xd512c9c
	// Params: [ Num(0) Size(0x0) ]
	void StopFlushTimer();

	// Object: Function DFMGameHud.BionicBirdHudView.StartFlushTimer
	// Flags: [Final|Native|Private]
	// Offset: 0xd512c88
	// Params: [ Num(0) Size(0x0) ]
	void StartFlushTimer();

	// Object: Function DFMGameHud.BionicBirdHudView.SafeCheckClose
	// Flags: [Final|Native|Private]
	// Offset: 0xd512c74
	// Params: [ Num(0) Size(0x0) ]
	void SafeCheckClose();

	// Object: Function DFMGameHud.BionicBirdHudView.OpenWorldExitStage
	// Flags: [Final|Native|Private]
	// Offset: 0xd512c60
	// Params: [ Num(0) Size(0x0) ]
	void OpenWorldExitStage();

	// Object: Function DFMGameHud.BionicBirdHudView.OpenWorldEnterStage
	// Flags: [Final|Native|Private]
	// Offset: 0xd512c4c
	// Params: [ Num(0) Size(0x0) ]
	void OpenWorldEnterStage();

	// Object: Function DFMGameHud.BionicBirdHudView.OnStartSprint
	// Flags: [Final|Native|Public]
	// Offset: 0xd512c38
	// Params: [ Num(0) Size(0x0) ]
	void OnStartSprint();

	// Object: Function DFMGameHud.BionicBirdHudView.InputAction
	// Flags: [Final|Native|Private]
	// Offset: 0xd512b94
	// Params: [ Num(1) Size(0x2) ]
	void InputAction(EInputActionType InputActionType);

	// Object: Function DFMGameHud.BionicBirdHudView.InitTickLockLocalCharacterFlag
	// Flags: [Final|Native|Private]
	// Offset: 0xd512b80
	// Params: [ Num(0) Size(0x0) ]
	void InitTickLockLocalCharacterFlag();

	// Object: Function DFMGameHud.BionicBirdHudView.DoFlushTimer
	// Flags: [Final|Native|Private]
	// Offset: 0xd512b6c
	// Params: [ Num(0) Size(0x0) ]
	void DoFlushTimer();

	// Object: Function DFMGameHud.BionicBirdHudView.CheckIsOB
	// Flags: [Final|Native|Private]
	// Offset: 0xd512b58
	// Params: [ Num(0) Size(0x0) ]
	void CheckIsOB();

	// Object: Function DFMGameHud.BionicBirdHudView.BP_UpdateUI
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_UpdateUI();

	// Object: Function DFMGameHud.BionicBirdHudView.BP_UpdateTargetData
	// Flags: [Event|Protected|HasDefaults|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(2) Size(0xC) ]
	void BP_UpdateTargetData(uint8_t bHasTarget, struct FVector2D TargetLocation);

	// Object: Function DFMGameHud.BionicBirdHudView.BP_UpdateSkill2Type
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_UpdateSkill2Type(int32_t Type);

	// Object: Function DFMGameHud.BionicBirdHudView.BP_StopControl
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_StopControl(uint8_t bIsExplode);

	// Object: Function DFMGameHud.BionicBirdHudView.BP_StartControl
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_StartControl();

	// Object: Function DFMGameHud.BionicBirdHudView.BP_Sprint
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xd512b44
	// Params: [ Num(0) Size(0x0) ]
	void BP_Sprint();

	// Object: Function DFMGameHud.BionicBirdHudView.BP_SetSprint
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_SetSprint(uint8_t bSprint);

	// Object: Function DFMGameHud.BionicBirdHudView.BP_SetIsOB
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_SetIsOB(uint8_t bCurrIsOB);

	// Object: Function DFMGameHud.BionicBirdHudView.BP_GetMainSkillItem
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x8) ]
	struct UDFMMobileSkillItem* BP_GetMainSkillItem();

	// Object: Function DFMGameHud.BionicBirdHudView.BP_Exit
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xd512b30
	// Params: [ Num(0) Size(0x0) ]
	void BP_Exit();
};

// Object: Class DFMGameHud.GameMarkerBaseWidget
// Size: 0x7B0 (Inherited: 0x2F8)
struct UGameMarkerBaseWidget : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UGameMarkerBaseWidget, "GameMarkerBaseWidget")

	struct UGPMarkerItemBase* MarkerItemPtr; // 0x2F8(0x8)
	struct FMarkInit MarkerInitData; // 0x300(0x150)
	struct AGPMarkerManager* MarkerManager; // 0x450(0x8)
	struct UGameMarkerPanel* MarkerPanel; // 0x458(0x8)
	struct UDFSceneMarkerPanelView* SceneMarkerPanelView; // 0x460(0x8)
	struct UUserWidget* MarkingAnimWidget; // 0x468(0x8)
	struct UCanvasPanel* MarkerCanvasPanel; // 0x470(0x8)
	struct FName MarkerCanvasPanelName; // 0x478(0x8)
	uint8_t bUsingMarkingAnimWidget : 1; // 0x480(0x1), Mask(0x1)
	uint8_t BitPad_0x480_1 : 7; // 0x480(0x1)
	uint8_t Pad_0x481[0x7]; // 0x481(0x7)
	struct UUserWidget* MarkingAnimWidgetClass_SOL; // 0x488(0x8)
	struct FName AnimName_Marking_SOL; // 0x490(0x8)
	struct FAnchorData MarkerAnchorData_SOL; // 0x498(0x28)
	struct FName MarkingSoundName_SOL; // 0x4C0(0x8)
	struct TMap<EMarkerCampType, struct FMarkingAnimDataMap> CampMarkingAnimDataMap_BattleField; // 0x4C8(0x50)
	struct TMap<EMarkerCampType, struct FMarkingAnimDataMap> UpgradeCampMarkingAnimDataMap_BattleField; // 0x518(0x50)
	uint8_t bPlayInAnim : 1; // 0x568(0x1), Mask(0x1)
	uint8_t BitPad_0x568_1 : 7; // 0x568(0x1)
	uint8_t Pad_0x569[0x3]; // 0x569(0x3)
	struct FName AnimName_In; // 0x56C(0x8)
	uint8_t bPlayLoopAnim : 1; // 0x574(0x1), Mask(0x1)
	uint8_t BitPad_0x574_1 : 7; // 0x574(0x1)
	uint8_t Pad_0x575[0x3]; // 0x575(0x3)
	struct FName AnimName_Loop; // 0x578(0x8)
	uint8_t bPlayOutAnim : 1; // 0x580(0x1), Mask(0x1)
	uint8_t BitPad_0x580_1 : 7; // 0x580(0x1)
	uint8_t Pad_0x581[0x3]; // 0x581(0x3)
	struct FName AnimName_Out; // 0x584(0x8)
	float AnimOutTime; // 0x58C(0x4)
	float AnimLoopStartDelayTime; // 0x590(0x4)
	float AnimLoopIntervalTime; // 0x594(0x4)
	float MarkingAnimTime; // 0x598(0x4)
	struct FVector2D InnerViewMargin; // 0x59C(0x8)
	struct FVector2D OuterViewMargin; // 0x5A4(0x8)
	struct FVector2D AnchorCenterOffest; // 0x5AC(0x8)
	uint8_t Pad_0x5B4[0x84]; // 0x5B4(0x84)
	struct UMarkingFlaggedFrameWidget* FlaggedFrameWidget; // 0x638(0x8)
	uint8_t Pad_0x640[0xC]; // 0x640(0xC)
	float LerpHalfTime; // 0x64C(0x4)
	uint8_t Pad_0x650[0x28]; // 0x650(0x28)
	struct UTextBlock* DistText; // 0x678(0x8)
	struct UTextBlock* DistTextTrace; // 0x680(0x8)
	struct UImage* Arrow; // 0x688(0x8)
	struct UGPMarkerBubbleBox* BubbleBox; // 0x690(0x8)
	struct FVector2D DistTextTraceOffset; // 0x698(0x8)
	float SettingOpacity; // 0x6A0(0x4)
	uint8_t Pad_0x6A4[0xC]; // 0x6A4(0xC)
	uint8_t bEnableSmooth : 1; // 0x6B0(0x1), Mask(0x1)
	uint8_t BitPad_0x6B0_1 : 7; // 0x6B0(0x1)
	uint8_t Pad_0x6B1[0x3]; // 0x6B1(0x3)
	float SmoothAlpha; // 0x6B4(0x4)
	struct FMarkerViewCreateConfig MarkerViewCreateConfig; // 0x6B8(0xE0)
	uint8_t Pad_0x798[0x18]; // 0x798(0x18)

	// Object: Function DFMGameHud.GameMarkerBaseWidget.UpdateAimedCircleRadiusOpacity
	// Flags: [Final|Native|Public]
	// Offset: 0xd5fb5dc
	// Params: [ Num(0) Size(0x0) ]
	void UpdateAimedCircleRadiusOpacity();

	// Object: Function DFMGameHud.GameMarkerBaseWidget.SetDistTextOutScreenOffset
	// Flags: [Native|Public]
	// Offset: 0xd5fb528
	// Params: [ Num(1) Size(0x1) ]
	void SetDistTextOutScreenOffset(uint8_t bIsLeftSide);

	// Object: Function DFMGameHud.GameMarkerBaseWidget.PlayMarkingAnimationLoop
	// Flags: [Native|Public]
	// Offset: 0xd5fb50c
	// Params: [ Num(0) Size(0x0) ]
	void PlayMarkingAnimationLoop();

	// Object: Function DFMGameHud.GameMarkerBaseWidget.OnBubbleLoopTimerFinished
	// Flags: [Final|Native|Protected]
	// Offset: 0xd5fb4f8
	// Params: [ Num(0) Size(0x0) ]
	void OnBubbleLoopTimerFinished();

	// Object: Function DFMGameHud.GameMarkerBaseWidget.HideMarkingWidget
	// Flags: [Native|Public]
	// Offset: 0xd5fb4dc
	// Params: [ Num(0) Size(0x0) ]
	void HideMarkingWidget();

	// Object: Function DFMGameHud.GameMarkerBaseWidget.GetSmoothScreenPosition
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xd5fb424
	// Params: [ Num(2) Size(0x10) ]
	struct FVector2D GetSmoothScreenPosition(const struct FVector2D& CurScreenPosition);

	// Object: Function DFMGameHud.GameMarkerBaseWidget.ClearBubble
	// Flags: [Final|Native|Protected]
	// Offset: 0xd5fb410
	// Params: [ Num(0) Size(0x0) ]
	void ClearBubble();
};

// Object: Class DFMGameHud.BionicBirdMarkerWidget
// Size: 0x7C0 (Inherited: 0x7B0)
struct UBionicBirdMarkerWidget : UGameMarkerBaseWidget
{
	DEFINE_UE_CLASS_HELPERS(UBionicBirdMarkerWidget, "BionicBirdMarkerWidget")

	struct FName MarkSoundName; // 0x7B0(0x8)
	uint8_t Pad_0x7B8[0x8]; // 0x7B8(0x8)

	// Object: Function DFMGameHud.BionicBirdMarkerWidget.PlayMarkSound
	// Flags: [Final|Native|Protected]
	// Offset: 0xd513158
	// Params: [ Num(0) Size(0x0) ]
	void PlayMarkSound();

	// Object: Function DFMGameHud.BionicBirdMarkerWidget.BP_SetCountDownPercent
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetCountDownPercent(float Percent);

	// Object: Function DFMGameHud.BionicBirdMarkerWidget.BP_SetBionicBirdMarkerItemType
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetBionicBirdMarkerItemType(int32_t ItemType);
};

// Object: Class DFMGameHud.DFMassMarkerBaseWidget
// Size: 0x848 (Inherited: 0x570)
struct UDFMassMarkerBaseWidget : UGPMassMarkerBaseWidget
{
	DEFINE_UE_CLASS_HELPERS(UDFMassMarkerBaseWidget, "DFMassMarkerBaseWidget")

	uint8_t Pad_0x570[0x8]; // 0x570(0x8)
	struct UGPMarkerMassSubsystem* MarkerMassSubsystem; // 0x578(0x8)
	struct UMassEntitySubsystem* MassEntitySubsystem; // 0x580(0x8)
	struct AGPMarkerManager* MarkerManager; // 0x588(0x8)
	struct UUserWidget* MarkingAnimWidget; // 0x590(0x8)
	struct UCanvasPanel* MarkerCanvasPanel; // 0x598(0x8)
	struct AActor* MarkedActor; // 0x5A0(0x8)
	uint8_t Pad_0x5A8[0x24]; // 0x5A8(0x24)
	struct FVector2D DistTextTraceOffset; // 0x5CC(0x8)
	uint8_t Pad_0x5D4[0x24]; // 0x5D4(0x24)
	struct UTextBlock* DistText; // 0x5F8(0x8)
	struct UTextBlock* DistTextTrace; // 0x600(0x8)
	struct UImage* Arrow; // 0x608(0x8)
	float SettingOpacity; // 0x610(0x4)
	uint8_t Pad_0x614[0x18]; // 0x614(0x18)
	struct FName MarkerCanvasPanelName; // 0x62C(0x8)
	uint8_t bUsingMarkingAnimWidget : 1; // 0x634(0x1), Mask(0x1)
	uint8_t BitPad_0x634_1 : 7; // 0x634(0x1)
	uint8_t Pad_0x635[0x3]; // 0x635(0x3)
	struct UUserWidget* MarkingAnimWidgetClass_SOL; // 0x638(0x8)
	struct FName AnimName_Marking_SOL; // 0x640(0x8)
	struct FAnchorData MarkerAnchorData_SOL; // 0x648(0x28)
	struct FName MarkingSoundName_SOL; // 0x670(0x8)
	struct TMap<EMarkerCampType, struct FMarkingAnimDataMap> CampMarkingAnimDataMap_BattleField; // 0x678(0x50)
	struct TMap<EMarkerCampType, struct FMarkingAnimDataMap> UpgradeCampMarkingAnimDataMap_BattleField; // 0x6C8(0x50)
	uint8_t bPlayInAnim : 1; // 0x718(0x1), Mask(0x1)
	uint8_t BitPad_0x718_1 : 7; // 0x718(0x1)
	uint8_t Pad_0x719[0x3]; // 0x719(0x3)
	struct FName AnimName_In; // 0x71C(0x8)
	uint8_t bPlayLoopAnim : 1; // 0x724(0x1), Mask(0x1)
	uint8_t BitPad_0x724_1 : 7; // 0x724(0x1)
	uint8_t Pad_0x725[0x3]; // 0x725(0x3)
	struct FName AnimName_Loop; // 0x728(0x8)
	uint8_t bPlayOutAnim : 1; // 0x730(0x1), Mask(0x1)
	uint8_t BitPad_0x730_1 : 7; // 0x730(0x1)
	uint8_t Pad_0x731[0x3]; // 0x731(0x3)
	struct FName AnimName_Out; // 0x734(0x8)
	float AnimOutTime; // 0x73C(0x4)
	float AnimLoopStartDelayTime; // 0x740(0x4)
	float AnimLoopIntervalTime; // 0x744(0x4)
	float MarkingAnimTime; // 0x748(0x4)
	struct FVector2D InnerViewMargin; // 0x74C(0x8)
	struct FVector2D OuterViewMargin; // 0x754(0x8)
	struct FVector2D AnchorCenterOffest; // 0x75C(0x8)
	uint8_t Pad_0x764[0x74]; // 0x764(0x74)
	struct UMarkingFlaggedFrameWidget* FlaggedFrameWidget; // 0x7D8(0x8)
	uint8_t bEnableSmooth : 1; // 0x7E0(0x1), Mask(0x1)
	uint8_t BitPad_0x7E0_1 : 7; // 0x7E0(0x1)
	uint8_t Pad_0x7E1[0x3]; // 0x7E1(0x3)
	float SmoothAlpha; // 0x7E4(0x4)
	uint8_t Pad_0x7E8[0xC]; // 0x7E8(0xC)
	struct FLinearColor NeutralColor; // 0x7F4(0x10)
	struct FLinearColor CampmateColor; // 0x804(0x10)
	struct FLinearColor TeammateColor; // 0x814(0x10)
	struct FLinearColor EnemyColor; // 0x824(0x10)
	struct FLinearColor SelfColor; // 0x834(0x10)
	uint8_t Pad_0x844[0x4]; // 0x844(0x4)

	// Object: Function DFMGameHud.DFMassMarkerBaseWidget.UpdateAimedCircleRadiusOpacity
	// Flags: [Final|Native|Public]
	// Offset: 0xd55a8a0
	// Params: [ Num(0) Size(0x0) ]
	void UpdateAimedCircleRadiusOpacity();

	// Object: Function DFMGameHud.DFMassMarkerBaseWidget.PlayMarkingAnimationLoop
	// Flags: [Native|Public]
	// Offset: 0xd55a884
	// Params: [ Num(0) Size(0x0) ]
	void PlayMarkingAnimationLoop();

	// Object: Function DFMGameHud.DFMassMarkerBaseWidget.IsAnyViewCreateConfigHasInit
	// Flags: [Final|Native|Public]
	// Offset: 0xd55a84c
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsAnyViewCreateConfigHasInit();

	// Object: Function DFMGameHud.DFMassMarkerBaseWidget.HideMarkingWidget
	// Flags: [Native|Public]
	// Offset: 0xd55a830
	// Params: [ Num(0) Size(0x0) ]
	void HideMarkingWidget();

	// Object: Function DFMGameHud.DFMassMarkerBaseWidget.GetSmoothScreenPosition
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0xd55a778
	// Params: [ Num(2) Size(0x10) ]
	struct FVector2D GetSmoothScreenPosition(const struct FVector2D& CurScreenPosition);
};

// Object: Class DFMGameHud.BionicBirdMassMarkerWidget
// Size: 0x868 (Inherited: 0x848)
struct UBionicBirdMassMarkerWidget : UDFMassMarkerBaseWidget
{
	DEFINE_UE_CLASS_HELPERS(UBionicBirdMassMarkerWidget, "BionicBirdMassMarkerWidget")

	struct FName MarkSoundName; // 0x848(0x8)
	struct TWeakObjectPtr<struct AActor> CurrMarkingActor; // 0x850(0x8)
	uint8_t CurrMarkingType; // 0x858(0x1)
	uint8_t Pad_0x859[0x3]; // 0x859(0x3)
	float CurrMarkingTime; // 0x85C(0x4)
	float TotalMarkingTime; // 0x860(0x4)
	uint8_t bPlayMarkSound : 1; // 0x864(0x1), Mask(0x1)
	uint8_t BitPad_0x864_1 : 7; // 0x864(0x1)
	uint8_t bIsSelfMark : 1; // 0x865(0x1), Mask(0x1)
	uint8_t BitPad_0x865_1 : 7; // 0x865(0x1)
	uint8_t bIsInMP : 1; // 0x866(0x1), Mask(0x1)
	uint8_t BitPad_0x866_1 : 7; // 0x866(0x1)
	uint8_t Pad_0x867[0x1]; // 0x867(0x1)

	// Object: Function DFMGameHud.BionicBirdMassMarkerWidget.SetBionicBirdMarkerItemType
	// Flags: [Final|Native|Protected]
	// Offset: 0xd5133c0
	// Params: [ Num(6) Size(0x13) ]
	void SetBionicBirdMarkerItemType(struct AActor* InMarkingActor, uint8_t MarkingType, float MarkingTime, uint8_t InPlayMarkSound, uint8_t InIsSelfMark, uint8_t InIsInMP);

	// Object: Function DFMGameHud.BionicBirdMassMarkerWidget.PlayMarkSound
	// Flags: [Final|Native|Protected]
	// Offset: 0xd5133ac
	// Params: [ Num(0) Size(0x0) ]
	void PlayMarkSound();

	// Object: Function DFMGameHud.BionicBirdMassMarkerWidget.IsPlayMarkSound
	// Flags: [Final|Native|Protected|Const]
	// Offset: 0xd513374
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsPlayMarkSound();

	// Object: Function DFMGameHud.BionicBirdMassMarkerWidget.IsCountDown
	// Flags: [Final|Native|Protected|Const]
	// Offset: 0xd513350
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsCountDown();

	// Object: Function DFMGameHud.BionicBirdMassMarkerWidget.GetMarkerItemType
	// Flags: [Final|Native|Protected|Const]
	// Offset: 0xd513334
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetMarkerItemType();

	// Object: Function DFMGameHud.BionicBirdMassMarkerWidget.GetCountDownPercent
	// Flags: [Final|Native|Protected|Const]
	// Offset: 0xd513300
	// Params: [ Num(1) Size(0x4) ]
	float GetCountDownPercent();

	// Object: Function DFMGameHud.BionicBirdMassMarkerWidget.BP_SetCountDownPercent
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetCountDownPercent(float Percent);

	// Object: Function DFMGameHud.BionicBirdMassMarkerWidget.BP_SetBionicBirdMarkerItemType
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetBionicBirdMarkerItemType(int32_t ItemType);
};

// Object: Class DFMGameHud.BionicSpyHudHudController
// Size: 0x80 (Inherited: 0x80)
struct UBionicSpyHudHudController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UBionicSpyHudHudController, "BionicSpyHudHudController")

	// Object: Function DFMGameHud.BionicSpyHudHudController.SetHUDState
	// Flags: [Final|Native|Private]
	// Offset: 0xd5136c8
	// Params: [ Num(1) Size(0x1) ]
	void SetHUDState(uint8_t bIsAdd);
};

// Object: Class DFMGameHud.BionicSpyHudHudView
// Size: 0x460 (Inherited: 0x400)
struct UBionicSpyHudHudView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBionicSpyHudHudView, "BionicSpyHudHudView")

	struct FBionicSpyGCConfig GCConfigHD; // 0x3FC(0x10)
	struct FBionicSpyGCConfig GCConfigMobile; // 0x40C(0x10)
	uint8_t bShowPlayerName : 1; // 0x41C(0x1), Mask(0x1)
	float BlackFadeOutTime; // 0x420(0x4)
	struct FName SprintScreenEffName; // 0x424(0x8)
	struct FName OpenSoundEvent; // 0x42C(0x8)
	struct FName CloseSoundEvent; // 0x434(0x8)
	float EnergyPercent; // 0x43C(0x4)
	struct FBionicSpyGCConfig GCConfig; // 0x440(0x10)
	uint8_t bIsViewSpy : 1; // 0x450(0x1), Mask(0x1)
	uint8_t BitPad_0x450_2 : 6; // 0x450(0x1)
	uint8_t bSwitchToSpyEnd : 1; // 0x451(0x1), Mask(0x1)
	uint8_t BitPad_0x451_1 : 7; // 0x451(0x1)
	uint8_t bSwitchToPlayerEnd : 1; // 0x452(0x1), Mask(0x1)
	uint8_t BitPad_0x452_1 : 7; // 0x452(0x1)
	uint8_t bSwitchToPlayerFadeIn : 1; // 0x453(0x1), Mask(0x1)
	uint8_t BitPad_0x453_1 : 7; // 0x453(0x1)
	uint8_t bStopSwitchToSpy : 1; // 0x454(0x1), Mask(0x1)
	uint8_t BitPad_0x454_1 : 7; // 0x454(0x1)
	uint8_t bInOpenWorldStage : 1; // 0x455(0x1), Mask(0x1)
	uint8_t BitPad_0x455_1 : 7; // 0x455(0x1)
	uint8_t bIsAddLoadingEvent : 1; // 0x456(0x1), Mask(0x1)
	uint8_t BitPad_0x456_1 : 7; // 0x456(0x1)
	uint8_t bIsShadowCacheFOV : 1; // 0x457(0x1), Mask(0x1)
	uint8_t BitPad_0x457_1 : 7; // 0x457(0x1)
	uint8_t bIsFlushEnd : 1; // 0x458(0x1), Mask(0x1)
	uint8_t BitPad_0x458_1 : 7; // 0x458(0x1)
	EBionicSpyHudSwitchState SwitchState; // 0x459(0x1)
	uint8_t Pad_0x45A[0x2]; // 0x45A(0x2)
	float CurrSwitchTime; // 0x45C(0x4)

	// Object: Function DFMGameHud.BionicSpyHudHudView.UpdateEnergyPercent
	// Flags: [Final|Native|Private]
	// Offset: 0xd514598
	// Params: [ Num(0) Size(0x0) ]
	void UpdateEnergyPercent();

	// Object: Function DFMGameHud.BionicSpyHudHudView.TryStopLockLocalCharacter
	// Flags: [Final|Native|Private]
	// Offset: 0xd514584
	// Params: [ Num(0) Size(0x0) ]
	void TryStopLockLocalCharacter();

	// Object: Function DFMGameHud.BionicSpyHudHudView.TrySetTargetName
	// Flags: [Final|Native|Private]
	// Offset: 0xd514570
	// Params: [ Num(0) Size(0x0) ]
	void TrySetTargetName();

	// Object: Function DFMGameHud.BionicSpyHudHudView.TryRemoveScreenEffect
	// Flags: [Final|Native|Private]
	// Offset: 0xd51455c
	// Params: [ Num(0) Size(0x0) ]
	void TryRemoveScreenEffect();

	// Object: Function DFMGameHud.BionicSpyHudHudView.TryRemoveHudState
	// Flags: [Final|Native|Private]
	// Offset: 0xd514548
	// Params: [ Num(0) Size(0x0) ]
	void TryRemoveHudState();

	// Object: Function DFMGameHud.BionicSpyHudHudView.TryRemoveBaseHudState
	// Flags: [Final|Native|Private]
	// Offset: 0xd514534
	// Params: [ Num(0) Size(0x0) ]
	void TryRemoveBaseHudState();

	// Object: Function DFMGameHud.BionicSpyHudHudView.TryAddScreenEffect
	// Flags: [Final|Native|Private]
	// Offset: 0xd514520
	// Params: [ Num(0) Size(0x0) ]
	void TryAddScreenEffect();

	// Object: Function DFMGameHud.BionicSpyHudHudView.TickSwitchToSpyView
	// Flags: [Final|Native|Private]
	// Offset: 0xd51447c
	// Params: [ Num(1) Size(0x4) ]
	void TickSwitchToSpyView(float Delta);

	// Object: Function DFMGameHud.BionicSpyHudHudView.TickSwitchToPlayerView
	// Flags: [Final|Native|Private]
	// Offset: 0xd5143d8
	// Params: [ Num(1) Size(0x4) ]
	void TickSwitchToPlayerView(float Delta);

	// Object: Function DFMGameHud.BionicSpyHudHudView.TickSwitchTarget
	// Flags: [Final|Native|Private]
	// Offset: 0xd514334
	// Params: [ Num(1) Size(0x4) ]
	void TickSwitchTarget(float Delta);

	// Object: Function DFMGameHud.BionicSpyHudHudView.TickLockLocalCharacter
	// Flags: [Final|Native|Private]
	// Offset: 0xd514290
	// Params: [ Num(1) Size(0x4) ]
	void TickLockLocalCharacter(float Delta);

	// Object: Function DFMGameHud.BionicSpyHudHudView.SwitchToSpyViewEnd
	// Flags: [Final|Native|Private]
	// Offset: 0xd51427c
	// Params: [ Num(0) Size(0x0) ]
	void SwitchToSpyViewEnd();

	// Object: Function DFMGameHud.BionicSpyHudHudView.SwitchToPlayerViewEnd
	// Flags: [Final|Native|Private]
	// Offset: 0xd514268
	// Params: [ Num(0) Size(0x0) ]
	void SwitchToPlayerViewEnd();

	// Object: Function DFMGameHud.BionicSpyHudHudView.StopSwitchToSpy
	// Flags: [Final|Native|Private]
	// Offset: 0xd514254
	// Params: [ Num(0) Size(0x0) ]
	void StopSwitchToSpy();

	// Object: Function DFMGameHud.BionicSpyHudHudView.StartSwitchViewTarget
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xd5141a4
	// Params: [ Num(1) Size(0xC) ]
	void StartSwitchViewTarget(const struct FVector& Position);

	// Object: Function DFMGameHud.BionicSpyHudHudView.StartBlackFadeIn
	// Flags: [Final|Native|Private]
	// Offset: 0xd514190
	// Params: [ Num(0) Size(0x0) ]
	void StartBlackFadeIn();

	// Object: Function DFMGameHud.BionicSpyHudHudView.SetShadowCacheFOV
	// Flags: [Final|Native|Private]
	// Offset: 0xd5140e4
	// Params: [ Num(1) Size(0x1) ]
	void SetShadowCacheFOV(uint8_t bIsOpen);

	// Object: Function DFMGameHud.BionicSpyHudHudView.RemovePlayerControllerSetViewTargetEvent
	// Flags: [Final|Native|Private]
	// Offset: 0xd5140d0
	// Params: [ Num(0) Size(0x0) ]
	void RemovePlayerControllerSetViewTargetEvent();

	// Object: Function DFMGameHud.BionicSpyHudHudView.PlaySoundByEventName
	// Flags: [Final|Native|Private|HasOutParms]
	// Offset: 0xd51401c
	// Params: [ Num(1) Size(0x8) ]
	void PlaySoundByEventName(const struct FName& SoundEventName);

	// Object: Function DFMGameHud.BionicSpyHudHudView.OpenWorldExitStage
	// Flags: [Final|Native|Private]
	// Offset: 0xd514008
	// Params: [ Num(0) Size(0x0) ]
	void OpenWorldExitStage();

	// Object: Function DFMGameHud.BionicSpyHudHudView.OpenWorldEnterStage
	// Flags: [Final|Native|Private]
	// Offset: 0xd513ff4
	// Params: [ Num(0) Size(0x0) ]
	void OpenWorldEnterStage();

	// Object: Function DFMGameHud.BionicSpyHudHudView.OnSwitchViewLoadingPercentage
	// Flags: [Final|Native|Private]
	// Offset: 0xd513f50
	// Params: [ Num(1) Size(0x4) ]
	void OnSwitchViewLoadingPercentage(int32_t Percentage);

	// Object: Function DFMGameHud.BionicSpyHudHudView.OnStopViewSpy
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xd513ea0
	// Params: [ Num(1) Size(0xC) ]
	void OnStopViewSpy(const struct FVector& Position);

	// Object: Function DFMGameHud.BionicSpyHudHudView.OnStartViewSpy
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xd513df0
	// Params: [ Num(1) Size(0xC) ]
	void OnStartViewSpy(const struct FVector& Position);

	// Object: Function DFMGameHud.BionicSpyHudHudView.OnSetViewTarget
	// Flags: [Final|Native|Private]
	// Offset: 0xd513d4c
	// Params: [ Num(1) Size(0x8) ]
	void OnSetViewTarget(struct AActor* InNewTarget);

	// Object: Function DFMGameHud.BionicSpyHudHudView.OnAbilityBionicSpyInfo
	// Flags: [Final|Native|Private]
	// Offset: 0xd513c6c
	// Params: [ Num(2) Size(0xC) ]
	void OnAbilityBionicSpyInfo(struct AActor* SpyActor, int32_t Type);

	// Object: Function DFMGameHud.BionicSpyHudHudView.InputAction
	// Flags: [Final|Native|Private]
	// Offset: 0xd513bc8
	// Params: [ Num(1) Size(0x2) ]
	void InputAction(EInputActionType InputActionType);

	// Object: Function DFMGameHud.BionicSpyHudHudView.GetMaxBlackTime
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xd513b94
	// Params: [ Num(1) Size(0x4) ]
	float GetMaxBlackTime();

	// Object: Function DFMGameHud.BionicSpyHudHudView.GetLocalCharacter
	// Flags: [Final|Native|Private]
	// Offset: 0xd513b60
	// Params: [ Num(1) Size(0x8) ]
	struct AGPCharacter* GetLocalCharacter();

	// Object: Function DFMGameHud.BionicSpyHudHudView.GetBionicSpyActor
	// Flags: [Final|Native|Private]
	// Offset: 0xd513b2c
	// Params: [ Num(1) Size(0x8) ]
	struct ABionicSpyBaseActor* GetBionicSpyActor();

	// Object: Function DFMGameHud.BionicSpyHudHudView.ForceStopViewSpy
	// Flags: [Final|Native|Private]
	// Offset: 0xd513b18
	// Params: [ Num(0) Size(0x0) ]
	void ForceStopViewSpy();

	// Object: Function DFMGameHud.BionicSpyHudHudView.EndSwitchViewTarget
	// Flags: [Final|Native|Private]
	// Offset: 0xd513b04
	// Params: [ Num(0) Size(0x0) ]
	void EndSwitchViewTarget();

	// Object: Function DFMGameHud.BionicSpyHudHudView.DoStartSwitchViewTarget
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xd513a54
	// Params: [ Num(2) Size(0xD) ]
	uint8_t DoStartSwitchViewTarget(struct FVector Position);

	// Object: Function DFMGameHud.BionicSpyHudHudView.DoCheckSpyMode
	// Flags: [Final|Native|Private]
	// Offset: 0xd513a1c
	// Params: [ Num(1) Size(0x1) ]
	uint8_t DoCheckSpyMode();

	// Object: Function DFMGameHud.BionicSpyHudHudView.CleanWorldCompositionTempConfig
	// Flags: [Final|Native|Private]
	// Offset: 0xd513a08
	// Params: [ Num(0) Size(0x0) ]
	void CleanWorldCompositionTempConfig();

	// Object: Function DFMGameHud.BionicSpyHudHudView.CleanSwitchArgs
	// Flags: [Final|Native|Private]
	// Offset: 0xd5139f4
	// Params: [ Num(0) Size(0x0) ]
	void CleanSwitchArgs();

	// Object: Function DFMGameHud.BionicSpyHudHudView.CheckCurrViewTarget
	// Flags: [Final|Native|Private]
	// Offset: 0xd5139e0
	// Params: [ Num(0) Size(0x0) ]
	void CheckCurrViewTarget();

	// Object: Function DFMGameHud.BionicSpyHudHudView.BP_UpdateUI
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_UpdateUI();

	// Object: Function DFMGameHud.BionicSpyHudHudView.BP_SetTargetName
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x10) ]
	void BP_SetTargetName(struct FString TargetName);

	// Object: Function DFMGameHud.BionicSpyHudHudView.BP_SetBtnShowState
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_SetBtnShowState(uint8_t bIsShow);

	// Object: Function DFMGameHud.BionicSpyHudHudView.BP_ForceSetBlack
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_ForceSetBlack();

	// Object: Function DFMGameHud.BionicSpyHudHudView.BP_Exit
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xd5139cc
	// Params: [ Num(0) Size(0x0) ]
	void BP_Exit();

	// Object: Function DFMGameHud.BionicSpyHudHudView.BP_CheckSpyMode
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xd5139b8
	// Params: [ Num(0) Size(0x0) ]
	void BP_CheckSpyMode();

	// Object: Function DFMGameHud.BionicSpyHudHudView.BP_BlackFadeOut
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_BlackFadeOut();

	// Object: Function DFMGameHud.BionicSpyHudHudView.BP_BlackFadeIn
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_BlackFadeIn();

	// Object: Function DFMGameHud.BionicSpyHudHudView.AddPlayerControllerSetViewTargetEvent
	// Flags: [Final|Native|Private]
	// Offset: 0xd5139a4
	// Params: [ Num(0) Size(0x0) ]
	void AddPlayerControllerSetViewTargetEvent();
};

// Object: Class DFMGameHud.BionicSpyHudView
// Size: 0x450 (Inherited: 0x3F0)
struct UBionicSpyHudView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBionicSpyHudView, "BionicSpyHudView")

	struct FBionicSpyGCConfig GCConfigHD; // 0x3EC(0x10)
	struct FBionicSpyGCConfig GCConfigMobile; // 0x3FC(0x10)
	uint8_t bShowPlayerName : 1; // 0x40C(0x1), Mask(0x1)
	float BlackFadeOutTime; // 0x410(0x4)
	struct FName SprintScreenEffName; // 0x414(0x8)
	struct FName OpenSoundEvent; // 0x41C(0x8)
	struct FName CloseSoundEvent; // 0x424(0x8)
	float EnergyPercent; // 0x42C(0x4)
	struct FBionicSpyGCConfig GCConfig; // 0x430(0x10)
	uint8_t bIsViewSpy : 1; // 0x440(0x1), Mask(0x1)
	uint8_t BitPad_0x440_2 : 6; // 0x440(0x1)
	uint8_t bSwitchToSpyEnd : 1; // 0x441(0x1), Mask(0x1)
	uint8_t BitPad_0x441_1 : 7; // 0x441(0x1)
	uint8_t bSwitchToPlayerEnd : 1; // 0x442(0x1), Mask(0x1)
	uint8_t BitPad_0x442_1 : 7; // 0x442(0x1)
	uint8_t bSwitchToPlayerFadeIn : 1; // 0x443(0x1), Mask(0x1)
	uint8_t BitPad_0x443_1 : 7; // 0x443(0x1)
	uint8_t bStopSwitchToSpy : 1; // 0x444(0x1), Mask(0x1)
	uint8_t BitPad_0x444_1 : 7; // 0x444(0x1)
	uint8_t bInOpenWorldStage : 1; // 0x445(0x1), Mask(0x1)
	uint8_t BitPad_0x445_1 : 7; // 0x445(0x1)
	uint8_t bIsAddLoadingEvent : 1; // 0x446(0x1), Mask(0x1)
	uint8_t BitPad_0x446_1 : 7; // 0x446(0x1)
	uint8_t bIsShadowCacheFOV : 1; // 0x447(0x1), Mask(0x1)
	uint8_t BitPad_0x447_1 : 7; // 0x447(0x1)
	uint8_t bIsFlushEnd : 1; // 0x448(0x1), Mask(0x1)
	uint8_t BitPad_0x448_1 : 7; // 0x448(0x1)
	EBionicSpyHudSwitchState SwitchState; // 0x449(0x1)
	uint8_t Pad_0x44A[0x2]; // 0x44A(0x2)
	float CurrSwitchTime; // 0x44C(0x4)

	// Object: Function DFMGameHud.BionicSpyHudView.UpdateEnergyPercent
	// Flags: [Final|Native|Private]
	// Offset: 0xd51549c
	// Params: [ Num(0) Size(0x0) ]
	void UpdateEnergyPercent();

	// Object: Function DFMGameHud.BionicSpyHudView.TryStopLockLocalCharacter
	// Flags: [Final|Native|Private]
	// Offset: 0xd515488
	// Params: [ Num(0) Size(0x0) ]
	void TryStopLockLocalCharacter();

	// Object: Function DFMGameHud.BionicSpyHudView.TrySetTargetName
	// Flags: [Final|Native|Private]
	// Offset: 0xd515474
	// Params: [ Num(0) Size(0x0) ]
	void TrySetTargetName();

	// Object: Function DFMGameHud.BionicSpyHudView.TryRemoveScreenEffect
	// Flags: [Final|Native|Private]
	// Offset: 0xd515460
	// Params: [ Num(0) Size(0x0) ]
	void TryRemoveScreenEffect();

	// Object: Function DFMGameHud.BionicSpyHudView.TryRemoveHudState
	// Flags: [Final|Native|Private]
	// Offset: 0xd51544c
	// Params: [ Num(0) Size(0x0) ]
	void TryRemoveHudState();

	// Object: Function DFMGameHud.BionicSpyHudView.TryAddScreenEffect
	// Flags: [Final|Native|Private]
	// Offset: 0xd515438
	// Params: [ Num(0) Size(0x0) ]
	void TryAddScreenEffect();

	// Object: Function DFMGameHud.BionicSpyHudView.TickSwitchToSpyView
	// Flags: [Final|Native|Private]
	// Offset: 0xd515394
	// Params: [ Num(1) Size(0x4) ]
	void TickSwitchToSpyView(float Delta);

	// Object: Function DFMGameHud.BionicSpyHudView.TickSwitchToPlayerView
	// Flags: [Final|Native|Private]
	// Offset: 0xd5152f0
	// Params: [ Num(1) Size(0x4) ]
	void TickSwitchToPlayerView(float Delta);

	// Object: Function DFMGameHud.BionicSpyHudView.TickSwitchTarget
	// Flags: [Final|Native|Private]
	// Offset: 0xd51524c
	// Params: [ Num(1) Size(0x4) ]
	void TickSwitchTarget(float Delta);

	// Object: Function DFMGameHud.BionicSpyHudView.TickLockLocalCharacter
	// Flags: [Final|Native|Private]
	// Offset: 0xd5151a8
	// Params: [ Num(1) Size(0x4) ]
	void TickLockLocalCharacter(float Delta);

	// Object: Function DFMGameHud.BionicSpyHudView.SwitchToSpyViewEnd
	// Flags: [Final|Native|Private]
	// Offset: 0xd515194
	// Params: [ Num(0) Size(0x0) ]
	void SwitchToSpyViewEnd();

	// Object: Function DFMGameHud.BionicSpyHudView.SwitchToPlayerViewEnd
	// Flags: [Final|Native|Private]
	// Offset: 0xd515180
	// Params: [ Num(0) Size(0x0) ]
	void SwitchToPlayerViewEnd();

	// Object: Function DFMGameHud.BionicSpyHudView.StopSwitchToSpy
	// Flags: [Final|Native|Private]
	// Offset: 0xd51516c
	// Params: [ Num(0) Size(0x0) ]
	void StopSwitchToSpy();

	// Object: Function DFMGameHud.BionicSpyHudView.StartSwitchViewTarget
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xd5150bc
	// Params: [ Num(1) Size(0xC) ]
	void StartSwitchViewTarget(const struct FVector& Position);

	// Object: Function DFMGameHud.BionicSpyHudView.StartBlackFadeIn
	// Flags: [Final|Native|Private]
	// Offset: 0xd5150a8
	// Params: [ Num(0) Size(0x0) ]
	void StartBlackFadeIn();

	// Object: Function DFMGameHud.BionicSpyHudView.SetShadowCacheFOV
	// Flags: [Final|Native|Private]
	// Offset: 0xd514ffc
	// Params: [ Num(1) Size(0x1) ]
	void SetShadowCacheFOV(uint8_t bIsOpen);

	// Object: Function DFMGameHud.BionicSpyHudView.RemovePlayerControllerSetViewTargetEvent
	// Flags: [Final|Native|Private]
	// Offset: 0xd514fe8
	// Params: [ Num(0) Size(0x0) ]
	void RemovePlayerControllerSetViewTargetEvent();

	// Object: Function DFMGameHud.BionicSpyHudView.PlaySoundByEventName
	// Flags: [Final|Native|Private|HasOutParms]
	// Offset: 0xd514f34
	// Params: [ Num(1) Size(0x8) ]
	void PlaySoundByEventName(const struct FName& SoundEventName);

	// Object: Function DFMGameHud.BionicSpyHudView.OpenWorldExitStage
	// Flags: [Final|Native|Private]
	// Offset: 0xd514f20
	// Params: [ Num(0) Size(0x0) ]
	void OpenWorldExitStage();

	// Object: Function DFMGameHud.BionicSpyHudView.OpenWorldEnterStage
	// Flags: [Final|Native|Private]
	// Offset: 0xd514f0c
	// Params: [ Num(0) Size(0x0) ]
	void OpenWorldEnterStage();

	// Object: Function DFMGameHud.BionicSpyHudView.OnSwitchViewLoadingPercentage
	// Flags: [Final|Native|Private]
	// Offset: 0xd514e68
	// Params: [ Num(1) Size(0x4) ]
	void OnSwitchViewLoadingPercentage(int32_t Percentage);

	// Object: Function DFMGameHud.BionicSpyHudView.OnStopViewSpy
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xd514db8
	// Params: [ Num(1) Size(0xC) ]
	void OnStopViewSpy(const struct FVector& Position);

	// Object: Function DFMGameHud.BionicSpyHudView.OnStartViewSpy
	// Flags: [Final|Native|Private|HasOutParms|HasDefaults]
	// Offset: 0xd514d08
	// Params: [ Num(1) Size(0xC) ]
	void OnStartViewSpy(const struct FVector& Position);

	// Object: Function DFMGameHud.BionicSpyHudView.OnSetViewTarget
	// Flags: [Final|Native|Private]
	// Offset: 0xd514c64
	// Params: [ Num(1) Size(0x8) ]
	void OnSetViewTarget(struct AActor* InNewTarget);

	// Object: Function DFMGameHud.BionicSpyHudView.OnAbilityBionicSpyInfo
	// Flags: [Final|Native|Private]
	// Offset: 0xd514b84
	// Params: [ Num(2) Size(0xC) ]
	void OnAbilityBionicSpyInfo(struct AActor* SpyActor, int32_t Type);

	// Object: Function DFMGameHud.BionicSpyHudView.InputAction
	// Flags: [Final|Native|Private]
	// Offset: 0xd514ae0
	// Params: [ Num(1) Size(0x2) ]
	void InputAction(EInputActionType InputActionType);

	// Object: Function DFMGameHud.BionicSpyHudView.GetMaxBlackTime
	// Flags: [Final|Native|Private|Const]
	// Offset: 0xd514aac
	// Params: [ Num(1) Size(0x4) ]
	float GetMaxBlackTime();

	// Object: Function DFMGameHud.BionicSpyHudView.GetLocalCharacter
	// Flags: [Final|Native|Private]
	// Offset: 0xd514a78
	// Params: [ Num(1) Size(0x8) ]
	struct AGPCharacter* GetLocalCharacter();

	// Object: Function DFMGameHud.BionicSpyHudView.GetBionicSpyActor
	// Flags: [Final|Native|Private]
	// Offset: 0xd514a44
	// Params: [ Num(1) Size(0x8) ]
	struct ABionicSpyBaseActor* GetBionicSpyActor();

	// Object: Function DFMGameHud.BionicSpyHudView.ForceStopViewSpy
	// Flags: [Final|Native|Private]
	// Offset: 0xd514a30
	// Params: [ Num(0) Size(0x0) ]
	void ForceStopViewSpy();

	// Object: Function DFMGameHud.BionicSpyHudView.EndSwitchViewTarget
	// Flags: [Final|Native|Private]
	// Offset: 0xd514a1c
	// Params: [ Num(0) Size(0x0) ]
	void EndSwitchViewTarget();

	// Object: Function DFMGameHud.BionicSpyHudView.DoStartSwitchViewTarget
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xd51496c
	// Params: [ Num(2) Size(0xD) ]
	uint8_t DoStartSwitchViewTarget(struct FVector Position);

	// Object: Function DFMGameHud.BionicSpyHudView.DoCheckSpyMode
	// Flags: [Final|Native|Private]
	// Offset: 0xd514934
	// Params: [ Num(1) Size(0x1) ]
	uint8_t DoCheckSpyMode();

	// Object: Function DFMGameHud.BionicSpyHudView.CleanWorldCompositionTempConfig
	// Flags: [Final|Native|Private]
	// Offset: 0xd514920
	// Params: [ Num(0) Size(0x0) ]
	void CleanWorldCompositionTempConfig();

	// Object: Function DFMGameHud.BionicSpyHudView.CleanSwitchArgs
	// Flags: [Final|Native|Private]
	// Offset: 0xd51490c
	// Params: [ Num(0) Size(0x0) ]
	void CleanSwitchArgs();

	// Object: Function DFMGameHud.BionicSpyHudView.CheckCurrViewTarget
	// Flags: [Final|Native|Private]
	// Offset: 0xd5148f8
	// Params: [ Num(0) Size(0x0) ]
	void CheckCurrViewTarget();

	// Object: Function DFMGameHud.BionicSpyHudView.BP_UpdateUI
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_UpdateUI();

	// Object: Function DFMGameHud.BionicSpyHudView.BP_SetTargetName
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x10) ]
	void BP_SetTargetName(struct FString TargetName);

	// Object: Function DFMGameHud.BionicSpyHudView.BP_SetBtnShowState
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_SetBtnShowState(uint8_t bIsShow);

	// Object: Function DFMGameHud.BionicSpyHudView.BP_ForceSetBlack
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_ForceSetBlack();

	// Object: Function DFMGameHud.BionicSpyHudView.BP_Exit
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xd5148e4
	// Params: [ Num(0) Size(0x0) ]
	void BP_Exit();

	// Object: Function DFMGameHud.BionicSpyHudView.BP_CheckSpyMode
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xd5148d0
	// Params: [ Num(0) Size(0x0) ]
	void BP_CheckSpyMode();

	// Object: Function DFMGameHud.BionicSpyHudView.BP_BlackFadeOut
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_BlackFadeOut();

	// Object: Function DFMGameHud.BionicSpyHudView.BP_BlackFadeIn
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_BlackFadeIn();

	// Object: Function DFMGameHud.BionicSpyHudView.AddPlayerControllerSetViewTargetEvent
	// Flags: [Final|Native|Private]
	// Offset: 0xd5148bc
	// Params: [ Num(0) Size(0x0) ]
	void AddPlayerControllerSetViewTargetEvent();
};

// Object: Class DFMGameHud.BionicSpyProgressHUDHudView
// Size: 0x420 (Inherited: 0x400)
struct UBionicSpyProgressHUDHudView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBionicSpyProgressHUDHudView, "BionicSpyProgressHUDHudView")

	struct FString HitTargetVoiceString; // 0x400(0x10)
	struct FName DiscoveredSoundName; // 0x410(0x8)
	struct FTimerHandle AutoHideTimerHandle; // 0x418(0x8)

	// Object: Function DFMGameHud.BionicSpyProgressHUDHudView.PlayHitVO
	// Flags: [Final|Native|Protected]
	// Offset: 0xd516f28
	// Params: [ Num(0) Size(0x0) ]
	void PlayHitVO();

	// Object: Function DFMGameHud.BionicSpyProgressHUDHudView.PlayDiscoveredSound
	// Flags: [Final|Native|Protected]
	// Offset: 0xd516f14
	// Params: [ Num(0) Size(0x0) ]
	void PlayDiscoveredSound();

	// Object: Function DFMGameHud.BionicSpyProgressHUDHudView.OnNotifyStartCast
	// Flags: [Final|Native|Protected]
	// Offset: 0xd516e70
	// Params: [ Num(1) Size(0x4) ]
	void OnNotifyStartCast(int32_t CastResult);

	// Object: Function DFMGameHud.BionicSpyProgressHUDHudView.OnNotifyCastResult
	// Flags: [Final|Native|Protected]
	// Offset: 0xd516dcc
	// Params: [ Num(1) Size(0x4) ]
	void OnNotifyCastResult(int32_t CastResult);

	// Object: Function DFMGameHud.BionicSpyProgressHUDHudView.OnAutoHideTimerTimer
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void OnAutoHideTimerTimer();

	// Object: Function DFMGameHud.BionicSpyProgressHUDHudView.BP_StopAutoHideTimerTimer
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xd516db8
	// Params: [ Num(0) Size(0x0) ]
	void BP_StopAutoHideTimerTimer();

	// Object: Function DFMGameHud.BionicSpyProgressHUDHudView.BP_StartCastSkill
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_StartCastSkill();

	// Object: Function DFMGameHud.BionicSpyProgressHUDHudView.BP_StartAutoHideTimerTimer
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xd516d14
	// Params: [ Num(1) Size(0x4) ]
	void BP_StartAutoHideTimerTimer(float DelayTime);

	// Object: Function DFMGameHud.BionicSpyProgressHUDHudView.BP_SetCastResult
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetCastResult(int32_t CastResult);
};

// Object: Class DFMGameHud.BionicSpyProgressHudView
// Size: 0x410 (Inherited: 0x3F0)
struct UBionicSpyProgressHudView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBionicSpyProgressHudView, "BionicSpyProgressHudView")

	struct FString HitTargetVoiceString; // 0x3F0(0x10)
	struct FName DiscoveredSoundName; // 0x400(0x8)
	struct FTimerHandle AutoHideTimerHandle; // 0x408(0x8)

	// Object: Function DFMGameHud.BionicSpyProgressHudView.PlayHitVO
	// Flags: [Final|Native|Protected]
	// Offset: 0xd517240
	// Params: [ Num(0) Size(0x0) ]
	void PlayHitVO();

	// Object: Function DFMGameHud.BionicSpyProgressHudView.PlayDiscoveredSound
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51722c
	// Params: [ Num(0) Size(0x0) ]
	void PlayDiscoveredSound();

	// Object: Function DFMGameHud.BionicSpyProgressHudView.OnNotifyStartCast
	// Flags: [Final|Native|Protected]
	// Offset: 0xd517188
	// Params: [ Num(1) Size(0x4) ]
	void OnNotifyStartCast(int32_t CastResult);

	// Object: Function DFMGameHud.BionicSpyProgressHudView.OnNotifyCastResult
	// Flags: [Final|Native|Protected]
	// Offset: 0xd5170e4
	// Params: [ Num(1) Size(0x4) ]
	void OnNotifyCastResult(int32_t CastResult);

	// Object: Function DFMGameHud.BionicSpyProgressHudView.OnAutoHideTimerTimer
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void OnAutoHideTimerTimer();

	// Object: Function DFMGameHud.BionicSpyProgressHudView.BP_StopAutoHideTimerTimer
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xd5170d0
	// Params: [ Num(0) Size(0x0) ]
	void BP_StopAutoHideTimerTimer();

	// Object: Function DFMGameHud.BionicSpyProgressHudView.BP_StartCastSkill
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BP_StartCastSkill();

	// Object: Function DFMGameHud.BionicSpyProgressHudView.BP_StartAutoHideTimerTimer
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0xd51702c
	// Params: [ Num(1) Size(0x4) ]
	void BP_StartAutoHideTimerTimer(float DelayTime);

	// Object: Function DFMGameHud.BionicSpyProgressHudView.BP_SetCastResult
	// Flags: [Event|Protected|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_SetCastResult(int32_t CastResult);
};

// Object: Class DFMGameHud.BlackScreenHudController
// Size: 0xB0 (Inherited: 0x80)
struct UBlackScreenHudController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UBlackScreenHudController, "BlackScreenHudController")

	struct UBlackScreenHudView* BlackScreenView; // 0x80(0x8)
	uint8_t Pad_0x88[0x28]; // 0x88(0x28)

	// Object: Function DFMGameHud.BlackScreenHudController.PlayFadeOut
	// Flags: [Native|Public]
	// Offset: 0xd517428
	// Params: [ Num(1) Size(0x4) ]
	void PlayFadeOut(float FadeTime);

	// Object: Function DFMGameHud.BlackScreenHudController.PlayFadeInAndOut
	// Flags: [Native|Public]
	// Offset: 0xd517308
	// Params: [ Num(3) Size(0xC) ]
	void PlayFadeInAndOut(float FadeInTime, float ShowTime, float FadeOutTime);

	// Object: Function DFMGameHud.BlackScreenHudController.PlayFadeIn
	// Flags: [Native|Public]
	// Offset: 0xd51725c
	// Params: [ Num(1) Size(0x4) ]
	void PlayFadeIn(float FadeTime);
};

// Object: Class DFMGameHud.BlackScreenHudView
// Size: 0x418 (Inherited: 0x400)
struct UBlackScreenHudView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBlackScreenHudView, "BlackScreenHudView")

	struct UWidgetAnimation* FadeInAnim; // 0x400(0x8)
	struct UWidgetAnimation* FadeOutAnim; // 0x408(0x8)
	struct UCanvasPanel* BlackScreenPanel; // 0x410(0x8)
};

// Object: Class DFMGameHud.BloodBarTipsHud
// Size: 0x4E0 (Inherited: 0x3F0)
struct UBloodBarTipsHud : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBloodBarTipsHud, "BloodBarTipsHud")

	struct TArray<struct UBloodBarTipsHudItem*> BloodUIitems; // 0x3F0(0x10)
	struct UCanvasPanel* Container; // 0x400(0x8)
	struct UBloodBarTipsHudItem* ItemClass; // 0x408(0x8)
	struct FVector2D offset; // 0x410(0x8)
	uint8_t Pad_0x418[0x38]; // 0x418(0x38)
	struct TMap<uint64_t, struct UBloodBarTipsHudItem*> BloodCharacterMap; // 0x450(0x50)
	struct ADFMCharacter* CurShowCharacter; // 0x4A0(0x8)
	uint8_t Pad_0x4A8[0x10]; // 0x4A8(0x10)
	struct TArray<struct UBloodBarTipsHudItem*> AllUIItems; // 0x4B8(0x10)
	uint8_t Pad_0x4C8[0x18]; // 0x4C8(0x18)
};

// Object: Class DFMGameHud.BloodBarTipsHudItem
// Size: 0x328 (Inherited: 0x2F8)
struct UBloodBarTipsHudItem : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UBloodBarTipsHudItem, "BloodBarTipsHudItem")

	struct UTextBlock* NameTxt; // 0x2F8(0x8)
	struct ACHARACTER* OwnCharacter; // 0x300(0x8)
	uint8_t IsFinshed : 1; // 0x308(0x1), Mask(0x1)
	uint8_t BitPad_0x308_1 : 7; // 0x308(0x1)
	uint8_t Pad_0x309[0x7]; // 0x309(0x7)
	struct UBloodBarTipsHud* ParentHud; // 0x310(0x8)
	uint8_t Pad_0x318[0x10]; // 0x318(0x10)

	// Object: Function DFMGameHud.BloodBarTipsHudItem.OnUpdateHealthBar
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(2) Size(0x5) ]
	void OnUpdateHealthBar(float Health, uint8_t Initialize);

	// Object: Function DFMGameHud.BloodBarTipsHudItem.OnFinshed
	// Flags: [Final|Native|Public]
	// Offset: 0xd5176b0
	// Params: [ Num(0) Size(0x0) ]
	void OnFinshed();

	// Object: Function DFMGameHud.BloodBarTipsHudItem.OnCharaterHealthChange
	// Flags: [Final|Native|Public]
	// Offset: 0xd51760c
	// Params: [ Num(1) Size(0x4) ]
	void OnCharaterHealthChange(int32_t Health);

	// Object: Function DFMGameHud.BloodBarTipsHudItem.BPShow
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BPShow();

	// Object: Function DFMGameHud.BloodBarTipsHudItem.BPReset
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BPReset();

	// Object: Function DFMGameHud.BloodBarTipsHudItem.BPHide
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BPHide();

	// Object: Function DFMGameHud.BloodBarTipsHudItem.BindData
	// Flags: [Final|Native|Public]
	// Offset: 0xd517568
	// Params: [ Num(1) Size(0x8) ]
	void BindData(struct ADFMCharacter* InOwnCharacter);
};

// Object: Class DFMGameHud.BloodBarTipsUIController
// Size: 0xE8 (Inherited: 0xA8)
struct UBloodBarTipsUIController : UBaseUIController
{
	DEFINE_UE_CLASS_HELPERS(UBloodBarTipsUIController, "BloodBarTipsUIController")

	struct UBloodBarTipsHud* BloodBarTipsHud; // 0xA8(0x8)
	float CheckDistance; // 0xB0(0x4)
	float ZoomCheckDistance; // 0xB4(0x4)
	float FrameTime; // 0xB8(0x4)
	uint8_t Pad_0xBC[0x1]; // 0xBC(0x1)
	uint8_t bIsAsync : 1; // 0xBD(0x1), Mask(0x1)
	uint8_t BitPad_0xBD_1 : 7; // 0xBD(0x1)
	uint8_t Pad_0xBE[0xA]; // 0xBE(0xA)
	struct ADFMCharacter* HitCharater; // 0xC8(0x8)
	uint8_t Pad_0xD0[0x18]; // 0xD0(0x18)

	// Object: Function DFMGameHud.BloodBarTipsUIController.OnCharRestart
	// Flags: [Final|Native|Public]
	// Offset: 0xd517788
	// Params: [ Num(1) Size(0x8) ]
	void OnCharRestart(struct AGPCharacterBase* CHARACTER);

	// Object: Function DFMGameHud.BloodBarTipsUIController.OnCharDied
	// Flags: [Final|Native|Public]
	// Offset: 0xd5176e4
	// Params: [ Num(1) Size(0x8) ]
	void OnCharDied(struct AGPCharacterBase* CHARACTER);
};

// Object: Class DFMGameHud.BossBeLaserScreenEffectHUD
// Size: 0x450 (Inherited: 0x3F0)
struct UBossBeLaserScreenEffectHUD : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBossBeLaserScreenEffectHUD, "BossBeLaserScreenEffectHUD")

	uint8_t Pad_0x3F0[0x8]; // 0x3F0(0x8)
	struct UImage* Image_Right; // 0x3F8(0x8)
	struct UImage* Image_Left; // 0x400(0x8)
	struct AActor* BossActor; // 0x408(0x8)
	struct AActor* SelfActor; // 0x410(0x8)
	float BlockSightValue; // 0x418(0x4)
	float InAlphaValue; // 0x41C(0x4)
	float BlockSightDelay; // 0x420(0x4)
	float InAlphaDelay; // 0x424(0x4)
	float MaxAliveTime; // 0x428(0x4)
	uint8_t EnableTraceTest : 1; // 0x42C(0x1), Mask(0x1)
	uint8_t BitPad_0x42C_1 : 7; // 0x42C(0x1)
	uint8_t Pad_0x42D[0x3]; // 0x42D(0x3)
	float ForwardMin; // 0x430(0x4)
	float ForwardMax; // 0x434(0x4)
	float RightMin; // 0x438(0x4)
	float RightMax; // 0x43C(0x4)
	float DirectionMin; // 0x440(0x4)
	float DirectionMax; // 0x444(0x4)
	float FocusClamp; // 0x448(0x4)
	uint8_t bDebugDraw : 1; // 0x44C(0x1), Mask(0x1)
	uint8_t BitPad_0x44C_1 : 7; // 0x44C(0x1)
	uint8_t Pad_0x44D[0x3]; // 0x44D(0x3)
};

// Object: Class DFMGameHud.BossBeLaserScreenEffectController
// Size: 0x158 (Inherited: 0x150)
struct UBossBeLaserScreenEffectController : UScreenEffectControllerBase
{
	DEFINE_UE_CLASS_HELPERS(UBossBeLaserScreenEffectController, "BossBeLaserScreenEffectController")

	struct TWeakObjectPtr<struct UBossBeLaserScreenEffectHUD> CacheBossLaserScreenUI; // 0x150(0x8)

	// Object: Function DFMGameHud.BossBeLaserScreenEffectController.SetupBossActor
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd51789c
	// Params: [ Num(1) Size(0x8) ]
	void SetupBossActor(struct AActor* Boss);

	// Object: Function DFMGameHud.BossBeLaserScreenEffectController.IsEffectActive
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0xd517864
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsEffectActive();
};

// Object: Class DFMGameHud.BossLocationViewController
// Size: 0x2D0 (Inherited: 0x2B0)
struct UBossLocationViewController : UMapIconViewController
{
	DEFINE_UE_CLASS_HELPERS(UBossLocationViewController, "BossLocationViewController")

	uint8_t Pad_0x2B0[0x20]; // 0x2B0(0x20)
};

// Object: Class DFMGameHud.BP_MobileHUD_GMButtonHudView
// Size: 0x400 (Inherited: 0x400)
struct UBP_MobileHUD_GMButtonHudView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBP_MobileHUD_GMButtonHudView, "BP_MobileHUD_GMButtonHudView")

	// Object: Function DFMGameHud.BP_MobileHUD_GMButtonHudView.OpenGMMainView4Lua
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd517a10
	// Params: [ Num(0) Size(0x0) ]
	void OpenGMMainView4Lua();
};

// Object: Class DFMGameHud.BraveGameMarkerWidget
// Size: 0x810 (Inherited: 0x7B0)
struct UBraveGameMarkerWidget : UGameMarkerBaseWidget
{
	DEFINE_UE_CLASS_HELPERS(UBraveGameMarkerWidget, "BraveGameMarkerWidget")

	struct UImage* IconImage; // 0x7B0(0x8)
	struct UTextBlock* DownCountDownText; // 0x7B8(0x8)
	struct UTextBlock* SideCountDownText; // 0x7C0(0x8)
	struct URadialImage* Image_ProcessBar; // 0x7C8(0x8)
	struct URadialImage* Image_ProcessBar_BG; // 0x7D0(0x8)
	uint8_t Pad_0x7D8[0x10]; // 0x7D8(0x10)
	struct UDFMBraveGameMarkerItem* BraveGameMarkerItem; // 0x7E8(0x8)
	uint8_t Pad_0x7F0[0x20]; // 0x7F0(0x20)

	// Object: Function DFMGameHud.BraveGameMarkerWidget.UpdateProgress
	// Flags: [Final|Native|Public]
	// Offset: 0xd517b7c
	// Params: [ Num(0) Size(0x0) ]
	void UpdateProgress();

	// Object: Function DFMGameHud.BraveGameMarkerWidget.BP_ShowMarkerRight
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_ShowMarkerRight(uint8_t bShowRight);

	// Object: Function DFMGameHud.BraveGameMarkerWidget.BP_ShowMarkerProgress
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_ShowMarkerProgress(uint8_t bShowProcess);

	// Object: Function DFMGameHud.BraveGameMarkerWidget.BP_ShowMarkerCountDown
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_ShowMarkerCountDown(uint8_t bShowCountDown);
};

// Object: Class DFMGameHud.BraveGameProgressTipHudController
// Size: 0x88 (Inherited: 0x80)
struct UBraveGameProgressTipHudController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UBraveGameProgressTipHudController, "BraveGameProgressTipHudController")

	struct UBraveGameProgressTipView* BraveGameProgressTipView; // 0x80(0x8)

	// Object: Function DFMGameHud.BraveGameProgressTipHudController.OnPlayerFinishGame
	// Flags: [Final|Native|Protected]
	// Offset: 0x10a92a24
	// Params: [ Num(0) Size(0x0) ]
	void OnPlayerFinishGame();
};

// Object: Class DFMGameHud.BraveGameFuelView
// Size: 0x2F8 (Inherited: 0x2F8)
struct UBraveGameFuelView : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UBraveGameFuelView, "BraveGameFuelView")

	// Object: Function DFMGameHud.BraveGameFuelView.BP_UpdateFuel
	// Flags: [Event|Public|HasDefaults|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(3) Size(0x18) ]
	void BP_UpdateFuel(int32_t Type, int32_t Team, struct FLinearColor Color);
};

// Object: Class DFMGameHud.BraveGameDangerLevelView
// Size: 0x2F8 (Inherited: 0x2F8)
struct UBraveGameDangerLevelView : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UBraveGameDangerLevelView, "BraveGameDangerLevelView")

	// Object: Function DFMGameHud.BraveGameDangerLevelView.BP_UpdateDangerLevel
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_UpdateDangerLevel(uint8_t bShow);
};

// Object: Class DFMGameHud.BraveGameProgressTipHUDView
// Size: 0x458 (Inherited: 0x3F8)
struct UBraveGameProgressTipHUDView : UBaseMutexUIView
{
	DEFINE_UE_CLASS_HELPERS(UBraveGameProgressTipHUDView, "BraveGameProgressTipHUDView")

	int32_t ContractID; // 0x3F8(0x4)
	uint8_t Pad_0x3FC[0x4]; // 0x3FC(0x4)
	struct TArray<struct FName> BraveGameFuelViews_Name; // 0x400(0x10)
	struct TArray<struct FName> BraveGameDangerLevelViews_Name; // 0x410(0x10)
	struct UDFTextBlock* TimeText; // 0x420(0x8)
	uint8_t Pad_0x428[0x8]; // 0x428(0x8)
	struct TArray<struct UBraveGameFuelView*> BraveGameFuelViews; // 0x430(0x10)
	struct TArray<struct UBraveGameDangerLevelView*> BraveGameDangerLevelViews; // 0x440(0x10)
	float ContractEndTimeStamp; // 0x450(0x4)
	uint8_t Pad_0x454[0x4]; // 0x454(0x4)

	// Object: Function DFMGameHud.BraveGameProgressTipHUDView.UpdateQuestProgress
	// Flags: [Final|Native|Protected]
	// Offset: 0xd5183cc
	// Params: [ Num(2) Size(0x9) ]
	void UpdateQuestProgress(int64_t UpdateQuestId, uint8_t QuestState);

	// Object: Function DFMGameHud.BraveGameProgressTipHUDView.UpdateQuestObjectiveProgress
	// Flags: [Final|Native|Protected]
	// Offset: 0xd518278
	// Params: [ Num(4) Size(0x12) ]
	void UpdateQuestObjectiveProgress(int64_t UpdateQuestId, int64_t UpdateObjectiveId, uint8_t ObjectiveState, uint8_t ObjType);

	// Object: Function DFMGameHud.BraveGameProgressTipHUDView.UpdateFuel
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51819c
	// Params: [ Num(2) Size(0x10) ]
	void UpdateFuel(struct ABraveGame* BraveGame, struct AGPPlayerState* LocalPlayerState);

	// Object: Function DFMGameHud.BraveGameProgressTipHUDView.UpdateDangerLevel
	// Flags: [Final|Native|Protected]
	// Offset: 0xd5180c0
	// Params: [ Num(2) Size(0x10) ]
	void UpdateDangerLevel(struct ABraveGame* BraveGame, struct AGPPlayerState* LocalPlayerState);

	// Object: Function DFMGameHud.BraveGameProgressTipHUDView.UpdateContractTime
	// Flags: [Final|Native|Protected]
	// Offset: 0xd5180ac
	// Params: [ Num(0) Size(0x0) ]
	void UpdateContractTime();

	// Object: Function DFMGameHud.BraveGameProgressTipHUDView.OnClientBraveGameDataUpdate
	// Flags: [Final|Native|Protected]
	// Offset: 0xd518008
	// Params: [ Num(1) Size(0x8) ]
	void OnClientBraveGameDataUpdate(struct AActor* InBraveGame);

	// Object: Function DFMGameHud.BraveGameProgressTipHUDView.BP_UpdateTipText
	// Flags: [Event|Public|HasOutParms|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x18) ]
	void BP_UpdateTipText(const struct FText& TipText);

	// Object: Function DFMGameHud.BraveGameProgressTipHUDView.BP_UpdateTimeoutSec
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_UpdateTimeoutSec(float TimeoutSec);

	// Object: Function DFMGameHud.BraveGameProgressTipHUDView.BP_SetContract
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_SetContract(uint8_t bIsContract);

	// Object: Function DFMGameHud.BraveGameProgressTipHUDView.BP_SetCollectFuelComplete
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_SetCollectFuelComplete(uint8_t bIsComplete);
};

// Object: Class DFMGameHud.BraveGameProgressTipView
// Size: 0x458 (Inherited: 0x400)
struct UBraveGameProgressTipView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBraveGameProgressTipView, "BraveGameProgressTipView")

	int32_t ContractID; // 0x3FC(0x4)
	struct TArray<struct FName> BraveGameFuelViews_Name; // 0x400(0x10)
	struct TArray<struct FName> BraveGameDangerLevelViews_Name; // 0x410(0x10)
	struct UDFTextBlock* TimeText; // 0x420(0x8)
	uint8_t Pad_0x42C[0x4]; // 0x42C(0x4)
	struct TArray<struct UBraveGameFuelView*> BraveGameFuelViews; // 0x430(0x10)
	struct TArray<struct UBraveGameDangerLevelView*> BraveGameDangerLevelViews; // 0x440(0x10)
	float ContractEndTimeStamp; // 0x450(0x4)
	uint8_t Pad_0x454[0x4]; // 0x454(0x4)

	// Object: Function DFMGameHud.BraveGameProgressTipView.UpdateQuestProgress
	// Flags: [Final|Native|Protected]
	// Offset: 0xd518a54
	// Params: [ Num(2) Size(0x9) ]
	void UpdateQuestProgress(int64_t UpdateQuestId, uint8_t QuestState);

	// Object: Function DFMGameHud.BraveGameProgressTipView.UpdateQuestObjectiveProgress
	// Flags: [Final|Native|Protected]
	// Offset: 0xd518900
	// Params: [ Num(4) Size(0x12) ]
	void UpdateQuestObjectiveProgress(int64_t UpdateQuestId, int64_t UpdateObjectiveId, uint8_t ObjectiveState, uint8_t ObjType);

	// Object: Function DFMGameHud.BraveGameProgressTipView.UpdateFuel
	// Flags: [Final|Native|Protected]
	// Offset: 0xd518824
	// Params: [ Num(2) Size(0x10) ]
	void UpdateFuel(struct ABraveGame* BraveGame, struct AGPPlayerState* LocalPlayerState);

	// Object: Function DFMGameHud.BraveGameProgressTipView.UpdateDangerLevel
	// Flags: [Final|Native|Protected]
	// Offset: 0xd518748
	// Params: [ Num(2) Size(0x10) ]
	void UpdateDangerLevel(struct ABraveGame* BraveGame, struct AGPPlayerState* LocalPlayerState);

	// Object: Function DFMGameHud.BraveGameProgressTipView.UpdateContractTime
	// Flags: [Final|Native|Protected]
	// Offset: 0xd518734
	// Params: [ Num(0) Size(0x0) ]
	void UpdateContractTime();

	// Object: Function DFMGameHud.BraveGameProgressTipView.OnClientBraveGameDataUpdate
	// Flags: [Final|Native|Protected]
	// Offset: 0xd518690
	// Params: [ Num(1) Size(0x8) ]
	void OnClientBraveGameDataUpdate(struct AActor* InBraveGame);

	// Object: Function DFMGameHud.BraveGameProgressTipView.BP_UpdateTipText
	// Flags: [Event|Public|HasOutParms|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x18) ]
	void BP_UpdateTipText(const struct FText& TipText);

	// Object: Function DFMGameHud.BraveGameProgressTipView.BP_UpdateTimeoutSec
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x4) ]
	void BP_UpdateTimeoutSec(float TimeoutSec);

	// Object: Function DFMGameHud.BraveGameProgressTipView.BP_SetContract
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_SetContract(uint8_t bIsContract);

	// Object: Function DFMGameHud.BraveGameProgressTipView.BP_SetCollectFuelComplete
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BP_SetCollectFuelComplete(uint8_t bIsComplete);
};

// Object: Class DFMGameHud.BreakAwayScreenEffectHUD
// Size: 0x410 (Inherited: 0x3F0)
struct UBreakAwayScreenEffectHUD : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBreakAwayScreenEffectHUD, "BreakAwayScreenEffectHUD")

	uint8_t Pad_0x3F0[0x10]; // 0x3F0(0x10)
	struct UWidgetAnimation* WBP_ScreenEff_Recharge_Loop_In; // 0x400(0x8)
	struct UWidgetAnimation* WBP_ScreenEff_Recharge_Loop_out; // 0x408(0x8)

	// Object: Function DFMGameHud.BreakAwayScreenEffectHUD.OnOutAnimaPlayEnd
	// Flags: [Final|Native|Public]
	// Offset: 0xd518b54
	// Params: [ Num(0) Size(0x0) ]
	void OnOutAnimaPlayEnd();
};

// Object: Class DFMGameHud.BreakAwayScreenEffectController
// Size: 0x158 (Inherited: 0x150)
struct UBreakAwayScreenEffectController : UScreenEffectControllerBase
{
	DEFINE_UE_CLASS_HELPERS(UBreakAwayScreenEffectController, "BreakAwayScreenEffectController")

	struct TWeakObjectPtr<struct UBaseUIView> CacheLowHealthScreenUI; // 0x150(0x8)
};

// Object: Class DFMGameHud.BroadcastHudItem
// Size: 0x790 (Inherited: 0x3F0)
struct UBroadcastHudItem : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBroadcastHudItem, "BroadcastHudItem")

	struct UTextBlock* KillerNameText; // 0x3F0(0x8)
	struct UImage* Icon_Commander; // 0x3F8(0x8)
	struct UImage* KillIcon; // 0x400(0x8)
	struct UTextBlock* BekilledNameText; // 0x408(0x8)
	struct UImage* Icon_Commander_Enemy; // 0x410(0x8)
	struct UImage* RankIcon_Killer; // 0x418(0x8)
	struct UImage* KnockDownIcon; // 0x420(0x8)
	struct UImage* RankIcon_Killee; // 0x428(0x8)
	struct UImage* GameInfoIcon; // 0x430(0x8)
	struct UImage* Icon_Testing; // 0x438(0x8)
	uint8_t bIsFinished : 1; // 0x440(0x1), Mask(0x1)
	uint8_t BitPad_0x440_1 : 7; // 0x440(0x1)
	uint8_t Pad_0x441[0x1]; // 0x441(0x1)
	uint8_t bIsPinnedToTop : 1; // 0x442(0x1), Mask(0x1)
	uint8_t BitPad_0x442_1 : 7; // 0x442(0x1)
	uint8_t Pad_0x443[0x5]; // 0x443(0x5)
	struct TMap<EBroadcastNameColorType, struct FBroadcastHudNameColor> NameColorMap; // 0x448(0x50)
	struct TMap<EBroadcastTeamInfoType, struct UPaperSprite*> TeamIconMap; // 0x498(0x50)
	struct TMap<EBroadcastGameInfoType, struct UPaperSprite*> GameInfoIconMap; // 0x4E8(0x50)
	struct TMap<EDeadType, struct UPaperSprite*> KillIconMap; // 0x538(0x50)
	struct TMap<EBroadcastKillIconType, struct UPaperSprite*> KillTypeIconMap; // 0x588(0x50)
	struct FSoftObjectPath DefaultKillIcon; // 0x5D8(0x18)
	uint8_t bUseVehicleIcon : 1; // 0x5F0(0x1), Mask(0x1)
	uint8_t BitPad_0x5F0_1 : 7; // 0x5F0(0x1)
	uint8_t Pad_0x5F1[0x3]; // 0x5F1(0x3)
	float AntiCheatDetectionInfoDisplayTime; // 0x5F4(0x4)
	struct FSlateColor SelfNameColor; // 0x5F8(0x28)
	struct FLinearColor SelfNameOutlineColor; // 0x620(0x10)
	struct FSlateColor SelfNameColor_MP; // 0x630(0x28)
	struct FLinearColor SelfNameOutlineColor_MP; // 0x658(0x10)
	struct FSlateColor TeamNameColor; // 0x668(0x28)
	struct FLinearColor TeamNameOutColor; // 0x690(0x10)
	struct FSlateColor EnemyNameColor; // 0x6A0(0x28)
	struct FLinearColor EnemyNameOutColor; // 0x6C8(0x10)
	struct FSlateColor GameInfoColor; // 0x6D8(0x28)
	struct FLinearColor GameInfoOutlineColor; // 0x700(0x10)
	struct FSlateColor BF_Camp_NameColor; // 0x710(0x28)
	struct FLinearColor BF_Camp_NameColor_Outline; // 0x738(0x10)
	struct FLinearColor ObserverModeTeam_OutlineColor; // 0x748(0x10)
	uint8_t Pad_0x758[0x18]; // 0x758(0x18)
	uint8_t bIsHidden : 1; // 0x770(0x1), Mask(0x1)
	uint8_t BitPad_0x770_1 : 7; // 0x770(0x1)
	uint8_t Pad_0x771[0x3]; // 0x771(0x3)
	float DisplayTime; // 0x774(0x4)
	uint8_t Pad_0x778[0x18]; // 0x778(0x18)

	// Object: Function DFMGameHud.BroadcastHudItem.SetHidden
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd519dec
	// Params: [ Num(0) Size(0x0) ]
	void SetHidden();

	// Object: Function DFMGameHud.BroadcastHudItem.SetData_TeamInfo
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd519af8
	// Params: [ Num(7) Size(0x51) ]
	void SetData_TeamInfo(EBroadcastTeamInfoType TeamInfoType, uint64_t PlayerUin, const struct FText& PlayerName, EBroadcastNameColorType NameColor01, uint64_t PlayerUin2, const struct FText& PlayerName2, EBroadcastNameColorType NameColor02);

	// Object: Function DFMGameHud.BroadcastHudItem.SetData_KillInfo
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd519774
	// Params: [ Num(8) Size(0xC0) ]
	void SetData_KillInfo(uint64_t KillerUin, const struct FText& KillerName, EBroadcastNameColorType KillerType, uint64_t BeKilledUin, const struct FText& BeKilledName, EBroadcastNameColorType BeKillType, EDeadType DeadType, const struct FBrocastKillInfo& KillInfo);

	// Object: Function DFMGameHud.BroadcastHudItem.SetData_GamePlayerInfo
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd519504
	// Params: [ Num(5) Size(0x48) ]
	void SetData_GamePlayerInfo(EBroadcastGameInfoType GameInfoType, uint64_t PlayerUin, const struct FText& PlayerName, EBroadcastNameColorType NameColor, const struct FText& Info);

	// Object: Function DFMGameHud.BroadcastHudItem.SetData_GameInfo
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd519294
	// Params: [ Num(5) Size(0x48) ]
	void SetData_GameInfo(EBroadcastGameInfoType GameInfoType, uint64_t PlayerUin, const struct FText& PlayerName, EBroadcastNameColorType NameColor, const struct FText& Info);

	// Object: Function DFMGameHud.BroadcastHudItem.SetData_AntiCheatDetectionInfo
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0xd519184
	// Params: [ Num(1) Size(0x18) ]
	void SetData_AntiCheatDetectionInfo(const struct FText& PlayerName);

	// Object: Function DFMGameHud.BroadcastHudItem.PlayAniOut
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void PlayAniOut();

	// Object: Function DFMGameHud.BroadcastHudItem.PlayAniIn
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void PlayAniIn();

	// Object: Function DFMGameHud.BroadcastHudItem.GetGamePlayerNameOutlineColor
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xd5190d4
	// Params: [ Num(2) Size(0x14) ]
	struct FLinearColor GetGamePlayerNameOutlineColor(EBroadcastNameColorType ColorType);

	// Object: Function DFMGameHud.BroadcastHudItem.GetGamePlayerNameForObserverPlayer
	// Flags: [Final|Native|Private|HasDefaults]
	// Offset: 0xd519024
	// Params: [ Num(2) Size(0x18) ]
	struct FLinearColor GetGamePlayerNameForObserverPlayer(uint64_t PlayerUin);

	// Object: Function DFMGameHud.BroadcastHudItem.GetGamePlayerNameColor
	// Flags: [Final|Native|Private]
	// Offset: 0xd518e5c
	// Params: [ Num(3) Size(0x38) ]
	struct FSlateColor GetGamePlayerNameColor(EBroadcastNameColorType ColorType, uint64_t PlayerUin);

	// Object: Function DFMGameHud.BroadcastHudItem.BPSetDefaultWeaponIcon
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x1) ]
	void BPSetDefaultWeaponIcon(EWeaponIconType IconType);

	// Object: Function DFMGameHud.BroadcastHudItem.BPSetData_AntiCheatDetectionInfo
	// Flags: [Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(1) Size(0x18) ]
	void BPSetData_AntiCheatDetectionInfo(const struct FText& PlayerName);

	// Object: Function DFMGameHud.BroadcastHudItem.BPResetWidget
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent]
	// Offset: 0x101d2e88
	// Params: [ Num(0) Size(0x0) ]
	void BPResetWidget();
};

// Object: Class DFMGameHud.BroadcastHudView
// Size: 0x690 (Inherited: 0x3F0)
struct UBroadcastHudView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBroadcastHudView, "BroadcastHudView")

	float DisplayTime; // 0x3EC(0x4)
	float Interval; // 0x3F0(0x4)
	float MoveTime; // 0x3F4(0x4)
	struct FRuntimeFloatCurve MoveCurve; // 0x3F8(0xA0)
	int32_t MaxShowNum; // 0x498(0x4)
	float Vertical_Spacing; // 0x49C(0x4)
	struct UCanvasPanel* TipContainer; // 0x4A0(0x8)
	struct FVector2D ChildPanelSlotSize; // 0x4A8(0x8)
	struct UBroadcastHudItem* BroadcastTipItemClass; // 0x4B0(0x8)
	int32_t PreSpwanItemNum; // 0x4B8(0x4)
	struct TArray<struct UBroadcastHudItem*> BroadcastUIItemArr; // 0x4C0(0x10)
	uint8_t Pad_0x4D0[0x10]; // 0x4D0(0x10)
	struct ADFMGameState* GPGameState; // 0x4E0(0x8)
	struct ADFMPlayerController* GPPlayerController; // 0x4E8(0x8)
	struct TMap<uint64_t, struct FSoftObjectPath> WeaponIconCache; // 0x4F0(0x50)
	uint8_t Pad_0x540[0x10]; // 0x540(0x10)
	struct TArray<struct UBroadcastHudItem*> RemoveItems; // 0x550(0x10)
	struct TArray<struct UBroadcastHudItem*> ReuseableItems; // 0x560(0x10)
	uint8_t Pad_0x570[0x118]; // 0x570(0x118)
	float Vertical_Offset; // 0x688(0x4)
	uint8_t Pad_0x68C[0x4]; // 0x68C(0x4)

	// Object: Function DFMGameHud.BroadcastHudView.PopBroadcastMsg
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51c8cc
	// Params: [ Num(0) Size(0x0) ]
	void PopBroadcastMsg();

	// Object: Function DFMGameHud.BroadcastHudView.OnResetBroadcastMsg
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51c8b8
	// Params: [ Num(0) Size(0x0) ]
	void OnResetBroadcastMsg();

	// Object: Function DFMGameHud.BroadcastHudView.OnReceiveBroadcastMsg
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0xd51c7fc
	// Params: [ Num(1) Size(0x10) ]
	void OnReceiveBroadcastMsg(const struct TArray<struct FGameBrocastMsg>& Msgs);

	// Object: Function DFMGameHud.BroadcastHudView.OnKillBroadcastRangeChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51c750
	// Params: [ Num(1) Size(0x10) ]
	void OnKillBroadcastRangeChanged(struct FString TypeString);

	// Object: Function DFMGameHud.BroadcastHudView.OnDFMGamePlayModeChange
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51c6ac
	// Params: [ Num(1) Size(0x1) ]
	void OnDFMGamePlayModeChange(EDFMGamePlayMode NewGamePlayMode);

	// Object: Function DFMGameHud.BroadcastHudView.OnAsyncLoadWeaponIconConfig
	// Flags: [Final|Native|Protected|HasOutParms|HasDefaults]
	// Offset: 0xd51c5ec
	// Params: [ Num(1) Size(0x18) ]
	void OnAsyncLoadWeaponIconConfig(const struct FSoftObjectPath& AssetRef);

	// Object: Function DFMGameHud.BroadcastHudView.OnAsyncLoadBroadcastConfig
	// Flags: [Final|Native|Protected|HasOutParms|HasDefaults]
	// Offset: 0xd51c52c
	// Params: [ Num(1) Size(0x18) ]
	void OnAsyncLoadBroadcastConfig(const struct FSoftObjectPath& AssetRef);

	// Object: Function DFMGameHud.BroadcastHudView.OnArenaRoundStateChange
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51c518
	// Params: [ Num(0) Size(0x0) ]
	void OnArenaRoundStateChange();
};

// Object: Class DFMGameHud.ImageMapItemHUDView
// Size: 0x4F8 (Inherited: 0x468)
struct UImageMapItemHUDView : UMapItemHUDView
{
	DEFINE_UE_CLASS_HELPERS(UImageMapItemHUDView, "ImageMapItemHUDView")

	struct UCanvasPanel* DFCanvasPanel_Default; // 0x468(0x8)
	uint8_t bUseAbsLayer : 1; // 0x470(0x1), Mask(0x1)
	uint8_t BitPad_0x470_1 : 7; // 0x470(0x1)
	uint8_t Pad_0x471[0x7]; // 0x471(0x7)
	struct UImage* DFMImage_Icon; // 0x478(0x8)
	uint8_t Pad_0x480[0x38]; // 0x480(0x38)
	struct UDFMCommonHover* WBP_CommonHoverBase; // 0x4B8(0x8)
	uint8_t Pad_0x4C0[0x8]; // 0x4C0(0x8)
	struct UMapItemRangeViewController* QuestObjRangeController; // 0x4C8(0x8)
	uint8_t Pad_0x4D0[0x28]; // 0x4D0(0x28)
};

// Object: Class DFMGameHud.BtnImageMapItemHUDView
// Size: 0x520 (Inherited: 0x4F8)
struct UBtnImageMapItemHUDView : UImageMapItemHUDView
{
	DEFINE_UE_CLASS_HELPERS(UBtnImageMapItemHUDView, "BtnImageMapItemHUDView")

	struct FName MarkingButtonName; // 0x4F8(0x8)
	struct UButton* Button_Marking; // 0x500(0x8)
	uint8_t Pad_0x508[0x10]; // 0x508(0x10)
	uint8_t bRecoverSeamlessSelectedIcon : 1; // 0x518(0x1), Mask(0x1)
	uint8_t BitPad_0x518_1 : 7; // 0x518(0x1)
	uint8_t Pad_0x519[0x7]; // 0x519(0x7)
};

// Object: Class DFMGameHud.BuffAndStaminaViewHDHudController
// Size: 0xD0 (Inherited: 0x80)
struct UBuffAndStaminaViewHDHudController : UGPBaseHudController
{
	DEFINE_UE_CLASS_HELPERS(UBuffAndStaminaViewHDHudController, "BuffAndStaminaViewHDHudController")

	uint8_t Pad_0x80[0x18]; // 0x80(0x18)
	struct TArray<uint32_t> HealthDebuffList; // 0x98(0x10)
	struct ADFMCharacter* CachedLocalPlayerCharacter; // 0xA8(0x8)
	uint8_t Pad_0xB0[0x20]; // 0xB0(0x20)

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudController.UpdateVisibleBuffArrayImmediately
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51cdc8
	// Params: [ Num(0) Size(0x0) ]
	void UpdateVisibleBuffArrayImmediately();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudController.UpdateHealthDebuffState
	// Flags: [Final|Native|Public]
	// Offset: 0xd51cdb4
	// Params: [ Num(0) Size(0x0) ]
	void UpdateHealthDebuffState();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudController.RequestUpdateVisibleBuffArray
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51cda0
	// Params: [ Num(0) Size(0x0) ]
	void RequestUpdateVisibleBuffArray();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudController.OnDelayUpdateVisibleBuffs
	// Flags: [Final|Native|Public]
	// Offset: 0xd51cd8c
	// Params: [ Num(0) Size(0x0) ]
	void OnDelayUpdateVisibleBuffs();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudController.OnCharacterBuffRemoved
	// Flags: [Final|Native|Public]
	// Offset: 0xd51cc68
	// Params: [ Num(3) Size(0x6) ]
	void OnCharacterBuffRemoved(uint32_t BuffId, uint8_t bIsPauseBuff, ECharacterPart CharacterPart);

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudController.OnCharacterBuffRefresh
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd51cb64
	// Params: [ Num(1) Size(0x78) ]
	void OnCharacterBuffRefresh(const struct FCharacterBuff& ClientBuff);

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudController.OnCharacterBuffAdded
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd51ca60
	// Params: [ Num(1) Size(0x78) ]
	void OnCharacterBuffAdded(const struct FCharacterBuff& ClientBuff);
};

// Object: Class DFMGameHud.BuffAndStaminaViewHDHudView
// Size: 0x598 (Inherited: 0x400)
struct UBuffAndStaminaViewHDHudView : UGPBaseHudView
{
	DEFINE_UE_CLASS_HELPERS(UBuffAndStaminaViewHDHudView, "BuffAndStaminaViewHDHudView")

	uint8_t Pad_0x400[0x10]; // 0x400(0x10)
	struct UCommonBuffItemView* BuffItemWidgetClass; // 0x410(0x8)
	struct UDFHorizontalBox* BuffContentBox; // 0x418(0x8)
	struct TArray<struct UCommonBuffItemView*> BuffItemViews; // 0x420(0x10)
	uint8_t bAlwaysShowHealthTipBox : 1; // 0x430(0x1), Mask(0x1)
	uint8_t BitPad_0x430_1 : 7; // 0x430(0x1)
	uint8_t bShowHealthTipBoxAnim : 1; // 0x431(0x1), Mask(0x1)
	uint8_t BitPad_0x431_1 : 7; // 0x431(0x1)
	uint8_t Pad_0x432[0xE]; // 0x432(0xE)
	uint8_t bHasPlayExhaustAnim : 1; // 0x440(0x1), Mask(0x1)
	uint8_t BitPad_0x440_1 : 7; // 0x440(0x1)
	uint8_t Pad_0x441[0x3]; // 0x441(0x3)
	float LowBreathPercent; // 0x444(0x4)
	float ShowIconPercent; // 0x448(0x4)
	uint8_t Pad_0x44C[0x4]; // 0x44C(0x4)
	struct UHoldBreathIconView* WBP_HoldBreathIcon; // 0x450(0x8)
	float LowStaminaValue; // 0x458(0x4)
	float BaseStaminaMaxValue; // 0x45C(0x4)
	uint8_t Pad_0x460[0x20]; // 0x460(0x20)
	struct FName KeyProgress; // 0x480(0x8)
	struct FName KeyProgressDown; // 0x488(0x8)
	struct FName Num; // 0x490(0x8)
	struct FName KeyColor; // 0x498(0x8)
	struct FName KeyColorDown; // 0x4A0(0x8)
	struct UWidgetAnimation* LowStaminaAnimation; // 0x4A8(0x8)
	float FullStaminaFlushTime; // 0x4B0(0x4)
	float BackCountdownTime; // 0x4B4(0x4)
	float PlayStaminaChangeFlushThreshold; // 0x4B8(0x4)
	struct FLinearColor BaseFrontColor; // 0x4BC(0x10)
	struct FLinearColor ExtraFrontColor; // 0x4CC(0x10)
	struct FLinearColor ExtraDownColor; // 0x4DC(0x10)
	struct FLinearColor ConsumeDownColor; // 0x4EC(0x10)
	struct FLinearColor LowStaminaColor; // 0x4FC(0x10)
	uint8_t Pad_0x50C[0x4]; // 0x50C(0x4)
	struct UBuffDetailTipWindowHudView* BuffDetailTipWindow; // 0x510(0x8)
	struct UDFHorizontalBox* DFHorizontalBox_HealthTipBox; // 0x518(0x8)
	struct UImage* ProgressBar_Base; // 0x520(0x8)
	struct UImage* ProgressBar_Extra; // 0x528(0x8)
	struct UImage* ProgressBar_Front_FX; // 0x530(0x8)
	struct UCanvasPanel* StaminaCanvasPanel; // 0x538(0x8)
	int32_t HealthTipAnimationCount; // 0x540(0x4)
	uint8_t Pad_0x544[0x4]; // 0x544(0x4)
	struct UMaterialInstanceDynamic* BaseMaterial; // 0x548(0x8)
	struct UMaterialInstanceDynamic* FXMaterial; // 0x550(0x8)
	uint8_t Pad_0x558[0x8]; // 0x558(0x8)
	float StaminaChangeSpeed; // 0x560(0x4)
	uint8_t Pad_0x564[0x1C]; // 0x564(0x1C)
	struct TArray<uint32_t> HealthDebuffList; // 0x580(0x10)
	uint8_t Pad_0x590[0x8]; // 0x590(0x8)

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.UpdateStamina
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51d3fc
	// Params: [ Num(2) Size(0x8) ]
	void UpdateStamina(int32_t OldValue, int32_t NewValue);

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.RefreshView
	// Flags: [Final|Native|Public]
	// Offset: 0xd51d3e8
	// Params: [ Num(0) Size(0x0) ]
	void RefreshView();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.RefreshDeBuffTip
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51d3d4
	// Params: [ Num(0) Size(0x0) ]
	void RefreshDeBuffTip();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.RefreshBuffContentBox
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51d3c0
	// Params: [ Num(0) Size(0x0) ]
	void RefreshBuffContentBox();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.PlayStaminaNotEnoughAnim
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51d3ac
	// Params: [ Num(0) Size(0x0) ]
	void PlayStaminaNotEnoughAnim();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.PlayHoldBreathDisableAnim
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51d398
	// Params: [ Num(0) Size(0x0) ]
	void PlayHoldBreathDisableAnim();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.PlayBreathWidgetFadeOutAnim
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51d360
	// Params: [ Num(1) Size(0x1) ]
	uint8_t PlayBreathWidgetFadeOutAnim();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.PlayBreathWidgetFadeInAnim
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51d328
	// Params: [ Num(1) Size(0x1) ]
	uint8_t PlayBreathWidgetFadeInAnim();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.OnUnHoverBuffItem
	// Flags: [Final|Native|Public]
	// Offset: 0xd51d284
	// Params: [ Num(1) Size(0x8) ]
	void OnUnHoverBuffItem(struct UCommonBuffItemView* ItemView);

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.OnPressBuffItem
	// Flags: [Final|Native|Public]
	// Offset: 0xd51d19c
	// Params: [ Num(2) Size(0x10) ]
	void OnPressBuffItem(uint8_t bPress, struct UCommonBuffItemView* ItemView);

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.OnHoverBuffItem
	// Flags: [Final|Native|Public]
	// Offset: 0xd51d0f8
	// Params: [ Num(1) Size(0x8) ]
	void OnHoverBuffItem(struct UCommonBuffItemView* ItemView);

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.OnGamePlayModeChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51d054
	// Params: [ Num(1) Size(0x1) ]
	void OnGamePlayModeChanged(EDFMGamePlayMode NewGamePlayMode);

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.OnCharacterStaminaChange
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51cf78
	// Params: [ Num(2) Size(0x8) ]
	void OnCharacterStaminaChange(int32_t OldValue, int32_t NewValue);

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.OnBreathFadeOutAnimationEnd
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51cf64
	// Params: [ Num(0) Size(0x0) ]
	void OnBreathFadeOutAnimationEnd();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.OnBreathFadeInAnimationEnd
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51cf50
	// Params: [ Num(0) Size(0x0) ]
	void OnBreathFadeInAnimationEnd();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.InitBuffDetailTipWindow
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51cf3c
	// Params: [ Num(0) Size(0x0) ]
	void InitBuffDetailTipWindow();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.HideAllBuffItem
	// Flags: [Final|Native|Public]
	// Offset: 0xd51cf28
	// Params: [ Num(0) Size(0x0) ]
	void HideAllBuffItem();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.HideAfterFullFlush
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51cf14
	// Params: [ Num(0) Size(0x0) ]
	void HideAfterFullFlush();

	// Object: Function DFMGameHud.BuffAndStaminaViewHDHudView.CustomTick
	// Flags: [Final|Native|Protected]
	// Offset: 0xd51cf00
	// Params: [ Num(0) Size(0x0) ]
	void CustomTick();
};

// Object: Class DFMGameHud.BuffAndStaminaViewPC
// Size: 0x828 (Inherited: 0x668)
struct UBuffAndStaminaViewPC : ULuaUIHudBaseView
{
	DEFINE_UE_CLASS_HELPERS(UBuffAndStaminaViewPC, "BuffAndStaminaViewPC")

	uint8_t bAlwayseShowHealthTipBox : 1; // 0x668(0x1), Mask(0x1)
	uint8_t BitPad_0x668_1 : 7; // 0x668(0x1)
	uint8_t bShowHealthTipBoxAnim : 1; // 0x669(0x1), Mask(0x1)
	uint8_t BitPad_0x669_1 : 7; // 0x669(0x1)
	uint8_t Pad_0x66A[0x2]; // 0x66A(0x2)
	int32_t HealthTipAnimationCount; // 0x66C(0x4)
	struct FUIAnimationController AnimationController; // 0x670(0x20)
	struct UBorder* wtBuffDetialTipWindow; // 0x690(0x8)
	struct UDFHorizontalBox* DFHorizontalBox_HealthTipBox; // 0x698(0x8)
	struct UImage* ProgressBar_Base; // 0x6A0(0x8)
	struct UImage* ProgressBar_Extra; // 0x6A8(0x8)
	struct UImage* ProgressBar_Front_FX; // 0x6B0(0x8)
	struct UCanvasPanel* StaminaCanvasPanel; // 0x6B8(0x8)
	struct FName KeyProgress; // 0x6C0(0x8)
	struct FName KeyProgressDown; // 0x6C8(0x8)
	struct FName Num; // 0x6D0(0x8)
	struct FName KeyColor; // 0x6D8(0x8)
	struct FName KeyColorDown; // 0x6E0(0x8)
	float StaminaChangeSpeed; // 0x6E8(0x4)
	float ChangeAnimThreshold; // 0x6EC(0x4)
	float LowStaminaValue; // 0x6F0(0x4)
	float BaseStaminaMaxValue; // 0x6F4(0x4)
	float FullStaminaFlushTime; // 0x6F8(0x4)
	float BackCountdownTime; // 0x6FC(0x4)
	float PlayStaminaChangeFlushThreshold; // 0x700(0x4)
	struct FLinearColor BaseFrontColor; // 0x704(0x10)
	struct FLinearColor BaseDownColor; // 0x714(0x10)
	struct FLinearColor ExtraFrontColor; // 0x724(0x10)
	struct FLinearColor ExtraDownColor; // 0x734(0x10)
	struct FLinearColor ConsumeDownColor; // 0x744(0x10)
	struct FLinearColor LowStaminaColor; // 0x754(0x10)
	uint8_t Pad_0x764[0x2C]; // 0x764(0x2C)
	struct UMaterialInstanceDynamic* BaseMaterial; // 0x790(0x8)
	struct UMaterialInstanceDynamic* ExtraMaterial; // 0x798(0x8)
	struct UMaterialInstanceDynamic* FXMaterial; // 0x7A0(0x8)
	struct AGPCharacter* LocalCharacter; // 0x7A8(0x8)
	struct UGPStaminaDataComponent* StaminaComp; // 0x7B0(0x8)
	struct UWidgetAnimation* LowStaminaAnimation; // 0x7B8(0x8)
	struct ADFMCharacter* DFMCharacter; // 0x7C0(0x8)
	uint8_t bIsOpenBag : 1; // 0x7C8(0x1), Mask(0x1)
	uint8_t BitPad_0x7C8_1 : 7; // 0x7C8(0x1)
	uint8_t Pad_0x7C9[0x3]; // 0x7C9(0x3)
	int32_t HasHealthDebuffCount; // 0x7CC(0x4)
	struct TArray<uint32_t> HealthDebuffList; // 0x7D0(0x10)
	struct UGPInputAimLogic* InputAimLogic; // 0x7E0(0x8)
	uint8_t bCacheIsZooming : 1; // 0x7E8(0x1), Mask(0x1)
	uint8_t BitPad_0x7E8_1 : 7; // 0x7E8(0x1)
	uint8_t Pad_0x7E9[0x7]; // 0x7E9(0x7)
	struct UHoldBreathIconView* WBP_HoldBreathIcon; // 0x7F0(0x8)
	float LowBreathPercent; // 0x7F8(0x4)
	float ShowIconPercent; // 0x7FC(0x4)
	uint8_t bHasPlayExhaustAnim : 1; // 0x800(0x1), Mask(0x1)
	uint8_t BitPad_0x800_1 : 7; // 0x800(0x1)
	uint8_t bInFadeIn : 1; // 0x801(0x1), Mask(0x1)
	uint8_t BitPad_0x801_1 : 7; // 0x801(0x1)
	uint8_t bInFadeOut : 1; // 0x802(0x1), Mask(0x1)
	uint8_t BitPad_0x802_1 : 7; // 0x802(0x1)
	uint8_t bFadeInAndOutCompleted : 1; // 0x803(0x1), Mask(0x1)
	uint8_t BitPad_0x803_1 : 7; // 0x803(0x1)
	uint8_t Pad_0x804[0x24]; // 0x804(0x24)

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.UpdateKeyTip
	// Flags: [Final|Native|Public]
	// Offset: 0xd51dc08
	// Params: [ Num(0) Size(0x0) ]
	void UpdateKeyTip();

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.UpdateHoldBreathIcon
	// Flags: [Final|Native|Public]
	// Offset: 0xd51dbf4
	// Params: [ Num(0) Size(0x0) ]
	void UpdateHoldBreathIcon();

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.PlayStaminaNotEnoughAnim
	// Flags: [Final|Native|Public]
	// Offset: 0xd51dbe0
	// Params: [ Num(0) Size(0x0) ]
	void PlayStaminaNotEnoughAnim();

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.PlayLowStaminaAnim
	// Flags: [Final|Native|Public]
	// Offset: 0xd51db34
	// Params: [ Num(1) Size(0x1) ]
	void PlayLowStaminaAnim(uint8_t bPlay);

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.PlayHoldBreathDisableAnim
	// Flags: [Final|Native|Public]
	// Offset: 0xd51db20
	// Params: [ Num(0) Size(0x0) ]
	void PlayHoldBreathDisableAnim();

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.PlayFadeOutAnim
	// Flags: [Final|Native|Public]
	// Offset: 0xd51dae8
	// Params: [ Num(1) Size(0x1) ]
	uint8_t PlayFadeOutAnim();

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.PlayFadeInAnim
	// Flags: [Final|Native|Public]
	// Offset: 0xd51dab0
	// Params: [ Num(1) Size(0x1) ]
	uint8_t PlayFadeInAnim();

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.OnInputTypeChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd51da0c
	// Params: [ Num(1) Size(0x1) ]
	void OnInputTypeChanged(EGPInputType InputType);

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.OnGamePlayModeChanged
	// Flags: [Final|Native|Public]
	// Offset: 0xd51d968
	// Params: [ Num(1) Size(0x1) ]
	void OnGamePlayModeChanged(EDFMGamePlayMode NewGamePlayMode);

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.OnFocusStatusChange
	// Flags: [Final|Native|Public]
	// Offset: 0xd51d8bc
	// Params: [ Num(1) Size(0x1) ]
	void OnFocusStatusChange(uint8_t NewFocusState);

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.OnFadeOutAnimationEnd
	// Flags: [Final|Native|Public]
	// Offset: 0xd51d8a8
	// Params: [ Num(0) Size(0x0) ]
	void OnFadeOutAnimationEnd();

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.OnFadeInAnimationEnd
	// Flags: [Final|Native|Public]
	// Offset: 0xd51d894
	// Params: [ Num(0) Size(0x0) ]
	void OnFadeInAnimationEnd();

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.OnCharacterStaminaChange
	// Flags: [Final|Native|Public]
	// Offset: 0xd51d7b8
	// Params: [ Num(2) Size(0x8) ]
	void OnCharacterStaminaChange(int32_t OldValue, int32_t NewValue);

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.IsMPMode
	// Flags: [Final|Native|Public]
	// Offset: 0xd51d780
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsMPMode();

	// Object: Function DFMGameHud.BuffAndStaminaViewPC.IsInRange
	// Flags: [Final|Native|Public]
	// Offset: 0xd51d748
	// Params: [ Num(1) Size(0x1) ]
	uint8_t IsInRange();
};

// Object: Class DFMGameHud.BuffDetailTipWindowHudView
// Size: 0x320 (Inherited: 0x2F8)
struct UBuffDetailTipWindowHudView : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UBuffDetailTipWindowHudView, "BuffDetailTipWindowHudView")

	struct UBorder* BuffDetailTipWindow; // 0x2F8(0x8)
	struct UDFVerticalBox* BuffTipGridBox; // 0x300(0x8)
	struct UCharacterBuffDetailTipItemWidget* BuffItemTipClass; // 0x308(0x8)
	struct UBuffAndStaminaViewHDHudView* OwnerView; // 0x310(0x8)
	struct UCommonBuffItemView* TargetBuffItemView; // 0x318(0x8)
};

// Object: Class DFMGameHud.BuffItemHUDView
// Size: 0x418 (Inherited: 0x3F0)
struct UBuffItemHUDView : UBaseUIView
{
	DEFINE_UE_CLASS_HELPERS(UBuffItemHUDView, "BuffItemHUDView")

	struct UTextBlock* CountText; // 0x3F0(0x8)
	struct UButton* BuffBtn; // 0x3F8(0x8)
	struct UImage* Image_90; // 0x400(0x8)
	struct UImage* BuffImage; // 0x408(0x8)
	uint8_t bLoading : 1; // 0x410(0x1), Mask(0x1)
	uint8_t BitPad_0x410_1 : 7; // 0x410(0x1)
	uint8_t Pad_0x411[0x3]; // 0x411(0x3)
	uint32_t CurrentBuffId; // 0x414(0x4)

	// Object: Function DFMGameHud.BuffItemHUDView.UpdatePrograss
	// Flags: [Final|Native|Public]
	// Offset: 0xd51df70
	// Params: [ Num(3) Size(0x18) ]
	void UpdatePrograss(uint64_t InArg1, uint64_t InArg2, uint64_t InArg3);

	// Object: Function DFMGameHud.BuffItemHUDView.SetBuffCount
	// Flags: [Final|Native|Public]
	// Offset: 0xd51decc
	// Params: [ Num(1) Size(0x4) ]
	void SetBuffCount(uint32_t Count);

	// Object: Function DFMGameHud.BuffItemHUDView.SelectBuffIcon
	// Flags: [Final|Native|Public]
	// Offset: 0xd51dddc
	// Params: [ Num(3) Size(0x6) ]
	uint8_t SelectBuffIcon(uint32_t BuffId, uint8_t bHighRes);

	// Object: Function DFMGameHud.BuffItemHUDView.OnBuffIconLoaded
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0xd51dcd8
	// Params: [ Num(2) Size(0x1C) ]
	void OnBuffIconLoaded(const struct FSoftObjectPath& Path, uint32_t Buff);
};

// Object: Class DFMGameHud.BuffListDetailHUDView
// Size: 0x488 (Inherited: 0x448)
struct UBuffListDetailHUDView : UMobileGamePadView
{
	DEFINE_UE_CLASS_HELPERS(UBuffListDetailHUDView, "BuffListDetailHUDView")

	struct TArray<struct UBuffListDetailItemView*> ItemList; // 0x448(0x10)
	struct UScrollBox* Scroll_Box; // 0x458(0x8)
	struct UBuffListDetailItemView* H_MiniMan_BufferDetailInfo; // 0x460(0x8)
	struct UBuffListDetailItemView* H_MiniMan_BufferDetailInfo_1; // 0x468(0x8)
	struct UBuffListDetailItemView* H_MiniMan_BufferDetailInfo_2; // 0x470(0x8)
	struct UBuffListDetailItemView* H_MiniMan_BufferDetailInfo_3; // 0x478(0x8)
	struct UBuffListDetailItemView* H_MiniMan_BufferDetailInfo_4; // 0x480(0x8)

	// Object: Function DFMGameHud.BuffListDetailHUDView.SetBuffList
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd51e0c8
	// Params: [ Num(1) Size(0x10) ]
	void SetBuffList(const struct TArray<struct FCharacterBuff>& buffArray);

	// Object: Function DFMGameHud.BuffListDetailHUDView.OnCloseWindowButtonClick
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xd51e0b4
	// Params: [ Num(0) Size(0x0) ]
	void OnCloseWindowButtonClick();
};

// Object: Class DFMGameHud.BuffListDetailItemView
// Size: 0x320 (Inherited: 0x2F8)
struct UBuffListDetailItemView : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(UBuffListDetailItemView, "BuffListDetailItemView")

	struct UBuffItemHUDView* BuffItem1_1; // 0x2F8(0x8)
	struct UTextBlock* TextName; // 0x300(0x8)
	struct UTextBlock* TextTime; // 0x308(0x8)
	struct UTextBlock* TextDesc; // 0x310(0x8)
	uint8_t Pad_0x318[0x8]; // 0x318(0x8)

	// Object: Function DFMGameHud.BuffListDetailItemView.SetCharacterBuffEffectEntity
	// Flags: [Final|Native|Public]
	// Offset: 0xd51e37c
	// Params: [ Num(4) Size(0x18) ]
	void SetCharacterBuffEffectEntity(struct FName Ebuff, struct UDFMCharacterBuffEntityBase* BuffEntity, uint32_t Cnt, uint32_t BuffId);

	// Object: Function DFMGameHud.BuffListDetailItemView.SetCharacterBuff
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0xd51e23c
	// Params: [ Num(2) Size(0x7C) ]
	void SetCharacterBuff(struct FCharacterBuff& Buff, uint32_t Cnt);

	// Object: Function DFMGameHud.BuffListDetailItemView.IsValidBuffType
	// Flags: [Final|Native|Public]
	// Offset: 0xd51e18c
	// Params: [ Num(2) Size(0x9) ]
	uint8_t IsValidBuffType(struct FName BuffType);
};

