#pragma once

#include "../CoreUObject_classes.hpp"
#include "AIModule.hpp"
#include "AnimGraphRuntime.hpp"
#include "AssetPackerRuntime.hpp"
#include "DFImGuiFramework.hpp"
#include "DSNetwork.hpp"
#include "Engine.hpp"
#include "GPAbility.hpp"
#include "GPAbilityBase.hpp"
#include "GPAudioRuntime.hpp"
#include "GPDeformable.hpp"
#include "GPEncryption.hpp"
#include "GPGameHud.hpp"
#include "GPGlobalDefines.hpp"
#include "GPPhysics.hpp"
#include "GPResource.hpp"
#include "GPWeaponDefineForPlugin.hpp"
#include "GPWeaponRuntime.hpp"
#include "GameCore.hpp"
#include "GameplayAbilities.hpp"
#include "GameplayTags.hpp"
#include "HudFramework.hpp"
#include "MovieScene.hpp"
#include "OpenWorldStreaming.hpp"
#include "PerfGear.hpp"
#include "PropertyReplication.hpp"
#include "SMSystem.hpp"
#include "SkeletalMeshMergeRuntime.hpp"
#include "SlateCore.hpp"
#include "UMG.hpp"
#include "ZZAnimationLib.hpp"

namespace SDK
{

// Package: GPGameplay
// Enums: 528
// Structs: 1324
// Classes: 1153

struct AAIController;
struct AActor;
struct ABaseHUD;
struct ACHARACTER;
struct ACameraActor;
struct AController;
struct AEmitterCameraLensEffectBase;
struct AFXProxyActor;
struct AFoliageAssetsStreamer;
struct AGPDeformableSmokeEmitActor;
struct AGPProjectile;
struct AGPQuestMarkerBase;
struct AGPSequenceActor;
struct AGPTriggerBase;
struct AGPWeaponBulletBase;
struct AGPWeaponBulletProjectile;
struct AGPWeaponBulletSystem;
struct AGPWeaponBulletThrowableProjectile;
struct AGameModeBase;

struct UWeaponPendantSkinComponent_InGameStatics;
struct IWeaponProxyInterface;
struct UWeaponPVEDataAttributeManager;
struct UWeaponReplicateComponent;
struct UWeaponSawDataComponentAnim;
struct UWeaponSkinApperanceModifer_RandomWord;
struct UWeaponSkinApperanceModifer_TexasPoker;
struct UWeaponSkinApperanceModifer_BaseConfigAsset;
struct UWeaponSkinDataAsset;
struct UWeaponSkinDataRow_Game2000TableManager;
struct UWeaponSkinMaterialInfo_Game2000TableManager;
struct UWeaponSkinDataRow_TexasPokerRuleTableManager;
struct UWeaponSkinDataRow_TexasPokerPairTemplateTableManager;
struct UWeaponSkinMaterialInfo_TexasPokerTableManager;
struct UMysticalSkinBasicParamTableManager;
struct UMysticalSkinInfoDataTableManager;
struct UMysticalSkinRelevancyTableManager;
struct UFMysticalPendantSkinRelevancyTableManager;
struct UMysticalSkinIntervalManager;
struct UFMysticalSkinColorMaterialManager;
struct UMysticalPendantSkinTableManager;
struct UFMysticalPendantDetailInfoTableManager;
struct IWeaponSkinModifierInterface;
struct UWeaponSkinLogicComponent;
struct UWeaponSkinLogic_Camouflage;
struct UWeaponSkinAsyncWorker;
struct UWeaponSkinModifier;
struct UWeaponSkinModifier_Dye;
struct UWeaponSkinModifier_Empty;
struct UWeaponSkinModifierManager;
struct UWeaponSkinUtil;
struct UPendantMysticalSkinUtil;
struct UWeaponSocketOverrideFuncComponentAppearance;
struct UWeaponSupportDataAnimComponnent;
struct UWeaponSystem;
struct IWeaponSystemInterface;
struct IWeaponThrowableAttachInterface;
struct UWeaponThrowableC103SmokeDataComponent;
struct UWeaponThrowableDataComponentAnim;
struct UWeaponThrowableDataComponentFiring;
struct UWeaponThrowableDataComponentFiring_C103Smoke;
struct UWeaponThrowableDataComponentPreview;
struct UWeaponThrowableDataComponentZoom;
struct UWeaponThrowableTableManager;
struct UWeaponThrowableDataAttributeManager;
struct UWeaponThrowableSkinApperanceTableManager;
struct UWeaponThrowableDataProjectileManager;
struct UWeaponThrowableDataDamageManager;
struct UWeaponThrowableDataFXManager;
struct UWeaponThrowableDataAudioManager;
struct UWeaponThrowableDataAnimManager;
struct UWeaponThrowableFuncComponentAppearance;
struct UWeaponThrowableFuncComponentFiring;
struct UWeaponThrowableFuncComponentZoom;
struct UWeaponThrowableLeftDataComponentAnim;
struct UWeaponThrowableLeftDataCompAnim_C103Smoke;
struct UWeaponThrowableLeftDataComponentFiring;
struct UWeaponThrowableLeftFireMode;
struct IWeaponThrowableSpawnActorInterface;
struct UWeaponThrowUASDataComponentAnim;
struct UWeaponThrowUASDataComponentFiring;
struct UWeaponThrowUASDataComponentState;
struct UWeaponThrowUASFXComponent;
struct UWeaponVehicleFuncComponentGunSway;
struct UWeaponViewComponentAnim_CBow;
struct UWeaponViewComponentImpact;
struct IWeaponZoomHudInterface;
struct UWeldingGunComponent;
struct UWeldingGunDataComponentProxy;
struct UWeldingGunFuncComponentCrosshair;
struct UWorldDamageMaker;
struct AZiplineDraftGear;
struct AZiplineInteractorActor;

// Object: Enum GPGameplay.EStateAudioEventType
enum class EStateAudioEventType : uint8_t
{
	None = 0,
	NormalState = 1,
	LowHealth = 2,
	PendingDeath = 3,
	HoldBreath = 4,
	MP_ExitBoundary = 5,
	MP_EnterDeploy = 6,
	Suppressed = 7,
	EStateAudioEventType_MAX = 8
};

// Object: Enum GPGameplay.EModularPartNodeType
enum class EModularPartNodeType : uint8_t
{
	None = 0,
	Adpater = 1,
	ExtraModel = 2,
	SkinAttach = 3,
	Pendant = 4,
	EModularPartNodeType_MAX = 5
};

// Object: Enum GPGameplay.EGPCharacterFightStateType
enum class EGPCharacterFightStateType : uint8_t
{
	Fighting = 0,
	Leisure = 1,
	Alert = 2,
	EGPCharacterFightStateType_MAX = 3
};

// Object: Enum GPGameplay.EDamageValidateType
enum class EDamageValidateType : uint8_t
{
	None = 0,
	HitScan = 1,
	Projectile = 2,
	MeleeHitScan = 3,
	EDamageValidateType_MAX = 4
};

// Object: Enum GPGameplay.EDamageType
enum class EDamageType : uint8_t
{
	ENone = 0,
	EDefault = 1,
	EBuffDamage = 2,
	EWeaponDamage = 3,
	EDroppedDamage = 4,
	EWeaponThrowableDamage = 5,
	EPVEVehicleExplodeDamage = 6,
	EVehicleHitDamage = 7,
	EWeaponMeleeDamage = 8,
	EFSMActionDamage = 9,
	EDebug = 10,
	EVehicleLightDamage = 11,
	EVehicleNormalDamage = 12,
	EVehicleHeavyDamage = 13,
	EAssassinateDamage = 14,
	ETieBreakerDamage = 15,
	EFixedTrackRocket = 16,
	EAbilityC401 = 17,
	EBattleFieldSupportDamage = 18,
	LandmineDamage = 19,
	EMax = 20,
	ESectorArtilerrateSkillDamage = 21,
	EGuidedMissleSkillDamage = 22,
	ESkillDamage = 23,
	EWaterDrowningDamage = 24,
	ELaserDamage = 25,
	EInteractDamage = 26,
	ESceneFlameDamage = 27,
	EFireCrackerExpodeDamage = 28,
	EFootballExpodeDamage = 29,
	EDamageType_MAX = 30
};

// Object: Enum GPGameplay.EDamageSystemDamageType
enum class EDamageSystemDamageType : uint8_t
{
	None = 0,
	Point = 1,
	Radial = 2,
	Physics = 3,
	Buff = 4,
	EDamageSystemDamageType_MAX = 5
};

// Object: Enum GPGameplay.EDamageValidateResult
enum class EDamageValidateResult : uint8_t
{
	None = 0,
	Approve = 1,
	Ignore = 2,
	Abort = 3,
	AbortOnlyLog = 4,
	UseServer = 5,
	EDamageValidateResult_MAX = 6
};

// Object: Enum GPGameplay.ECharacterLiveStatus
enum class ECharacterLiveStatus : uint8_t
{
	ECharacterLiveStatus_None = 0,
	ECharacterLiveStatus_Alive = 1,
	ECharacterLiveStatus_Death = 2,
	ECharacterLiveStatus_ImpendingDeath = 3,
	ECharacterLiveStatus_WTF = 4,
	ECharacterLiveStatus_MAX = 5
};

// Object: Enum GPGameplay.EHitDamageApplyType
enum class EHitDamageApplyType : uint8_t
{
	HitDamageApplyType_Health = 0,
	HitDamageApplyType_Shield = 1,
	HitDamageApplyType_BothShieldHealth = 2,
	HitDamageApplyType_MAX = 3
};

// Object: Enum GPGameplay.EDirection
enum class EDirection : uint8_t
{
	Direction_None = 0,
	Direction_Front = 1,
	Direction_Back = 2,
	Direction_Left = 3,
	Direction_Right = 4,
	Direction_MAX = 5
};

// Object: Enum GPGameplay.EHitGroupType
enum class EHitGroupType : uint8_t
{
	HitGroupType_None = 0,
	HitGroupType_Head = 1,
	HitGroupType_Neck = 2,
	HitGroupType_LeftShoulder = 3,
	HitGroupType_RightShoulder = 4,
	HitGroupType_Chest = 5,
	HitGroupType_Stomach = 6,
	HitGroupType_Hip = 7,
	HitGroupType_LeftLeg = 8,
	HitGroupType_LeftLegLower = 9,
	HitGroupType_LeftFoot = 10,
	HitGroupType_RightLeg = 11,
	HitGroupType_RightLegLower = 12,
	HitGroupType_RightFoot = 13,
	HitGroupType_LeftArm = 14,
	HitGroupType_LeftForeArm = 15,
	HitGroupType_LeftHand = 16,
	HitGroupType_RightArm = 17,
	HitGroupType_RightForeArm = 18,
	HitGroupType_RightHand = 19,
	HitGroupType_Shield = 20,
	HitGroupType_Weapon = 21,
	HitGroupType_RightAnkle = 22,
	HitGroupType_LeftAnkle = 23,
	HitGroupType_MAX = 24
};

// Object: Enum GPGameplay.ELastHitPosition
enum class ELastHitPosition : uint8_t
{
	Head = 0,
	Chest = 1,
	Stomach = 2,
	LeftArm = 3,
	RightArm = 4,
	LeftLeg = 5,
	RightLeg = 6,
	None = 99,
	ELastHitPosition_MAX = 100
};

// Object: Enum GPGameplay.EMysticalPendantShowType
enum class EMysticalPendantShowType : uint8_t
{
	None = 0,
	Material = 1,
	Effect = 2,
	Image = 3,
	EMysticalPendantShowType_MAX = 4
};

// Object: Enum GPGameplay.EDeadType
enum class EDeadType : uint8_t
{
	ENone = 0,
	EKilledByWeapon = 1,
	EkilledByVehicle = 2,
	EkilledBySelf = 3,
	EkilledByPoisonGas = 4,
	EkilledFallDown = 5,
	EKilledFromImpendingDeath = 6,
	EKilledFromBuff = 7,
	EKilledByGm = 8,
	EKilledFromEnvExplosion = 9,
	EKilledByVehicleWeapon = 10,
	EKilledByAssassinateDamage = 11,
	EKilledByBattleFieldSupportSkill = 12,
	EKilledBySectorArtilerrateSkill = 13,
	EKilledByGuidedMissleSkill = 14,
	EDeadType_MAX = 15
};

// Object: Enum GPGameplay.EGPHealthShowMode
enum class EGPHealthShowMode : uint8_t
{
	NeverShow = 0,
	ShowOnPoint = 1,
	AlwaysShow = 2,
	ShowBigBar = 3,
	EGPHealthShowMode_MAX = 4
};

// Object: Enum GPGameplay.EGPFSMTransitionEvent
enum class EGPFSMTransitionEvent : uint8_t
{
	EGPFSMTransitionEvent_Unknown = 0,
	EGPFSMTransitionEVent_WaitPlayerStart = 1,
	EGPFSMTransitionEVent_EndWaitPlayerStart = 2,
	EGPFSMTransitionEVent_EnterMPLogoutState = 3,
	EGPFSMTransitionEVent_ExitMPLogoutState = 4,
	EGPFSMTransitionEvent_Timeout = 5,
	EGPFSMTransitionEvent_StartSprint = 6,
	EGPFSMTransitionEvent_StartSuperSprint = 7,
	EGPFSMTransitionEvent_EndSprintToStop = 8,
	EGPFSMTransitionEvent_EndSprintToMoving = 9,
	EGPFSMTransitionEvent_Finish = 10,
	EGPFSMTransitionEvent_NormalToADS = 11,
	EGPFSMTransitionEvent_AdsToNormal = 12,
	EGPFSMTransitionEvent_BeginVault = 13,
	EGPFSMTransitionEvent_EndVault = 14,
	EGPFSMTransitionEvent_BeginOperate = 15,
	EGPFSMTransitionEvent_EndOperate = 16,
	EGPFSMTransitionEvent_BeginZipline = 17,
	EGPFSMTransitionEvent_EndZipline = 18,
	EGPFSMTransitionEvent_CancelZipline = 19,
	EGPFSMTransitionEvent_CancelOperate = 20,
	EGPFSMTransitionEvent_ToLooting = 21,
	EGPFSMTransitionEvent_ToReborn = 22,
	EGPFSMTransitionEvent_BeAssassinateToIampendingDeath = 23,
	ESkillEvent_BuffFinish = 24,
	ESkillEvent_Cast = 25,
	ESkillEvent_Charged = 26,
	ESkillEvent_Charging = 27,
	ESkillEvent_Restored = 28,
	ESkillEvent_SpawnObjectFinish = 29,
	ESkillEvent_Terminate = 30,
	ESkillEvent_Ultimate = 31,
	ESkillEvent_NormalBreak = 32,
	ESkillEvent_Timeout = 33,
	ESkillEvent_Break = 34,
	ESkillEvent_BeginCharging = 35,
	ESkillEvent_BeginCooling = 36,
	ESkillEvent_BeginPreparing = 37,
	ESkillEvent_EndPrepare = 38,
	ESkillEvent_CancelPrepare = 39,
	ESkillEvent_Yes = 40,
	ESkillEvent_No = 41,
	ESkillEvent_SkillEnerngyChange = 42,
	ESkillEvent_Failed = 43,
	ESkillEvent_EnergyChanged = 44,
	ESkillEvent_Death = 45,
	ESkillEvent_Uncharged = 46,
	EGPFSMTransitionEvent_BeginRelaxIdle = 47,
	EGPFSMTransitionEvent_EndRelaxIdle = 48,
	EGPFSMTransitionEvent_BeginStarApp = 49,
	EGPFSMTransitionEvent_BeginStarAppInRegName = 50,
	EGPFSMTransitionEvent_EndStarApp = 51,
	EGPFSMTransitionEvent_BeginCutScne = 52,
	EGPFSMTransitionEvent_EndCutScne = 53,
	EGPFSMTransitionEvent_ToLeftLean = 54,
	EGPFSMTransitionEvent_ToRightLean = 55,
	EGPFSMTransitionEvent_EndLean = 56,
	EGPFSMTransitionEvent_StartClimbLadder = 57,
	EGPFSMTransitionEvent_GetOffClimbLadder = 58,
	EGPFSMTransitionEvent_EndClimbLadder = 59,
	EGPFSMTransitionEvent_CarryBodyGetOnVehicle = 60,
	EGPFSMTransitionEvent_CarryBodyGetOffVehicle = 61,
	EGPFSMTransitionEvent_BeginBeHit = 62,
	EGPFSMTransitionEvent_EndBeHit = 63,
	EGPFSMTransitionEvent_CancelBeHit = 64,
	EGPFSMTransitionEvent_StartAutoDriveVehicle = 65,
	EGPFSMTransitionEvent_CancelAutoDriveVehicle = 66,
	EGPFSMTransitionEvent_GetOnFlyBase = 67,
	EGPFSMTransitionEvent_GetOffFlyBase = 68,
	EGPFSMTransitionEvent_BeginUseSkill = 69,
	EGPFSMTransitionEvent_EndUseSkill = 70,
	EGPFSMTransitionEvent_BeginLeftHandSkill = 71,
	EGPFSMTransitionEvent_EndLeftHandSkill = 72,
	EGPFSMTransitionEvent_BeginRightHandSkill = 73,
	EGPFSMTransitionEvent_EndRightHandSkill = 74,
	EGPFSMTransitionEvent_BeginDoubleHandsSkill = 75,
	EGPFSMTransitionEvent_EndDoubleHandsSkill = 76,
	EGPFSMTransitionEvent_BeginLegsSkill = 77,
	EGPFSMTransitionEvent_EndLegsSkill = 78,
	EGPFSMTransitionEvent_BeginSpecialSkill = 79,
	EGPFSMTransitionEvent_EndSpecialSkill = 80,
	EGPFSMTransitionEvent_BeginActionSkill = 81,
	EGPFSMTransitionEvent_EndActionSkill = 82,
	EGPFSMTransitionEvent_BeginCustomSkill = 83,
	EGPFSMTransitionEvent_EndCustomSkill = 84,
	EGPFSMTransitionEvent_BeginCustom2Skill = 85,
	EGPFSMTransitionEvent_EndCustom2Skill = 86,
	EGPFSMTransitionEvent_BeginCustom3Skill = 87,
	EGPFSMTransitionEvent_EndCustom3Skill = 88,
	EGPFSMTransitionEvent_BeginAssassinate = 89,
	EGPFSMTransitionEvent_EndAssassinate = 90,
	EGPFSMTransitionEvent_SkillToSkillADS = 91,
	EGPFSMTransitionEvent_SkillADSToSkill = 92,
	EGPFSMTransitionEvent_EndRescue = 93,
	EGPFSMTransitionEvent_StartSearchItem = 94,
	EGPFSMTransitionEvent_EndSearchItem = 95,
	EGPFSMTransitionEvent_StartWeaponInspect = 96,
	EGPFSMTransitionEvent_EndWeaponInspect = 97,
	EGPFSMTransitionEvent_StartHighValueItemInspect = 98,
	EGPFSMTransitionEvent_EndHighValueItemInspect = 99,
	EGPFSMTransitionEvent_StartWeaponBipodDeploy = 100,
	EGPFSMTransitionEvent_EndWeaponBipodDeploy = 101,
	EGPFSMTransitionEvent_StartSlidingTackle = 102,
	EGPFSMTransitionEvent_EndSlidingTackle = 103,
	EGPFSMTransitionEvent_StartCrocodileBite = 104,
	EGPFSMTransitionEvent_EndCrocodileBite = 105,
	EGPFSMTransitionEvent_StartSimpleOperate = 106,
	EGPFSMTransitionEvent_EndSimpleOperate = 107,
	EGPFSMTransitionEvent_StartSimpleOperateWithUI = 108,
	EGPFSMTransitionEvent_EndSimpleOperateWithUI = 109,
	EGPFSMTransitionEvent_StartPreciseOperate = 110,
	EGPFSMTransitionEvent_EndPreciseOperate = 111,
	EGPFSMTransitionEvent_StartPreciseOperateWithUI = 112,
	EGPFSMTransitionEvent_EndPreciseOperateWithUI = 113,
	EGPFSMTransitionEvent_StartDelayOperate = 114,
	EGPFSMTransitionEvent_EndDelayOperate = 115,
	EGPFSMTransitionEvent_StartDelayOperateWithUI = 116,
	EGPFSMTransitionEvent_EndDelayOperateWithUI = 117,
	EGPFSMTransitionEvent_EndKnockbacck = 118,
	EGPFSMTransitionEvent_StartKnockbacck = 119,
	EGPFSMTransitionEvent_StartFirefighting = 120,
	EGPFSMTransitionEvent_EndFirefighting = 121,
	EGPFSMTransitionEvent_StartMarking = 122,
	EGPFSMTransitionEvent_EndMarking = 123,
	EGPFSMTransitionEvent_StartOneHandedGesture = 124,
	EGPFSMTransitionEvent_EndOneHandedGesture = 125,
	EGPFSMTransitionEvent_StartTwoHandedGesture = 126,
	EGPFSMTransitionEvent_EndTwoHandedGesture = 127,
	EGPFSMTransitionEvent_StartEmote = 128,
	EGPFSMTransitionEvent_EndEmote = 129,
	EGPFSMTransitionEvent_StartApplySpray = 130,
	EGPFSMTransitionEvent_EndApplySpray = 131,
	EGPFSMTransitionEvent_StartFallHighBeHit = 132,
	EGPFSMTransitionEvent_EndFallHighBeHit = 133,
	EGPFSMTransitionEvent_SafeHouseEnterRange = 134,
	EGPFSMTransitionEvent_SafeHouseLeaveRange = 135,
	EGPFSMTransitionEvent_StartAirDropVehicle = 136,
	EGPFSMTransitionEvent_EndAirDropVehicle = 137,
	EGPFSMTransitionEvent_StartSeamlessShow = 138,
	EGPFSMTransitionEvent_EndSeamlessShow = 139,
	EGPFSMTransitionEvent_StartRankSKillOperate = 140,
	EGPFSMTransitionEvent_EndRankSKillOperate = 141,
	EGPFSMTransitionEvent_StartCommonLeftArmAnim = 142,
	EGPFSMTransitionEvent_EndCommonLeftArmAnim = 143,
	EGPFSMTransitionEvent_StartDive = 144,
	EGPFSMTransitionEvent_EndDive = 145,
	EGPFSMTransitionEvent_CaptureFlagStarFinish = 146,
	EGPFSMTransitionEvent_StartCaptureFlag = 147,
	EGPFSMTransitionEvent_EndCaptureFlag = 148,
	EGPFSMTransitionEvent_StartPassiveMove = 149,
	EGPFSMTransitionEvent_EndPassiveMove = 150,
	EGPFSMTransitionEvent_StartPrePassiveMove = 151,
	EGPFSMTransitionEvent_EndPrePassiveMove = 152,
	EGPFSMTransitionEvent_EndElectricShock = 153,
	EGPFSMTransitionEvent_StartElectricShock = 154,
	EGPFSMTransitionEvent_StartHelmetAction = 155,
	EGPFSMTransitionEvent_EndHelmetAction = 156,
	EGPFSMTransitionEvent_StartDramaFall = 157,
	EGPFSMTransitionEvent_EndDramaFall = 158,
	EGPFSMTransitionEvent_GetOnVehicleMoveBase = 159,
	EGPFSMTransitionEvent_GetOffVehicleMoveBase = 160,
	EGPFSMTransitionEvent_AssaSharkMoveQTE = 161,
	EGPFSMTransitionEvent_AssaSharkAttack2 = 162,
	EGPFSMTransitionEvent_StartEarthquakeFallDown = 163,
	EGPFSMTransitionEvent_EndEarthquakeFallDown = 164,
	EGPFSMTransitionEvent_StartPushOver = 165,
	EGPFSMTransitionEvent_EndPushOver = 166,
	EGPFSMTransitionEvent_MAX = 167
};

// Object: Enum GPGameplay.ECharacterFSMEventDefine
enum class ECharacterFSMEventDefine : uint8_t
{
	EVENT_GPFSM_NONE = 0,
	EVENT_GPFSM_Server_ReceiveTransitionEvent = 1,
	EVENT_GPFSM_Client_MoveForward = 2,
	EVENT_GPFSM_Client_MoveRight = 3,
	EVENT_GPFSM_Client_MoveStatusChanged = 4,
	EVENT_GPFSM_Client_Turn = 5,
	EVENT_GPFSM_Client_TurnAtRate = 6,
	EVENT_GPFSM_Client_LookUp = 7,
	EVENT_GPFSM_Client_LookUpAtRate = 8,
	EVENT_GPFSM_Client_PrepareFire = 9,
	EVENT_GPFSM_Client_PrepareJump = 10,
	EVENT_GPFSM_Client_PrepareAim = 11,
	EVENT_GPFSM_Client_PrepareReload = 12,
	EVENT_GPFSM_Client_FireButtonPressed = 13,
	EVENT_GPFSM_Client_FireButtonReleased = 14,
	EVENT_GPFSM_Client_FireButtonRelease_IncludeF = 15,
	EVENT_GPFSM_Client_JumButtonPressed = 16,
	EVENT_GPFSM_Client_AimButtonPressed = 17,
	EVENT_GPFSM_Client_AimButtonReleased = 18,
	EVENT_GPFSM_Client_SideAimButtonPressed = 19,
	EVENT_GPFSM_Client_SideAimButtonReleased = 20,
	EVENT_GPFSM_Client_ReloadButtonPressed = 21,
	EVENT_GPFSM_Client_MoveButtonPressed = 22,
	EVENT_GPFSM_Client_SprintButtonPressed = 23,
	EVENT_GPFSM_Client_CrouchButtonPressed = 24,
	EVENT_GPFSM_Client_CrouchButtonReleased = 25,
	EVENT_GPFSM_Client_ProneButtonPressed = 26,
	EVENT_GPFSM_Client_SwitchWeaponButtonPressed = 27,
	EVENT_GPFSM_Client_ToogleCrouch = 28,
	EVENT_GPFSM_Client_ToogleProne = 29,
	EVENT_GPFSM_Client_TooglePose = 30,
	EVENT_GPFSM_Server_BeginUseItem = 31,
	EVENT_GPFSM_Server_EndUseItem = 32,
	EVENT_GPFSM_Server_CancelUseItem = 33,
	EVENT_GPFSM_Client_CancelUseItem = 34,
	EVENT_GPFSM_Client_ClientPreUseItem = 35,
	EVENT_GPFSM_Server_BeginOperate = 36,
	EVENT_GPFSM_Server_EndOperate = 37,
	EVENT_GPFSM_Server_CancelOperate = 38,
	EVENT_GPFSM_Server_TryRescue = 39,
	EVENT_GPFSM_Server_TryCancelRescue = 40,
	EVENT_GPFSM_Client_TryCancelRescue = 41,
	EVENT_GPFSM_Client_TryCancelRescueMySelf = 42,
	EVENT_GPFSM_Client_TryCancelCancelRescueMySelf = 43,
	EVENT_GPFSM_Client_BeingRescueInfoArrived = 44,
	EVENT_GPFSM_Client_BeingRescueAnimationTriggered = 45,
	EVENT_GPFSM_Client_TryCancelRescueMySelfImmediately = 46,
	EVENT_GPFSM_Client_TryCancelCancelRescueMySelfImmediately = 47,
	EVENT_GPFSM_Server_StartSprint = 48,
	EVENT_GPFSM_Server_EndSprint = 49,
	EVENT_GPFSM_Server_BeginLooting = 50,
	EVENT_GPFSM_Server_TryDriveCar = 51,
	EVENT_GPFSM_Server_TryTexiCar = 52,
	EVENT_GPFSM_Server_GetOnVehicleWhenCarryBody = 53,
	EVENT_GPFSM_Server_GetOffVehicleWhenCarryBody = 54,
	EVENT_GPFSM_Server_TryStopDrivingCar = 55,
	EVENT_GPFSM_Server_TryTexiOffCar = 56,
	EVENT_GPFSM_Client_CarInfoArrived = 57,
	EVENT_GPFSM_Client_TrySwitchSeat = 58,
	EVENT_GPFSM_Server_TrySwitchSeat = 59,
	EVENT_GPFSM_Server_TryGetOnCarWithSpecificSeat = 60,
	EVENT_GPFSM_Server_TryCarryBody = 61,
	EVENT_GPFSM_Server_TryCancelCarryBody = 62,
	EVENT_GPFSM_Server_TryDropCarryBody = 63,
	EVENT_GPFSM_Server_TryStartMonitor = 64,
	EVENT_GPFSM_Server_TryCancelMonitor = 65,
	EVENT_GPFSM_Server_TryEnterMonitor = 66,
	EVENT_GPFSM_Server_TryEnterNextMonitor = 67,
	EVENT_GPFSM_Server_TryEnterLastMonitor = 68,
	EVENT_GPFSM_Server_TryUseTelescope = 69,
	EVENT_GPFSM_Server_TryCancelTelescope = 70,
	EVENT_GPFSM_Both_ResetPassengerPosition = 71,
	EVENT_GPFSM_Server_TryUseH2HBInCar = 72,
	EVENT_GPFSM_Server_TryUseH2HBOnLand = 73,
	EVENT_GPFSM_Server_TryLeaveMachineGun = 74,
	EVENT_GPFSM_Client_JumpButtonPressed = 75,
	EVENT_GPFSM_Client_JumpButtonReleased = 76,
	EVENT_GPFSM_Client_ForceToStand = 77,
	EVENT_GPFSM_Client_UseItemInfoArrived = 78,
	EVENT_GPFSM_Client_TrumpetButtonPressed = 79,
	EVENT_GPFSM_Client_TrumpetButtonReleased = 80,
	EVENT_GPFSM_Client_WheelieButtonPressed = 81,
	EVENT_GPFSM_Client_WheelieButtonReleased = 82,
	EVENT_GPFSM_Client_StoppieButtonPressed = 83,
	EVENT_GPFSM_Client_StoppieButtonReleased = 84,
	EVENT_GPFSM_Client_TryUseStarApp = 85,
	EVENT_GPFSM_Client_TryCancelStarApp = 86,
	EVENT_GPFSM_Client_ToogleLeftLean = 87,
	EVENT_GPFSM_Client_ToogleRightLean = 88,
	EVENT_GPFSM_CancelLean = 89,
	EVENT_GPFSM_Server_StartSearchItem = 90,
	EVENT_GPFSM_Server_EndSearchItem = 91,
	EVENT_GPFSM_Server_StartWeaponInspect = 92,
	EVENT_GPFSM_Server_EndWeaponInspect = 93,
	EVENT_GPFSM_Server_StartWeaponBipodDeploy = 94,
	EVENT_GPFSM_Server_EndWeaponBipodDeploy = 95,
	EVENT_GPFSM_Client_StartWeaponBipodDeploy = 96,
	EVENT_GPFSM_Client_EndPerformAction = 97,
	EVENT_GPFSM_Server_EndPerformAction = 98,
	EVENT_GPFSM_Client_FirefightingButtonReleased = 99,
	EVENT_GPFSM_Server_KnockDownBeginBeHit = 100,
	EVENT_GPFSM_Server_KnockDownCancelBeHit = 101,
	EVENT_GPFSM_Server_ExplodeDamageBeginBeHit = 102,
	EVENT_GPFSM_Server_ExplodeDamageCancelBeHit = 103,
	EVENT_GPFSM_Server_BeginUseSkill = 104,
	EVENT_GPFSM_Server_EndUseSkill = 105,
	EVENT_GPFSM_Server_BeginLeftHandSkill = 106,
	EVENT_GPFSM_Server_EndLeftHandSkill = 107,
	EVENT_GPFSM_Server_BeginRightHandSkill = 108,
	EVENT_GPFSM_Server_EndRightHandSkill = 109,
	EVENT_GPFSM_Server_BeginDoubleHandsSkill = 110,
	EVENT_GPFSM_Server_EndDoubleHandsSkill = 111,
	EVENT_GPFSM_Server_BeginLegsSkill = 112,
	EVENT_GPFSM_Server_EndLegsSkill = 113,
	EVENT_GPFSM_Server_BeginSpecialSkill = 114,
	EVENT_GPFSM_Server_EndSpecialSkill = 115,
	EVENT_GPFSM_Server_BeginActionSkill = 116,
	EVENT_GPFSM_Server_EndActionSkill = 117,
	EVENT_GPFSM_Server_BeginCustomSkill = 118,
	EVENT_GPFSM_Server_EndCustomSkill = 119,
	EVENT_GPFSM_Server_BeginCustom2Skill = 120,
	EVENT_GPFSM_Server_EndCustom2Skill = 121,
	EVENT_GPFSM_Server_BeginCustom3Skill = 122,
	EVENT_GPFSM_Server_EndCustom3Skill = 123,
	EVENT_GPFSM_Server_BeginZipline = 124,
	EVENT_GPFSM_Server_EndZipline = 125,
	EVENT_GPFSM_Server_CancelZipline = 126,
	EVENT_GPFSM_Server_BeginAssassinate = 127,
	EVENT_GPFSM_Server_EndAssassinate = 128,
	EVENT_GPFSM_Server_CancelAssassinate = 129,
	EVENT_GPFSM_Server_BeingAssassinateBegin = 130,
	EVENT_GPFSM_Server_BeingAssassinateEnd = 131,
	EVENT_GPFSM_Server_BeingAssassinateBreakOff = 132,
	EVENT_GPFSM_CommandSkill = 133,
	EVENT_GPFSM_BeginPrepare = 134,
	EVENT_GPFSM_CancelPrepare = 135,
	EVENT_GPFSM_Both_TryCancelUseItem = 136,
	EVENT_GPFSM_Client_ParentAttachmentChange = 137,
	EVENT_GPFSM_Server_TryEnterRelaxIdle = 138,
	EVENT_GPFSM_Server_TryCancelRelaxIdle = 139,
	EVENT_GPFSM_Client_TryGetOutWeapon = 140,
	EVENT_GPFSM_Client_TryStartAutoDriveVehicle = 141,
	EVENT_GPFSM_Server_BeginFloating = 142,
	EVENT_GPFSM_Server_CancelFloating = 143,
	EVENT_GPFSM_Client_SkillPressed = 144,
	EVENT_GPFSM_Client_SkillReleased = 145,
	EVENT_GPFSM_Client_BeginVaultAndClimb = 146,
	EVENT_GPFSM_Client_EndVaultAndClimb = 147,
	EVENT_GPFSM_Server_BeginBeSuppressed = 148,
	EVENT_GPFSM_Server_CanceBeSuppressed = 149,
	EVENT_GPFSM_Server_BeginRaiseWatch = 150,
	EVENT_GPFSM_Server_EndRaiseWatch = 151,
	EVENT_GPFSM_Client_SafeHouseEnterRange = 152,
	EVENT_GPFSM_Client_SafeHouseLeaveRange = 153,
	EVENT_GPFSM_Server_StartAirDropVehicle = 154,
	EVENT_GPFSM_Server_EndAirDropVehicle = 155,
	EVENT_GPFSM_Server_StartRankSkillOperate = 156,
	EVENT_GPFSM_Server_EndRankSkillOperate = 157,
	EVENT_GPFSM_MAX = 158
};

// Object: Enum GPGameplay.EBreathState
enum class EBreathState : uint8_t
{
	None = 0,
	Breath = 1,
	HoldBreath = 2,
	UnHoldBreath = 3,
	EBreathState_MAX = 4
};

// Object: Enum GPGameplay.ECharingSlot
enum class ECharingSlot : uint8_t
{
	None = 0,
	ArmdedForceItem1 = 1,
	ArmdedForceItem2 = 2,
	Ability = 3,
	AbilityReady = 4,
	FlyRebotSkill = 5,
	FlyRebotHealth = 6,
	FlyRebotCharging = 7,
	BattleFieldPropSkillCD = 8,
	GuidedMissle = 9,
	SectorArtilerrate = 10,
	SectorSmoke = 11,
	RebornBeacons = 12,
	NightVision = 13,
	ArmdedForceItem1Ready = 14,
	ArmdedForceItem2Ready = 15,
	BattleFieldPropSkillReady = 16,
	UpgradeHighValueAnchor = 17,
	UpgradeHighVehicleAnchor = 18,
	FastRedeploy = 19,
	FreeBuild = 20,
	CommanderCommumication = 21,
	AttackReform = 22,
	Relink = 23,
	Max = 24
};

// Object: Enum GPGameplay.ESkillBehavior
enum class ESkillBehavior : uint8_t
{
	NormalStart = 0,
	NormalBreak = 1,
	NormalEnd = 2,
	UnNormalEnd = 3,
	Fire = 4,
	FirePress = 5,
	Reload = 6,
	Jump = 7,
	Aim = 8,
	SwtichWeapon = 9,
	AssaultBreak = 10,
	CharacherImpendingDeat = 11,
	CharacherImpendingDeatAction = 12,
	CharacherDie = 13,
	CurWeaponAllAmmoEmpty = 14,
	UseItem = 15,
	SwtichWeaponSuccess = 16,
	BeginEquipWeapon = 17,
	EndEquipWeapon = 18,
	FireUnPress = 19,
	EndFire = 20,
	SupportWeaponFire = 21,
	UseSkill2_Begin = 22,
	UseSkill2_End = 23,
	SkillWeaponAttach = 24,
	SkillWeaponDetach = 25,
	BeginEquip = 26,
	WeaponComponentFire = 27,
	WeaponComponentEndFire = 28,
	WeaponComponentSwitchToIdle = 29,
	TakeDamge = 30,
	TakeDamgeToDie = 31,
	EMPBreak = 32,
	RePressedInSkill = 33,
	LeaveSkillState = 34,
	OnEndPassiveMove = 35,
	OnPassiveMoveAnimEnd = 36,
	CallAI_CombatStyle_Assault = 37,
	CallAI_CombatStyle_Prudent = 38,
	ReLongPressInSkill = 39,
	ReClickInSkill = 40,
	ESkillBehavior_MAX = 41
};

// Object: Enum GPGameplay.ESkillBtnCall
enum class ESkillBtnCall : uint8_t
{
	None = 0,
	Pressed = 1,
	Released = 2,
	Click = 3,
	LongPress = 4,
	ESkillBtnCall_MAX = 5
};

// Object: Enum GPGameplay.EWeaponAddFunction
enum class EWeaponAddFunction : uint8_t
{
	EWeapAddFunc_None = 0,
	EWeapAddFunc_Zooming = 1,
	EWeapAddFunc_Silencer = 2,
	EWeapAddFunc_FlashSuppressor = 3,
	EWeapAddFunc_ClipExtent = 4,
	EWeapAddFunc_ChangeClipFaster = 5,
	EWeapAddFunc_LeftHandIK = 6,
	EWeapAddFunc_BipodUpDown = 7,
	EWeapAddFunc_FlashLight = 8,
	EWeapAddFunc_Laser = 9,
	EWeapAddFunc_PowerFlash = 10,
	EWeapAddFunc_InspectWeapon = 11,
	EWeapAddFunc_QuicklyAdapt = 12,
	EBackWeapPos_Max = 13,
	EWeaponAddFunction_MAX = 14
};

// Object: Enum GPGameplay.ESubtitleSequenceType
enum class ESubtitleSequenceType : uint8_t
{
	None = 0,
	Subtitle_Raid1 = 1,
	Subtitle_Raid2 = 2,
	Subtitle_SafeHouse = 3,
	Subtitle_SOLEvent = 4,
	Subtitle_SOLQuest = 5,
	Subtitle_AI = 6,
	Subtitle_Intro = 7,
	Subtitle_CutScene = 8,
	Subtitle_BreakthroughThink = 9,
	Subtitle_SOLRelink = 10,
	ESubtitleSequenceType_MAX = 11
};

// Object: Enum GPGameplay.ESlotButton
enum class ESlotButton : uint8_t
{
	SlotButton_Right = 0,
	SlotButton_Left = 1,
	SlotButton_FirePress = 2,
	SlotButton_FireRelease = 3,
	SlotButton_MAX = 4
};

// Object: Enum GPGameplay.ESkillUISlot
enum class ESkillUISlot : uint8_t
{
	UIState_NoSlot = 0,
	UIState_FireButtonLeft = 1,
	UIState_Custom = 2,
	UIState_Custom2 = 3,
	UIState_Custom3 = 4,
	UIState_Self = 5,
	UIState_QTELeft = 6,
	UIState_QTERight = 7,
	UIState_ActiveSkill = 8,
	UIState_SupportSkill = 9,
	UIState_BattleFieldPropSkill = 10,
	UIState_QTELeft_Ext = 11,
	UIState_RankSkill = 12,
	UIState_MAX = 13
};

// Object: Enum GPGameplay.ESkillCDEffectType
enum class ESkillCDEffectType : uint8_t
{
	SkillCDEffect_Normal = 0,
	SkillCDEffect_Support = 1,
	SkillCDEffect_MAX = 2
};

// Object: Enum GPGameplay.ERankSkillUIState
enum class ERankSkillUIState : uint8_t
{
	None = 0,
	ScoreLess = 1,
	CDing = 2,
	ToBeUsed = 3,
	ERankSkillUIState_MAX = 4
};

// Object: Enum GPGameplay.EMarkFeature
enum class EMarkFeature : uint32_t
{
	UpdateScreenPosOnce = 1,
	UpdateScreenPos = 2,
	UpdateScreenPosFromTargetActor = 4,
	UpdateScreenPosFromGivenLocation = 8,
	UpdateScreenPosByController = 16,
	UpdateScreenPosByMatrix = 32,
	UpdateScreenPosEnableTraceXYZ = 64,
	UpdateScreenPosEnableTraceXY = 128,
	Update3DDis = 1024,
	Update2DDis = 2048,
	UpdateDir = 32768,
	UpdateAimed = 1048576,
	UpdateAimedOnTarget = 2097152,
	UpdateAimedBasedOnRadialDistance = 4194304,
	UpdateHasCoverBetween = 33554432,
	UpdateHasCoverBetweenUseRayTrace = 67108864,
	UpdateSizeOnDis = 1073741824,
	EMarkFeature_MAX = 1073741825
};

// Object: Enum GPGameplay.ETeamIdentity
enum class ETeamIdentity : uint8_t
{
	None = 0,
	TeamMember = 1,
	TeamLeader = 2,
	Commander = 3,
	ETeamIdentity_MAX = 4
};

// Object: Enum GPGameplay.EMarkingType
enum class EMarkingType : uint8_t
{
	None = 0,
	NormalUnitMarking = 1,
	UpgradeMarking = 2,
	TacticalMarking = 3,
	MapSyncMarking = 4,
	COUNT = 5,
	EMarkingType_MAX = 6
};

// Object: Enum GPGameplay.EMarkerCampType
enum class EMarkerCampType : uint8_t
{
	None = 0,
	Neutral = 1,
	Campmate = 2,
	Teammate = 3,
	Enemy = 4,
	Self = 5,
	EMarkerCampType_MAX = 6
};

// Object: Enum GPGameplay.EGPMarkerClassType
enum class EGPMarkerClassType : uint8_t
{
	None = 0,
	FriendlyCharacterMarker = 1,
	EnemyCharacterMarker = 2,
	SceneWeaponMarker = 3,
	VehicleMarker = 4,
	TacticalEquipmentMarker = 5,
	BattleFieldGameModeMarker = 6,
	SOLGameModeMarker = 7,
	QuestMarker = 8,
	MapMarker = 9,
	MarkingMarker = 10,
	InteractorMarker = 11,
	TacticalMarking = 12,
	EGPMarkerClassType_MAX = 13
};

// Object: Enum GPGameplay.ECountDownPriority
enum class ECountDownPriority : uint8_t
{
	None = 0,
	Common = 1,
	Contract = 2,
	Escape = 3,
	MandelBrick = 4,
	BraveGame = 5,
	Max = 6
};

// Object: Enum GPGameplay.EGPAbilityLockerType
enum class EGPAbilityLockerType : uint8_t
{
	None = 0,
	LaserPointer = 1,
	LaserPointerReciver = 2,
	LowAmmo = 3,
	EGPAbilityLockerType_MAX = 4
};

// Object: Enum GPGameplay.EAudioListenerType
enum class EAudioListenerType : uint8_t
{
	None = 0,
	Action = 1,
	Weapon = 2,
	Skill = 3,
	Voice = 4,
	Interact = 5,
	Loot = 6,
	Vehicle = 7,
	Buff = 8,
	RemoveBuff = 9,
	UseItem = 10,
	FormationChange = 11,
	FireFighting = 12,
	ClimbLadder = 13,
	BuffState = 14,
	FixedWeapon = 15,
	Emote = 16,
	OneHandGesture = 17,
	TwoHandGesture = 18,
	Spray = 19,
	GrenadeExplosion = 20,
	EAudioListenerType_MAX = 21
};

// Object: Enum GPGameplay.EInteractorType
enum class EInteractorType : uint8_t
{
	InteractorType_Unknow = 0,
	InteractorType_Default = 1,
	InteractorType_BoxOrBag = 2,
	InteractorType_DeadBody = 3,
	InteractorType_SingleItem = 4,
	InteractorType_Vehicle = 5,
	InteractorType_Rescue = 6,
	InteractorType_Carrybody = 7,
	InteractorType_ShopStation = 8,
	InteractorType_Door = 9,
	InteractorType_SingleItemContainer = 10,
	InteractorType_HackPC = 11,
	InteractorType_MusicPlayer = 12,
	InteractorType_Altar = 13,
	InteractorType_DisposalBomb = 14,
	InteractorType_GiftTreasure = 15,
	InteractorType_Max = 16
};

// Object: Enum GPGameplay.EAudioListenerGrenadeExplosionType
enum class EAudioListenerGrenadeExplosionType : uint8_t
{
	None = 0,
	Damage = 1,
	Smoke = 2,
	EAudioListenerGrenadeExplosionType_MAX = 3
};

// Object: Enum GPGameplay.EDestructibleBreakType
enum class EDestructibleBreakType : uint8_t
{
	Bullet = 0,
	Explosion = 1,
	Projectile = 2,
	Melee = 3,
	Physics = 4,
	Character = 5,
	Vehicle = 6,
	Skill = 7,
	Damage = 8,
	Other = 9,
	EDestructibleBreakType_MAX = 10
};

// Object: Enum GPGameplay.EHitEventType
enum class EHitEventType : uint8_t
{
	None = 0,
	HitBody = 1,
	HitBodyWithArmor = 2,
	HitBodyWithArmorAndDamageHp = 3,
	HitHeadWithoutHelmet = 4,
	HitHelmet = 5,
	HitHelmetAndDamageHp = 6,
	HitHelmetBroken = 7,
	HitArmorBroken = 8,
	HitLowHealth = 9,
	HitBulletWhoosh = 10,
	HitBulletHitAround = 11,
	HitSuppressByBullet = 12,
	KnockDownByHitBody = 13,
	KnockDownByHitHead = 14,
	KilledByHitBody = 15,
	KilledByHitHead = 16,
	Shocked = 17,
	HitVehicle = 18,
	KillVehicle = 19,
	BreakthroughRankSkillHit = 20,
	HitShield = 21,
	HitHeavyArmor = 22,
	Stagger = 23,
	HitADS = 24,
	HitSkillActor = 25,
	BreakShieldGlass = 26,
	CounterProjectile = 27,
	Invincible = 28,
	HitButterShield = 29,
	EHitEventType_MAX = 30
};

// Object: Enum GPGameplay.AttributeAdditionType
enum class EAttributeAdditionType : uint8_t
{
	Add_Base = 0,
	Override_Base = 1,
	InitalCover = 2,
	FinalCover = 3,
	Add = 4,
	Mult_A = 5,
	Mult_B = 6,
	Mult_C = 7,
	Mult_D = 8,
	Max = 9
};

// Object: Enum GPGameplay.EFSMGamePlayStatusDefine
enum class EFSMGamePlayStatusDefine : uint8_t
{
	GamePlayStatus_None = 0,
	GamePlayStatus_AimOn = 1,
	GamePlayStatus_Reload = 2,
	GamePlayStatus_Looting = 3,
	GamePlayStatus_Rescue = 4,
	GamePlayStatus_BeingRescue = 5,
	GamePlayStatus_ImpedingDeath = 6,
	GamePlayStatus_Prone = 7,
	GamePlayStatus_Crouch = 8,
	GamePlayStatus_float = 9,
	GamePlayStatus_MAX = 10
};

// Object: Enum GPGameplay.EFSMCharacterState
enum class EFSMCharacterState : uint8_t
{
	FSMPlayerState_None = 0,
	FSMPlayerState_AimOn = 1,
	FSMPlayerState_LeanPeek = 2,
	FSMPlayerState_Reload = 3,
	FSMPlayerState_Fire = 4,
	FSMPlayerState_WeaponInspect = 5,
	FSMPlayerState_WeaponBipodDeploy = 6,
	FSMPlayerState_Prone = 7,
	FSMPlayerState_Crouch = 8,
	FSMPlayerState_Stand = 9,
	FSMPlayerState_Sprint = 10,
	FSMPlayerState_SlidingTackle = 11,
	FSMPlayerState_SpecialMove = 12,
	FSMPlayerState_Swimming = 13,
	FSMPlayerState_SwimmingSprint = 14,
	FSMPlayerState_Marking = 15,
	FSMPlayerState_SearchItem = 16,
	FSMPlayerState_CarryBody = 17,
	FSMPlayerState_CarryBodyDrop = 18,
	FSMPlayerState_Rescue = 19,
	FSMPlayerState_BeingRescue = 20,
	FSMPlayerState_Interact = 21,
	FSMPlayerState_PreciseInteract = 22,
	FSMPlayerState_DelayInteract = 23,
	FSMPlayerState_GameOperate = 24,
	FSMPlayerState_Skill = 25,
	FSMPlayerState_DoubleHandSkill = 26,
	FSMPlayerState_LeftHandSkill = 27,
	FSMPlayerState_RightHandSkill = 28,
	FSMPlayerState_LegSkill = 29,
	FSMPlayerState_SpecialSkill = 30,
	FSMPlayerState_ActionSkill = 31,
	FSMPlayerState_Custom1Skill = 32,
	FSMPlayerState_Custom2Skill = 33,
	FSMPlayerState_Custom3Skill = 34,
	FSMPlayerState_Vehicle = 35,
	FSMPlayerState_SceneWeapon = 36,
	FSMPlayerState_UseItem = 37,
	FSMPlayerState_Firefighting = 38,
	FSMPlayerState_HighValueItemInspect = 39,
	FSMPlayerState_Helmet = 40,
	FSMPlayerState_BeHit = 41,
	FSMPlayerState_ImpedingDeath = 42,
	FSMPlayerState_Death = 43,
	FSMPlayerState_CutScene = 44,
	FSMPlayerState_Assassinate = 45,
	FSMPlayerState_BeAssassinate = 46,
	FSMPlayerState_OneHandedGesture = 47,
	FSMPlayerState_TwoHandedGesture = 48,
	FSMPlayerState_Emote = 49,
	FSMPlayerState_ApplySpray = 50,
	FSMPlayerState_CommonLeftArmAnim = 51,
	FSMPlayerState_Dive = 52,
	FSMPlayerState_CaptureFlag = 53,
	FSMPlayerState_PassiveMove = 54,
	FSMPlayerState_WaitStart = 55,
	FSMPlayerState_QuitGame = 56,
	FSMPlayerState_CrowdControl = 57,
	FSMPlayerState_EarthquakeFallDown = 58,
	FSMPlayerState_PushOver = 59,
	FSMPlayerState_MAX = 60
};

// Object: Enum GPGameplay.EMarkerCoordinatedType
enum class EMarkerCoordinatedType : uint8_t
{
	None = 0,
	PlayerExit_MapMarked = 10,
	EvacTriggerDam_MapMarked = 20,
	ContractInteractor_MapMarked = 21,
	MandelBrick = 31,
	MandelBrick_MapMarked = 41,
	HighValueBox_MapMarked = 42,
	MarkingItemMarker = 51,
	EMarkerCoordinatedType_MAX = 52
};

// Object: Enum GPGameplay.ECombustibleState
enum class ECombustibleState : uint8_t
{
	NonCombustible = 0,
	Combustible = 1,
	Ignited = 2,
	Burning = 3,
	ECombustibleState_MAX = 4
};

// Object: Enum GPGameplay.EBurnStage
enum class EBurnStage : uint8_t
{
	None = 0,
	EarlyBurn = 1,
	MidBurn = 2,
	LateBurn = 3,
	EBurnStage_MAX = 4
};

// Object: Enum GPGameplay.ERepairEventType
enum class ERepairEventType : uint8_t
{
	RepairStop = 0,
	RepairFinished = 1,
	ERepairEventType_MAX = 2
};

// Object: Enum GPGameplay.ELockerSubType
enum class ELockerSubType : uint8_t
{
	Normal = 0,
	GTQ35_Drone = 1,
	ELockerSubType_MAX = 2
};

// Object: Enum GPGameplay.EWeaponLockerType
enum class EWeaponLockerType : uint8_t
{
	None = 0,
	LaserPoniter = 1,
	StingerMissile = 2,
	Javelin = 3,
	AA = 4,
	AT = 5,
	EWeaponLockerType_MAX = 6
};

// Object: Enum GPGameplay.EStingerMissileLockingState
enum class EStingerMissileLockingState : uint8_t
{
	NONE = 0,
	UNLOCK_DISTANCE = 1,
	UNLOCK_EMPTY = 2,
	NAP_OF_EARTH = 3,
	CANNOTLOCK = 4,
	START_LOCKING = 5,
	COMPLETE_LOCKING = 6,
	END_LOCKING = 7,
	MISSILE_ATTACK = 8,
	EStingerMissileLockingState_MAX = 9
};

// Object: Enum GPGameplay.ECurveBlendOption_BCOnly
enum class ECurveBlendOption_BCOnly : uint8_t
{
	Override = 0,
	MaxValue = 1,
	Additive = 2,
	ECurveBlendOption_MAX = 3
};

// Object: Enum GPGameplay.EPartNodeFunc
enum class EPartNodeFunc : uint8_t
{
	EPNF_Empty = 0,
	EPNF_None = 1,
	EPNF_MAX = 2
};

// Object: Enum GPGameplay.EGPPlayParticleEffectRole
enum class EGPPlayParticleEffectRole : uint8_t
{
	ROLE_1PAnd3P = 0,
	ROLE_1P = 1,
	ROLE_3P = 2,
	ROLE_MAX = 3
};

// Object: Enum GPGameplay.EClimbLadderNotifySettingType
enum class EClimbLadderNotifySettingType : uint8_t
{
	EClimbLadderNotifySettingType_NONE = 0,
	EClimbLadderNotifySettingType_BreakPoint = 1,
	EClimbLadderNotifySettingType_MAX = 2
};

// Object: Enum GPGameplay.EVaultNotifySettingType
enum class EVaultNotifySettingType : uint8_t
{
	EVaultNotifySettingType_NONE = 0,
	EVaultNotifySettingType_StartPoint = 1,
	EVaultNotifySettingType_HandTouchPoint = 2,
	EVaultNotifySettingType_BeginVaultPoint = 3,
	EVaultNotifySettingType_EndVaultPoint = 4,
	EVaultNotifySettingType_LandPoint = 5,
	EVaultNotifySettingType_EndPoint = 6,
	EVaultNotifySettingType_BreakPoint = 7,
	EVaultNotifySettingType_HideWeapon = 8,
	EVaultNotifySettingType_ShowWeapon = 9,
	EVaultNotifySettingType_FallingPoint = 10,
	EVaultNotifySettingType_BeforeBreakPoint = 11,
	EVaultNotifySettingType_MAX = 12
};

// Object: Enum GPGameplay.EAnimNotifyStateIKBlend
enum class EAnimNotifyStateIKBlend : uint8_t
{
	None = 0,
	ChangeClip = 1,
	Vault = 2,
	Max = 3
};

// Object: Enum GPGameplay.EExplodeRagdollImpulseType
enum class EExplodeRagdollImpulseType : uint8_t
{
	None = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	EExplodeRagdollImpulseType_MAX = 4
};

// Object: Enum GPGameplay.EDamageExplodeBlockCheckType
enum class EDamageExplodeBlockCheckType : uint8_t
{
	Low = 0,
	High = 1,
	EDamageExplodeBlockCheckType_MAX = 2
};

// Object: Enum GPGameplay.EGPDamageFeature
enum class EGPDamageFeature : uint8_t
{
	None = 0,
	SOL = 1,
	EGPDamageFeature_MAX = 2
};

// Object: Enum GPGameplay.EGPDamageMode
enum class EGPDamageMode : uint8_t
{
	Default = 0,
	GameMode01 = 1,
	GameMode02 = 2,
	GameMode03 = 3,
	GameMode04 = 4,
	EGPDamageMode_MAX = 5
};

// Object: Enum GPGameplay.EAttributeEffectMainTag
enum class EAttributeEffectMainTag : uint8_t
{
	Default = 0,
	Damage = 1,
	Buff = 2,
	System = 3,
	Equipment = 4,
	Max = 5
};

// Object: Enum GPGameplay.EAttributeEffectInstanceType
enum class EAttributeEffectInstanceType : uint8_t
{
	None = 0,
	Damage = 1,
	Buff = 2,
	ItemHealth = 3,
	EAttributeEffectInstanceType_MAX = 4
};

// Object: Enum GPGameplay.EPlayerQuitMatchReason
enum class EPlayerQuitMatchReason : uint8_t
{
	ENone = 0,
	EEndMatch = 1,
	ESvrForceKick = 2,
	EClientReqQuit = 3,
	EPlayerQuitMatchReason_MAX = 4
};

// Object: Enum GPGameplay.EPlayerEndMatchReason
enum class EPlayerEndMatchReason : uint8_t
{
	EPlayerEndMatch_Success = 0,
	EPlayerEndMatch_Killed = 1,
	EPlayerEndMatch_TimeLimit = 2,
	EPlayerEndMatch_MAX = 3
};

// Object: Enum GPGameplay.EBattlefieldEffectGroup
enum class EBattlefieldEffectGroup : uint16_t
{
	Environment = 0,
	Explosiones = 1,
	None = 255,
	EBattlefieldEffectGroup_MAX = 256
};

// Object: Enum GPGameplay.EBattlefieldEffectType
enum class EBattlefieldEffectType : uint16_t
{
	Common = 0,
	Dirty = 1,
	Snow = 2,
	Grenade = 3,
	Explosion = 4,
	BuildingRuin = 5,
	None = 255,
	EBattlefieldEffectType_MAX = 256
};

// Object: Enum GPGameplay.EBulletHitActionType
enum class EBulletHitActionType : uint8_t
{
	None = 0,
	Damage = 1,
	Buff = 2,
	Custom = 3,
	EBulletHitActionType_MAX = 4
};

// Object: Enum GPGameplay.ECampType
enum class ECampType : uint8_t
{
	BF_DeltaCamp0 = 0,
	BF_DeltaCamp1 = 1,
	SOL_DeltaPMC = 2,
	SOL_DarkTide = 3,
	SOL_Hudson = 4,
	Raid_DeltaPMC = 5,
	Raid_DarkTide = 6,
	Raid_Hudson = 7,
	Black_Hudson = 8,
	BF_Hudson = 9,
	SafeHouse_Player = 10,
	SafeHouse_NPC = 11,
	SafeHouse_RangeTarget = 12,
	Vehicle = 13,
	Neutral = 14,
	SOL_ContractPlayer = 15,
	SOL_BossTeam = 16,
	SOL_ContractPlayer_DarkTide = 17,
	SOL_ContractPlayer_Hudson = 18,
	SOL_RebornPlayer_DarkTide = 19,
	SOL_RebornPlayer_Hudson = 20,
	SOL_ShuShu = 21,
	SOL_NPC = 22,
	Max = 23
};

// Object: Enum GPGameplay.EChainHookTargetType
enum class EChainHookTargetType : uint8_t
{
	Enemy = 0,
	DeadBody = 1,
	DeadBox = 2,
	Other = 3,
	None = 4,
	EChainHookTargetType_MAX = 5
};

// Object: Enum GPGameplay.ECharacterSnatshotSubPose
enum class ECharacterSnatshotSubPose : uint8_t
{
	Center = 0,
	Left = 1,
	Right = 2,
	Max = 3
};

// Object: Enum GPGameplay.ECharacterSnatshotBasePose
enum class ECharacterSnatshotBasePose : uint8_t
{
	None = 0,
	Stand = 1,
	Crouch = 2,
	Prone = 3,
	InVehicle = 4,
	InSceneWeapon = 5,
	ImpendingDeath = 6,
	Knockback = 7,
	SlidingTackle = 8,
	Vaulting = 9,
	Climb = 10,
	Zipline = 11,
	BeingAssassinate = 12,
	ShieldHold = 13,
	ShieldFlank = 14,
	ShieldRescue = 15,
	ShieldSprint = 16,
	Dive = 17,
	SwimmingSurfaceIdle = 18,
	SwimmingBackward = 19,
	SwimmingForward = 20,
	SwimmingAscendingBackward = 21,
	SwimmingDescendingForward = 22,
	RollMove = 23,
	PassiveRopeMove = 24,
	PassiveMove = 25,
	Supine = 26,
	Max = 27
};

// Object: Enum GPGameplay.EDamageRangeShapeType
enum class EDamageRangeShapeType : uint8_t
{
	Box = 0,
	Sphere = 1,
	EDamageRangeShapeType_MAX = 2
};

// Object: Enum GPGameplay.EHaavkTurnType
enum class EHaavkTurnType : uint8_t
{
	LeftAndRight = 0,
	Circle = 1,
	EHaavkTurnType_MAX = 2
};

// Object: Enum GPGameplay.EDamageStateRecordType
enum class EDamageStateRecordType : uint8_t
{
	Default = 0,
	Character = 1,
	GeneralGun = 2,
	Melee = 3,
	Vehicle = 4,
	Door = 5,
	EDamageStateRecordType_MAX = 6
};

// Object: Enum GPGameplay.EDamageGameState
enum class EDamageGameState : uint8_t
{
	None = 0,
	Prematch = 1,
	InGame = 2,
	EndGame = 3,
	EDamageGameState_MAX = 4
};

// Object: Enum GPGameplay.EDamageUnitType
enum class EDamageUnitType : uint8_t
{
	Actor = 0,
	Component = 1,
	EDamageUnitType_MAX = 2
};

// Object: Enum GPGameplay.EDamageActorType
enum class EDamageActorType : uint8_t
{
	None = 0,
	PlayerCharacter = 1,
	AICharacter = 2,
	Vehicle = 3,
	Weapon = 4,
	World = 5,
	BreakablePawn = 6,
	ScenceWeaponPawn = 7,
	Others = 8,
	EDamageActorType_MAX = 9
};

// Object: Enum GPGameplay.EDamageModifyType
enum class EDamageModifyType : uint8_t
{
	Add = 0,
	Mult = 1,
	Override = 2,
	EDamageModifyType_MAX = 3
};

// Object: Enum GPGameplay.EGPDamageEnableType
enum class EGPDamageEnableType : uint8_t
{
	Default = 0,
	Enable = 1,
	Disable = 2,
	EnableWithEnemy = 3,
	EGPDamageEnableType_MAX = 4
};

// Object: Enum GPGameplay.EDamageChannel
enum class EDamageChannel : uint8_t
{
	Default = 0,
	HP = 1,
	ArmorDamage = 2,
	HealthDamage = 3,
	Max = 4
};

// Object: Enum GPGameplay.EWeaponFireValidateFaildReason
enum class EWeaponFireValidateFaildReason : uint8_t
{
	None = 0,
	CharacterOwnerNull = 1,
	CharacterDied = 2,
	CharacterImpendingDeath = 3,
	CharacterCantFire = 4,
	WeaponInactive = 5,
	WeaponNotFiringState = 6,
	WeaponNoAmmo = 7,
	FireIntervalError = 8,
	FireIdInvalid = 9,
	FireTimeInvalid = 10,
	LogicFireTimeInvalid = 11,
	SkillForbidFire = 12,
	EWeaponFireValidateFaildReason_MAX = 13
};

// Object: Enum GPGameplay.EDataTableConstrainType
enum class EDataTableConstrainType : uint8_t
{
	Unique = 0,
	ForeignKey = 1,
	EDataTableConstrainType_MAX = 2
};

// Object: Enum GPGameplay.EEMPTakerType
enum class EEMPTakerType : uint8_t
{
	Default = 0,
	RebornFlag = 1,
	TeamRebornFlag = 2,
	ADS = 3,
	TerryTrap = 4,
	ClayMore = 5,
	AntiTankMine = 6,
	SentryHive = 7,
	SonarDetector = 8,
	EEMPTakerType_MAX = 9
};

// Object: Enum GPGameplay.EEMPType
enum class EEMPType : uint8_t
{
	EMP = 0,
	DataKnife = 1,
	C204 = 2,
	EEMPType_MAX = 3
};

// Object: Enum GPGameplay.EFiringAnimMode
enum class EFiringAnimMode : uint8_t
{
	Single = 0,
	Continue = 1,
	EFiringAnimMode_MAX = 2
};

// Object: Enum GPGameplay.EFiringAnimBlendOutMode
enum class EFiringAnimBlendOutMode : uint8_t
{
	ForceEnd = 0,
	ContinueAnim = 1,
	BlendOut = 2,
	EFiringAnimBlendOutMode_MAX = 3
};

// Object: Enum GPGameplay.EFiringAnimDim
enum class EFiringAnimDim : uint8_t
{
	Dim_Trans_Forward = 0,
	Dim_Trans_Right = 1,
	Dim_Trans_Up = 2,
	Dim_Rot_Pitch = 3,
	Dim_Rot_Yaw = 4,
	Dim_Rot_Roll = 5,
	Dim_Num = 6,
	Dim_MAX = 7
};

// Object: Enum GPGameplay.EDFMAbilityEndReason
enum class EDFMAbilityEndReason : uint8_t
{
	NormalEnd = 0,
	UnNormalEnd = 1,
	Die = 2,
	RemoveFromCharacter = 3,
	CastFaild = 4,
	PlayMontageFaild = 5,
	EDFMAbilityEndReason_MAX = 6
};

// Object: Enum GPGameplay.EDFMAbilityLogicType
enum class EDFMAbilityLogicType : uint8_t
{
	Default = 0,
	EnterState = 1,
	LeaveState = 2,
	PlayMontage = 3,
	PlayMontageInstance = 4,
	KeepActor = 5,
	SpawnActor = 6,
	Function = 7,
	WeaponProjectileActor = 8,
	ProjectileActor = 9,
	Buff = 10,
	LogicTypeMax = 11,
	EDFMAbilityLogicType_MAX = 12
};

// Object: Enum GPGameplay.EAbilityMontagePlayerStage
enum class EAbilityMontagePlayerStage : uint8_t
{
	Init = 0,
	Start = 1,
	Loop = 2,
	End = 3,
	EAbilityMontagePlayerStage_MAX = 4
};

// Object: Enum GPGameplay.ESharkMovementState
enum class ESharkMovementState : uint8_t
{
	Idle = 0,
	Start = 1,
	Moving = 2,
	Turning = 3,
	Arrival = 4,
	Twitch = 5,
	CustomRootMotion = 6,
	TurnInPlace = 7,
	ESharkMovementState_MAX = 8
};

// Object: Enum GPGameplay.EAnimState
enum class EAnimState : uint8_t
{
	Stand = 0,
	Crouch = 1,
	Prone = 2,
	Sprint = 3,
	Jump = 4,
	Dead = 5,
	Vault = 6,
	Zipline = 7,
	Rescue = 8,
	Throw = 9,
	Reload = 10,
	Medical = 11,
	Moving = 12,
	ImpendingDeath = 13,
	Max = 32
};

// Object: Enum GPGameplay.EAnimCrowdControlType
enum class EAnimCrowdControlType : uint8_t
{
	ElectricShock = 0,
	EAnimCrowdControlType_MAX = 1
};

// Object: Enum GPGameplay.EAnimPassiveMoveType
enum class EAnimPassiveMoveType : uint8_t
{
	Pulling = 0,
	Pulling_UnderWater = 1,
	EAnimPassiveMoveType_MAX = 2
};

// Object: Enum GPGameplay.EAnimKnockbackType
enum class EAnimKnockbackType : uint8_t
{
	Knockback = 0,
	Knockback_UnderWater = 1,
	EAnimKnockbackType_MAX = 2
};

// Object: Enum GPGameplay.EAnimRescueType
enum class EAnimRescueType : uint8_t
{
	None = 0,
	SolLandRescueStand = 1,
	SolLandBeRescueStand = 2,
	SolLandRescueCrouch = 3,
	SolLandBeRescueCrouch = 4,
	SolLandRescueProne = 5,
	SolLandBeRescueProne = 6,
	SolSwimRescueSurfaceWater = 7,
	SolSwimBeRescueSurfaceWater = 8,
	SolSwimRescueInWater = 9,
	SolSwimBeRescueInWater = 10,
	BatLandRescueStand = 11,
	BatLandBeRescueStand = 12,
	BatLandRescueCrouch = 13,
	BatLandBeRescueCrouch = 14,
	BatLandRescueProne = 15,
	BatLandBeRescueProne = 16,
	BatSwimRescueSurfaceWater = 17,
	BatSwimBeRescueSurfaceWater = 18,
	BatSwimRescueInWater = 19,
	BatSwimBeRescueInWater = 20,
	SolLandRescueCrouchDeath = 21,
	SolRescueLandNoPreciseStand = 22,
	SolRescueLandNoPreciseCrouch = 23,
	SolRescueLandNoPreciseProne = 24,
	BatRescueLandNoPreciseStand = 25,
	BatRescueLandNoPreciseCrouch = 26,
	BatRescueLandNoPreciseProne = 27,
	SolLandFastBeRescueCrouch = 28,
	BatLandFastBeRescueProne = 29,
	EAnimRescueType_MAX = 30
};

// Object: Enum GPGameplay.EAnimCarryBodyType
enum class EAnimCarryBodyType : uint8_t
{
	CarryCharacter = 0,
	CarryBox = 1,
	EAnimCarryBodyType_MAX = 2
};

// Object: Enum GPGameplay.EAnimApplySprayType
enum class EAnimApplySprayType : uint8_t
{
	ApplySpray = 0,
	EAnimApplySprayType_MAX = 1
};

// Object: Enum GPGameplay.EAnimMarkingType
enum class EAnimMarkingType : uint8_t
{
	Marking = 0,
	EAnimMarkingType_MAX = 1
};

// Object: Enum GPGameplay.EAnimFirefightingType
enum class EAnimFirefightingType : uint8_t
{
	Firefighting = 0,
	ZoyaSwarms = 1,
	Rope = 2,
	BionicSpy = 3,
	NetRemove = 4,
	NoiseRemove = 5,
	HookedFastFire = 6,
	Max = 255
};

// Object: Enum GPGameplay.EAnimRaiseWatchType
enum class EAnimRaiseWatchType : uint8_t
{
	RaiseWatch = 0,
	EAnimRaiseWatchType_MAX = 1
};

// Object: Enum GPGameplay.EAnimHitPart
enum class EAnimHitPart : uint8_t
{
	None = 0,
	Head = 1,
	UpperBody = 2,
	LeftLeg = 3,
	RightLeg = 4,
	EAnimHitPart_MAX = 5
};

// Object: Enum GPGameplay.EAnimParachuteType
enum class EAnimParachuteType : uint8_t
{
	Parachute = 0,
	Glide = 1,
	EAnimParachuteType_MAX = 2
};

// Object: Enum GPGameplay.EAnimClimbLadderType
enum class EAnimClimbLadderType : uint8_t
{
	ClimbLadder = 0,
	EAnimClimbLadderType_MAX = 1
};

// Object: Enum GPGameplay.EAnimBunkerType
enum class EAnimBunkerType : uint8_t
{
	NoWeapon = 0,
	EAnimBunkerType_MAX = 1
};

// Object: Enum GPGameplay.EAnimTacticalActionType
enum class EAnimTacticalActionType : uint8_t
{
	TacticalAction = 0,
	EAnimTacticalActionType_MAX = 1
};

// Object: Enum GPGameplay.EAnimVehicleSeatPos
enum class EAnimVehicleSeatPos : uint8_t
{
	Seat_FL = 0,
	Seat_FR = 1,
	Seat_BL = 2,
	Seat_BR = 3,
	Seat_BL02 = 4,
	Seat_BR02 = 5,
	Seat_BL03 = 6,
	Seat_BR03 = 7,
	Seat_MachineGun = 8,
	Seat_MAX = 9
};

// Object: Enum GPGameplay.EAnimLoadPriority
enum class EAnimLoadPriority : uint8_t
{
	Low = 0,
	Medium = 50,
	High = 100,
	SuperHigh = 200,
	EAnimLoadPriority_MAX = 201
};

// Object: Enum GPGameplay.EGPEventToggleState
enum class EGPEventToggleState : uint8_t
{
	TURN_ON = 6,
	TURN_OFF = 7,
	TURN_MAX = 8
};

// Object: Enum GPGameplay.EGPAnimOperationInterruptType
enum class EGPAnimOperationInterruptType : uint8_t
{
	Default = 0,
	Interrupt_SwitchWeapon = 1,
	Interrupt_Reload = 2,
	EGPAnimOperationInterruptType_MAX = 3
};

// Object: Enum GPGameplay.EGPAnimNotifyLogicalBreakType
enum class EGPAnimNotifyLogicalBreakType : uint8_t
{
	Default = 0,
	LogicReload_Complete = 1,
	Reload_Ready = 5,
	EventToggle_TurnOn = 6,
	EventToggle_TurnOff = 7,
	Fire_Break = 8,
	Equip_Break = 9,
	Fire_Break_End = 10,
	Do_Fire = 11,
	EnableSprint_ThrowableWeapon = 12,
	Show_PreviewLine = 13,
	Throwable_HideMesh = 14,
	Throwable_ShowMesh = 15,
	Throwable_Unlock = 16,
	LeftWeapon_EndLeftHold = 17,
	LeftWeapon_HideMesh = 18,
	LeftWeapon_ShowMesh = 19,
	PostFire_Break = 20,
	CBow_SwitchToLeft = 21,
	EGPAnimNotifyLogicalBreakType_MAX = 22
};

// Object: Enum GPGameplay.EUseLeftHandReason
enum class EUseLeftHandReason : uint8_t
{
	EUseLeftHandReason_OneHandedGesture = 0,
	EUseLeftHandReason_ApplySpray = 1,
	EUseLeftHandReason_Marking = 2,
	EUseLeftHandReason_AbilityPlayMontageSystem = 3,
	EUseLeftHandReason_LeftWeaponAnim = 4,
	EUseLeftHandReason_ThrowableWeapon = 5,
	EUseLeftHandReason_Helmet = 6,
	EUseLeftHandReason_MAX = 7
};

// Object: Enum GPGameplay.ERetargetConfig
enum class ERetargetConfig : uint8_t
{
	ERetargetConfig_Normal = 0,
	ERetargetConfig_FPP = 1,
	ERetargetConfig_MAX = 2
};

// Object: Enum GPGameplay.EWeaponLeanAimType
enum class EWeaponLeanAimType : uint8_t
{
	EWeapLeanAimType_Center = 0,
	EWeapLeanAimType_Left = 1,
	EWeapLeanAimType_Right = 2,
	EWeapLeanAimType_MAX = 3
};

// Object: Enum GPGameplay.ELocomotionTransitionType
enum class ELocomotionTransitionType : uint8_t
{
	LocomotionTransitionType_None = 0,
	LocomotionTransitionType_IdleToWalking = 1,
	LocomotionTransitionType_IdleToRunning = 2,
	LocomotionTransitionType_IdleToFastRunning = 3,
	LocomotionTransitionType_RunningToFastRunning = 4,
	LocomotionTransitionType_WalkingToIdle = 5,
	LocomotionTransitionType_RunningToIdle = 6,
	LocomotionTransitionType_FastRunningToIdle = 7,
	LocomotionTransitionType_Pivot_Walking = 8,
	LocomotionTransitionType_Pivot_Running = 9,
	LocomotionTransitionType_Pivot_FastRunning = 10,
	LocomotionTransitionType_MAX = 11
};

// Object: Enum GPGameplay.EAssasinateAnimType
enum class EAssasinateAnimType : uint8_t
{
	Stand = 1,
	Impending = 2,
	Prone = 4,
	Shark = 8,
	EAssasinateAnimType_MAX = 9
};

// Object: Enum GPGameplay.ESmallActionTrigger
enum class ESmallActionTrigger : uint8_t
{
	EStill2NotStill = 1,
	ENotStil2Still = 2,
	EFiring2NotFiring = 4,
	EFasterMove2Walk = 8,
	EJumping2Land = 16,
	EStand2Crouch = 32,
	ECrouch2Stand = 64,
	ESmallActionTrigger_MAX = 65
};

// Object: Enum GPGameplay.ESmallActionState
enum class ESmallActionState : uint8_t
{
	EStill = 0,
	EHorizonRotate = 1,
	EVerticalRotate = 2,
	EMove = 3,
	EFiring = 4,
	ENoFiring = 5,
	EWalk = 6,
	ERun = 7,
	ESprint = 8,
	EAiring = 9,
	ELanding = 10,
	EStand = 11,
	ECrouch = 12,
	EZooming = 13,
	EMax = 14,
	ESmallActionState_MAX = 15
};

// Object: Enum GPGameplay.ESpringStatusType
enum class ESpringStatusType : uint8_t
{
	ESpringStatus_Default = 0,
	ESpringStatus_Aim = 1,
	ESpringStatus_Crouch = 2,
	ESpringStatus_NumMax = 3,
	ESpringStatus_MAX = 4
};

// Object: Enum GPGameplay.EFPPCameraRotationCalcType
enum class EFPPCameraRotationCalcType : uint8_t
{
	EJointBoneAddValue = 0,
	EFPPCameraBoneAutoBlend = 1,
	EFPPCameraBone = 2,
	EFPPCameraRotationCalcType_MAX = 3
};

// Object: Enum GPGameplay.EAnimEnvInteraction
enum class EAnimEnvInteraction : uint8_t
{
	EAnimEnv_None = 0,
	EAnimEnv_Up = 1,
	EAnimEnv_Down = 2,
	EAnimEnv_CollisionL = 3,
	EAnimEnv_CollisionR = 4,
	EAnimEnv_MAX = 5
};

// Object: Enum GPGameplay.EMotionGear
enum class EMotionGear : uint8_t
{
	EMotionGear_Walk = 0,
	EMotionGear_Run = 1,
	EMotionGear_Sprint = 2,
	EMotionGear_SuperSprint = 3,
	EMotionGear_MAX = 4
};

// Object: Enum GPGameplay.EAnimationSwimType
enum class EAnimationSwimType : uint8_t
{
	AnimSwimType_Surfacewater = 0,
	AnimSwimType_Underwater = 1,
	AnimSwimType_Descending = 2,
	AnimSwimType_Ascending = 3,
	AnimSwimType_MAX = 4
};

// Object: Enum GPGameplay.EAnimationPlayType
enum class EAnimationPlayType : uint8_t
{
	AnimPlayType_None = 0,
	AnimPlayType_FullBody = 1,
	AnimPlayType_FullBodyBeforeAO = 2,
	AnimPlayType_FullBodyWithIK = 3,
	AnimPlayType_FullBodyNoMoving = 4,
	AnimPlayType_FullBodyWhenProne = 5,
	AnimPlayType_UpperBody = 6,
	AnimPlayType_UpperBodyWithIK = 7,
	AnimPlayType_UpperBodyGroupAimWithIK = 8,
	AnimPlayType_LowerBody = 9,
	AnimPlayType_FPPAnimSlot = 10,
	AnimPlayType_UpperBodyWithForceIdle = 11,
	AnimPlayType_FullBodyTakeHit = 12,
	AnimPlayType_FullBodyDeath = 13,
	AnimPlayType_LeftArm = 14,
	AnimPlayType_LeftArmBeforeAO = 15,
	AnimPlayType_RightArm = 16,
	AnimPlayType_LeftRightArm = 17,
	AnimPlayType_LeftArmMirrorByRightArm = 18,
	AnimPlayType_RightArmMirrorByLeftArm = 19,
	AnimPlayType_MirrorAnimBlend = 20,
	AnimPlayType_TurnAnim = 21,
	AnimPlayType_DefaultFullBodyMovingUpperBody = 22,
	AnimPlayType_DefaultFullBodyMovingUpperBodyWithIK = 23,
	AnimPlayType_FullBodyRescue = 24,
	AnimPlayType_InVehicle = 25,
	AnimPlayType_InVehicleBeforeDrive = 26,
	AnimPlayType_MachineGun = 27,
	AnimPlayType_FullBodyCarryBody = 28,
	AnimPlayType_FullBodyAllOverride = 29,
	AnimPlayType_UpperArms = 30,
	AnimPlayType_DefaultUpperBodyMovingUpperArms = 31,
	AnimPlayType_LocomotionFullBodyRushWithIK = 32,
	AnimPlayType_SwimmingUpperBodyMovingUpperArms = 33,
	AnimPlayType_SwimmingUpperBodyMovingUpperArmsWithIK = 34,
	AnimPlayType_MAX = 35
};

// Object: Enum GPGameplay.EEquipmentPart
enum class EEquipmentPart : uint8_t
{
	None = 0,
	TopOfHead = 1,
	Neck = 2,
	Ear = 3,
	Eye = 4,
	Jaw = 5,
	Thorax = 6,
	LeftArm = 7,
	RightArm = 8,
	LeftLeg = 9,
	RightLeg = 10,
	Max = 11
};

// Object: Enum GPGameplay.ECharacterPart
enum class ECharacterPart : uint8_t
{
	None = 0,
	Head = 1,
	Thorax = 2,
	Abdomen = 3,
	RightArm = 4,
	LeftArm = 5,
	RightLeg = 6,
	LeftLeg = 7,
	FullBody = 8,
	ECharacterPart_MAX = 9
};

// Object: Enum GPGameplay.EInstantGEType
enum class EInstantGEType : uint8_t
{
	None = 0,
	InstantAddHP = 1,
	FixFracture = 2,
	FixBleeding = 3,
	EInstantGEType_MAX = 4
};

// Object: Enum GPGameplay.EHeadEquipmentPartType
enum class EHeadEquipmentPartType : uint8_t
{
	HeadTop = 0,
	Eye = 1,
	Face = 2,
	Ear = 3,
	Max = 4
};

// Object: Enum GPGameplay.EEquipmentType
enum class EEquipmentType : uint8_t
{
	None = 0,
	Helmet = 1,
	Headset = 2,
	FaceMask = 3,
	Armband = 4,
	BreastPlate = 5,
	Glasses = 6,
	ChestHanging = 7,
	Bag = 8,
	SafeBox = 9,
	Tool = 10,
	Shoes = 11,
	KeyChain = 12,
	Max = 13
};

// Object: Enum GPGameplay.EWeaponBuff
enum class EWeaponBuff : uint8_t
{
	None = 0,
	Max = 1
};

// Object: Enum GPGameplay.EFootstepStateType
enum class EFootstepStateType : uint8_t
{
	Default = 0,
	Walk = 1,
	Run = 2,
	Sprint = 3,
	CrouchMove = 4,
	CrouchRun = 5,
	ProneMove = 6,
	ProneRun = 7,
	EFootstepStateType_MAX = 8
};

// Object: Enum GPGameplay.EFakeFootstepReason
enum class EFakeFootstepReason : uint8_t
{
	LowAnimLOD = 0,
	PVSCut = 1,
	LossNotify = 2,
	EFakeFootstepReason_MAX = 3
};

// Object: Enum GPGameplay.EFakeFootstepStatus
enum class EFakeFootstepStatus : uint8_t
{
	Simulating = 0,
	InTransition = 1,
	PendingRemove = 2,
	EFakeFootstepStatus_MAX = 3
};

// Object: Enum GPGameplay.EAudioMovementMode
enum class EAudioMovementMode : uint8_t
{
	MOVE_None = 0,
	MOVE_Walking = 1,
	MOVE_NavWalking = 2,
	MOVE_Falling = 3,
	MOVE_Swimming = 4,
	MOVE_Flying = 5,
	MOVE_Custom = 6,
	MOVE_MAX = 7
};

// Object: Enum GPGameplay.EAudioListenerMovementType
enum class EAudioListenerMovementType : uint8_t
{
	None = 0,
	Crouch = 1,
	CrouchSlientWalk = 2,
	Prone = 3,
	Walk = 4,
	SlientWalk = 5,
	Sprint = 6,
	ClimbLadder = 7,
	EAudioListenerMovementType_MAX = 8
};

// Object: Enum GPGameplay.ESubtitleHudType
enum class ESubtitleHudType : uint8_t
{
	None = 0,
	OnlyText = 1,
	TextWithBlackBG = 2,
	ESubtitleHudType_MAX = 3
};

// Object: Enum GPGameplay.ESubtitlePriorityType
enum class ESubtitlePriorityType : uint8_t
{
	None = 0,
	QuestNotice_P1 = 1,
	QuestNotice_P2 = 2,
	QuestNotice_P3 = 3,
	AIDialog_P1 = 4,
	AIDialog_P2 = 5,
	AIDialog_P3 = 6,
	ESubtitlePriorityType_MAX = 7
};

// Object: Enum GPGameplay.EBattleFieldEffectState
enum class EBattleFieldEffectState : uint8_t
{
	Wait = 0,
	Startup = 1,
	Keep = 2,
	Duration = 3,
	Cleanup = 4,
	CleanupFast = 5,
	NeedRemove = 6,
	EBattleFieldEffectState_MAX = 7
};

// Object: Enum GPGameplay.EBlackboardFields
enum class EBlackboardFields : uint32_t
{
	None = 0,
	WeaponProxy = 1,
	WeaponAnimData = 2,
	WeaponZoomData = 4,
	WeaponFuncZoom = 8,
	WeaponFuncGunSway = 16,
	WeaponFuncOffset = 32,
	bIsZooming = 64,
	CurrentWeaponState = 128,
	bIsFiring = 256,
	bIsSwitchingWeapon = 512,
	bIsPrefiring = 1024,
	bIsLeftWeaponFiring = 2048,
	bUndderFPP = 4096,
	GPPlayer = 8192,
	GPPlayerInputManager = 16384,
	PlayerCameraManager = 32768,
	SoundVisualizationComponent = 65536,
	GPPlayerState = 131072,
	bIsInLegFracture = 262144,
	bIsInDoubleLegFracture = 524288,
	bIsInArmFracture = 1048576,
	bIsInBoss05Dizzy = 2097152,
	EBlackboardFields_MAX = 2097153
};

// Object: Enum GPGameplay.EGPBuffAttributeAdditionType
enum class EGPBuffAttributeAdditionType : uint8_t
{
	Add_Base = 0,
	Override_Base = 1,
	InitalCover = 2,
	FinalCover = 3,
	Add = 4,
	Mult_A = 5,
	Mult_B = 6,
	Mult_C = 7,
	Mult_D = 8,
	Max = 9
};

// Object: Enum GPGameplay.EGPBuffStackType
enum class EGPBuffStackType : uint8_t
{
	NoStack = 0,
	RefreshTime = 1,
	Independent = 2,
	IndependentAndRefresh = 3,
	EGPBuffStackType_MAX = 4
};

// Object: Enum GPGameplay.EGPCharacterCameraModeType
enum class EGPCharacterCameraModeType : uint8_t
{
	ECameraMode_None = 0,
	ECameraMode_FPP = 1,
	ECameraMode_TPP = 2,
	ECameraMode_MAX = 3
};

// Object: Enum GPGameplay.EGPCharacterCameraModeReason
enum class EGPCharacterCameraModeReason : uint8_t
{
	ECameraModeReason_VehicleLiveSpectating = 0,
	ECameraModeReason_RebornEffect = 1,
	ECameraModeReason_Redeploy = 2,
	ECameraModeReason_Emote = 3,
	ECameraModeReason_GamePlay = 4,
	ECameraModeReason_UserXppChange = 5,
	ECameraModeReason_Vehicle = 6,
	ECameraModeReason_GamePlayLow = 7,
	ECameraModeReason_MAX = 8
};

// Object: Enum GPGameplay.ECorrectControlActorReason
enum class ECorrectControlActorReason : uint8_t
{
	FailedToStartControl = 0,
	FailedToStopControl = 1,
	ReplicationError = 2,
	ECorrectControlActorReason_MAX = 3
};

// Object: Enum GPGameplay.ECharacterAudioGender
enum class ECharacterAudioGender : uint8_t
{
	Male = 0,
	Female = 1,
	ECharacterAudioGender_MAX = 2
};

// Object: Enum GPGameplay.ECharacterAudioListener
enum class ECharacterAudioListener : uint8_t
{
	NoNeeds = 0,
	Myself = 1,
	Teammate = 2,
	CampmateButNotTeammate = 3,
	Enemy = 4,
	ECharacterAudioListener_MAX = 5
};

// Object: Enum GPGameplay.ECharacterAudioPlayMode
enum class ECharacterAudioPlayMode : uint8_t
{
	OneShot = 0,
	Loop = 1,
	State = 2,
	ECharacterAudioPlayMode_MAX = 3
};

// Object: Enum GPGameplay.ECharacterAudioType
enum class ECharacterAudioType : uint8_t
{
	Pending = 0,
	Breath_Sprint = 1,
	Breath_Tired = 2,
	Breath_Recover = 3,
	Breath_Dying = 4,
	Breath_Injured_Heavy = 5,
	Breath_Injured_Light = 6,
	Breath_CloseMouth = 7,
	Reaction_Die = 8,
	Reaction_Pain = 9,
	Reaction_Bleeding = 10,
	Reaction_ArmBroken = 11,
	Reaction_LegBroken = 12,
	Reaction_BodyBroken = 13,
	Reaction_Yell = 14,
	Reaction_Hit = 15,
	Reaction_Healed = 16,
	State_Default = 17,
	State_Injured = 18,
	Ability_VO1 = 19,
	Ability_VO2 = 20,
	Ability_VO3 = 21,
	Ability_VO4 = 22,
	Ability_VO5 = 23,
	Ability_VO6 = 24,
	Ability_VO7 = 25,
	Ability_VO8 = 26,
	Ability_VO9 = 27,
	Ability_VO10 = 28,
	Ability_VO11 = 29,
	Ability_VO12 = 30,
	Ability_VO13 = 31,
	Ability_VO14 = 32,
	Ability_VO15 = 33,
	Ability_VO16 = 34,
	Ability_VO17 = 35,
	Ability_VO18 = 36,
	Ability_VO19 = 37,
	Ability_VO20 = 38,
	PassiveTrigger = 39,
	UltimateSmokePropUse = 40,
	UltimateSmokePropFinished = 41,
	PropEliminate = 42,
	PropAssist = 43,
	UltimateFullyCharged = 44,
	UltimateUse = 45,
	UltimateOngoing = 46,
	UltimateEliminate = 47,
	UltimateEliminateAssist = 48,
	UltimateCure = 49,
	UltimateFullyCharged401 = 50,
	UltimateUse401 = 51,
	UltimateOngoing401 = 52,
	UltimateHit401 = 53,
	UltimateAssist401 = 54,
	Begin_Throw_Throwables = 55,
	EnterSmoke_Cough = 56,
	Enemy_Explosive_Nearby = 57,
	CQB_FullyCharged = 58,
	CQB_UseSkill = 59,
	CQB_Kill = 60,
	CQB_KillAssist = 61,
	PassiveTrigger_C201 = 62,
	PropUse_C201ElectricBow = 63,
	PropHit_C201ElectricBow = 64,
	PropAssist_C201ElectricBow = 65,
	PropEliminate_C201ElectricBow = 66,
	UltimateFullyCharged_C201ProxSensorBow = 67,
	UltimateUse_C201ProxSensorBow = 68,
	UltimateOngoing_C201ProxSensorBow = 69,
	UltimateEliminate_C201ProxSensorBow = 70,
	UltimateAssist_C201ProxSensorBow = 71,
	UltimateHit_C201ProxSensorBow = 72,
	PropUse_C301Launcer = 73,
	PropHit_C301Launcer = 74,
	PropAssist_C301Launcer = 75,
	PropEliminate_C301Launcer = 76,
	Passive_Trigger_Throw = 77,
	Prop_Hit_Mine = 78,
	Prop_Use_Mine = 79,
	Prop_Eliminate_Mine = 80,
	Prop_UseSupportSmoke = 81,
	Prop_UseAssultSmoke = 82,
	Prop_StartHoldBreath = 83,
	Prop_EndHoldBreath = 84,
	Prop_StartUnHoldBreath = 85,
	NONE = 86,
	NumMax = 87,
	ECharacterAudioType_MAX = 88
};

// Object: Enum GPGameplay.EBuffRemovedReason
enum class EBuffRemovedReason : uint8_t
{
	ENormal = 0,
	EDead = 1,
	EBuffRemovedReason_MAX = 2
};

// Object: Enum GPGameplay.ECharacterActionHandleType
enum class ECharacterActionHandleType : uint8_t
{
	None = 0,
	FSMAction = 1,
	Skill = 2,
	FastFire = 3,
	ECharacterActionHandleType_MAX = 4
};

// Object: Enum GPGameplay.ECharacterActionState
enum class ECharacterActionState : uint32_t
{
	None = 0,
	FireFightingAction_Firefighting = 1,
	FireFightingAction_ZoyaSwarms = 2,
	FireFightingAction_Rope = 4,
	FireFightingAction_BionicSpy = 8,
	FireFightingAction_NetRemove = 16,
	FireFightingAction_NoiseRemove = 32,
	FireFightingAction_Mask = 63,
	SkillAction_ElectricArrowBleeding = 2048,
	SkillAction_AbilitySkill = 4096,
	SkillAction_HookedFastFire = 8192,
	SkillAction_HookCarryBody = 16384,
	SkillAction_Mask = 30720,
	CharacterAction_CarryBody = 2097152,
	CharacterAction_DropBody = 4194304,
	CharacterAction_CarryBox = 8388608,
	CharacterAction_DropBox = 16777216,
	CharacterAction_Assassinate = 33554432,
	CharacterAction_Mask = 65011712,
	ECharacterActionState_MAX = 65011713
};

// Object: Enum GPGameplay.EGPCustomMovementType
enum class EGPCustomMovementType : uint8_t
{
	GPCustomMovementType_None = 0,
	GPCustomMovementType_Vaulting = 1,
	GPCustomMovementType_Climbing = 2,
	GPCustomMovementType_ClimbingLadder = 3,
	GPCustomMovementType_SlidingTackle = 4,
	GPCustomMovementType_Parachute = 5,
	GPCustomMovementType_Assassinate = 6,
	GPCustomMovementType_Zipline = 7,
	GPCustomMovementType_PlayerParachute = 8,
	GPCustomMovementType_Gliding = 9,
	GPCustomMovementType_Interactor = 10,
	GPCustomMovementType_Rescue = 11,
	GPCustomMovementType_BeingRescue = 12,
	GPCustomMovementType_TransitionToSequence = 13,
	GPCustomMovementType_Rush = 14,
	GPCustomMovementType_KnockBack = 15,
	GPCustomMovementType_CrocodileBite = 16,
	GPCustomMovementType_BeAssassinate = 17,
	GPCustomMovementType_Dive = 18,
	GPCustomMovementType_PassiveMove = 19,
	GPCustomMovementType_Roll = 20,
	GPCustomMovementType_RopeHanging = 21,
	GPCustomMovementType_Idling = 22,
	GPCustomMovementType_AnimRootMotion = 23,
	GPCustomMovementType_MAX = 24
};

// Object: Enum GPGameplay.EGPCharacterHiddenReason
enum class EGPCharacterHiddenReason : uint8_t
{
	EGPCharacterHidden_WaitSOLStart = 0,
	EGPCharacterHidden_SOLFinishGame = 1,
	EGPCharacterHidden_MPFinishGame = 2,
	EGPCharacterHidden_MPDeathViewOther = 3,
	EGPCharacterHidden_Vehicle = 4,
	EGPCharacterHidden_VehicleCarryBody = 5,
	EGPCharacterHidden_DeathShowDeadBox = 6,
	EGPCharacterHidden_IsOfflineCharacter = 7,
	EGPCharacterHidden_AntiPeekMode = 8,
	EGPCharacterHidden_TearOff = 9,
	EGPCharacterHidden_Assassinate = 10,
	EGPCharacterHidden_MAX = 11
};

// Object: Enum GPGameplay.ECharacterQTEStateRight
enum class ECharacterQTEStateRight : uint8_t
{
	QTERight_None = 0,
	QTERight_MineActivate = 1,
	QTERight_SelfCure = 2,
	QTERight_ReleaseRope = 4,
	QTERight_Rescue = 8,
	QTERight_Parachute = 16,
	QTERight_MAX = 17
};

// Object: Enum GPGameplay.ECharacterQTEStateLeft
enum class ECharacterQTEStateLeft : uint8_t
{
	QTELeft_None = 0,
	QTELeft_ReleaseRope = 1,
	QTELeft_MineRecycle = 2,
	QTELeft_Carry = 4,
	QTELeft_MAX = 5
};

// Object: Enum GPGameplay.EHeroResourceState
enum class EHeroResourceState : uint8_t
{
	AS_Init = 0,
	AS_Invalid = 1,
	AS_Loading = 2,
	AS_Loaded = 3,
	AS_MAX = 4
};

// Object: Enum GPGameplay.ECollisionState
enum class ECollisionState : uint8_t
{
	None = 0,
	Sol_DefaultSpawn = 1,
	Sol_ImpendingDeath = 2,
	Sol_CarryBody = 3,
	Sol_BeAssassinate = 4,
	Sol_Dying = 5,
	Sol_MatchOver = 6,
	Breakthrough_DefaultSpawn = 7,
	Breakthrough_ImpendingDeath = 8,
	Breakthrough_CarryBody = 9,
	Breakthrough_BeAssassinate = 10,
	Breakthrough_Dying = 11,
	Breakthrough_MatchOver = 12,
	Prone_Default = 13,
	Prone_Prone = 14,
	Prone_ImpendingDeath_Sol = 15,
	Prone_ImpendingDeath_Breakthrough = 16,
	Prone_BeCarry = 17,
	Prone_BeAssassinate = 18,
	Prone_Dying = 19,
	Prone_MatchOver = 20,
	Sol_BeDragRescue = 21,
	Breakthrough_BeDragRescue = 22,
	ECollisionState_MAX = 23
};

// Object: Enum GPGameplay.EProcessInputCompReason
enum class EProcessInputCompReason : uint8_t
{
	EProcessInputReason_WatchingCCTV = 1,
	EProcessInputReason_WeaponAssembler = 2,
	EProcessInputReason_HALLDISPLAY = 4,
	EProcessInputReason_3DSafeHouse = 8,
	EProcessInputReason_Range = 16,
	EProcessInputReason_CollectionRoom = 32,
	EProcessInputReason_MAX = 33
};

// Object: Enum GPGameplay.EAICharacterTag
enum class EAICharacterTag : uint8_t
{
	EAICharacterTag_None = 0,
	EAICharacterTag_Elite = 1,
	EAICharacterTag_Civilian = 2,
	EAICharacterTag_Sniper = 3,
	EAICharacterTag_Shield = 4,
	EAICharacterTag_HeavyArmor = 5,
	EAICharacterTag_Paratrooper = 6,
	EAICharacterTag_Melee = 7,
	EAICharacterTag_Firebat = 8,
	EAICharacterTag_RPG = 9,
	EAICharacterTag_Boss = 10,
	EAICharacterTag_BoyBand = 11,
	EAICharacterTag_Crocodile = 12,
	EAICharacterTag_NonHuman = 13,
	EAICharacterTag_HelicopterPilot = 14,
	EAICharacterTag_InsuranceCompany = 15,
	EAICharacterTag_Activity = 16,
	EAICharacterTag_Romytheus_Assault = 17,
	EAICharacterTag_Romytheus_Shield = 18,
	EAICharacterTag_CanSurrender = 19,
	EAICharacterTag_Shark = 20,
	EAICharacterTag_NuclearPurger = 21,
	EAICharacterTag_NPC = 22,
	EAICharacterTag_MAX = 23
};

// Object: Enum GPGameplay.EStateInterruptReason
enum class EStateInterruptReason : uint8_t
{
	Lean = 0,
	Sliding = 1,
	NotStandPose = 2,
	ForbidReasonMax = 3,
	EStateInterruptReason_MAX = 4
};

// Object: Enum GPGameplay.EOverrideMovementType
enum class EOverrideMovementType : uint8_t
{
	EOperateMovementType_NoMove = 0,
	EOperateMovementType_Walk = 1,
	EOperateMovementType_Run = 2,
	EOperateMovementType_Sprint = 3,
	EOperateMovementType_None = 4,
	EOperateMovementType_MAX = 5
};

// Object: Enum GPGameplay.EOperateMovementType
enum class EOperateMovementType : uint8_t
{
	EOperateMovementType_None = 0,
	EOperateMovementType_NoMove = 1,
	EOperateMovementType_NormalRun = 2,
	EOperateMovementType_NoMoveAndNoBasePoseSwitch = 3,
	EOperateMovementType_MAX = 4
};

// Object: Enum GPGameplay.EFSMForbidReason
enum class EFSMForbidReason : uint8_t
{
	EFR_Default = 0,
	EFR_Sprint = 1,
	EFR_Vault = 2,
	EFR_Reload = 3,
	EFR_Jump = 4,
	EFR_ProneFire = 5,
	EFR_FreeLook = 6,
	EFR_ImpendingDeath = 7,
	EFR_Operate = 8,
	EFR_Aim = 9,
	EFR_QuickThrow = 10,
	EFR_Prone = 11,
	EFR_Fire = 12,
	EFR_Sequence = 13,
	EFR_Vehicle = 14,
	EFR_Burden = 15,
	EFR_Death = 16,
	EFR_ClimbLadder = 17,
	EFR_WeaponState = 18,
	EFR_UseTelescope = 19,
	EFR_Monitor = 20,
	EFR_RelaxIde = 21,
	EFR_CutScene = 22,
	EFR_BeHit = 23,
	EFR_UseStarApp = 24,
	EFR_SceneWeapon = 25,
	EFR_StaminaLow = 26,
	EFR_OnFlyBase = 27,
	EFR_Assassinate = 28,
	EFR_BeAssassinate = 29,
	EFR_UsingSkill = 30,
	EFR_SearchItem = 31,
	EFR_FallHigh = 32,
	EFR_UseZipline = 33,
	EFR_Parachute = 34,
	EFR_SlidingTackle = 35,
	EFR_TutorialRotate = 36,
	EFR_TutorialMove = 37,
	EFR_TutorialShoot = 38,
	EFR_InSafeHouse = 39,
	EFR_OpenInteractUI = 40,
	EFR_RaiseWatch = 41,
	EFR_PreViewActor = 42,
	EFR_FireModePlacement = 43,
	EFR_WeaponInspect = 44,
	EFR_HighValueItemInspect = 45,
	EFR_WeaponBipodDeploy = 46,
	EFR_BowArrow = 47,
	EFR_SkillRTT = 48,
	EFR_ClientPreStateRTT = 49,
	EFR_WaitingStart = 50,
	EFR_SeamlessShow = 51,
	EFR_Helmet = 52,
	EFR_Firefighting = 53,
	EFR_ApplySpray = 54,
	EFR_OneHandedGesture = 55,
	EFR_TwoHandedGesture = 56,
	EFR_Emote = 57,
	EFR_UsingDoubleHandsSkill = 58,
	EFR_UsingRightHandSkill = 59,
	EFR_UsingLeftHandSkill = 60,
	EFR_UsingLegsSkill = 61,
	EFR_UsingSpecialSkill = 62,
	EFR_Knockback = 63,
	EFR_WeaponPreFire = 64,
	EFR_WeaponFire = 65,
	EFR_Rescue = 66,
	EFR_RushMoveEnd = 67,
	EFR_UsingDoubleHandsSkillAction = 68,
	EFR_UsingRightHandSkillAction = 69,
	EFR_UsingLeftHandSkillAction = 70,
	EFR_UsingLegsSkillAction = 71,
	EFR_UsingSpecialSkillAction = 72,
	EFR_OpenBag = 73,
	EFR_Lean = 74,
	EFR_VehicleLockCamera = 75,
	EFR_PlayingMedia = 76,
	EFR_Reborn = 77,
	EFR_Dive = 78,
	EFR_PassiveMove = 79,
	EFR_PrePassiveMove = 80,
	EFR_SkillFireRTT = 81,
	EFR_RangeFirstEquipAnim = 82,
	EFR_UsingActionSkill = 83,
	EFR_PostPassiveMove = 84,
	EFR_ProneSetFireCracker = 85,
	EFR_CrowdControl = 86,
	EFR_ControlDrone = 87,
	EFR_DramaFallingVolume = 88,
	EFR_Swim = 89,
	EFR_SwimSprint = 90,
	EFR_EyeUnderWater = 91,
	EFR_RollMove = 92,
	EFR_JailBreak = 93,
	EFR_EMP = 94,
	EFR_EarthquakeFallDown = 95,
	EFR_PushOver = 96,
	EFR_SelfRescue = 97,
	EFR_Net = 98,
	EFR_RemoteRescue = 99,
	EFR_OnVehicleMoveBase = 100,
	EFR_UsingCustomSkill = 101,
	EFR_UsingCustom2Skill = 102,
	EFR_UsingCustom3Skill = 103,
	EFR_MatchEnd = 104,
	EFR_InPreviewRoom = 105,
	EFR_DragRescue = 106,
	EFR_Putback = 107,
	ForbidReasonMAX = 108,
	EFSMForbidReason_MAX = 109
};

// Object: Enum GPGameplay.ECharacterStateMask
enum class ECharacterStateMask : uint8_t
{
	None = 0,
	CanMove = 1,
	CanRotate = 2,
	CanCharacterRotate = 3,
	CanCrouch = 4,
	CanProne = 5,
	CanJump = 6,
	CanVault = 7,
	CanReload = 8,
	CanAimOn = 9,
	CanAimOff = 10,
	CanSwitchWeapon = 11,
	CanFire = 12,
	CanAutoChangeClip = 13,
	CanWeaponInspect = 14,
	CanHighValueItemInspect = 15,
	CanWeaponBolt = 16,
	CanWeaponBipodDeploy = 17,
	CanSkillSwtichWeapon = 18,
	CanDiscardOrEquipWeapon = 19,
	CanUseMachineGun = 20,
	CanSwitchNormalWeapon = 21,
	CanSwitchTacticalEquip = 22,
	CanUseItem = 23,
	CanOperate = 24,
	DisableWhitelistOperate = 25,
	CanLooting = 26,
	CanDetectInteractor = 27,
	CanDetectRescue = 28,
	CanUserChangeXPP = 29,
	CanSwitchHelmetMask = 30,
	PauseSwitchHelmetMask = 31,
	CanDrive = 32,
	CanPlayTacticalAction = 33,
	CanClimbLadder = 34,
	CanUseTelescope = 35,
	CanChangeWeaponMode = 36,
	CanShowInteractUI = 37,
	CanLean = 38,
	CanBeHit = 39,
	CanUseSkill = 40,
	CanAssassinate = 41,
	CanBeAssassinate = 42,
	CanCarrybody = 43,
	CanParachute = 44,
	CanSlidingTackle = 45,
	CanUseZipline = 46,
	CanPlayMarkingAnim = 47,
	CanFirefighting = 48,
	CanApplySpray = 49,
	CanPlayOneHandedGesture = 50,
	CanPlayTwoHandedGesture = 51,
	CanPlayEmote = 52,
	CanDive = 53,
	CanSuperSprint = 54,
	CanNotBlockFriend = 55,
	CanStandUp = 56,
	CanProneMove = 57,
	CanProneStandUp = 58,
	CanSprint = 59,
	CanSwimSprint = 60,
	CanBeBreakByOtherSkill = 61,
	CanUseSpecialSkill = 62,
	CanUseLeftHandSkill = 63,
	CanUseRightHandSkill = 64,
	CanUseLegSkill = 65,
	CanUseActionSkill = 66,
	CanUseCustomSkill = 67,
	CanUseCustom2Skill = 68,
	CanUseCustom3Skill = 69,
	CanSkillWeaponFire = 70,
	CanNormalWeaponFire = 71,
	CanReloadLogic = 72,
	CanRaiseWatch = 73,
	CanUseHelmet = 74,
	CanAbilityListner = 75,
	CanSelfRescue = 76,
	CanFastFire = 77,
	All = 78,
	ECharacterStateMask_MAX = 79
};

// Object: Enum GPGameplay.EForbidMoveReason
enum class EForbidMoveReason : uint8_t
{
	VaultAndClimb = 0,
	AbilityForbidMove = 1,
	InteractForbidMove = 2,
	InteractTrackerForbidMove = 3,
	HUDForbidMove = 4,
	SettlementForbidMove = 5,
	FSM = 6,
	TransitionMove = 7,
	ForbidMoveReasonNum = 8,
	EForbidMoveReason_MAX = 9
};

// Object: Enum GPGameplay.EMovementFailureReason
enum class EMovementFailureReason : uint8_t
{
	MovementFailureReason_None = 0,
	MovementFailureReason_AlreadyInState = 1,
	MovementFailureReason_NotSupport = 2,
	MovementFailureReason_TooFrequent = 3,
	MovementFailureReason_SimulatingPhysics = 4,
	MovementFailureReason_Swimming = 5,
	MovementFailureReason_UsingItem = 6,
	MovementFailureReason_InWeakStatus = 7,
	MovementFailureReason_NotPassCollisionTest = 8,
	MovementFailureReason_TouchWaterVolume = 9,
	MovementFailureReason_IsInKeepPreFireState = 10,
	MovementFailureReason_CanNotStandNow = 11,
	MovementFailureReason_CanNotProneNow = 12,
	MovementFailureReason_Falling = 13,
	MovementFailureReason_MAX = 14
};

// Object: Enum GPGameplay.EPlayerScoreReturnType
enum class EPlayerScoreReturnType : uint8_t
{
	PlayerScoreReturnType_None = 0,
	PlayerScoreReturnType_RebornFlag = 1,
	PlayerScoreReturnType_Rescue = 2,
	PlayerScoreReturnType_DriveVehicle = 3,
	PlayerScoreReturnType_TeamLastOneRedeploy = 4,
	PlayerScoreReturnType_MAX = 5
};

// Object: Enum GPGameplay.EPlayerLeanType
enum class EPlayerLeanType : uint8_t
{
	PlayerLeanType_NotLean = 0,
	PlayerLeanType_LeftLean = 1,
	PlayerLeanType_RightLean = 2,
	PlayerLeanType_Toggle = 16,
	PlayerLeanType_MAX = 17
};

// Object: Enum GPGameplay.ESwimImmediateAudioType
enum class ESwimImmediateAudioType : uint8_t
{
	SwimImmediateAudioType_None = 0,
	SwimImmediateAudioType_Human = 1,
	SwimImmediateAudioType_Vehicle = 2,
	SwimImmediateAudioType_MAX = 3
};

// Object: Enum GPGameplay.ESwimStateAudioType
enum class ESwimStateAudioType : uint8_t
{
	SwimStateAudioType_None = 0,
	SwimStateAudioType_AboveWater = 1,
	SwimStateAudioType_BelowWater = 2,
	SwimStateAudioType_MAX = 3
};

// Object: Enum GPGameplay.EStaminaExclusiveChangeType
enum class EStaminaExclusiveChangeType : uint8_t
{
	EStaminaExclusiveChange_Normal = 0,
	EStaminaExclusiveChange_Sprint = 1,
	EStaminaExclusiveChange_StandRun = 2,
	EStaminaExclusiveChange_SuperSprint = 3,
	EStaminaExclusiveChange_SwimmingSprint = 4,
	EStaminaExclusiveChange_MAX = 5
};

// Object: Enum GPGameplay.EStaminaIndependentChangeType
enum class EStaminaIndependentChangeType : uint8_t
{
	EStaminaIndependentChange_None = 0,
	EStaminaIndependentChange_Jump = 1,
	EStaminaIndependentChange_Vault_One = 2,
	EStaminaIndependentChange_Vault_Two = 3,
	EStaminaIndependentChange_Vault_Three = 4,
	EStaminaIndependentChange_Vault_Four = 5,
	EStaminaIndependentChange_SlideTackle = 6,
	EStaminaIndependentChange_StandToProne = 7,
	EStaminaIndependentChange_StandToCrouch = 8,
	EStaminaIndependentChange_CrouchToStand = 9,
	EStaminaIndependentChange_CrouchToProne = 10,
	EStaminaIndependentChange_ProneToCrouch = 11,
	EStaminaIndependentChange_ProneToStand = 12,
	EStaminaIndependentChange_SkillAssaultAward = 13,
	EStaminaIndependentChange_SkillAssaultStart = 14,
	EStaminaIndependentChange_SkillBlastShieldNormalAttack = 15,
	EStaminaIndependentChange_SkillBlastShieldHeavyAttack = 16,
	EStaminaIndependentChange_Dive = 17,
	EStaminaIndependentChange_SprintPenalty = 18,
	EStaminaIndependentChange_MAX = 19
};

// Object: Enum GPGameplay.ECampNum
enum class ECampNum : uint8_t
{
	ECamp_None = 0,
	ECamp_Player = 1,
	ECamp_PlayerEnemy = 2,
	ECamp_Custom1 = 3,
	ECamp_MAX = 4
};

// Object: Enum GPGameplay.ECharacterGender
enum class ECharacterGender : uint8_t
{
	CharacterGender_Male = 0,
	CharacterGender_Female = 1,
	CharacterGender_MAX = 2
};

// Object: Enum GPGameplay.ECharacterDamagePartsName
enum class ECharacterDamagePartsName : uint8_t
{
	None = 0,
	Leg = 1,
	LegUpper = 2,
	Arm = 3,
	ArmUpper = 4,
	Head = 5,
	Thorx = 6,
	ThorxUpper = 7,
	ECharacterDamagePartsName_MAX = 8
};

// Object: Enum GPGameplay.ESetCharacterPositionAndRep2ClientReason
enum class ESetCharacterPositionAndRep2ClientReason : uint8_t
{
	ENone = 0,
	ERedeploy = 1,
	ERaidResetHasVechile = 2,
	EVolumeResetPosition = 3,
	EVolumeResetCharacterBasePose = 4,
	EMapHeightChanged = 5,
	ECharacterStuck = 6,
	EVaultClimbEndNotInSafe = 7,
	EZiplineCheck = 8,
	EGetOffFromVehicleWithInheritVelocity = 9,
	ESetCharacterPositionAndRep2ClientReason_MAX = 10
};

// Object: Enum GPGameplay.ERedeployStateFuture
enum class ERedeployStateFuture : uint8_t
{
	Idle = 0,
	Start = 1,
	FallDown = 2,
	TurnCameraToEnemy = 3,
	FovZoomOut = 4,
	KillerMark = 5,
	FovZoomIn = 6,
	TurnCameraToSelf = 7,
	Rescue = 8,
	Rising = 9,
	HighView = 10,
	WaitLoadCollision = 11,
	WaitPreMatch = 12,
	Landing = 13,
	RedeployEnd = 14,
	ERedeployStateFuture_MAX = 15
};

// Object: Enum GPGameplay.ERushKillState
enum class ERushKillState : uint8_t
{
	Normal = 0,
	Rush = 1,
	Kill = 2,
	Rush2 = 3,
	Kill2 = 4,
	ERushKillState_MAX = 5
};

// Object: Enum GPGameplay.ECharacterBaseState
enum class ECharacterBaseState : uint8_t
{
	NormalFight = 0,
	SafeHouse = 1,
	ECharacterBaseState_MAX = 2
};

// Object: Enum GPGameplay.ERescueNoPreciseType
enum class ERescueNoPreciseType : uint8_t
{
	None = 0,
	NoMedicSwim = 1,
	NoMedicLand = 2,
	Medic = 3,
	NoMedicLandTargetLand = 4,
	DragMedic = 5,
	ERescueNoPreciseType_MAX = 6
};

// Object: Enum GPGameplay.EClientAdjustPositionExInfo
enum class EClientAdjustPositionExInfo : uint8_t
{
	None = 0,
	WantToCrouch = 1,
	WantToProne = 2,
	WantToStand = 3,
	EClientAdjustPositionExInfo_MAX = 4
};

// Object: Enum GPGameplay.EVerifyClientMoveExFlag
enum class EVerifyClientMoveExFlag : uint16_t
{
	SuccessTrustAll = 0,
	NotVelocity = 1,
	NotMoveMode = 2,
	NotLocation = 4,
	FailJumpCount = 8,
	FailZAxis = 16,
	FailMaxJumpHeight = 32,
	FailDistance = 64,
	FailCustomMove = 128,
	FailTrustScore = 256,
	EVerifyClientMoveExFlag_MAX = 257
};

// Object: Enum GPGameplay.VerifyClientMoveResult
enum class EVerifyClientMoveResult : uint8_t
{
	UseTrustScore = 0,
	SuccessCustomMove = 1,
	SuccessOnMoveBase = 2,
	Fail = 3,
	VerifyClientMoveResult_MAX = 4
};

// Object: Enum GPGameplay.EGPPlayerMoveMode
enum class EGPPlayerMoveMode : uint8_t
{
	None = 0,
	StandStill = 1,
	Walk = 2,
	Run = 3,
	Sprint = 4,
	EGPPlayerMoveMode_MAX = 5
};

// Object: Enum GPGameplay.EGPMoveDebug
enum class EGPMoveDebug : uint8_t
{
	GPMoveDebug_None = 0,
	GPMoveDebug_Prone = 1,
	GPMoveDebug_Penetration = 2,
	GPMoveDebug_MoveAlong = 3,
	GPMoveDebug_ResetWalkingPosition = 4,
	GPMoveDebug_DrawServerPhysicCheck = 5,
	GPMoveDebug_SwimLog = 6,
	GPMoveDebug_MAX = 7
};

// Object: Enum GPGameplay.EGPMovementType
enum class EGPMovementType : uint8_t
{
	MovementType_None = 0,
	MovementType_Walk = 1,
	MovementType_Fall = 2,
	MovementType_Swim = 3,
	MovementType_Fly = 4,
	MovementType_Sprint = 5,
	MovementType_SilentWalk = 6,
	MovementType_HalfSquatWalk = 7,
	MovementType_MAX = 8
};

// Object: Enum GPGameplay.ECharacterSpecificVoiceType
enum class ECharacterSpecificVoiceType : uint8_t
{
	None = 0,
	GameStart = 1,
	Kill = 2,
	Rescue = 3,
	BeRescued = 4,
	ECharacterSpecificVoiceType_MAX = 5
};

// Object: Enum GPGameplay.EAbilityVehicleDestroyReason
enum class EAbilityVehicleDestroyReason : uint8_t
{
	Boom = 0,
	EmptyHealth = 1,
	OwnerDie = 2,
	RetrieveItems = 3,
	Power = 4,
	EAbilityVehicleDestroyReason_MAX = 5
};

// Object: Enum GPGameplay.EEarthquakeFallDownDirection
enum class EEarthquakeFallDownDirection : uint8_t
{
	StandOnSpot = 0,
	ProneOnSpot = 1,
	Left = 2,
	Right = 3,
	Forward = 4,
	EEarthquakeFallDownDirection_MAX = 5
};

// Object: Enum GPGameplay.EAudioEventType
enum class EAudioEventType : uint8_t
{
	None = 0,
	StandToCrouch = 1,
	StandToProne = 2,
	CrouchToStand = 3,
	CrouchToProne = 4,
	ProneToStand = 5,
	ProneToCrouch = 6,
	ClimbLadderUp = 7,
	EAudioEventType_MAX = 8
};

// Object: Enum GPGameplay.EGPAnimAssetType
enum class EGPAnimAssetType : uint8_t
{
	None = 0,
	AssassinateStand = 1,
	BeAssassinateStand = 2,
	AssassinateProne = 3,
	BeAssassinateProne = 4,
	AssassinateImpendingDeath = 5,
	BeAssassinateImpendingDeath = 6,
	EGPAnimAssetType_MAX = 7
};

// Object: Enum GPGameplay.EAntiPeekModeValidationStrategy
enum class EAntiPeekModeValidationStrategy : uint8_t
{
	ValidationStrategy_Default = 0,
	ValidationStrategy_OnlyHead = 1,
	ValidationStrategy_MAX = 2
};

// Object: Enum GPGameplay.EAntiPeekModeReason
enum class EAntiPeekModeReason : uint8_t
{
	AntiPeekModeReason_Emote = 0,
	AntiPeekModeReason_Assassination = 1,
	AntiPeekModeReason_MAX = 2
};

// Object: Enum GPGameplay.EAntiPeekModeCharacterPart
enum class EAntiPeekModeCharacterPart : uint8_t
{
	AntiPeekModeCharacterPart_Head = 0,
	AntiPeekModeCharacterPart_Spine = 1,
	AntiPeekModeCharacterPart_LeftHand = 2,
	AntiPeekModeCharacterPart_RightHand = 3,
	AntiPeekModeCharacterPart_LeftFoot = 4,
	AntiPeekModeCharacterPart_RightFoot = 5,
	AntiPeekModeCharacterPart_MAX = 6
};

// Object: Enum GPGameplay.EAntiPeekModeCategory
enum class EAntiPeekModeCategory : uint8_t
{
	AntiPeekModeCategory_PC_SOL_Player = 0,
	AntiPeekModeCategory_PC_SOL_AI = 1,
	AntiPeekModeCategory_PC_MP_Player = 2,
	AntiPeekModeCategory_PC_MP_AI = 3,
	AntiPeekModeCategory_Mobile_SOL_Player = 4,
	AntiPeekModeCategory_Mobile_SOL_AI = 5,
	AntiPeekModeCategory_Mobile_MP_Player = 6,
	AntiPeekModeCategory_Mobile_MP_AI = 7,
	AntiPeekModeCategory_MAX = 8
};

// Object: Enum GPGameplay.EVoiceTriggerRule
enum class EVoiceTriggerRule : uint8_t
{
	DefaultInspect = 0,
	EmptyInspect = 1,
	MatchStart = 2,
	Ace = 3,
	Kill = 4,
	EVoiceTriggerRule_MAX = 5
};

// Object: Enum GPGameplay.EKillType
enum class EKillType : uint8_t
{
	Player = 0,
	AILab = 1,
	RobotAI = 2,
	AIBoss = 3,
	EKillType_MAX = 4
};

// Object: Enum GPGameplay.ECommercializationVoiceResourceType
enum class ECommercializationVoiceResourceType : uint8_t
{
	WeaponSkin = 0,
	Pendant = 1,
	ECommercializationVoiceResourceType_MAX = 2
};

// Object: Enum GPGameplay.ECharacterState
enum class ECharacterState : uint8_t
{
	CharacterState_None = 0,
	CharacterState_Stand = 1,
	CharacterState_Crouch = 2,
	CharacterState_Prone = 3,
	CharacterState_SilentWalk = 4,
	CharacterState_Zipline = 5,
	CharacterState_Peek = 6,
	CharacterState_Jump = 7,
	CharacterState_Firing = 8,
	CharacterState_Zooming = 9,
	CharacterState_Reload = 10,
	CharacterState_SwitchWeapon = 11,
	CharacterState_Inspect = 12,
	CharacterState_Skill = 13,
	CharacterState_SprayPaint = 14,
	CharacterState_HandGesture = 15,
	CharacterState_LookWatch = 16,
	CharacterState_GetKill = 17,
	CharacterState_MAX = 18
};

// Object: Enum GPGameplay.EWatchMaterialRule
enum class EWatchMaterialRule : uint8_t
{
	WatchMaterialRule_Texture = 0,
	WatchMaterialRule_Time = 1,
	WatchMaterialRule_KillCount = 2,
	WatchMaterialRule_HallDisplayCustom = 3,
	WatchMaterialRule_SpecialRule = 4,
	WatchMaterialRule_MAX = 5
};

// Object: Enum GPGameplay.EItemCondition
enum class EItemCondition : uint8_t
{
	ItemCondition_None = 0,
	ItemCondition_Empty = 1,
	ItemCondition_CannotUse = 2,
	ItemCondition_NoSpace = 3,
	ItemCondition_MAX = 4
};

// Object: Enum GPGameplay.EItemType
enum class EItemType : uint8_t
{
	None = 0,
	Spray = 1,
	Voice = 2,
	OneHandedGesture = 3,
	TwoHandedGesture = 4,
	Emote = 5,
	WeaponInspect = 6,
	SkillInspect = 7,
	Watch = 8,
	HighValueItem = 9,
	WeaponIndependentEmptyInspect = 10,
	EItemType_MAX = 11
};

// Object: Enum GPGameplay.EDestructAnimForwardType
enum class EDestructAnimForwardType : uint8_t
{
	Forward = 0,
	Right = 1,
	Up = 2,
	NegativeForward = 3,
	NegativeRight = 4,
	NegativeUp = 5,
	EDestructAnimForwardType_MAX = 6
};

// Object: Enum GPGameplay.EDestructPriorityType
enum class EDestructPriorityType : uint8_t
{
	ENormalPriority = 0,
	EHighPriority = 1,
	EDestructPriorityType_MAX = 2
};

// Object: Enum GPGameplay.EDestructPhysicsSimulateType
enum class EDestructPhysicsSimulateType : uint8_t
{
	EAnimNodePhysics = 0,
	EGobalPhysics = 1,
	EAsyncPhysics = 2,
	EDestructPhysicsSimulateType_MAX = 3
};

// Object: Enum GPGameplay.EDestructPhysicsType
enum class EDestructPhysicsType : uint8_t
{
	ENoPhysics = 0,
	ESimulateWithAnimationSequence = 1,
	ESimulateWithDelay = 2,
	ESimulateImmediateWithForce = 3,
	ESimulateImmediateWithForceInRadius = 4,
	EDestructPhysicsType_MAX = 5
};

// Object: Enum GPGameplay.EDestructState
enum class EDestructState : uint8_t
{
	ENotDestructed = 0,
	EDamaged = 1,
	EDestroying = 2,
	EMultistage = 3,
	EDestructed = 4,
	EDestructState_MAX = 5
};

// Object: Enum GPGameplay.EDestructLoadMode
enum class EDestructLoadMode : uint8_t
{
	AsyncLoadWhenTrigger = 0,
	AsyncLoadWhenBeginPlay = 1,
	SyncLoad = 2,
	EDestructLoadMode_MAX = 3
};

// Object: Enum GPGameplay.EDiveState
enum class EDiveState : uint8_t
{
	DiveState_Undefine = 0,
	DiveState_InAir = 1,
	DiveState_Landed = 2,
	DiveState_MAX = 3
};

// Object: Enum GPGameplay.EDroneMoveType
enum class EDroneMoveType : uint8_t
{
	SingleAxis = 0,
	MultiAxis = 1,
	EDroneMoveType_MAX = 2
};

// Object: Enum GPGameplay.EAIAdditiveBehavior
enum class EAIAdditiveBehavior : uint8_t
{
	None = 0,
	AimTarget = 1,
	GunShooting = 2,
	ChangeClip = 3,
	Speaking = 4,
	SpotTurn = 5,
	ProneRotator = 6,
	AdditiveGunPos = 7,
	ForbidHandIK = 8,
	ForbidSlopeWarping = 9,
	MAX = 10
};

// Object: Enum GPGameplay.EAILeisureMovementType
enum class EAILeisureMovementType : uint8_t
{
	DefualtType = 0,
	SpecialType01 = 1,
	SpecialType02 = 2,
	TYPE_MAX = 3,
	EAILeisureMovementType_MAX = 4
};

// Object: Enum GPGameplay.EGPCharacterMoveDirStateType
enum class EGPCharacterMoveDirStateType : uint8_t
{
	Forward = 0,
	Backward = 1,
	Horizontal = 2,
	EGPCharacterMoveDirStateType_MAX = 3
};

// Object: Enum GPGameplay.EGPCharacterInCoverPoseType
enum class EGPCharacterInCoverPoseType : uint8_t
{
	None = 0,
	LeftLow = 1,
	RightLow = 2,
	EGPCharacterInCoverPoseType_MAX = 3
};

// Object: Enum GPGameplay.EGPCharacterPoseStateType
enum class EGPCharacterPoseStateType : uint8_t
{
	Stand = 0,
	Crouch = 1,
	Prone = 2,
	Sprint = 3,
	Trott = 4,
	EGPCharacterPoseStateType_MAX = 5
};

// Object: Enum GPGameplay.EGPCharacterAlertStateType
enum class EGPCharacterAlertStateType : uint8_t
{
	Normal = 0,
	TrottMove = 1,
	Sight = 2,
	EGPCharacterAlertStateType_MAX = 3
};

// Object: Enum GPGameplay.EGPCharacterLeisureMoveType
enum class EGPCharacterLeisureMoveType : uint8_t
{
	LeisureMoveType0 = 0,
	LeisureMoveType1 = 1,
	LeisureMoveType2 = 2,
	EGPCharacterLeisureMoveType_MAX = 3
};

// Object: Enum GPGameplay.EGPAICharaLocomotionType
enum class EGPAICharaLocomotionType : uint8_t
{
	None = 0,
	Leisure_Patrol = 1,
	Alert_Trot = 2,
	Alert_Walk = 3,
	Alert_Crouch = 4,
	Alert_InLeftCover = 5,
	Alert_InRightCover = 6,
	Alert_Sprint = 7,
	Fight_Crouch = 8,
	Fight_Walk = 9,
	Fight_Run = 10,
	Fight_Sprint = 11,
	Fight_InCoverLeft = 12,
	Fight_InCoverRight = 13,
	EGPAICharaLocomotionType_MAX = 14
};

// Object: Enum GPGameplay.EGPAIMotionType
enum class EGPAIMotionType : uint8_t
{
	None = 0,
	Walk = 1,
	Run = 2,
	Sprint = 3,
	Crouch = 4,
	Prone = 5,
	Swim = 6,
	EGPAIMotionType_MAX = 7
};

// Object: Enum GPGameplay.EFSMAudioEventType
enum class EFSMAudioEventType : uint8_t
{
	None = 0,
	GAudio = 1,
	Foot = 2,
	LoopStart = 3,
	LoopEnd = 4,
	EFSMAudioEventType_MAX = 5
};

// Object: Enum GPGameplay.ECharacterGlobalEventDefine
enum class ECharacterGlobalEventDefine : uint8_t
{
	ECharacterGlobalEventD_None = 0,
	ECharacterGlobalEvent_ToHandingM2HB = 1,
	ECharacterGlobalEvent_WTF = 2,
	ECharacterGlobalEventDefine_MAX = 3
};

// Object: Enum GPGameplay.EGPFSMNetworkIdentityType
enum class EGPFSMNetworkIdentityType : uint8_t
{
	GPFSM_None = 0,
	GPFSM_OnlyServer = 1,
	GPFSM_OnlyClient = 2,
	GPFSM_OnlyAutonomous = 3,
	GPFSM_OnlySimulate = 4,
	GPFSM_BothServerAndAutonomous = 5,
	GPFSM_BothClientAndServer = 6,
	GPFSM_MAX = 7
};

// Object: Enum GPGameplay.EResetWalkingPositionType
enum class EResetWalkingPositionType : uint8_t
{
	None = 0,
	PreCheckSuccess = 1,
	Success = 2,
	Fail_CD = 3,
	Fail_NotStuckInGeometry = 4,
	Fail_CheckFail = 5,
	Fail_Disable = 6,
	EResetWalkingPositionType_MAX = 7
};

// Object: Enum GPGameplay.EEndZiplineReason
enum class EEndZiplineReason : uint8_t
{
	Arrive = 0,
	Collision = 1,
	Jump = 2,
	Cancel = 3,
	None = 4,
	EEndZiplineReason_MAX = 5
};

// Object: Enum GPGameplay.EGameRuleType
enum class EGameRuleType : uint8_t
{
	None = 0,
	Rule_SOL = 2,
	Rule_Arena = 4,
	Rule_JailBreak = 8,
	Rule_Trials = 16,
	Rule_AZ = 32,
	Rule_BombDefusal = 64,
	EGameRuleType_MAX = 65
};

// Object: Enum GPGameplay.EBaseTLogDataType
enum class EBaseTLogDataType : uint8_t
{
	ENone = 0,
	EServerBegin = 1,
	EDamage = 2,
	EBeDamaged = 3,
	EKillInfo = 4,
	EPropChange = 5,
	EHPGained = 6,
	EServerEnd = 7,
	EClientBegin = 8,
	EBigMapOperate = 9,
	EClientEnd = 10,
	EBaseTLogDataType_MAX = 11
};

// Object: Enum GPGameplay.ESpecialWeaponMatch
enum class ESpecialWeaponMatch : uint8_t
{
	None = 0,
	Sniper = 1,
	ColdArms = 2,
	Richx3 = 3,
	Pistol = 4,
	Shotgun = 5,
	Drug = 6,
	AbilityItem = 7,
	ESpecialWeaponMatch_MAX = 8
};

// Object: Enum GPGameplay.EGameplayType
enum class EGameplayType : uint8_t
{
	EGameplayType_None = 0,
	EGameplayType_Normal = 1,
	EGameplayType_BFA = 2,
	EGameplayType_BTT = 3,
	EGameplayType_Max = 4
};

// Object: Enum GPGameplay.EGameTeamMemberCountType
enum class EGameTeamMemberCountType : uint8_t
{
	EGameTeamMemberCountType_None = 0,
	EGameTeamMemberCountType_1 = 1,
	EGameTeamMemberCountType_2 = 2,
	EGameTeamMemberCountType_4 = 4,
	EGameTeamMemberCountType_5 = 5,
	EGameRoomType_Max = 6,
	EGameTeamMemberCountType_MAX = 7
};

// Object: Enum GPGameplay.EGameRoomType
enum class EGameRoomType : uint8_t
{
	EGameRoomType_None = 0,
	EGameRoomType_Normal = 1,
	EGameRoomType_Rank = 2,
	EGameRoomType_Custom = 3,
	EGameRoomType_Max = 4
};

// Object: Enum GPGameplay.EGPSoftwareCursorType
enum class EGPSoftwareCursorType : uint8_t
{
	None = 0,
	Default = 1,
	DefaultMoving = 2,
	Hand = 3,
	HandPressed = 4,
	GrabHand = 5,
	CardinalCross = 6,
	EGPSoftwareCursorType_MAX = 7
};

// Object: Enum GPGameplay.EHitEffectType
enum class EHitEffectType : uint8_t
{
	HitEffectType_None = 0,
	HitEffectType_Animation = 1,
	HitEffectType_Physx = 2,
	HitEffectType_MAX = 3
};

// Object: Enum GPGameplay.EHitDirection
enum class EHitDirection : uint8_t
{
	HitDirection_None = 0,
	HitDirection_Front = 1,
	HitDirection_Back = 2,
	HitDirection_Left = 3,
	HitDirection_Right = 4,
	HitDirection_MAX = 5
};

// Object: Enum GPGameplay.EGPHotFixActorType
enum class EGPHotFixActorType : uint8_t
{
	None = 0,
	Add = 1,
	Delete = 2,
	Modify = 3,
	EGPHotFixActorType_MAX = 4
};

// Object: Enum GPGameplay.EBagTabType
enum class EBagTabType : uint8_t
{
	EBagTab_Character = 0,
	EBagTab_Health = 1,
	EBagTab_ScoreBoard = 2,
	EBagTab_MAX = 3
};

// Object: Enum GPGameplay.EInputDisableReason
enum class EInputDisableReason : uint8_t
{
	HUD_EmptyWhiteListBlockAll = 0,
	HUD_NotInWhiteList = 1,
	HUD_InBlackList = 2,
	MainStage = 3,
	PlayMode = 4,
	Dynamic = 5,
	EInputDisableReason_MAX = 6
};

// Object: Enum GPGameplay.EInputActionType
enum class EInputActionType : uint16_t
{
	EInputAction_None = 0,
	EInputAction_MoveForwardBtnDown = 1,
	EInputAction_MoveForwardBtnUp = 2,
	EInputAction_MoveBackwardBtnDown = 3,
	EInputAction_MoveBackwardBtnUp = 4,
	EInputAction_MoveLeftBtnDown = 5,
	EInputAction_MoveLeftBtnUp = 6,
	EInputAction_MoveRightBtnDown = 7,
	EInputAction_MoveRightBtnUp = 8,
	EInputAction_MoveUpBtnDown = 9,
	EInputAction_MoveUpBtnUp = 10,
	EInputAction_MoveDownBtnDown = 11,
	EInputAction_MoveDownBtnUp = 12,
	EInputAction_MoveRollLeftBtnDown = 13,
	EInputAction_MoveRollLeftBtnUp = 14,
	EInputAction_MoveRollRightBtnDown = 15,
	EInputAction_MoveRollRightBtnUp = 16,
	EInputAction_AirThrottleUpBtnDown = 17,
	EInputAction_AirThrottleUpBtnUp = 18,
	EInputAction_AirThrottleDownBtnDown = 19,
	EInputAction_AirThrottleDownBtnUp = 20,
	EInputAction_AirRollLeftBtnDown = 21,
	EInputAction_AirRollLeftBtnUp = 22,
	EInputAction_AirRollRightBtnDown = 23,
	EInputAction_AirRollRightBtnUp = 24,
	EInputAction_AirPitchUpBtnDown = 25,
	EInputAction_AirPitchUpBtnUp = 26,
	EInputAction_AirPitchDownBtnDown = 27,
	EInputAction_AirPitchDownBtnUp = 28,
	EInputAction_AirYawLeftBtnDown = 29,
	EInputAction_AirYawLeftBtnUp = 30,
	EInputAction_AirYawRightBtnDown = 31,
	EInputAction_AirYawRightBtnUp = 32,
	EInputAction_HeliThrottleUpBtnDown = 33,
	EInputAction_HeliThrottleUpBtnUp = 34,
	EInputAction_HeliThrottleDownBtnDown = 35,
	EInputAction_HeliThrottleDownBtnUp = 36,
	EInputAction_HeliRollLeftBtnDown = 37,
	EInputAction_HeliRollLeftBtnUp = 38,
	EInputAction_HeliRollRightBtnDown = 39,
	EInputAction_HeliRollRightBtnUp = 40,
	EInputAction_HeliPitchUpBtnDown = 41,
	EInputAction_HeliPitchUpBtnUp = 42,
	EInputAction_HeliPitchDownBtnDown = 43,
	EInputAction_HeliPitchDownBtnUp = 44,
	EInputAction_HeliYawLeftBtnDown = 45,
	EInputAction_HeliYawLeftBtnUp = 46,
	EInputAction_HeliYawRightBtnDown = 47,
	EInputAction_HeliYawRightBtnUp = 48,
	EInputAction_JumpAndVaultBtnDown = 49,
	EInputAction_JumpAndVaultBtnUp = 50,
	EInputAction_JumpBtnDown = 51,
	EInputAction_JumpBtnUp = 52,
	EInputAction_VaultBtnDown = 53,
	EInputAction_CrouchBtnDown = 54,
	EInputAction_CrouchBtnUp = 55,
	EInputAction_CrouchHoldBtnDown = 56,
	EInputAction_CrouchHoldBtnUp = 57,
	EInputAction_ProneAndDiveBtnDown = 58,
	EInputAction_ProneBtnDown = 59,
	EInputAction_DiveBtnDown = 60,
	EInputAction_SwimUpBtnDown = 61,
	EInputAction_SwimUpBtnUp = 62,
	EInputAction_SwimDownBtnDown = 63,
	EInputAction_SwimDownBtnUp = 64,
	EInputAction_SprintBtnDown = 65,
	EInputAction_SprintBtnUp = 66,
	EInputAction_SilentWalkBtnDown = 67,
	EInputAction_SilentWalkBtnUp = 68,
	EInputAction_SuperSprintBtnDown = 69,
	EInputAction_SuperSprintBtnUp = 70,
	EInputAction_PersistMoveBtnDown = 71,
	EInputAction_PersistMoveBtnUp = 72,
	EInputAction_SprintKeyboardBtnDown = 73,
	EInputAction_SprintKeyboardBtnUp = 74,
	EInputAction_SilentWalkKeyboardBtnDown = 75,
	EInputAction_SilentWalkKeyboardBtnUp = 76,
	EInputAction_LeftPeekBtnDown = 77,
	EInputAction_LeftPeekBtnUp = 78,
	EInputAction_RightPeekBtnDown = 79,
	EInputAction_RightPeekBtnUp = 80,
	EInputAction_ParachuteOpenBtnDown = 81,
	EInputAction_ParachuteCloseBtnDown = 82,
	EInputAction_LeftFireBtnDown = 83,
	EInputAction_LeftFireBtnUp = 84,
	EInputAction_RightFireBtnDown = 85,
	EInputAction_RightFireBtnUp = 86,
	EInputAction_AimBtnDown = 87,
	EInputAction_AimBtnUp = 88,
	EInputAction_SideAimBtnDown = 89,
	EInputAction_SideAimBtnUp = 90,
	EInputAction_ChangeSightBtnDown = 91,
	EInputAction_HoldBreathBtnDown = 92,
	EInputAction_HoldBreathBtnUp = 93,
	EInputAction_ReloadBtnDown = 94,
	EInputAction_ReloadBtnUp = 95,
	EInputAction_GamepadReloadBtnDown = 96,
	EInputAction_FastFireBtnDown = 97,
	EInputAction_FastFireBtnUp = 98,
	EInputAction_SwitchWeapon1BtnDown = 99,
	EInputAction_SwitchWeapon2BtnDown = 100,
	EInputAction_SwitchWeapon3BtnDown = 101,
	EInputAction_SwitchWeapon4BtnDown = 102,
	EInputAction_SwitchToPreWeaponBtnDown = 103,
	EInputAction_SwitchToNextWeaponBtnDown = 104,
	EInputAction_SwitchWeaponFireModeBtnDown = 105,
	EInputAction_ChangeFOVBtnDown = 106,
	EInputAction_ChangeFovBtnUp = 107,
	EInputAction_SwitchTacticalEquipmentBtnDown = 108,
	EInputAction_SwitchTacticalEquipmentBtnUp = 109,
	EInputAction_PowerFlashOpenKeyboardBtnDown = 110,
	EInputAction_RangeFinderBtnDown = 111,
	EInputAction_NightVisionBtnDown = 112,
	EInputAction_NightVisionBtnUp = 113,
	EInputAction_WeaponBipodDeployBtnDown = 114,
	EInputAction_FalloutDetectorBtnDown = 115,
	EInputAction_FalloutDetectorBtnUp = 116,
	EInputAction_AbilityDetailBtnUp = 117,
	EInputAction_AbilityDetailBtnDown = 118,
	EInputAction_SkillButtonBtnDown = 119,
	EInputAction_SkillButtonBtnUp = 120,
	EInputAction_AbilityItemBtnDown = 121,
	EInputAction_AbilityItemBtnUp = 122,
	EInputAction_AbilityItemSecondBtnDown = 123,
	EInputAction_AbilityItemSecondBtnUp = 124,
	EInputAction_MedicalSyringeBtnDown = 125,
	EInputAction_SkillCustom1BtnDown = 126,
	EInputAction_SkillCustom1BtnUp = 127,
	EInputAction_SkillCustom2BtnDown = 128,
	EInputAction_SkillCustom2BtnUp = 129,
	EInputAction_BattleFieldPropSkillBtnDown = 130,
	EInputAction_BattleFieldPropSkillBtnUp = 131,
	EInputAction_SkillQTELeftBtnDown = 132,
	EInputAction_SkillQTELeftBtnUp = 133,
	EInputAction_SkillQTERightBtnDown = 134,
	EInputAction_SkillQTERightBtnUp = 135,
	EInputAction_SkillInspectRouletteBtnDown = 136,
	EInputAction_SkillInspectRouletteBtnUp = 137,
	EInputAction_SkillInspectBtnDown = 138,
	EInputAction_AbilityItem1InspectBtnDown = 139,
	EInputAction_AbilityItem2InspectBtnDown = 140,
	EInputAction_CallAICombatStyleToggleBtnDown = 141,
	EInputAction_CallAICombatStyleToggleBtnUp = 142,
	EInputAction_InteractBtnDown = 143,
	EInputAction_InteractBtnUp = 144,
	EInputAction_Interact2BtnDown = 145,
	EInputAction_Interact2BtnUp = 146,
	EInputAction_Interact3BtnDown = 147,
	EInputAction_Interact3BtnUp = 148,
	EInputAction_Interact4BtnDown = 149,
	EInputAction_Interact4BtnUp = 150,
	EInputAction_RescueBtnDown = 151,
	EInputAction_RescueBtnUp = 152,
	EInputAction_CarryBodyBtnDown = 153,
	EInputAction_DropCarryBodyBtnDown = 154,
	EInputAction_ZiplineBtnDown = 155,
	EInputAction_AssassinateBtnDown = 156,
	EInputAction_AssassinateBtnUp = 157,
	EInputAction_FirefightingBtnDown = 158,
	EInputAction_FirefightingBtnUp = 159,
	EInputAction_PullOutArrowBtnDown = 160,
	EInputAction_PullOutArrowBtnUp = 161,
	EInputAction_ButterRescueBtnDown = 162,
	EInputAction_ButterRescueBtnUp = 163,
	EInputAction_3DMiniGameBtnDown = 164,
	EInputAction_3DMiniGameBtnUp = 165,
	EInputAction_ESCBtnDown = 166,
	EInputAction_OpenGameESCPanelBtnDown = 167,
	EInputAction_LootingOpenBagBtnDown = 168,
	EInputAction_LootingOpenBagBtnUp = 169,
	EInputAction_LootingOpenHealthTabBtnDown = 170,
	EInputAction_ToggleScoreboardBtnDown = 171,
	EInputAction_ToggleScoreboardBtnUp = 172,
	EInputAction_RequestRescueBtnDown = 173,
	EInputAction_RequestRescueBtnUp = 174,
	EInputAction_AbandonRescueBtnDown = 175,
	EInputAction_AbandonRescueBtnUp = 176,
	EInputAction_AbandonRescueInWaterBtnDown = 177,
	EInputAction_AbandonRescueInWaterBtnUp = 178,
	EInputAction_EquipmentRentalBtnDown = 179,
	EInputAction_MiniMapScaleChangeBtnDown = 180,
	EInputAction_CloseDeathDetailBtnDown = 181,
	EInputAction_QuickResYesBtnDown = 182,
	EInputAction_QuickResNoBtnDown = 183,
	EInputAction_OpenScoreBoardBtnDown = 184,
	EInputAction_OpenScoreBoardBtnUp = 185,
	EInputAction_ArtillerySupportBtnDown = 186,
	EInputAction_ArtillerySupportBtnUp = 187,
	EInputAction_RouletteMedBtnDown = 188,
	EInputAction_RouletteMedBtnUp = 189,
	EInputAction_RouletteLeftBtnDown = 190,
	EInputAction_UseCurrentRouletteItemBtnDown = 191,
	EInputAction_CancelRouletteBtnDown = 192,
	EInputAction_OpenTaskBtnDown = 193,
	EInputAction_CommanderImpeachBtnDown = 194,
	EInputAction_TeamInfoDetailsBtnDown = 195,
	EInputAction_OpenMapBtnDown = 196,
	EInputAction_ZoomUpBigMapScaleBtnDown = 197,
	EInputAction_ZoomDownBigMapScaleBtnDown = 198,
	EInputAction_MapLongPressSelectBtnDown = 199,
	EInputAction_MapLongPressSelectBtnUp = 200,
	EInputAction_SOLMapExitInfoShow = 201,
	EInputAction_MapDigitalKey1BtnDown = 202,
	EInputAction_MapDigitalKey2BtnDown = 203,
	EInputAction_MapDigitalKey3BtnDown = 204,
	EInputAction_MapDigitalKey4BtnDown = 205,
	EInputAction_MapKeyUpBtnDown = 206,
	EInputAction_MapKeyDownBtnDown = 207,
	EInputAction_LocatePlayerBtnDown = 208,
	EInputAction_ToggleLegendsBtnDown = 209,
	EInputAction_WatchFightChangeTargetBtnDown = 210,
	EInputAction_WatchFightExitBtnDown = 211,
	EInputAction_WatchFightReportVoiceBtnDown = 212,
	EInputAction_WatchFightReportBtnDown = 213,
	EInputAction_WatchFightPlayerCardBtnDown = 214,
	EInputAction_WatchFightDeathDetailInfoBtnDown = 215,
	EInputAction_WatchKillCamReplayBtnDown = 216,
	EInputAction_MarkingBtnDown = 217,
	EInputAction_MarkingBtnUp = 218,
	EInputAction_CommercializationBtnDown = 219,
	EInputAction_CommercializationBtnUp = 220,
	EInputAction_SwitchRoulette = 221,
	EInputAction_KeepVoiceSpeakingBtnDown = 222,
	EInputAction_KeepVoiceSpeakingBtnUp = 223,
	EInputAction_MuteAllBtnDown = 224,
	EInputAction_ChangeVoiceChannelDown = 225,
	EInputAction_ChangeMicrophoneTypeBtnDown = 226,
	EInputAction_RangeManageWeaponBtnDown = 227,
	EInputAction_RangeToggleAnalysisPanelBtnDown = 228,
	EInputAction_RangeRefreshAnalysisPanelBtnDown = 229,
	EInputAction_RangeToggleAnalysisDetailedPanelBtnDown = 230,
	EInputAction_PreviewRoomSwitchSceneBtnDown = 231,
	EInputAction_VehicleBoostBtnDown = 232,
	EInputAction_VehicleBrakeBtnDown = 233,
	EInputAction_VehicleBrakeBtnUp = 234,
	EInputAction_VehicleLockTurretBtnDown = 235,
	EInputAction_VehicleLockTurretBtnUp = 236,
	EInputAction_ChangeVehicleSeat1BtnDown = 237,
	EInputAction_ChangeVehicleSeat2BtnDown = 238,
	EInputAction_ChangeVehicleSeat3BtnDown = 239,
	EInputAction_ChangeVehicleSeat4BtnDown = 240,
	EInputAction_ChangeVehicleSeat5BtnDown = 241,
	EInputAction_ChangeVehicleSeat6BtnDown = 242,
	EInputAction_ChangeVehicleSeatToAvailable = 243,
	EInputAction_FirstVehicleSkillBtnDown = 244,
	EInputAction_FirstVehicleSkillBtnUp = 245,
	EInputAction_SecondVehicleSkillBtnDown = 246,
	EInputAction_SecondVehicleSkillBtnUp = 247,
	EInputAction_ThirdVehicleSkillBtnDown = 248,
	EInputAction_ThirdVehicleSkillBtnUp = 249,
	EInputAction_FourthVehicleSkillBtnDown = 250,
	EInputAction_FourthVehicleSkillBtnUp = 251,
	EInputAction_SecondVehicleWeaponFireBtnDown = 252,
	EInputAction_VehicleHeadOutBtnDown = 253,
	EInputAction_VehicleTrumpetBtnDown = 254,
	EInputAction_VehicleTrumpetBtnUp = 255,
	EInputAction_VehicleMusicBtnDown = 256,
	EInputAction_VehicleSwitchXPPBtnDown = 257,
	EInputAction_LeaveVehicleBtnDown = 258,
	EInputAction_LockVehicleCameraBtnDown = 259,
	EInputAction_LockVehicleCameraBtnUp = 260,
	EInputAction_AirLockVehicleCameraBtnDown = 261,
	EInputAction_AirLockVehicleCameraBtnUp = 262,
	EInputAction_VehicleFireBtnDown = 263,
	EInputAction_VehicleFireBtnUp = 264,
	EInputAction_VehicleAimBtnDown = 265,
	EInputAction_VehicleAimBtnUp = 266,
	EInputAction_JetAimBtnDown = 267,
	EInputAction_JetAimBtnUp = 268,
	EInputAction_AirVehicleBlanceAssistBtnDown = 269,
	EInputAction_AirVehicleBlanceAssistBtnUp = 270,
	EInputAction_SwitchVehicleWeapon1BtnDown = 271,
	EInputAction_SwitchVehicleWeapon2BtnDown = 272,
	EInputAction_SwitchScrollVehicleWeapon1BtnDown = 273,
	EInputAction_SwitchScrollVehicleWeapon2BtnDown = 274,
	EInputAction_VehicleSpeedupBtnDown = 275,
	EInputAction_VehicleSpeedupBtnUp = 276,
	EInputAction_JetDriveModeBtnDown = 277,
	EInputAction_VehicleSmokeWallSkillChangeTypeBtnDown = 278,
	EInputAction_Exit3DSafeHouseBtnDown = 279,
	EInputAction_ChangeXPPBtnDown = 280,
	EInputAction_HideHUDBtnDown = 281,
	EInputAction_ToggleWeaponDebugPanelBtnDown = 282,
	EInputAction_GMToggleGhostWalk = 283,
	EInputAction_GMToggleFlyWalk = 284,
	EInputAction_GMAddSpeed100 = 285,
	EInputAction_GMMinusSpeed100 = 286,
	EInputAction_GMPauseBtnDown = 287,
	EInputAction_GMMoveStuckGotoBtnDown = 288,
	EInputAction_GMMoveStuckNextBtnDown = 289,
	EInputAction_GMMoveStuckPreBtnDown = 290,
	EInputAction_TPPRotateCameraBtnDown = 291,
	EInputAction_TPPRotateCameraBtnUp = 292,
	EInputAction_FreeLookaroundModeBtnDown = 293,
	EInputAction_FreeLookaroundModeBtnUp = 294,
	EInputAction_OBC_ShowHidePanelBtnDown = 295,
	EInputAction_OBC_CatchMoveRoutePointBtnDown = 296,
	EInputAction_OBC_GenerateMoveRouteBtnDown = 297,
	EInputAction_OBC_ClearMoveRouteBtnDown = 298,
	EInputAction_OBC_CatchFaceRoutePointBtnDown = 299,
	EInputAction_OBC_GenerateFaceRouteBtnDown = 300,
	EInputAction_OBC_ClearFaceRouteBtnDown = 301,
	EInputAction_OBC_ShowHideRouteDebugViewBtnDown = 302,
	EInputAction_OBC_StartMoveCameraBtnDown = 303,
	EInputAction_OBC_UpdateFocusPointBtnDown = 304,
	EInputAction_OBC_LeftBtnClickBtnDown = 305,
	EInputAction_OBC_RightBtnClickBtnDown = 306,
	EInputAction_OBC_SwitchToFreeCameraBtnDown = 307,
	EInputAction_OBC_PrevTeamBtnDown = 308,
	EInputAction_OBC_NextTeamBtnDown = 309,
	EInputAction_OBC_ShowDetailListBtnDown = 310,
	EInputAction_OBC_ShowTeamInfoBtnDown = 311,
	EInputAction_OBC_ShowOutLineEffectBtnDown = 312,
	EInputAction_OBC_ShowPlayerMarkerBtnDown = 313,
	EInputAction_OBC_CameraMoveSpeedAccelerateBtnDown = 314,
	EInputAction_OBC_CameraMoveSpeedDecelerateBtnDown = 315,
	EInputAction_OBC_ChangeCameraCollisionBtnDown = 316,
	EInputAction_VehicleChangeXPPBtnDown = 317,
	EInputAction_NumMax = 318,
	EInputAction_MAX = 319
};

// Object: Enum GPGameplay.EInputAxisType
enum class EInputAxisType : uint8_t
{
	EInputAxis_None = 0,
	EInputAxis_TurnAtRate = 1,
	EInputAxis_LookUpAtRate = 2,
	EInputAxis_MoveForward = 3,
	EInputAxis_MoveVehicleForward_Gamepad = 4,
	EInputAxis_MoveVehicleBackward_Gamepad = 5,
	EInputAxis_MoveRight = 6,
	EInputAxis_MoveUp = 7,
	EInputAxis_MoveRoll = 8,
	EInputAxis_AirThrottle = 9,
	EInputAxis_AirPitch = 10,
	EInputAxis_AirRoll = 11,
	EInputAxis_AirYaw = 12,
	EInputAxis_HeliThrottle = 13,
	EInputAxis_HeliPitch = 14,
	EInputAxis_HeliRoll = 15,
	EInputAxis_HeliYaw = 16,
	EInputAxis_RouletteOperationX = 17,
	EInputAxis_RouletteOperationY = 18,
	EInputAxis_SelectTacticalEquipX = 19,
	EInputAxis_SelectTacticalEquipY = 20,
	EInputAxis_NumMax = 21,
	EInputAxis_MAX = 22
};

// Object: Enum GPGameplay.EDoorKeyType
enum class EDoorKeyType : uint8_t
{
	DoorKeyType_Normal = 0,
	DoorKeyType_ByLevel = 1,
	DoorKeyType_ByItemGid = 2,
	DoorKeyType_MAX = 3
};

// Object: Enum GPGameplay.EInteractorOptConditionType
enum class EInteractorOptConditionType : uint8_t
{
	OptCondition_None = 0,
	OptCondition_ConsumeItem = 1,
	OptCondition_MAX = 2
};

// Object: Enum GPGameplay.EInteractorOptSwitcherType
enum class EInteractorOptSwitcherType : uint8_t
{
	InteractorOptSwitcherType_None = 0,
	InteractorOptSwitcherType_Lock = 1,
	InteractorOptSwitcherType_OpenClose = 2,
	InteractorOptSwitcherType_MAX = 3
};

// Object: Enum GPGameplay.EInteractorBlockCheckType
enum class EInteractorBlockCheckType : uint8_t
{
	InteractorBlockCheck_ForwardAndCheckBlock = 0,
	InteractorBlockCheck_BackwardAndCheckBlock = 1,
	InteractorBlockCheck_MAX = 2
};

// Object: Enum GPGameplay.EInteractorPriority
enum class EInteractorPriority : uint8_t
{
	InteractorPriority_Zipline = 0,
	InteractorPriority_PickupOwnBySelf = 1,
	InteractorPriority_Delay = 2,
	InteractorPriority_Common = 3,
	InteractorPriority_PickupOwnByTeammate = 4,
	InteractorPriority_MAX = 5
};

// Object: Enum GPGameplay.EInteractorHUDType
enum class EInteractorHUDType : uint8_t
{
	HUDType_None = 0,
	HUDType_Common = 1,
	HUDType_ContractNPC = 2,
	HUDType_MAX = 3
};

// Object: Enum GPGameplay.EInteractorPanelLayout
enum class EInteractorPanelLayout : uint8_t
{
	InteractorPanelLayout_NULL = 0,
	InteractorPanelLayout_Default = 1,
	InteractorPanelLayout_Pickup = 2,
	InteractorPanelLayout_Container = 3,
	InteractorPanelLayout_DeadBody = 4,
	InteractorPanelLayout_Door = 5,
	InteractorPanelLayout_Rescue = 6,
	InteractorPanelLayout_Vehicle = 7,
	InteractorPanelLayout_CarryBody = 8,
	InteractorPanelLayout_SingleItemContainer = 9,
	InteractorPanelLayout_PickupContainer = 10,
	InteractorPanelLayout_GiftTreasure = 11,
	InteractorPanelLayout_PutBack = 12,
	InteractorPanelLayout_MAX = 13
};

// Object: Enum GPGameplay.EKnockbackFromType
enum class EKnockbackFromType : uint8_t
{
	None = 0,
	TigerCrouch = 1,
	RankSkill_GuidMissle = 2,
	BlastShieldAttack = 3,
	EKnockbackFromType_MAX = 4
};

// Object: Enum GPGameplay.EKnockBackState
enum class EKnockBackState : uint8_t
{
	KnockBackState_Undefine = 0,
	KnockBackState_Fly = 1,
	KnockBackState_Fall = 2,
	KnockBackState_GetUp = 3,
	KnockBackState_MAX = 4
};

// Object: Enum GPGameplay.EGPMarkerColorType
enum class EGPMarkerColorType : uint8_t
{
	None = 0,
	LocationMarkerEnemyColor = 1,
	EGPMarkerColorType_MAX = 2
};

// Object: Enum GPGameplay.EMarkingReceiver
enum class EMarkingReceiver : uint8_t
{
	None = 0,
	SelfMarkingReceiver = 1,
	TeamMarkingReceiver = 2,
	CampMarkingReceiver = 3,
	TeamLeaderMarkingReceiver = 4,
	CommanderMarkingReceiver = 5,
	EMarkingReceiver_MAX = 6
};

// Object: Enum GPGameplay.ELowAmmoBubbleSourceType
enum class ELowAmmoBubbleSourceType : uint8_t
{
	None = 0,
	AmmoPack = 1,
	ELowAmmoBubbleSourceType_MAX = 2
};

// Object: Enum GPGameplay.ELowHealthBubbleSourceType
enum class ELowHealthBubbleSourceType : uint8_t
{
	None = 0,
	HealthPack = 1,
	ELowHealthBubbleSourceType_MAX = 2
};

// Object: Enum GPGameplay.EAutoShowBubbleSourceType
enum class EAutoShowBubbleSourceType : uint8_t
{
	None = 0,
	SupportPack = 1,
	SupportBox = 2,
	MedicalGun = 3,
	EAutoShowBubbleSourceType_MAX = 4
};

// Object: Enum GPGameplay.EMarkingOtherType
enum class EMarkingOtherType : uint8_t
{
	None = 0,
	CancelMarking = 1,
	ReplyRescue = 2,
	Evacuation = 3,
	SafeBox = 4,
	MandelBrick = 5,
	DecipherStation = 6,
	COUNT = 7,
	EMarkingOtherType_MAX = 8
};

// Object: Enum GPGameplay.EMarkingItemType
enum class EMarkingItemType : uint8_t
{
	None = 0,
	CommonItem = 1,
	LootingItem = 2,
	Container = 3,
	DyingTeammate = 4,
	DeadBody = 5,
	Weapon = 6,
	EngineerSonicTrap = 7,
	Vehicle = 8,
	TacticalEquip = 9,
	PendingDeathCharacter = 10,
	SectorAnchor = 11,
	MandelBrickInteractor = 12,
	MandelBrickDecipherDevice = 13,
	ExitTrigger = 14,
	ContractStation = 15,
	DoorAcquireCard = 16,
	COUNT = 17,
	EMarkingItemType_MAX = 18
};

// Object: Enum GPGameplay.EGameMarkFeature
enum class EGameMarkFeature : uint8_t
{
	UpdateDistance = 1,
	UpdateHasCoverBetween = 2,
	UpdateHasAimed = 4,
	UpdateHasAimedByCircle = 8,
	UpdateScaleWithDistance = 16,
	EGameMarkFeature_MAX = 17
};

// Object: Enum GPGameplay.EMarkerType
enum class EMarkerType : uint8_t
{
	None = 0,
	Tactic = 1,
	TeamMember = 2,
	EMarkerType_MAX = 3
};

// Object: Enum GPGameplay.ETacticalMarkingType
enum class ETacticalMarkingType : uint8_t
{
	None = 0,
	TacticalMarking_Attack = 1,
	TacticalMarking_Defense = 2,
	TacticalMarking_GoAheadThere = 3,
	TacticalMarking_VehicleGoAheadThere = 4,
	TacticalMarking_AttentionEnemy = 5,
	TacticalMarking_AttentionVehicle = 6,
	TacticalMarking_RequestHelp = 7,
	TacticalMarking_RequestRebornFlag = 8,
	TacticalMarking_RequestAttention = 9,
	TacticalMarking_RequestAttack = 10,
	TacticalMarking_Digit1 = 11,
	TacticalMarking_Digit2 = 12,
	TacticalMarking_Digit3 = 13,
	ETacticalMarkingType_MAX = 14
};

// Object: Enum GPGameplay.EInteractorMarkerType
enum class EInteractorMarkerType : uint8_t
{
	None = 0,
	Interactor_SceneAmmoBox = 1,
	Interactor_Fortification = 2,
	Interactor_AutoFortification_FixedWeaponAAMarker = 3,
	Interactor_AutoFortification_FixedWeaponMachineGunMarker = 4,
	Interactor_AutoFortification_FixedWeaponShoreMarker = 5,
	Interactor_EggPortalDoor = 6,
	Interactor_RecoveryMarker = 7,
	Interactor_AirVehicleRecoveryMarker = 8,
	Interactor_EggGoldBirdNest = 9,
	Interactor_EarthquakeDevice = 10,
	EInteractorMarkerType_MAX = 11
};

// Object: Enum GPGameplay.EMarkingMarkerType
enum class EMarkingMarkerType : uint8_t
{
	None = 0,
	PlayerMarker_Location = 1,
	PlayerMarker_Item = 2,
	PlayerMarker_Other = 3,
	EMarkingMarkerType_MAX = 4
};

// Object: Enum GPGameplay.EMapMarkerType
enum class EMapMarkerType : uint8_t
{
	None = 0,
	MapMarkerNormal = 1,
	Chat_Normal = 2,
	Chat_Item = 3,
	MapMarkerPlayerExit = 4,
	MapMarkerPlayerExitTrigger = 5,
	MapMarkerDoor = 6,
	MapMarkerQuest = 7,
	MapMarkerPOI = 8,
	MapMarkerShopStation = 9,
	MapMarkerHighValueBox = 10,
	MapMarkerContractQuest = 11,
	MapMarkerContractObjection = 12,
	MapMarkerWeaponBlueprintStation = 13,
	MapMarkerSectorAnchor = 14,
	MapMarkerScouter = 15,
	MapMarkerIronGauze = 16,
	CommanderMarking = 17,
	MapMarkerIconDisposalBomb = 18,
	EMapMarkerType_MAX = 19
};

// Object: Enum GPGameplay.EQuestMarkerMarkerType
enum class EQuestMarkerMarkerType : uint8_t
{
	None = 0,
	Arrive = 1,
	Destroy = 2,
	Protect = 3,
	ProtectWithHP = 4,
	Arrive_Optional = 5,
	Destroy_Optional = 6,
	Protect_Optional = 7,
	ProtectWithHP_Optional = 8,
	NPCTalk = 9,
	TargetTrack = 10,
	NPCTrigger = 11,
	RPGTrack = 12,
	Vehicle = 13,
	Hostage = 14,
	MarkerNarrow = 15,
	AmmoBox = 16,
	EliteAI = 17,
	InteractiveReading = 18,
	InteractGame = 19,
	Raid_ValkyrieVehicle = 20,
	NPCTeamMate = 21,
	SOLContractKill = 22,
	SOLContractArrive = 23,
	SOLContractInteract = 24,
	SOLContractManning = 25,
	SOLMissionKill = 26,
	SOLMissionArrive = 27,
	SOLMissionInteract = 28,
	BraveGame = 29,
	RavenGuide = 30,
	RavenManning = 31,
	EQuestMarkerMarkerType_MAX = 32
};

// Object: Enum GPGameplay.ESOLGameModeMarkerType
enum class ESOLGameModeMarkerType : uint8_t
{
	None = 0,
	DoorMarker = 1,
	CountDownReleaseMarker = 2,
	C4BombMarker = 3,
	JailBreakDeadBodyMarker = 4,
	BraveGame_Marker = 5,
	FalloutMarker = 6,
	ParkourCheckpointMarker = 7,
	ESOLGameModeMarkerType_MAX = 8
};

// Object: Enum GPGameplay.EBattleFieldGameModeMarkerType
enum class EBattleFieldGameModeMarkerType : uint8_t
{
	None = 0,
	SectorAnchorMarker = 1,
	TransferMarker = 2,
	SupportSkillMarker = 3,
	BattleFieldCampSectorMarker = 4,
	CaptureFlagAnchorMarker = 5,
	CaptureFlagMarker = 6,
	HardPointMarker = 7,
	EBattleFieldGameModeMarkerType_MAX = 8
};

// Object: Enum GPGameplay.ETacticalEquipmentMarkerType
enum class ETacticalEquipmentMarkerType : uint8_t
{
	None = 0,
	CommonTacticalEquipmentMarker = 1,
	RebornFlagMarker = 2,
	VehicleRebornFlagMarker = 3,
	AmmoBoxMarker = 4,
	SonicTrapMarker = 5,
	GunnerRobotMarker = 6,
	HealBoxMarker = 7,
	ADSMarker = 8,
	RecoveryMarker = 9,
	DeadBodyAmmoBoxMarker = 10,
	ThrowBlocking = 11,
	SceneAmmoBoxMarker = 12,
	NetSpider = 13,
	SentrySpider = 14,
	SentryHive = 15,
	IntelligentSmoke = 16,
	SonarDevice = 17,
	StingMissleMarker = 18,
	SupportWeaponMarker = 19,
	LaserPointerMarker = 20,
	LaserPointerReciverMarker = 21,
	Detector = 22,
	RankSkillRebornFlagMarker = 23,
	SupportPackTargetMarker = 24,
	AutiTankMine = 25,
	ClaymoreMine = 26,
	BarbedWire = 27,
	RopeRoot = 28,
	BionicBirdMarker = 29,
	WireGuidedMarker = 30,
	SonarDetectMarker = 31,
	C103SmokeMarker = 32,
	C103MedicalDroneMarker = 33,
	C103ButterMarker = 34,
	ElecDeviceDetectMarker = 35,
	C405StunGrenadeMarker = 36,
	ETacticalEquipmentMarkerType_MAX = 37
};

// Object: Enum GPGameplay.EVehicleMarkerType
enum class EVehicleMarkerType : uint8_t
{
	None = 0,
	CommonVehicleMarker = 1,
	OBCommonVehicleMarker = 2,
	EVehicleMarkerType_MAX = 3
};

// Object: Enum GPGameplay.ESceneWeaponMarkerType
enum class ESceneWeaponMarkerType : uint8_t
{
	None = 0,
	CommonSceneWeaponMarker = 1,
	FixedWeaponAAMarker = 2,
	FixedWeaponMachineGunMarker = 3,
	FixedWeaponShoreMarker = 4,
	AutoFortification_FixedWeaponAAMarker = 5,
	AutoFortification_FixedWeaponMachineGunMarker = 6,
	AutoFortification_FixedWeaponShoreMarker = 7,
	ESceneWeaponMarkerType_MAX = 8
};

// Object: Enum GPGameplay.EEnemyCharacterMarkerType
enum class EEnemyCharacterMarkerType : uint8_t
{
	None = 0,
	RevealMarker = 1,
	AIBaseMarker = 2,
	AIWarnMarker = 3,
	AimedEnemyPlayerMarker = 4,
	AimedAIMarker = 5,
	EnemyEffectMarker = 6,
	FocusedEnemyMarker = 7,
	KillCamSelfMarker = 8,
	KnifeDroneLockEnemyMarker = 9,
	EEnemyCharacterMarkerType_MAX = 10
};

// Object: Enum GPGameplay.EFriendlyCharacterMarkerType
enum class EFriendlyCharacterMarkerType : uint8_t
{
	None = 0,
	FriendlyMarker = 1,
	ImpendingDeathMarker = 2,
	DeathMarker = 3,
	OBFriendlyMarker = 4,
	OBImpendingDeathMarker = 5,
	OBDeathMarker = 6,
	BattleFieldOBFriendlyMarker = 7,
	BattleFieldOBImpendingDeathMarker = 8,
	BattleFieldOBDeathMarker = 9,
	OBAIMarker = 10,
	FriendlyAIMarker = 11,
	C103MedicalDroneLockTeammateMarker = 12,
	EFriendlyCharacterMarkerType_MAX = 13
};

// Object: Enum GPGameplay.EGPMarkerType
enum class EGPMarkerType : uint16_t
{
	None = 0,
	FriendlyMarker = 1,
	ImpendingDeathMarker = 2,
	DeathMarker = 3,
	OBFriendlyMarker = 4,
	OBImpendingDeathMarker = 5,
	OBDeathMarker = 6,
	BattleFieldOBFriendlyMarker = 7,
	BattleFieldOBImpendingDeathMarker = 8,
	BattleFieldOBDeathMarker = 9,
	OBAIMarker = 10,
	FriendlyAIMarker = 11,
	C103MedicalDroneLockTeammateMarker = 12,
	RevealMarker = 257,
	AIBaseMarker = 258,
	AIWarnMarker = 259,
	AimedEnemyPlayerMarker = 260,
	AimedAIMarker = 261,
	EnemyEffectMarker = 262,
	FocusedEnemyMarker = 263,
	KillCamSelfMarker = 264,
	KnifeDroneLockEnemyMarker = 265,
	CommonSceneWeaponMarker = 513,
	FixedWeaponAAMarker = 514,
	FixedWeaponMachineGunMarker = 515,
	FixedWeaponShoreMarker = 516,
	AutoFortification_FixedWeaponAAMarker = 517,
	AutoFortification_FixedWeaponMachineGunMarker = 518,
	AutoFortification_FixedWeaponShoreMarker = 519,
	CommonVehicleMarker = 769,
	OBCommonVehicleMarker = 770,
	CommonTacticalEquipmentMarker = 1025,
	RebornFlagMarker = 1026,
	VehicleRebornFlagMarker = 1027,
	AmmoBoxMarker = 1028,
	SonicTrapMarker = 1029,
	GunnerRobotMarker = 1030,
	HealBoxMarker = 1031,
	ADSMarker = 1032,
	RecoveryMarker = 1033,
	DeadBodyAmmoBoxMarker = 1034,
	ThrowBlocking = 1035,
	SceneAmmoBoxMarker = 1036,
	NetSpider = 1037,
	SentrySpider = 1038,
	SentryHive = 1039,
	IntelligentSmoke = 1040,
	SonarDevice = 1041,
	StingMissleMarker = 1042,
	SupportWeaponMarker = 1043,
	LaserPointerMarker = 1044,
	LaserPointerReciverMarker = 1045,
	Detector = 1046,
	RankSkillRebornFlagMarker = 1047,
	SupportPackTargetMarker = 1048,
	AutiTankMine = 1049,
	ClaymoreMine = 1050,
	BarbedWire = 1051,
	RopeRoot = 1052,
	BionicBirdMarker = 1053,
	WireGuidedMarker = 1054,
	SonarDetectMarker = 1055,
	C103SmokeMarker = 1056,
	C103MedicalDroneMarker = 1057,
	C103ButterMarker = 1058,
	ElecDeviceDetectMarker = 1059,
	C405StunGrenadeMarker = 1060,
	SectorAnchorMarker = 1281,
	TransferMarker = 1282,
	SupportSkillMarker = 1283,
	BattleFieldCampSectorMarker = 1284,
	CaptureFlagAnchorMarker = 1285,
	CaptureFlagMarker = 1286,
	HardPointMarker = 1287,
	DoorMarker = 1537,
	CountDownReleaseMarker = 1538,
	C4BombMarker = 1539,
	JailBreakDeadBodyMarker = 1540,
	BraveGame_Marker = 1541,
	FalloutMarker = 1542,
	ParkourCheckpointMarker = 1543,
	Arrive = 1793,
	Destroy = 1794,
	Protect = 1795,
	ProtectWithHP = 1796,
	Arrive_Optional = 1797,
	Destroy_Optional = 1798,
	Protect_Optional = 1799,
	ProtectWithHP_Optional = 1800,
	NPCTalk = 1801,
	TargetTrack = 1802,
	NPCTrigger = 1803,
	RPGTrack = 1804,
	Vehicle = 1805,
	Hostage = 1806,
	MarkerNarrow = 1807,
	AmmoBox = 1808,
	EliteAI = 1809,
	InteractiveReading = 1810,
	InteractGame = 1811,
	Raid_ValkyrieVehicle = 1812,
	NPCTeamMate = 1813,
	SOLContractKill = 1814,
	SOLContractArrive = 1815,
	SOLContractInteract = 1816,
	SOLContractManning = 1817,
	SOLMissionKill = 1818,
	SOLMissionArrive = 1819,
	SOLMissionInteract = 1820,
	BraveGame = 1821,
	RavenGuide = 1822,
	MapMarkerNormal = 2049,
	Chat_Normal = 2050,
	Chat_Item = 2051,
	MapMarkerPlayerExit = 2052,
	MapMarkerPlayerExitTrigger = 2053,
	MapMarkerDoor = 2054,
	MapMarkerQuest = 2055,
	MapMarkerPOI = 2056,
	MapMarkerShopStation = 2057,
	MapMarkerHighValueBox = 2058,
	MapMarkerContractQuest = 2059,
	MapMarkerContractObjection = 2060,
	MapMarkerWeaponBlueprintStation = 2061,
	MapMarkerSectorAnchor = 2062,
	MapMarkerScouter = 2063,
	MapMarkerIronGauze = 2064,
	CommanderMarking = 2065,
	MapMarkerIconDisposalBomb = 2066,
	PlayerMarker_Location = 2305,
	PlayerMarker_Item = 2306,
	PlayerMarker_Other = 2307,
	Interactor_SceneAmmoBox = 2561,
	Interactor_Fortification = 2562,
	Interactor_AutoFortification_FixedWeaponAAMarker = 2563,
	Interactor_AutoFortification_FixedWeaponMachineGunMarker = 2564,
	Interactor_AutoFortification_FixedWeaponShoreMarker = 2565,
	Interactor_EggPortalDoor = 2566,
	Interactor_RecoveryMarker = 2567,
	Interactor_AirVehicleRecoveryMarker = 2568,
	Interactor_EggGoldBirdNest = 2569,
	Interactor_EarthquakeDevice = 2570,
	TacticalMarking_Attack = 2817,
	TacticalMarking_Defense = 2818,
	TacticalMarking_GoAheadThere = 2819,
	TacticalMarking_VehicleGoAheadThere = 2820,
	TacticalMarking_AttentionEnemy = 2821,
	TacticalMarking_AttentionVehicle = 2822,
	TacticalMarking_RequestHelp = 2823,
	TacticalMarking_RequestRebornFlag = 2824,
	TacticalMarking_RequestAttention = 2825,
	TacticalMarking_RequestAttack = 2826,
	TacticalMarking_Digit1 = 2827,
	TacticalMarking_Digit2 = 2828,
	TacticalMarking_Digit3 = 2829,
	EGPMarkerType_MAX = 2830
};

// Object: Enum GPGameplay.EMarkerRefreshFrequencyLevel
enum class EMarkerRefreshFrequencyLevel : uint8_t
{
	EveryFrame = 0,
	SuperHighFrequency = 1,
	HighFrequency = 2,
	MidFrequency = 3,
	LowFrequency = 4,
	EMarkerRefreshFrequencyLevel_MAX = 5
};

// Object: Enum GPGameplay.EGPMarkerViewStatus
enum class EGPMarkerViewStatus : uint8_t
{
	PendingCreate = 0,
	Created = 1,
	EGPMarkerViewStatus_MAX = 2
};

// Object: Enum GPGameplay.EGPMarkedActorStatus
enum class EGPMarkedActorStatus : uint8_t
{
	Normal = 0,
	Clipped = 1,
	Destroyed = 2,
	EGPMarkedActorStatus_MAX = 3
};

// Object: Enum GPGameplay.EMarkerUIWigetType
enum class EMarkerUIWigetType : uint8_t
{
	None = 0,
	DistanceText = 1,
	NameText = 2,
	Bar = 4,
	Icon = 8,
	All = 15,
	EMarkerUIWigetType_MAX = 16
};

// Object: Enum GPGameplay.ERevealMarkerReason
enum class ERevealMarkerReason : uint8_t
{
	None = 0,
	Resident = 1,
	AimReveal = 2,
	FireReveal = 3,
	MarkingReveal = 4,
	LockReveal = 5,
	ScoutDetect = 6,
	ERevealMarkerReason_MAX = 7
};

// Object: Enum GPGameplay.ECharacterMarkerState
enum class ECharacterMarkerState : uint8_t
{
	None = 0,
	Alive = 1,
	PendingDeath = 2,
	FirstDeath = 3,
	Death = 4,
	ButterRescuring = 5,
	ButterRescured_Death = 6,
	ButterRescured_PendingDeath = 7,
	ECharacterMarkerState_MAX = 8
};

// Object: Enum GPGameplay.EQuickChatMarkingItemType
enum class EQuickChatMarkingItemType : uint8_t
{
	None = 0,
	ThankYou = 1,
	NeedMedic = 2,
	NeedRepair = 3,
	NeedMunitions = 4,
	NeedVehicle = 5,
	SOL_NeedHealing = 6,
	SOL_NeedMunitions = 7,
	SOL_NeedMedication_Health = 8,
	SOL_NeedMedication_Surgery = 9,
	SOL_NeedMedication_PainKiller = 10,
	SOL_NeedMedication_HelmetRepair = 11,
	SOL_NeedMedication_ArmourRepair = 12,
	SOL_NeedMedication_Injection = 13,
	EQuickChatMarkingItemType_MAX = 14
};

// Object: Enum GPGameplay.MarkType
enum class EMarkType : uint8_t
{
	CHARACTER = 0,
	MarkType_MAX = 1
};

// Object: Enum GPGameplay.ENetworkNotifyPriority
enum class ENetworkNotifyPriority : uint8_t
{
	NetworkIdentityNotifyPriority_NoUse = 0,
	NetworkIdentityNotifyPriority_Default = 1,
	NetworkIdentityNotifyPriority_Blackboard = 2,
	NetworkIdentityNotifyPriority_ActorRoot = 3,
	NetworkIdentityNotifyPriority_First = 4,
	NetworkIdentityNotifyPriority_Second = 5,
	NetworkIdentityNotifyPriority_Third = 6,
	NetworkIdentityNotifyPriority_Fourth = 7,
	NetworkIdentityNotifyPriority_Fifth = 8,
	NetworkIdentityNotifyPriority_Sixth = 9,
	NetworkIdentityNotifyPriority_Seventh = 10,
	NetworkIdentityNotifyPriority_Eighth = 11,
	NetworkIdentityNotifyPriority_MAX = 12
};

// Object: Enum GPGameplay.ENotifyTeammatesType
enum class ENotifyTeammatesType : uint8_t
{
	ENotify_None = 0,
	ENotify_SkillReady = 1,
	ENotify_NumMax = 2,
	ENotify_MAX = 3
};

// Object: Enum GPGameplay.EOutLineScreenEffectStencil
enum class EOutLineScreenEffectStencil : uint8_t
{
	None = 0,
	OutLineRed_3P = 30,
	OutLineWhite = 31,
	OutLineGreen = 32,
	OutLineBlue = 33,
	OutLineAI = 34,
	OutLineRed_1P = 35,
	OutLineLocking = 36,
	OutLineLockComplete = 37,
	OutLineGreen_SupportEffect = 38,
	OutLineYellow_Low = 40,
	OutLineYellow_High = 41,
	OutLineGreen_OB = 42,
	OutLineRed_OB = 43,
	OutLineOrange = 44,
	OutLineBlue_Butter = 58,
	OutLineGreen_Butter = 59,
	OutLineYellow_Butter = 60,
	OutLineDeepYellow_Butter = 61,
	OutLineDeepGray_Butter = 62,
	EOutLineScreenEffectStencil_MAX = 63
};

// Object: Enum GPGameplay.EAbilityItemOutLineType
enum class EAbilityItemOutLineType : uint8_t
{
	None = 0,
	OnlyTeamate = 1,
	AllCamp = 2,
	EAbilityItemOutLineType_MAX = 3
};

// Object: Enum GPGameplay.EOutLineEffectType
enum class EOutLineEffectType : uint32_t
{
	OutLineType_None = 0,
	OutLineType_ProxSensor = 1,
	OutLineType_ArrowMark = 2,
	OutLineType_MedicGun = 4,
	OutLineType_MedicGunHit = 8,
	OutLineType_SupportEffect = 16,
	OutLineType_DyingLockEnemy = 32,
	OutLineType_Breakthrough_Defender = 64,
	OutLineType_DyingShowTeammateCanRescueSelf = 128,
	OutLineType_DyingShowCampMedicCanRescueSelf = 256,
	OutLineType_Locking = 512,
	OutLineType_LockComplete = 1024,
	OutLineType_LockFire = 2048,
	OutLineType_OnlyMarker = 4096,
	OutLineType_SOL_OB_Teammate = 8192,
	OutLineType_SOL_OB_Enemy = 16384,
	OutLineType_SOL_OB_AI = 32768,
	OutLineType_SOL_OB_FreeCamera = 65536,
	OutLineType_Breakthrough_OB_Attacker = 131072,
	OutLineType_OBorReplay = 262144,
	OutLineType_Replay_Self = 524288,
	OutLineType_Replay_Teammate = 1048576,
	OutLineType_Breakthrough_OB_Defender = 2097152,
	OutLineType_SpiderSkill = 4194304,
	OutLineType_C103ButterPassiveSkill = 8388608,
	OutLineType_OverloadMode = 16777216,
	OutLineType_DestroyedRemoteVehicle = 33554432,
	OutLineType_VehicleCounterFireRadar = 67108864,
	OutLineType_SonarMP = 134217728,
	OutLineType_MAX = 134217729
};

// Object: Enum GPGameplay.EPlayerParachutePhaseType
enum class EPlayerParachutePhaseType : uint8_t
{
	None = 0,
	Parachute = 1,
	Glide = 2,
	EPlayerParachutePhaseType_MAX = 3
};

// Object: Enum GPGameplay.EParachutePhaseType
enum class EParachutePhaseType : uint8_t
{
	EParachutePhase_None = 0,
	EParachutePhase_Flying = 1,
	EParachutePhase_Landing = 2,
	EParachutePhase_MAX = 3
};

// Object: Enum GPGameplay.EPassiveMoveBodyType
enum class EPassiveMoveBodyType : uint8_t
{
	PassiveMoveBodyTypeStand = 0,
	PassiveMoveBodyTypeCrouch = 1,
	PassiveMoveBodyTypeProne = 2,
	EPassiveMoveBodyType_MAX = 3
};

// Object: Enum GPGameplay.EPassiveMoveLogicType
enum class EPassiveMoveLogicType : uint8_t
{
	PassiveMoveLogic_Default = 0,
	PassiveMoveLogic_Rope = 1,
	PassiveMoveLogic_MAX = 2
};

// Object: Enum GPGameplay.EPassiveMoveType
enum class EPassiveMoveType : uint8_t
{
	PassiveMove_None = 0,
	PassiveMove_Target = 1,
	PassiveMove_Path = 2,
	PassiveMove_MAX = 3
};

// Object: Enum GPGameplay.EGPPathFollowStatus
enum class EGPPathFollowStatus : uint8_t
{
	Init = 0,
	Play = 1,
	Pause = 2,
	Stop = 3,
	EGPPathFollowStatus_MAX = 4
};

// Object: Enum GPGameplay.ECameraModifier
enum class ECameraModifier : uint8_t
{
	ECM_Default = 0,
	ECM_Reborn = 1,
	ECM_Redeploy = 2,
	ECM_GunSway = 3,
	ECM_AssaultSpeedUp = 4,
	ECM_Fire = 5,
	ECM_Bleeding = 6,
	ECM_Sprint = 7,
	ECM_CameraShake = 8,
	ECM_FPPFocusActor = 9,
	ECM_AssaultShock = 10,
	ECM_BeHit = 11,
	ECM_WeaponRecoil = 12,
	ECM_InVehicle = 13,
	ECM_ProneImpact = 14,
	ECM_FPPCameraOperate = 15,
	ECM_JoggleCamera = 16,
	ECM_ExplosionBeHit = 17,
	ECM_ViewRotateSpeedLimit = 18,
	ECM_AssaultSpeedUpMobile = 19,
	ECM_AISpecialHit = 20,
	ECM_FOVEffect = 21,
	ECM_RedPacketFOVEffect = 22,
	ECM_MAX = 23
};

// Object: Enum GPGameplay.EDefaultFOVRenderReason
enum class EDefaultFOVRenderReason : uint8_t
{
	EDFRR_Default = 0,
	EDFRR_MachiGun = 1,
	EDFRR_DriveCar = 2,
	EDFRR_ClimbLadder = 3,
	EDFRR_Telescope = 4,
	EDFRR_StarApp = 5,
	EDFRR_GetRopeDown = 6,
	EDFRR_Parachute = 7,
	EDFRR_Interact = 8,
	EDFRR_CrocodileBite = 9,
	EDFRR_Max = 10
};

// Object: Enum GPGameplay.EPOVModifyOption
enum class EPOVModifyOption : uint8_t
{
	DoNotModify = 0,
	DefaultValue = 1,
	SetValue = 2,
	EPOVModifyOption_MAX = 3
};

// Object: Enum GPGameplay.ECameraRotationType
enum class ECameraRotationType : uint8_t
{
	CameraRot_Final = 0,
	CameraRot_WeaponTrace = 1,
	CameraRot_MAX = 2
};

// Object: Enum GPGameplay.EFovAdjustMode
enum class EFovAdjustMode : uint8_t
{
	FovMode_FixY = 0,
	FovMode_FixX = 1,
	FovMode_FixShortSide = 2,
	FovMode_FixLongSide = 3,
	FovMode_MAX = 4
};

// Object: Enum GPGameplay.ECameraSmoothDirection
enum class ECameraSmoothDirection : uint8_t
{
	CameraSmoothDirection_None = 0,
	CameraSmoothDirection_OnlyZ = 1,
	CameraSmoothDirection_Full = 2,
	CameraSmoothDirection_MAX = 3
};

// Object: Enum GPGameplay.ECameraSmoothType
enum class ECameraSmoothType : uint8_t
{
	CameraSmoothType_None = 0,
	CameraSmoothType_Crouch = 1,
	CameraSmoothType_Prone = 2,
	CameraSmoothType_QuickCrouch = 3,
	CameraSmoothType_Parachute = 4,
	CameraSmoothType_Climb = 5,
	CameraSmoothType_MAX = 6
};

// Object: Enum GPGameplay.EGPMGameSceneType
enum class EGPMGameSceneType : uint8_t
{
	None = 0,
	FireShoot = 1,
	KillPlayer = 2,
	GetHighValueItem = 3,
	KillBoss = 4,
	SOLSettlement = 5,
	MPVictory = 6,
	EGPMGameSceneType_MAX = 7
};

// Object: Enum GPGameplay.EPlayerMarkerScreenPosType
enum class EPlayerMarkerScreenPosType : uint8_t
{
	OnAim = 0,
	Inner = 1,
	Middle = 2,
	Outer = 3,
	EPlayerMarkerScreenPosType_MAX = 4
};

// Object: Enum GPGameplay.EPlayerPVSGoalVisibleReason
enum class EPlayerPVSGoalVisibleReason : uint8_t
{
	None = 0,
	EPlayerPVSGoalParachuteGlobalAction = 1,
	MAXNUM = 2,
	EPlayerPVSGoalVisibleReason_MAX = 3
};

// Object: Enum GPGameplay.EPlayerPVSSelfVisibleReason
enum class EPlayerPVSSelfVisibleReason : uint8_t
{
	None = 0,
	MAXNUM = 1,
	EPlayerPVSSelfVisibleReason_MAX = 2
};

// Object: Enum GPGameplay.EPlayerPVSConnectionVisibleReason
enum class EPlayerPVSConnectionVisibleReason : uint8_t
{
	None = 0,
	EPlayerPVSConnectionVisible_OutlineEffect = 1,
	EPlayerPVSConnectionVisible_Tracing = 2,
	EPlayerPVSConnectionVisible_ThrowableAttach = 3,
	MAXNUM = 4,
	EPlayerPVSConnectionVisibleReason_MAX = 5
};

// Object: Enum GPGameplay.EBattleFieldForcesType
enum class EBattleFieldForcesType : uint8_t
{
	None = 0,
	Forces_Haavk = 1,
	Forces_GTI = 2,
	EBattleFieldForcesType_MAX = 3
};

// Object: Enum GPGameplay.EPlayerState
enum class EPlayerState : uint8_t
{
	PlayerState_NONE = 0,
	PlayerState_Normal = 1,
	PlayerState_Airplane = 2,
	PlayerState_Air = 3,
	PlayerState_Drive = 4,
	PlayerState_Weak = 5,
	PlayerState_OffLine = 6,
	PlayerState_Dead = 7,
	PlayerState_Spectating = 8,
	PlayerState_MAX = 9
};

// Object: Enum GPGameplay.EPlayerGender
enum class EPlayerGender : uint8_t
{
	PlayerGender_None = 0,
	PlayerGender_Male = 1,
	PlayerGender_Female = 2,
	PlayerGender_Unknow = 3,
	PlayerGender_Hide = 4,
	PlayerGender_Max = 5
};

// Object: Enum GPGameplay.ECharacterQTEState4
enum class ECharacterQTEState4 : uint8_t
{
	QTEState_None = 0,
	QTEState_FastMelee = 1,
	QTEState_Assassinate = 2,
	QTEState_MAX = 3
};

// Object: Enum GPGameplay.EHitPartType
enum class EHitPartType : uint8_t
{
	Body = 0,
	Head = 1,
	LeftShoulder = 2,
	RightShoulder = 3,
	LeftLeg = 4,
	RightLeg = 5,
	EHitPartType_MAX = 6
};

// Object: Enum GPGameplay.ERagdollStopReason
enum class ERagdollStopReason : uint8_t
{
	ReplicateStop = 0,
	ClearRagdoll = 1,
	DropBodyCheck = 2,
	TickCheck = 3,
	MovableBase = 4,
	FallbackOverTime = 5,
	BeginOverlap = 6,
	CheckHipsVerticalDist = 7,
	HipsStable = 8,
	ClientPreStop = 9,
	OverTime = 10,
	ClientRPC = 11,
	ERagdollStopReason_MAX = 12
};

// Object: Enum GPGameplay.ERagdollAnimType
enum class ERagdollAnimType : uint8_t
{
	NormalDeath = 0,
	DropBody = 1,
	ToImpendingDeath = 2,
	VehicleKill = 3,
	ERagdollAnimType_MAX = 4
};

// Object: Enum GPGameplay.ERagdollConstraintAnimType
enum class ERagdollConstraintAnimType : uint8_t
{
	Blend = 0,
	Fixed = 1,
	ERagdollConstraintAnimType_MAX = 2
};

// Object: Enum GPGameplay.EGPAIDeathWeaponType
enum class EGPAIDeathWeaponType : uint8_t
{
	None = 0,
	Medium = 1,
	Heavy = 2,
	EGPAIDeathWeaponType_MAX = 3
};

// Object: Enum GPGameplay.EWeaponDeathType
enum class EWeaponDeathType : uint8_t
{
	None = 0,
	Medium = 1,
	Heavy = 2,
	EWeaponDeathType_MAX = 3
};

// Object: Enum GPGameplay.ERushFromType
enum class ERushFromType : uint8_t
{
	Skill = 0,
	BlastShield = 1,
	ERushFromType_MAX = 2
};

// Object: Enum GPGameplay.ESHMoveMode
enum class ESHMoveMode : uint8_t
{
	Stand = 0,
	Crouch = 1,
	Prone = 2,
	Sprint = 3,
	SilentWalk = 4,
	InAir = 5,
	ESHMoveMode_MAX = 6
};

// Object: Enum GPGameplay.EFSHForbidReason
enum class EFSHForbidReason : uint8_t
{
	EFR_Default = 0,
	EFR_Sprint = 1,
	EFR_Jump = 2,
	EFR_Prone = 3,
	ForbidReasonMAX = 4,
	EFSHForbidReason_MAX = 5
};

// Object: Enum GPGameplay.ESHMovementState
enum class ESHMovementState : uint8_t
{
	None = 0,
	Grounded = 1,
	InAir = 2,
	ESHMovementState_MAX = 3
};

// Object: Enum GPGameplay.ESHPlayerMoveMode
enum class ESHPlayerMoveMode : uint8_t
{
	None = 0,
	StandStill = 1,
	Walk = 2,
	Run = 3,
	Sprint = 4,
	ESHPlayerMoveMode_MAX = 5
};

// Object: Enum GPGameplay.EGPHudDataType
enum class EGPHudDataType : uint8_t
{
	None = 0,
	LocAndRot = 1,
	TeamCharacterHealth = 2,
	VehicleInfo = 3,
	SceneWeaponInfo = 4,
	EGPHudDataType_MAX = 5
};

// Object: Enum GPGameplay.EGPSceneActorType
enum class EGPSceneActorType : uint8_t
{
	SA_NONE = 0,
	SA_Character = 1,
	SA_Vehicle = 2,
	SA_SceneWeapon = 3,
	SA_MAX = 4
};

// Object: Enum GPGameplay.EGPSceneActorStateType
enum class EGPSceneActorStateType : uint8_t
{
	E_BeginPlay = 0,
	E_EndPlay = 1,
	E_Relevancy = 2,
	E_MAX = 3
};

// Object: Enum GPGameplay.EGPHudDataUpdateFrequency
enum class EGPHudDataUpdateFrequency : uint8_t
{
	Freeze = 0,
	LowFrequency = 1,
	MidFrequency = 2,
	HighFrequency = 3,
	EGPHudDataUpdateFrequency_MAX = 4
};

// Object: Enum GPGameplay.EIrisSeamlessEnterType
enum class EIrisSeamlessEnterType : uint8_t
{
	General = 0,
	Guide = 1,
	Tide = 2,
	Saeed = 3,
	EIrisSeamlessEnterType_MAX = 4
};

// Object: Enum GPGameplay.ECustomPrimitiveDataFloatDefine
enum class ECustomPrimitiveDataFloatDefine : uint8_t
{
	CPD_BaseColorFator = 0,
	CPD_EmissiveFator = 1,
	CPD_DistanceOffset = 2,
	CPD_Blank3 = 3,
	CPD_MAX = 4
};

// Object: Enum GPGameplay.ESkeletalMeshAnimUROActorType
enum class ESkeletalMeshAnimUROActorType : uint8_t
{
	Normal = 0,
	Player = 1,
	AI = 2,
	Weapon = 3,
	Equipment = 4,
	Breakable = 5,
	ESkeletalMeshAnimUROActorType_MAX = 6
};

// Object: Enum GPGameplay.EKillerType
enum class EKillerType : uint8_t
{
	None = 0,
	Killer = 1,
	BeKilled = 2,
	EKillerType_MAX = 3
};

// Object: Enum GPGameplay.EDataFlowType
enum class EDataFlowType : uint8_t
{
	None = 0,
	BeDamaged = 1,
	BeHealed = 2,
	BeKnocked = 3,
	MoveState = 4,
	BeBuffed = 5,
	BeRemoveBuffed = 6,
	BeDetect = 7,
	SkillState = 8,
	Move = 9,
	Sprint = 10,
	Squat = 11,
	Jump = 12,
	EDataFlowType_MAX = 13
};

// Object: Enum GPGameplay.EUltraSkillUIState
enum class EUltraSkillUIState : uint8_t
{
	None = 0,
	Normal = 1,
	Cooldown = 2,
	Banned = 3,
	EUltraSkillUIState_MAX = 4
};

// Object: Enum GPGameplay.ESkillConflictResolveType
enum class ESkillConflictResolveType : uint8_t
{
	Accept = 0,
	Refuse = 1,
	Break = 2,
	OnlyBreak = 3,
	OnlyUsingBreak = 4,
	ConflictMax = 5,
	ESkillConflictResolveType_MAX = 6
};

// Object: Enum GPGameplay.EAbiltyTemplateAttachMeshMode
enum class EAbiltyTemplateAttachMeshMode : uint8_t
{
	ATTACH_ALL = 0,
	ATTACH_FPP = 1,
	ATTACH_TPP = 2,
	ATTACH_MAX = 3
};

// Object: Enum GPGameplay.EAbilitySpawnState
enum class EAbilitySpawnState : uint8_t
{
	Init = 0,
	Request = 1,
	Done = 2,
	Removed = 3,
	EAbilitySpawnState_MAX = 4
};

// Object: Enum GPGameplay.EAbilityTriggerType
enum class EAbilityTriggerType : uint8_t
{
	None = 0,
	Then = 1,
	Trigger = 2,
	UnTrigger = 3,
	CallEvent = 4,
	Custom = 5,
	EAbilityTriggerType_MAX = 6
};

// Object: Enum GPGameplay.ESkillExcuteState
enum class ESkillExcuteState : uint8_t
{
	EnterState = 1,
	LeaveState = 2,
	InvalidLeaveState = 4,
	ESkillExcuteState_MAX = 5
};

// Object: Enum GPGameplay.EAbilityCanNotPlayReason
enum class EAbilityCanNotPlayReason : uint8_t
{
	None = 0,
	PreNodeNoExcute = 1,
	PreNodeTime = 2,
	ServerNodeExcuteCount = 3,
	ClientNodeExcuteCount = 4,
	ClientServerNoExcute = 5,
	EAbilityCanNotPlayReason_MAX = 6
};

// Object: Enum GPGameplay.EAbilityEnterFlag
enum class EAbilityEnterFlag : uint8_t
{
	CanNotPlay = 0,
	CanPlay = 1,
	NotifyServerEnter = 2,
	EAbilityEnterFlag_MAX = 3
};

// Object: Enum GPGameplay.EAbilityStateFlag
enum class EAbilityStateFlag : uint8_t
{
	RepExcute = 0,
	PredictExcute = 1,
	PredictLocalExcute = 2,
	PredictLocalExcuteAll = 3,
	EAbilityStateFlag_MAX = 4
};

// Object: Enum GPGameplay.ENodeCantPlay
enum class ENodeCantPlay : uint8_t
{
	NoSkillState = 0,
	CharacterDie = 1,
	ENodeCantPlay_MAX = 2
};

// Object: Enum GPGameplay.EAbilityNodeExcuteType
enum class EAbilityNodeExcuteType : uint8_t
{
	Both = 0,
	Server = 1,
	Client = 2,
	Client1P = 3,
	Client3P = 4,
	ServerAndClient1P = 5,
	BothCantPlay = 6,
	EAbilityNodeExcuteType_MAX = 7
};

// Object: Enum GPGameplay.ECharacterSkillType
enum class ECharacterSkillType : uint8_t
{
	None = 0,
	SkillType1 = 1,
	SkillType2 = 2,
	SkillType3 = 3,
	SkillType4 = 4,
	ECharacterSkillType_MAX = 5
};

// Object: Enum GPGameplay.ELoadResourceType
enum class ELoadResourceType : uint8_t
{
	NONE = 0,
	Server = 1,
	Client1P = 2,
	Client3P = 3,
	Server_Client1P = 4,
	Server_Client1P_Client3P = 5,
	ELoadResourceType_MAX = 6
};

// Object: Enum GPGameplay.EAbilitySpawnType
enum class EAbilitySpawnType : uint8_t
{
	NONE = 0,
	Server = 1,
	Client1P = 2,
	Client3P = 4,
	EAbilitySpawnType_MAX = 5
};

// Object: Enum GPGameplay.ESkillWeaponSwitchType
enum class ESkillWeaponSwitchType : uint8_t
{
	Default = 0,
	Quiet = 1,
	Instant = 2,
	GetWeaponQuiet = 3,
	PutWeaponQuiet = 4,
	GetWeaponFast = 5,
	PutWeaponFast = 6,
	GetAndPutWeaponFast = 7,
	PutQuietAndGetWeaponFast = 8,
	ESkillWeaponSwitchType_MAX = 9
};

// Object: Enum GPGameplay.ESkillStateType
enum class ESkillStateType : uint8_t
{
	DoubleHandsSkill = 1,
	LeftHandSkill = 2,
	RightHandSkill = 3,
	LegsSkill = 4,
	SpecialSkill = 5,
	ActionSkill = 6,
	CustomSkill = 7,
	Custom2Skill = 8,
	Custom3Skill = 9,
	SkillState_MAX = 10,
	ESkillStateType_MAX = 11
};

// Object: Enum GPGameplay.ESkillBehaviorPreFilterState
enum class ESkillBehaviorPreFilterState : uint8_t
{
	ESkillBehavior_Failed = 0,
	ESkillBehavior_FailedWithTips = 1,
	ESkillBehavior_Successed = 2,
	ESkillBehavior_MAX = 3
};

// Object: Enum GPGameplay.ESkillNumType
enum class ESkillNumType : uint8_t
{
	UT_Normal = 0,
	UT_Item = 1,
	UT_NoShow = 2,
	UT_MAX = 3
};

// Object: Enum GPGameplay.ESkillUsingType
enum class ESkillUsingType : uint8_t
{
	UT_Normal = 0,
	UT_Normal_Charging = 1,
	UT_Select = 2,
	UT_Rocking = 3,
	UT_Disable_Charging = 4,
	UT_Activate = 5,
	UT_Disable_UseCD = 6,
	UT_Disable_EMP = 7,
	UT_Disable_NoCharging = 8,
	UT_Disable_NoTarget = 9,
	UT_MAX = 10
};

// Object: Enum GPGameplay.ESkillItemUsingType
enum class ESkillItemUsingType : uint8_t
{
	UT_Normal = 0,
	UT_Selected = 1,
	UT_Activate = 2,
	UT_Disable = 3,
	UT_NormalUsing = 4,
	UT_MAX = 5
};

// Object: Enum GPGameplay.ESkillButtonState
enum class ESkillButtonState : uint8_t
{
	ESB_Normal = 0,
	ESB_Cancel = 1,
	ESB_Activate = 2,
	ESB_Disable = 3,
	ESB_Slot1 = 4,
	ESB_Slot2 = 5,
	ESB_Fire = 6,
	ESB_MAX = 7
};

// Object: Enum GPGameplay.ECharacterSkillAbilityMask
enum class ECharacterSkillAbilityMask : uint8_t
{
	None = 0,
	CanMove = 1,
	CanRotate = 2,
	CanCharacterRotate = 3,
	CanCrouch = 4,
	CanProne = 5,
	CanJump = 6,
	CanVault = 7,
	CanReload = 8,
	CanAimOn = 9,
	CanUseItem = 10,
	CanOperate = 11,
	CanLooting = 12,
	CanDetectInteractor = 13,
	CanDetectRescue = 14,
	CanUserChangeXPP = 15,
	CanDiscardOrEquipWeapon = 16,
	CanSwitchHelmetMask = 17,
	PauseSwitchHelmetMask = 18,
	CanFire = 19,
	CanDrive = 20,
	CanPlayTacticalAction = 21,
	CanClimbLadder = 22,
	CanUseTelescope = 23,
	CanChangeWeaponMode = 24,
	CanShowInteractUI = 25,
	CanLean = 26,
	CanBeHit = 27,
	CanUseSkill = 28,
	CanAssassinate = 29,
	CanCarrybody = 30,
	CanParachute = 31,
	CanSlidingTackle = 32,
	CanUseZipline = 33,
	CanAutoChangeClip = 34,
	CanWeaponInspect = 35,
	CanHighValueItemInspect = 36,
	CanWeaponBipodDeploy = 37,
	CanNotBlockFriend = 38,
	CanStandUp = 39,
	CanProneMove = 40,
	CanProneStandUp = 41,
	CanSkillSwtichWeapon = 42,
	CanWeaponBolt = 43,
	CanZoom = 44,
	CanSwitchWeapon = 45,
	CanPlayMarkingAnim = 46,
	CanFirefighting = 47,
	CanApplySpray = 48,
	CanPlayOneHandedGesture = 49,
	CanPlayTwoHandedGesture = 50,
	CanSprint = 51,
	CanBeBreakByOtherSkill = 52,
	All = 53,
	ECharacterSkillAbilityMask_MAX = 54
};

// Object: Enum GPGameplay.EFlowDataType
enum class EFlowDataType : uint8_t
{
	None = 0,
	Props = 1,
	ActiveSKill = 2,
	Passive = 3,
	EFlowDataType_MAX = 4
};

// Object: Enum GPGameplay.ESkillLogicType
enum class ESkillLogicType : uint8_t
{
	None = 0,
	Assault = 1,
	Support = 2,
	Scout = 3,
	Engineer = 4,
	Support101_SkillSmoke = 5,
	Support101_ItemSmoke = 6,
	Support101_Gun = 7,
	Item = 8,
	TestAbility = 9,
	RecycleMine = 10,
	ActivaMine = 11,
	ESkillLogicType_MAX = 12
};

// Object: Enum GPGameplay.ESkillActorEvent
enum class ESkillActorEvent : uint8_t
{
	Idle = 0,
	Fire = 1,
	BeginEquipWeapon = 2,
	EndEquipWeapon = 3,
	WeaponChanged = 4,
	ESkillActorEvent_MAX = 5
};

// Object: Enum GPGameplay.ESkillDragMode
enum class ESkillDragMode : uint8_t
{
	None = 0,
	ESkillDragMode_MAX = 1
};

// Object: Enum GPGameplay.ESkillKeyStatus
enum class ESkillKeyStatus : uint8_t
{
	SKILL_STATUS_UNKNOW = 0,
	SKILL_STATUS_READY = 1,
	SKILL_STATUS_PRECAST = 2,
	SKILL_STATUS_CASTING = 3,
	SKILL_STATUS_AFTERCAST = 4,
	SKILL_STATUS_FINISH = 5,
	SKILL_STATUS_COOLING = 6,
	SKILL_STATUS_CHARGING = 7,
	SKILL_STATUS_PREPARING = 8,
	SKILL_STATUS_MAX = 9
};

// Object: Enum GPGameplay.ESkillRecycleType
enum class ESkillRecycleType : uint8_t
{
	None = 0,
	SuppressionMine = 1,
	AntiTankMine = 2,
	ClaymoreMine = 3,
	SentryHive = 4,
	IntelligentSmoke = 5,
	ESkillRecycleType_MAX = 6
};

// Object: Enum GPGameplay.ESkillInterruptReason
enum class ESkillInterruptReason : uint8_t
{
	None = 0,
	InWater = 1,
	ESkillInterruptReason_MAX = 2
};

// Object: Enum GPGameplay.ESkillUIState
enum class ESkillUIState : uint8_t
{
	UIState_Undefine = 0,
	UIState_Ready = 1,
	UIState_Using = 2,
	UIState_CDing = 3,
	UIState_Disable = 4,
	UIState_Forbit = 5,
	UIState_StateDisable = 6,
	UIState_Score = 7,
	UIState_CampNum = 8,
	UIState_UseNoReady = 9,
	UIState_TemplateNoReady = 10,
	UIState_OtherSkill = 11,
	UIState_Blocked = 12,
	UIState_SwitchWeapon = 13,
	UIState_ZoomWeapon = 14,
	UIState_NoSkill = 15,
	UIState_NoCharacter = 16,
	UIState_TakeDamgeBreak = 17,
	UIState_FireBreak = 18,
	UIState_TeamNum = 19,
	UIState_Sector = 20,
	UIState_LieDownForbidSmoke = 21,
	UIState_UnderWater = 22,
	UIState_OnWater = 23,
	UIState_AirDropVehicle = 24,
	UIState_LimitUse = 25,
	UIState_NoTarget = 26,
	UIState_MAX = 27
};

// Object: Enum GPGameplay.EThreatShapeType
enum class EThreatShapeType : uint8_t
{
	Sphere = 0,
	Box = 1,
	EThreatShapeType_MAX = 2
};

// Object: Enum GPGameplay.EThreatMarkerType
enum class EThreatMarkerType : uint8_t
{
	Origin = 0,
	Screen = 1,
	EThreatMarkerType_MAX = 2
};

// Object: Enum GPGameplay.EThreatCampType
enum class EThreatCampType : uint8_t
{
	Self = 0,
	SameTeam = 1,
	SameCamp = 2,
	Enemy = 3,
	EThreatCampType_MAX = 4
};

// Object: Enum GPGameplay.ESlideBreakType
enum class ESlideBreakType : uint8_t
{
	None = 0,
	SlideBreak_Jump = 1,
	SlideBreak_Crouch = 2,
	ESlideBreakType_MAX = 3
};

// Object: Enum GPGameplay.ECharingSlotState
enum class ECharingSlotState : uint8_t
{
	Normal = 0,
	Counting = 1,
	Pause = 2,
	Disable = 3,
	ECharingSlotState_MAX = 4
};

// Object: Enum GPGameplay.ESoundVisualizationVerticalType
enum class ESoundVisualizationVerticalType : uint8_t
{
	Upper = 0,
	Middle = 1,
	Lower = 2,
	ESoundVisualizationVerticalType_MAX = 3
};

// Object: Enum GPGameplay.EMovementRelatedSpringArmState
enum class EMovementRelatedSpringArmState : uint8_t
{
	ESpringArmState_None = 0,
	ESpringArmState_Default = 1,
	ESpringArmState_Crouch = 2,
	ESpringArmState_Prone = 3,
	ESpringArmState_Swim = 4,
	ESpringArmState_Vault = 5,
	ESpringArmState_SlidingTackle = 6,
	ESpringArmState_Parachute = 7,
	ESpringArmState_FPP = 8,
	ESpringArmState_TPPToFPP = 9,
	ESpringArmState_BeCarryBySomeOne = 10,
	ESpringArmState_LeftLeanPeek = 11,
	ESpringArmState_RightLeanPeek = 12,
	ESpringArmState_NPCTalk = 13,
	ESpringArmState_Error = 14,
	ESpringArmState_Emote = 15,
	ESpringArmState_MAX = 16
};

// Object: Enum GPGameplay.EVoiceOverTriggerType
enum class EVoiceOverTriggerType : uint8_t
{
	None = 0,
	OverlapTrigger = 1,
	InteractTrigger = 2,
	EVoiceOverTriggerType_MAX = 3
};

// Object: Enum GPGameplay.ETacticalActionType
enum class ETacticalActionType : uint8_t
{
	None = 0,
	RESPECT = 1,
	WINGCHUN = 2,
	ROCKPAPERSCISSORS = 3,
	ETacticalActionType_MAX = 4
};

// Object: Enum GPGameplay.EVaultEndMoveType
enum class EVaultEndMoveType : uint8_t
{
	EVaultEndMove_Walking = 0,
	EVaultEndMove_Falling = 1,
	EVaultEndMove_MAX = 2
};

// Object: Enum GPGameplay.ETriggerVaultType
enum class ETriggerVaultType : uint8_t
{
	ETriggerVault_None = 0,
	ETriggerVault_SprintAutoVault = 1,
	ETriggerVault_MAX = 2
};

// Object: Enum GPGameplay.EVaultAnimType
enum class EVaultAnimType : uint8_t
{
	EVaultAnim_None = 0,
	EVA_StepOn = 1,
	EVA_Vault = 2,
	EVA_Climb = 3,
	EVA_ClimbSwim = 4,
	EVaultAnimType_MAX = 5
};

// Object: Enum GPGameplay.EObstacleHeightType
enum class EObstacleHeightType : uint8_t
{
	EObstacleHeight_None = 0,
	EObstacleHeight_60 = 1,
	EObstacleHeight_90 = 2,
	EObstacleHeight_140 = 3,
	EObstacleHeight_180 = 4,
	EObstacleHeight_Max = 5
};

// Object: Enum GPGameplay.EClimbVaultFailedReason
enum class EClimbVaultFailedReason : uint8_t
{
	EChoice_None = 0,
	TouchAngle = 1,
	ObstacleHeight = 2,
	ApexPoint = 3,
	ObstacleAbruptSlope = 4,
	ObstacleWidth = 5,
	CollideOverHead = 6,
	EClimbVaultFailedReason_MAX = 7
};

// Object: Enum GPGameplay.EClimbVaultChoice
enum class EClimbVaultChoice : uint8_t
{
	EChoice_None = 0,
	EChoice_Climb = 1,
	EChoice_Vault = 2,
	EChoice_MAX = 3
};

// Object: Enum GPGameplay.EClimbLadderFixTransformType
enum class EClimbLadderFixTransformType : uint8_t
{
	EClimbLadderFix_DownStart = 0,
	EClimbLadderFix_DownEnd = 1,
	EClimbLadderFix_TopStart = 2,
	EClimbLadderFix_TopEnd = 3,
	EClimbLadderFix_Nearly = 4,
	EClimbLadderFix_MAX = 5
};

// Object: Enum GPGameplay.EClimbLadderCheckType
enum class EClimbLadderCheckType : uint8_t
{
	EClimbLadderCheck_None = 0,
	EClimbLadderCheck_DownEnter = 1,
	EClimbLadderCheck_DownExit = 2,
	EClimbLadderCheck_TopEnter = 3,
	EClimbLadderCheck_TopExit = 4,
	EClimbLadderCheck_JumpEnter = 5,
	EClimbLadderCheck_JumpExit = 6,
	EClimbLadderCheck_Cancel = 7,
	EClimbLadderCheck_MAX = 8
};

// Object: Enum GPGameplay.EVehicleSpawnMethod
enum class EVehicleSpawnMethod : uint8_t
{
	EVSM_None = 0,
	EVSM_AirDrop = 1,
	EVSM_Deployment = 2,
	EVSM_MAX = 3
};

// Object: Enum GPGameplay.EDrawSkillProjectileType
enum class EDrawSkillProjectileType : uint8_t
{
	EDSPT_None = 0,
	EDSPT_H = 1,
	EDSPT_V = 2,
	EDSPT_MAX = 3
};

// Object: Enum GPGameplay.EVehicleExtraPartType
enum class EVehicleExtraPartType : uint8_t
{
	NONE = 0,
	WEAPON = 1,
	SKILL = 2,
	SKIN = 3,
	EVehicleExtraPartType_MAX = 4
};

// Object: Enum GPGameplay.EVehicleResetType
enum class EVehicleResetType : uint8_t
{
	NONE = 0,
	STATUS = 1,
	PHYSICS = 2,
	AI = 4,
	PASSENGERS = 8,
	ALL = 15,
	EVehicleResetType_MAX = 16
};

// Object: Enum GPGameplay.EAnimVehicleSeatType
enum class EAnimVehicleSeatType : uint8_t
{
	Sitting = 0,
	Stand = 1,
	EAnimVehicleSeatType_MAX = 2
};

// Object: Enum GPGameplay.EWeaponStage
enum class EWeaponStage : uint8_t
{
	Dormancy = 0,
	DeActive = 1,
	Active = 2,
	EWeaponStage_MAX = 3
};

// Object: Enum GPGameplay.EWeaponInputOwner
enum class EWeaponInputOwner : uint8_t
{
	None = 0,
	Left = 1,
	Right = 2,
	EWeaponInputOwner_MAX = 3
};

// Object: Enum GPGameplay.EZiplineHudStatus
enum class EZiplineHudStatus : uint8_t
{
	None = 0,
	Hidden = 1,
	DisplayGetOn = 2,
	DisplayGetOff = 3,
	EZiplineHudStatus_MAX = 4
};

// Object: Enum GPGameplay.EExplicitDisableReason
enum class EExplicitDisableReason : uint8_t
{
	CarrayBody = 0,
	ClimbLadder = 1,
	PassiveMove = 2,
	ResuceAction = 3,
	ResucePrecise = 4,
	Vehicle = 5,
	VehicleControl = 6,
	Helicopter = 7,
	RagDoll = 8,
	Rope = 9,
	Assassinate = 10,
	Movement = 11,
	DragRescue = 12,
	Max = 13
};

// Object: Enum GPGameplay.EIntCharacterSnap
enum class EIntCharacterSnap : uint8_t
{
	None = 0,
	SnapToLatest = 1,
	EIntCharacterSnap_MAX = 2
};

// Object: Enum GPGameplay.EScopeZoomType
enum class EScopeZoomType : uint8_t
{
	ScopeZoomTypeDefault = 0,
	ScopeZoomTypeSideAiming = 1,
	ScopeZoomTypeMax = 2,
	EScopeZoomType_MAX = 3
};

// Object: Enum GPGameplay.ELowRepPriorityActorType
enum class ELowRepPriorityActorType : uint8_t
{
	None = 0,
	GameState = 1,
	Camp0DataActor = 2,
	Camp1DataActor = 3,
	ELowRepPriorityActorType_MAX = 4
};

// Object: Enum GPGameplay.EMaterialSequencerPlayerPlayStatus
enum class EMaterialSequencerPlayerPlayStatus : uint8_t
{
	None = 0,
	Playing = 1,
	EMaterialSequencerPlayerPlayStatus_MAX = 2
};

// Object: Enum GPGameplay.EMaterialSequencerNotifyType
enum class EMaterialSequencerNotifyType : uint8_t
{
	None = 0,
	Name = 1,
	EMaterialSequencerNotifyType_MAX = 2
};

// Object: Enum GPGameplay.EMaterialSequenceParamsType
enum class EMaterialSequenceParamsType : uint8_t
{
	Float = 0,
	LinearColor = 1,
	Vector = 2,
	EMaterialSequenceParamsType_MAX = 3
};

// Object: Enum GPGameplay.EWeaponAdapterItemType
enum class EWeaponAdapterItemType : uint8_t
{
	NONE = 0,
	Foregrip = 1,
	Handguard = 2,
	Receiver = 3,
	PistolGrip = 4,
	Stock = 5,
	GunBarral = 6,
	TacticalDevices = 7,
	EWeaponAdapterItemType_MAX = 8
};

// Object: Enum GPGameplay.EWeaponAdapterHandIKPoseType
enum class EWeaponAdapterHandIKPoseType : uint8_t
{
	NONE = 0,
	FPP = 1,
	TPP = 2,
	FPPWithWidget = 3,
	TPPWithWidget = 4,
	FPPNear = 5,
	FPPFar = 6,
	FPPNearWithWidget = 7,
	FPPFarWithWidget = 8,
	FPP_R = 9,
	TPP_R = 10,
	EWeaponAdapterHandIKPoseType_MAX = 11
};

// Object: Enum GPGameplay.EMagazineAnimType
enum class EMagazineAnimType : uint8_t
{
	Normal = 0,
	Long = 1,
	Drum = 2,
	Special = 3,
	EMagazineAnimType_MAX = 4
};

// Object: Enum GPGameplay.EMagazineType
enum class EMagazineType : uint8_t
{
	NONE = 0,
	NormalMagazine = 1,
	CLMagazine = 2,
	EMagazineType_MAX = 3
};

// Object: Enum GPGameplay.ETextureType
enum class ETextureType : uint8_t
{
	NONE = 0,
	BaseColorMap = 1,
	MACMap = 2,
	NRMap = 3,
	ETextureType_MAX = 4
};

// Object: Enum GPGameplay.EWeaponPartAnimFunctionIKType
enum class EWeaponPartAnimFunctionIKType : uint8_t
{
	NONE = 0,
	LeftIK = 1,
	RightIK = 2,
	EWeaponPartAnimFunctionIKType_MAX = 3
};

// Object: Enum GPGameplay.EWeaponPartAnimFunctionType
enum class EWeaponPartAnimFunctionType : uint8_t
{
	NONE = 0,
	IK_LeftHand = 1,
	Anim_MagBulletChain = 2,
	Anim_BipodUpDown = 3,
	Anim_Overide = 4,
	Anim_Sco = 5,
	Anim_TransparentMag = 6,
	EWeaponPartAnimFunctionType_MAX = 7
};

// Object: Enum GPGameplay.EWeaponPartFunctionType
enum class EWeaponPartFunctionType : uint8_t
{
	NONE = 0,
	StaticAttributeModify = 2,
	StaticAttributeReplace = 3,
	StaticArrayAttributeModify = 4,
	EWeaponPartFunctionType_MAX = 5
};

// Object: Enum GPGameplay.EWeaponPartFunctionDynamicType
enum class EWeaponPartFunctionDynamicType : uint8_t
{
	NONE = 0,
	AlwaysEffective = 1,
	TacticalEffective = 2,
	EWeaponPartFunctionDynamicType_MAX = 3
};

// Object: Enum GPGameplay.EModularWeaponDescCompare
enum class EModularWeaponDescCompare : uint8_t
{
	None = 0,
	Adapter = 1,
	ExtraModel = 2,
	Skin = 3,
	Pendant = 4,
	SolutionCompare = 5,
	AllCompare = 6,
	EModularWeaponDescCompare_MAX = 7
};

// Object: Enum GPGameplay.EModularPartNodeFlagState
enum class EModularPartNodeFlagState : uint8_t
{
	Default = 0,
	Simulate = 1,
	RelationSimulate = 2,
	RelationVirutalSimulate = 4,
	EModularPartNodeFlagState_MAX = 5
};

// Object: Enum GPGameplay.EModularWeaponBuildStage
enum class EModularWeaponBuildStage : uint8_t
{
	None = 0,
	WaitLoadDynamicPartsAsset = 1,
	DynamicPartsAssetLoading = 2,
	DynamicPartsAssetLoadFinished = 3,
	ModularBuild = 4,
	EModularWeaponBuildStage_MAX = 5
};

// Object: Enum GPGameplay.EModularWeaponMergeStage
enum class EModularWeaponMergeStage : uint8_t
{
	None = 0,
	WaitLoadAllPartsAsset = 1,
	AllPartsAssetLoading = 2,
	AllPartsAssetLoadFnished = 3,
	MeshMerge = 4,
	EModularWeaponMergeStage_MAX = 5
};

// Object: Enum GPGameplay.EMysticalWeaponMaterialParamType
enum class EMysticalWeaponMaterialParamType : uint8_t
{
	None = 0,
	Scalar = 1,
	Vector = 2,
	Color = 3,
	Texture = 4,
	EMysticalWeaponMaterialParamType_MAX = 5
};

// Object: Enum GPGameplay.ETuneSliderType
enum class ETuneSliderType : uint8_t
{
	Continue = 0,
	Discrete = 1,
	ETuneSliderType_MAX = 2
};

// Object: Enum GPGameplay.ETuneMeshType
enum class ETuneMeshType : uint8_t
{
	None = 0,
	Position = 1,
	Rotation = 2,
	ETuneMeshType_MAX = 3
};

// Object: Enum GPGameplay.EWeaponVoidPartsModelConditionType
enum class EWeaponVoidPartsModelConditionType : uint8_t
{
	None = 0,
	Socket = 1,
	AdapterType = 2,
	ItemId = 3,
	EWeaponVoidPartsModelConditionType_MAX = 4
};

// Object: Enum GPGameplay.EWeaponPartMeshType
enum class EWeaponPartMeshType : uint8_t
{
	Mesh1p = 0,
	Mesh3P = 1,
	MeshUI = 2,
	EWeaponPartMeshType_MAX = 3
};

// Object: Enum GPGameplay.FPartAddtionRuleType
enum class EFPartAddtionRuleType : uint8_t
{
	None = 0,
	Addtive = 1,
	Replace = 2,
	FPartAddtionRuleType_MAX = 3
};

// Object: Enum GPGameplay.EMaterialParameterType
enum class EMaterialParameterType : uint8_t
{
	Vector = 0,
	Scalar = 1,
	Texture = 2,
	EMaterialParameterType_MAX = 3
};

// Object: Enum GPGameplay.EApperanceModifyType
enum class EApperanceModifyType : uint8_t
{
	None = 0,
	AppendModel = 1,
	EApperanceModifyType_MAX = 2
};

// Object: Enum GPGameplay.EWeaponExtraModelConditionType
enum class EWeaponExtraModelConditionType : uint8_t
{
	None = 0,
	Socket = 1,
	AdapterType = 2,
	ItemId = 3,
	EWeaponExtraModelConditionType_MAX = 4
};

// Object: Enum GPGameplay.EWeaponExtraModelVisibility
enum class EWeaponExtraModelVisibility : uint8_t
{
	Visible = 0,
	Hidden = 1,
	EWeaponExtraModelVisibility_MAX = 2
};

// Object: Enum GPGameplay.EFxFuntionType
enum class EFxFuntionType : uint8_t
{
	ReplaceMuzzleFlashFx = 0,
	ReplaceShellDropFx = 1,
	ReplaceMuzzleTrailFx = 2,
	ReplaceRealBulletTrailFx = 3,
	ReplaceVirtualBulletTrailFx = 4,
	ReplaceBulletTrailFx = 5,
	ReplaceHitFx = 6,
	ReplaceMuzzleLightLevel = 7,
	AddMuzzleLightLevel = 8,
	EFxFuntionType_MAX = 9
};

// Object: Enum GPGameplay.EAssemblerAudioType
enum class EAssemblerAudioType : uint8_t
{
	None = 0,
	Receiver = 1,
	GunBarral = 2,
	PistolGrip = 3,
	Stock = 4,
	Handguard = 5,
	Sight = 11,
	Magazine = 12,
	Muzzle = 13,
	Foregrip = 14,
	Underbarrel = 15,
	TacticalDevices = 16,
	Bipod = 17,
	ForSight = 18,
	RearSight = 19,
	SightBase = 21,
	Ammo = 99,
	Pop_Gun = 201,
	Select_Gun = 202,
	EAssemblerAudioType_MAX = 203
};

// Object: Enum GPGameplay.ERule_Opt
enum class ERule_Opt : uint8_t
{
	And = 0,
	Or = 1,
	ERule_MAX = 2
};

// Object: Enum GPGameplay.EAnimItemOverrideRuleType
enum class EAnimItemOverrideRuleType : uint8_t
{
	E_WeaponIDRule = 0,
	E_PartIDRule = 1,
	E_SkinRule = 2,
	E_HasPartType = 3,
	E_MAX = 4
};

// Object: Enum GPGameplay.EForbidLeftHandIKType
enum class EForbidLeftHandIKType : uint8_t
{
	EOutReachDistance = 0,
	EHaveAdapterInSocket = 1,
	EAttachInSocket = 2,
	EForbidLeftHandIKType_MAX = 3
};

// Object: Enum GPGameplay.EAimDownSightsState
enum class EAimDownSightsState : uint8_t
{
	InVisible = 0,
	Special_Pose = 1,
	Constant = 2,
	EAimDownSightsState_MAX = 3
};

// Object: Enum GPGameplay.EPartFunctionTag
enum class EPartFunctionTag : uint16_t
{
	NONE = 0,
	SupportSideAiming = 1,
	All = 255,
	EPartFunctionTag_MAX = 256
};

// Object: Enum GPGameplay.EAssemblerCameraType
enum class EAssemblerCameraType : uint8_t
{
	LOCK = 0,
	ROTATE_ROOT = 1,
	ROTATE_ARROUND = 2,
	AUTO_ROTATE = 3,
	EAssemblerCameraType_MAX = 4
};

// Object: Enum GPGameplay.EAssemblerCamPoint
enum class EAssemblerCamPoint : uint8_t
{
	POINT_DEFAULT = 0,
	POINT_GUN_SELECTED = 1,
	POINT_GUN_DISPLAY = 2,
	POINT_MUZZLE = 3,
	POINT_BARREL = 4,
	POINT_HANDGUARD = 5,
	POINT_SIGHT = 6,
	POINT_MAGAZINE = 7,
	POINT_GRIP = 8,
	POINT_STOCK = 9,
	POINT_UP_RAIL = 10,
	POINT_DOWN_RAIL = 11,
	POINT_LEFT_RAIL = 12,
	POINT_RIGHT_RAIL = 13,
	POINT_BIPOD = 14,
	POINT_GUN_PRESET = 15,
	POINT_SPECIAL = 16,
	POINT_CONNECTOR = 17,
	POINT_CHEEKPAD = 18,
	POINT_PISTOLGRIP_PATCH = 19,
	POINT_SCO_SECONDARY = 20,
	POINT_HANU_POINT = 21,
	POINT_HAND_POINT = 22,
	POINT_HANL_POINT = 23,
	POINT_HANR_POINT = 24,
	POINT_BARBIP_POINT = 25,
	POINT_HANKIT_POINT = 26,
	POINT_STOKIT_POINT = 27,
	POINT_BARKIT_POINT = 28,
	POINT_SCOU_POINT = 29,
	POINT_RISER_POINT = 30,
	POINT_FOR_POINT = 31,
	POINT_COMMON_POINT = 32,
	POINT_GRIPBASS_POINT = 33,
	POINT_MAGBASS_POINT = 34,
	POINT_FLASHKILL_POINT = 35,
	POINT_HANDGUARDU_POINT = 36,
	POINT_GAS_POINT = 37,
	POINT_HAMMER_POINT = 38,
	POINT_TRIGGER_POINT = 39,
	POINT_HYDRASCO_POINT = 50,
	POINT_SHIELD_POINT = 51,
	POINT_BOLT_POINT = 52,
	POINT_GISG2_POINT = 53,
	POINT_HANDLE_POINT = 54,
	POINT_BOWSTRING_POINT = 55,
	POINT_BOWGRIP_POINT = 56,
	POINT_BOWLIMB_POINT = 57,
	POINT_BOWSCOPE_POINT = 58,
	POINT_ARROWREST_POINT = 59,
	POINT_STABILIZER_POINT = 60,
	POINT_BOWRELEASE_POINT = 61,
	POINT_LEVER_POINT = 62,
	POINT_SHWLLHOLDER_POINT = 63,
	POINT_PENDANT_POINT = 90,
	POINT_GUN_SOLUTION = 100,
	POINT_GUN_SOL_INSPECTOR = 200,
	POINT_GUN_DISPLAY_FEATURE1 = 201,
	POINT_GUN_SKIN_DEFAULT = 202,
	POINT_GUN_FINETUNE = 203,
	POINT_GUN_UPGRADE = 204,
	NONE = 205,
	EAssemblerCamPoint_MAX = 206
};

// Object: Enum GPGameplay.EPerkEffectAdditiveLogic
enum class EPerkEffectAdditiveLogic : uint8_t
{
	None = 0,
	DurationAndCD = 1,
	TriggerIcon = 2,
	Max = 3
};

// Object: Enum GPGameplay.EPerkEffectTriggerCond
enum class EPerkEffectTriggerCond : uint8_t
{
	None = 0,
	LowHealth = 1,
	Max = 2
};

// Object: Enum GPGameplay.EPerkSharedEffectType
enum class EPerkSharedEffectType : uint8_t
{
	None = 0,
	ZoyaSOL = 1,
	ZoyaBreakThrough = 2,
	Max = 3
};

// Object: Enum GPGameplay.EPerkSharedEffectSource
enum class EPerkSharedEffectSource : uint8_t
{
	None = 0,
	Zoya = 1,
	Max = 2
};

// Object: Enum GPGameplay.EPerkSpecialEffectType
enum class EPerkSpecialEffectType : uint8_t
{
	None = 0,
	StaminaNotLose = 1,
	SuperDash = 2,
	ExSkillCoolDownReduce = 3,
	ArmdedForceItem1SkillCoolDownReduce = 4,
	ArmdedForceItem2SkillCoolDownReduce = 5,
	AimingAdverseResistance = 6,
	CrouchOrSilentWalkSpeedUp = 7,
	CureBodyWhenRescueSucceed = 8,
	Max = 9
};

// Object: Enum GPGameplay.EPerkEffectType
enum class EPerkEffectType : uint8_t
{
	AddBuff = 0,
	AddSkill = 1,
	TriggerSpecialEffect = 2,
	Max = 3
};

// Object: Enum GPGameplay.EBuffEntityTriggerIconType
enum class EBuffEntityTriggerIconType : uint8_t
{
	None = 0,
	EXSkillCooling = 1,
	BattleFieldPropSkill1Cooling = 2,
	BattleFieldPropSkill2Cooling = 3,
	CrouchOrSilentWalk = 4,
	Max = 5
};

// Object: Enum GPGameplay.EQuickAccessActionType
enum class EQuickAccessActionType : uint8_t
{
	ConsoleCommand = 0,
	ConsoleVar = 1,
	ExecLuaScript = 2,
	EQuickAccessActionType_MAX = 3
};

// Object: Enum GPGameplay.EQuickAccessSideMenuParamType
enum class EQuickAccessSideMenuParamType : uint8_t
{
	InputText = 0,
	StaticCombo = 1,
	DataTableDynamicCombo = 2,
	EQuickAccessSideMenuParamType_MAX = 3
};

// Object: Enum GPGameplay.EScopeLocationType
enum class EScopeLocationType : uint8_t
{
	Undefined = 0,
	Main = 1,
	Top = 2,
	Side = 3,
	Sloping = 4,
	EScopeLocationType_MAX = 5
};

// Object: Enum GPGameplay.EShadowTransferType
enum class EShadowTransferType : uint8_t
{
	FromLeft = 0,
	FromRight = 1,
	EShadowTransferType_MAX = 2
};

// Object: Enum GPGameplay.EScopeCompositeType
enum class EScopeCompositeType : uint8_t
{
	CompositeUpDown = 0,
	CompositeLeftRight = 1,
	CompositeFrontBack = 2,
	EScopeCompositeType_MAX = 3
};

// Object: Enum GPGameplay.ECrosshairType
enum class ECrosshairType : uint8_t
{
	Crosshair_None = 0,
	Crosshair_Holo = 1,
	Crosshair_RedDot = 2,
	Crosshair_MAX = 3
};

// Object: Enum GPGameplay.ESoftState
enum class ESoftState : uint8_t
{
	Custom = 0,
	EFiring = 1,
	EReload = 2,
	ESoftState_MAX = 3
};

// Object: Enum GPGameplay.ERuntimeQualityLevel
enum class ERuntimeQualityLevel : uint8_t
{
	High = 0,
	Medium = 1,
	Low = 2,
	Minimal = 3,
	ERuntimeQualityLevel_MAX = 4
};

// Object: Enum GPGameplay.ERuntimeImportanceLevel
enum class ERuntimeImportanceLevel : uint8_t
{
	Critical = 0,
	High = 1,
	Normal = 2,
	Low = 3,
	ERuntimeImportanceLevel_MAX = 4
};

// Object: Enum GPGameplay.ERuntimeGameMode
enum class ERuntimeGameMode : uint8_t
{
	SOL = 0,
	MP = 1,
	SafeHouse = 2,
	All = 3,
	ERuntimeGameMode_MAX = 4
};

// Object: Enum GPGameplay.ERuntimeTagMatchMask
enum class ERuntimeTagMatchMask : uint32_t
{
	None = 0,
	XPPType = 1,
	PoseType = 2,
	GameMode = 4,
	PartType = 8,
	PCExclusive = 16,
	ImportanceLevel = 32,
	QualityLevel = 64,
	IsDiffReload = 128,
	All = 65535,
	ERuntimeTagMatchMask_MAX = 65536
};

// Object: Enum GPGameplay.EAbilityEntitySysteType
enum class EAbilityEntitySysteType : uint8_t
{
	Ability = 0,
	SysteTypeMax = 1,
	EAbilityEntitySysteType_MAX = 2
};

// Object: Enum GPGameplay.ESupportType
enum class ESupportType : uint8_t
{
	HealthPack = 0,
	ArmorPack = 1,
	ESupportType_MAX = 2
};

// Object: Enum GPGameplay.ESwitchWeaponOperation
enum class ESwitchWeaponOperation : uint8_t
{
	OP_Start = 0,
	OP_ActivatePending = 1,
	OP_Cancel = 2,
	OP_MAX = 3
};

// Object: Enum GPGameplay.EClassRepNodeMapping
enum class EClassRepNodeMapping : uint8_t
{
	NotRouted = 0,
	RelevantAllConnections = 1,
	RelevantToTeam = 2,
	RelevantToClientProxy = 3,
	RelevantToJailBreakDeadBody = 4,
	Spatialize_Static = 5,
	Spatialize_Dynamic = 6,
	Spatialize_Dormancy = 7,
	RelevantToEggGoldenNest = 8,
	IsNetRelevantFor = 9,
	RelevantToQuestActor = 10,
	EClassRepNodeMapping_MAX = 11
};

// Object: Enum GPGameplay.EVehiclePartType
enum class EVehiclePartType : uint8_t
{
	NONE = 0,
	BODY = 1,
	ENGINE_MAX = 2,
	WEAPON = 3,
	LEFT_TRACK = 4,
	RIGHT_TRACK = 5,
	ANTI_EXPLOSION_ARMOR = 6,
	VEHICLE_PART_TYPE_MAX = 7,
	EVehiclePartType_MAX = 8
};

// Object: Enum GPGameplay.EWeaponAdapterType
enum class EWeaponAdapterType : uint8_t
{
	Receiver = 0,
	GunBarral = 1,
	PistolGrip = 2,
	Stock = 3,
	Handguard = 4,
	Sight = 5,
	Magazine = 6,
	Muzzle = 7,
	Foregrip = 8,
	Underbarrel = 9,
	TacticalDevices = 10,
	Bipod = 11,
	ForSight = 12,
	RearSight = 13,
	SightBase = 14,
	Special = 15,
	Silencer = 16,
	EWeaponAdapterType_MAX = 17
};

// Object: Enum GPGameplay.EBurnningPotState
enum class EBurnningPotState : uint8_t
{
	StateIdle = 0,
	StateFiring = 1,
	StateCutting = 2,
	StateDeactive = 3,
	EBurnningPotState_MAX = 4
};

// Object: Enum GPGameplay.EWeaponAmmoLogicType
enum class EWeaponAmmoLogicType : uint8_t
{
	None = 0,
	CommonAmmo = 1,
	ItemAmmo = 2,
	EWeaponAmmoLogicType_MAX = 3
};

// Object: Enum GPGameplay.EAddAmmoFailReason
enum class EAddAmmoFailReason : uint8_t
{
	None = 0,
	NoProperWeapon = 1,
	FullCarriedAmmo = 2,
	CanNotAddAmmo = 3,
	NotSupportedAmmoType = 4,
	EAddAmmoFailReason_MAX = 5
};

// Object: Enum GPGameplay.ECharacterLeftArmAnimType
enum class ECharacterLeftArmAnimType : uint8_t
{
	None = 0,
	Scene = 1,
	Weapon = 2,
	ECharacterLeftArmAnimType_MAX = 3
};

// Object: Enum GPGameplay.EWeaponAnimDirectItemType
enum class EWeaponAnimDirectItemType : uint8_t
{
	None = 0,
	FPPMoveF = 1,
	FPPMoveFR = 2,
	FPPMoveFL = 3,
	FPPMoveB = 4,
	FPPMoveBR = 5,
	FPPMoveBL = 6,
	FPPMoveL = 7,
	FPPMoveR = 8,
	TPPMoveF = 9,
	TPPMoveFR = 10,
	TPPMoveFL = 11,
	TPPMoveB = 12,
	TPPMoveBR = 13,
	TPPMoveBL = 14,
	TPPMoveL = 15,
	TPPMoveR = 16,
	EWeaponAnimDirectItemType_MAX = 17
};

// Object: Enum GPGameplay.EWeaponAnimItemType
enum class EWeaponAnimItemType : uint8_t
{
	None = 0,
	FPPDef = 1,
	FPPStand = 2,
	FPPCrouch = 3,
	FPPProne = 4,
	FPPFracture = 5,
	FPPImpendingDeath = 6,
	FPPSwim = 7,
	TPPDef = 8,
	TPPStand = 9,
	TPPCrouch = 10,
	TPPProne = 11,
	TPPFracture = 12,
	TPPImpendingDeath = 13,
	TPPSwim = 14,
	TPPUnderwaterSwim = 15,
	TPPUnderFPPStand = 16,
	TPPUnderFPPCrouch = 17,
	TPPUnderFPPProne = 18,
	TPPUnderFPPFracture = 19,
	TPPUnderFPPImpendingDeath = 20,
	TPPUnderFPPSwim = 21,
	TPPUnderFPPUnderwaterSwim = 22,
	EWeaponAnimItemType_MAX = 23
};

// Object: Enum GPGameplay.EWeaponAnimXPPType
enum class EWeaponAnimXPPType : uint8_t
{
	None = 0,
	Both = 1,
	FPP = 2,
	TPPor3P = 3,
	EWeaponAnimXPPType_MAX = 4
};

// Object: Enum GPGameplay.ERuntimeOverrideAnimDatType
enum class ERuntimeOverrideAnimDatType : uint8_t
{
	None = 0,
	WeaponAnimBasePos = 1,
	WeaponAnimBS = 2,
	WeaponAnimOperaction = 3,
	Max = 4
};

// Object: Enum GPGameplay.EWeaponAnimDataTableType
enum class EWeaponAnimDataTableType : uint8_t
{
	None = 0,
	WeaponAnimBasePos = 1,
	WeaponAnimOperaction = 2,
	SpecialWeaponAnim = 3,
	AiAnimPosTable = 4,
	InWeaponAnimMax = 5,
	WeaponPartAnim = 6,
	CharacterLeftArm = 7,
	HallCharacterAnim = 8,
	HallWeaponPartAnim = 9,
	Max = 10
};

// Object: Enum GPGameplay.ERequestAnimType
enum class ERequestAnimType : uint8_t
{
	EWeaponAnim = 0,
	EItemAnim = 1,
	EBasicAnim = 2,
	ERequestAnimType_MAX = 3
};

// Object: Enum GPGameplay.EGunSwayType
enum class EGunSwayType : uint8_t
{
	Common = 0,
	Vehicle = 1,
	EGunSwayType_MAX = 2
};

// Object: Enum GPGameplay.EWeaponEffectType
enum class EWeaponEffectType : uint8_t
{
	None = 0,
	MuzzleFlash = 1,
	ShellDrop = 2,
	MuzzleTrail = 3,
	BulletTrail = 4,
	ModelFx = 5,
	OverHeatTrail = 6,
	EWeaponEffectType_MAX = 7
};

// Object: Enum GPGameplay.EWeaponDisplayMode
enum class EWeaponDisplayMode : uint8_t
{
	None = 0,
	FirstPerson = 1,
	ThirdPerson = 2,
	ThirdPersonOther = 3,
	EWeaponDisplayMode_MAX = 4
};

// Object: Enum GPGameplay.EWeaponHiddenTag
enum class EWeaponHiddenTag : uint8_t
{
	OwnerHidden = 0,
	CarringBody = 1,
	PreciseOperate = 2,
	Redeploy = 3,
	Helicopter = 4,
	Vehicle = 5,
	VaultAndClimb = 6,
	RescuePrecise = 7,
	Assassinate = 8,
	Ability = 9,
	Parachute = 10,
	Interactive = 11,
	ExitCutScene = 12,
	RaiseWatch = 13,
	BeCarryBody = 14,
	LOD = 15,
	BeAssassinate = 16,
	ImpendingDeath = 17,
	ClimbLadder = 18,
	UseItem = 19,
	Perform = 20,
	Firefighting = 21,
	InteractivePutWeapon = 22,
	ShieldAttachBack = 23,
	AnimAttachBack = 24,
	CrowdControl = 25,
	SwimSprint = 26,
	HighValueItemInspect = 27,
	RopePassiveMove = 28,
	RollMove = 29,
	DramaFalling = 30,
	DoubleHandAbility = 31,
	LeftHandAbility = 32,
	RightHandAbility = 33,
	LegAbility = 34,
	SpecialAbility = 35,
	ActionAbility = 36,
	CustomAbility = 37,
	Custom2Ability = 38,
	Custom3Ability = 39,
	PlaceFootballGate = 40,
	AnimHide = 41,
	TagMax = 42,
	EWeaponHiddenTag_MAX = 43
};

// Object: Enum GPGameplay.EWeaponAttributeValueType
enum class EWeaponAttributeValueType : uint8_t
{
	Normal = 0,
	Percentage = 1,
	EWeaponAttributeValueType_MAX = 2
};

// Object: Enum GPGameplay.EAttributeBetterDeterminer
enum class EAttributeBetterDeterminer : uint8_t
{
	None = 0,
	Max = 1,
	Min = 2
};

// Object: Enum GPGameplay.ELimitFormulateType
enum class ELimitFormulateType : uint8_t
{
	None = 0,
	MULT_A_Min = 1,
	MULT_A_Max = 2,
	Final_Min = 3,
	Final_Max = 4,
	ELimitFormulateType_MAX = 5
};

// Object: Enum GPGameplay.EWeaponAttackTriggerMode
enum class EWeaponAttackTriggerMode : uint8_t
{
	OnHit = 0,
	OnExplode = 1,
	Custom = 2,
	EWeaponAttackTriggerMode_MAX = 3
};

// Object: Enum GPGameplay.ETrailInWaterMode
enum class ETrailInWaterMode : uint8_t
{
	ETrailMoveSelf = 1,
	ETrailAttachtoBullet = 2,
	ETrailInWaterMode_MAX = 3
};

// Object: Enum GPGameplay.EProjectileFlyMode
enum class EProjectileFlyMode : uint8_t
{
	FlyMode_PhysicSimulate = 0,
	FlyMode_HitScan = 1,
	FlyMode_HitScanDelay = 2,
	FlyMode_MAX = 3
};

// Object: Enum GPGameplay.EWeaponBoolPropertyType
enum class EWeaponBoolPropertyType : uint8_t
{
	None = 0,
	IsBipodDown = 1,
	IsPowerFlashOn = 2,
	IsTacticalEquipUOn = 3,
	IsTacticalEquipU1On = 4,
	IsTacticalEquipU2On = 5,
	IsTacticalEquipROn = 6,
	IsTacticalEquipR1On = 7,
	IsTacticalEquipR2On = 8,
	IsTacticalEquipDOn = 9,
	IsTacticalEquipD1On = 10,
	IsTacticalEquipD2On = 11,
	IsTacticalEquipLOn = 12,
	IsTacticalEquipL1On = 13,
	IsTacticalEquipL2On = 14,
	Max = 15
};

// Object: Enum GPGameplay.EVehicleLockType
enum class EVehicleLockType : uint16_t
{
	NONE = 0,
	Terrestrial = 1,
	Aerial = 2,
	All = 255,
	EVehicleLockType_MAX = 256
};

// Object: Enum GPGameplay.EWeaponGunKickTriggerType
enum class EWeaponGunKickTriggerType : uint8_t
{
	EveryFire = 0,
	FirstFireKeep = 1,
	FirstFireLoop = 2,
	EWeaponGunKickTriggerType_MAX = 3
};

// Object: Enum GPGameplay.EWeaponFireShakeWaveform
enum class EWeaponFireShakeWaveform : uint8_t
{
	CosWave = 0,
	SinWave = 1,
	PerlinNoise = 2,
	Curve = 3,
	CosWaveE = 4,
	SinWaveE = 5,
	EWeaponFireShakeWaveform_MAX = 6
};

// Object: Enum GPGameplay.EWeaponFireShakeType
enum class EWeaponFireShakeType : uint8_t
{
	FireBegin = 0,
	FireLoop = 1,
	FireAlways = 2,
	FireRecoil = 3,
	EWeaponFireShakeType_MAX = 4
};

// Object: Enum GPGameplay.EWeaponOpenSightOnFireMode
enum class EWeaponOpenSightOnFireMode : uint8_t
{
	None = 0,
	OpenSightMode_SemiAutomatic = 1,
	OpenSightMode_Automatic = 2,
	OpenSightMode_Sniper = 3,
	OpenSightMode_Missile = 4,
	EWeaponOpenSightOnFireMode_MAX = 5
};

// Object: Enum GPGameplay.EWeaponFireWithSightRealseConfigMode
enum class EWeaponFireWithSightRealseConfigMode : uint8_t
{
	None = 0,
	StopFire_CloseSight = 1,
	OpenFire_Sight = 2,
	EWeaponFireWithSightRealseConfigMode_MAX = 3
};

// Object: Enum GPGameplay.EWeaponFireWithSightPressConfigMode
enum class EWeaponFireWithSightPressConfigMode : uint8_t
{
	None = 0,
	OpenSightWithFire = 1,
	OpenSight = 2,
	EWeaponFireWithSightPressConfigMode_MAX = 3
};

// Object: Enum GPGameplay.EWeaponInputAutoFireMode
enum class EWeaponInputAutoFireMode : uint8_t
{
	None = 0,
	Single = 1,
	Auto = 2,
	EWeaponInputAutoFireMode_MAX = 3
};

// Object: Enum GPGameplay.EWeaponInputRightActionMode
enum class EWeaponInputRightActionMode : uint8_t
{
	None = 0,
	Follow_FireWithSightOpenConfig = 1,
	Follow_FireConfig = 2,
	EWeaponInputRightActionMode_MAX = 3
};

// Object: Enum GPGameplay.EWeaponAdditiveAnimTriggerType
enum class EWeaponAdditiveAnimTriggerType : uint8_t
{
	None = 0,
	Always = 1,
	EveryFire = 2,
	WhileFireOnce = 3,
	WhileFireLoop = 4,
	EndFire = 5,
	EWeaponAdditiveAnimTriggerType_MAX = 6
};

// Object: Enum GPGameplay.EHitEventType_FX
enum class EHitEventType_FX : uint8_t
{
	None = 0,
	KillWithHead = 1,
	KillWithBody = 2,
	HitWithHead = 3,
	HitWithBody = 4,
	HitWithArmor = 5,
	EHitEventType_MAX = 6
};

// Object: Enum GPGameplay.ECrosshairScaleMode
enum class ECrosshairScaleMode : uint8_t
{
	ScaleGap = 0,
	ScaleAll = 1,
	ScaleOverride = 2,
	ECrosshairScaleMode_MAX = 3
};

// Object: Enum GPGameplay.EWeaponDataRecoilType
enum class EWeaponDataRecoilType : uint8_t
{
	WeaponRecoil_DFM = 0,
	WeaponRecoil_Polynomial = 1,
	WeaponRecoil_VelocityModel = 2,
	WeaponRecoil_MAX = 3
};

// Object: Enum GPGameplay.EExplosionType
enum class EExplosionType : uint8_t
{
	None = 0,
	Weapon_Grenade = 1,
	Weapon_RPG_7 = 2,
	Weapon_C4 = 3,
	Weapon_Missile = 4,
	WeaponMelee_Hurt = 5,
	Weapon_3Grenade = 6,
	Vehicle_ArmedPickup = 7,
	Vehicle_Motor = 8,
	Vehicle_TutuCar = 9,
	Vehicle_UNTrunk = 10,
	Vehicle_DarkTideJeep = 11,
	Vehicle_CargoTrunk = 12,
	Vehicle_Drone = 13,
	Tank_Projectile = 14,
	FixedTrackRocket = 15,
	Other_Shell = 16,
	Other_RocketRecycling = 17,
	Type_Large = 18,
	Type_Mid = 19,
	Type_Small = 20,
	Weapon_Point = 21,
	RankSkill_GuidedMissle = 22,
	Other_Debug = 23,
	Max = 24
};

// Object: Enum GPGameplay.EMainAttributeFunctionCurvingType
enum class EMainAttributeFunctionCurvingType : uint8_t
{
	NONE = 0,
	DeltaMapping = 1,
	DeltaMappingThenScale = 2,
	AbsoluteMapping = 3,
	AbsoluteMappingThenScale = 4,
	EMainAttributeFunctionCurvingType_MAX = 5
};

// Object: Enum GPGameplay.EWeaponDataModifierPeriod
enum class EWeaponDataModifierPeriod : uint8_t
{
	GAME_MODE = 0,
	PARTS = 1,
	PART_TUNE = 2,
	Max = 3
};

// Object: Enum GPGameplay.EWeaponDataArrayModifierType
enum class EWeaponDataArrayModifierType : uint8_t
{
	None = 0,
	Add = 1,
	Rem = 2,
	Max = 3
};

// Object: Enum GPGameplay.EWeaponDataReplaceType
enum class EWeaponDataReplaceType : uint8_t
{
	None = 0,
	Final = 1,
	Initial = 2,
	Max = 3
};

// Object: Enum GPGameplay.EWeaponDataModifierType
enum class EWeaponDataModifierType : uint8_t
{
	None = 0,
	Addend = 1,
	Mult_A = 2,
	Mult_B = 3,
	Mult_C = 4,
	Max = 5
};

// Object: Enum GPGameplay.EScopeLenMatState
enum class EScopeLenMatState : uint8_t
{
	Close = 0,
	Switch = 1,
	Open = 2,
	EMP = 3,
	EScopeLenMatState_MAX = 4
};

// Object: Enum GPGameplay.WeaponInspectType
enum class EWeaponInspectType : uint8_t
{
	WeaponInspectType_Default = 0,
	WeaponInspectType_Empty = 1,
	WeaponInspectType_Finally = 2,
	WeaponInspectType_FirstEmpty = 3,
	WeaponInspectType_Infinite = 4,
	WeaponInspectType_MAX = 5
};

// Object: Enum GPGameplay.ETieWeaponState
enum class ETieWeaponState : uint8_t
{
	E_Idle = 0,
	E_Vacant = 1,
	E_Using = 2,
	E_Broken = 3,
	E_Destory = 4,
	E_MAX = 5
};

// Object: Enum GPGameplay.ESceneWeaponType
enum class ESceneWeaponType : uint8_t
{
	E_None = 0,
	E_MachineGun = 1,
	E_FixedWeaponAA = 2,
	E_FixedWEaponShore = 3,
	E_GiantTowerGuidedRocket = 4,
	E_GiantTowerWeaponAA = 5,
	E_HumveeCracked = 6,
	E_HawkMachineGun = 7,
	E_BunkerMachineGun = 8,
	E_MAX = 9
};

// Object: Enum GPGameplay.ESceneHealthState
enum class ESceneHealthState : uint8_t
{
	None = 0,
	E_Normal = 1,
	E_Impaired = 2,
	E_Destory = 3,
	E_Constructable = 4,
	ESceneHealthState_MAX = 5
};

// Object: Enum GPGameplay.ECrossHairBindMode
enum class ECrossHairBindMode : uint8_t
{
	BindToFireLocation = 0,
	BindToFrontSight = 1,
	BindToScreenCenter = 2,
	ECrossHairBindMode_MAX = 3
};

// Object: Enum GPGameplay.EWeaponOffsetType
enum class EWeaponOffsetType : uint8_t
{
	WeaponZoomOffset_Rotation = 0,
	WeaponZoomOffset = 1,
	WeaponDisplayOffset = 2,
	WeaponAdditiveAnim = 3,
	WeaponAdditiveAnim_FiringAnim = 4,
	WeaponCameraShakeRoll = 5,
	WeaponGunKick = 6,
	WeaponGunSway = 7,
	WeaponOwnerHitShake = 8,
	WeaponGunKick2 = 9,
	WeaponOffsetFinal = 10,
	EWeaponOffsetType_MAX = 11
};

// Object: Enum GPGameplay.EZoomAlignmentMode
enum class EZoomAlignmentMode : uint8_t
{
	TransformAlignment = 0,
	TranslationAlignment = 1,
	DisableAlignment = 2,
	EZoomAlignmentMode_MAX = 3
};

// Object: Enum GPGameplay.EEquipmentPartDamageType
enum class EEquipmentPartDamageType : uint8_t
{
	Default = 0,
	Fix = 1,
	EEquipmentPartDamageType_MAX = 2
};

// Object: Enum GPGameplay.EWeaponHandAnimType
enum class EWeaponHandAnimType : uint8_t
{
	None = 0,
	LeftHandType = 1,
	RightHandType = 2,
	BothHandsType = 3,
	EWeaponHandAnimType_MAX = 4
};

// Object: Enum GPGameplay.EWeaponFireCrosshairStyle
enum class EWeaponFireCrosshairStyle : uint8_t
{
	CrosshairNormal = 0,
	EWeaponFireCrosshairStyle_MAX = 1
};

// Object: Enum GPGameplay.ECharacterLogicPoseType
enum class ECharacterLogicPoseType : uint8_t
{
	None = 0,
	StandPose = 1,
	CrouchPose = 2,
	PronePose = 3,
	ECharacterLogicPoseType_MAX = 4
};

// Object: Enum GPGameplay.EChracterPoseType
enum class EChracterPoseType : uint8_t
{
	None = 0,
	Stand = 1,
	Crouch = 2,
	Prone = 3,
	Jump = 4,
	Run = 5,
	Fly = 6,
	Sprint = 7,
	Fracture = 8,
	ImpendingDeath = 9,
	Swim = 10,
	UnderwaterSwim = 11,
	SlidingTackle = 12,
	Rescue = 13,
	Dive = 14,
	EChracterPoseType_MAX = 15
};

// Object: Enum GPGameplay.EHandIKType
enum class EHandIKType : uint8_t
{
	HandIKType_None = 0,
	HandIKType_Primary = 1,
	HandIKType_Submachine = 2,
	HandIKType_Pistol = 3,
	HandIKType_SpecialLongWeapon = 4,
	HandIKType_Max = 5
};

// Object: Enum GPGameplay.ETurn8AngleType
enum class ETurn8AngleType : uint8_t
{
	None = 0,
	Angle_Turn_0 = 1,
	Angle_TurnLeft_45 = 2,
	Angle_TurnLeft_90 = 3,
	Angle_TurnLeft_135 = 4,
	Angle_TurnLeft_180 = 5,
	Angle_TurnRight_45 = 6,
	Angle_TurnRight_90 = 7,
	Angle_TurnRight_135 = 8,
	Max = 9
};

// Object: Enum GPGameplay.EEightDirectionType
enum class EEightDirectionType : uint8_t
{
	None = 0,
	Direction_F = 1,
	Direction_FR = 2,
	Direction_FL = 3,
	Direction_B = 4,
	Direction_BR = 5,
	Direction_BL = 6,
	Direction_L = 7,
	Direction_R = 8,
	Max = 9
};

// Object: Enum GPGameplay.EAnimationSpecialUseType
enum class EAnimationSpecialUseType : uint8_t
{
	None = 0,
	TPPAnim_UnderFPP = 6,
	EAnimationSpecialUseType_MAX = 7
};

// Object: Enum GPGameplay.EPlacementPreviewType
enum class EPlacementPreviewType : uint8_t
{
	Common = 0,
	Invalid = 1,
	Conflict = 2,
	EPlacementPreviewType_MAX = 3
};

// Object: Enum GPGameplay.ERecoilPeriod
enum class ERecoilPeriod : uint8_t
{
	Sleep = 0,
	Recoil = 1,
	RecoverPause = 2,
	Recover = 3,
	ERecoilPeriod_MAX = 4
};

// Object: Enum GPGameplay.EWeaponSpreadModifierType
enum class EWeaponSpreadModifierType : uint8_t
{
	CentralLimitTheorem = 0,
	SimpleRandom = 1,
	EWeaponSpreadModifierType_MAX = 2
};

// Object: Enum GPGameplay.EDistributionInSpreadType
enum class EDistributionInSpreadType : uint8_t
{
	UniformDistribution = 0,
	CutCakeDistribution = 1,
	CustomDistribution = 2,
	EDistributionInSpreadType_MAX = 3
};

// Object: Enum GPGameplay.EWeaponSpreadAreaType
enum class EWeaponSpreadAreaType : uint8_t
{
	Oval = 0,
	EWeaponSpreadAreaType_MAX = 1
};

// Object: Enum GPGameplay.EWeaponAdditiveGetAnimResultType
enum class EWeaponAdditiveGetAnimResultType : uint8_t
{
	RotateSpine = 0,
	RotateByCenter = 1,
	RotateByHoldPoint = 2,
	AddtiveLeftHand = 3,
	EWeaponAdditiveGetAnimResultType_MAX = 4
};

// Object: Enum GPGameplay.EWeaponAntiCheatType
enum class EWeaponAntiCheatType : uint8_t
{
	None = 0,
	Time = 1,
	SwitchWeapon = 2,
	Ammo = 3,
	FireSpread = 4,
	FireRecoil = 5,
	ChangeClip = 101,
	Chamber = 102,
	Equipping = 103,
	Firing = 104,
	OtherState = 200,
	EWeaponAntiCheatType_MAX = 201
};

// Object: Enum GPGameplay.EBulletShowReason
enum class EBulletShowReason : uint8_t
{
	None = 0,
	ChangeClip = 1,
	Inspect = 2,
	Equip = 3,
	Chamber = 4,
	EBulletShowReason_MAX = 5
};

// Object: Enum GPGameplay.EShakerRuntimeRecoilSimulatorStage
enum class EShakerRuntimeRecoilSimulatorStage : uint8_t
{
	None = 0,
	StartFire = 1,
	FireRebound = 2,
	Recover = 3,
	EShakerRuntimeRecoilSimulatorStage_MAX = 4
};

// Object: Enum GPGameplay.EZoomInParamType
enum class EZoomInParamType : uint8_t
{
	Default = 0,
	Sight = 1,
	Scope = 2,
	Debug = 3,
	Max = 4
};

// Object: Enum GPGameplay.EGPCameraSwayMode
enum class EGPCameraSwayMode : uint8_t
{
	EGPCameraSwayMode_AimWalk = 0,
	EGPCameraSwayMode_Walk = 1,
	EGPCameraSwayMode_Run = 2,
	EGPCameraSwayMode_MAX = 3
};

// Object: Enum GPGameplay.EMeleeFireMode
enum class EMeleeFireMode : uint8_t
{
	Auto = 0,
	Single = 1,
	EMeleeFireMode_MAX = 2
};

// Object: Enum GPGameplay.EWeaponObjectMatchLevel
enum class EWeaponObjectMatchLevel : uint8_t
{
	MatchAll = 0,
	MatchWeaponId = 1,
	MatchWeaponType = 2,
	AlwaysMatch = 3,
	Similarity = 4,
	EWeaponObjectMatchLevel_MAX = 5
};

// Object: Enum GPGameplay.EProcedureAnimBoneType
enum class EProcedureAnimBoneType : uint8_t
{
	ScopeCenter = 0,
	WeaponRoot = 1,
	Camera = 2,
	FrontSight = 3,
	Custom = 4,
	EProcedureAnimBoneType_MAX = 5
};

// Object: Enum GPGameplay.EWeaponFeatureChangeReason
enum class EWeaponFeatureChangeReason : uint8_t
{
	Undefined = 0,
	CharacterLODFeatureLevelEnter = 1,
	CharacterLODFeatureExitFeature = 2,
	CharacterSimulationLODSystemPost = 3,
	CharacterSignificanceEvaluateSystemApplyResult = 4,
	CharacterVehicleControlActionRefresh = 5,
	WeapRepCompBeginPlay = 6,
	WeapRepCompOnCharacterOwnerStartObserved = 7,
	OnWeaponFeatureDebugChanged = 8,
	RefreshVehicleWeaponLod = 9,
	EWeaponFeatureChangeReason_MAX = 10
};

// Object: Enum GPGameplay.EWeaponSkin_TexasPoker_Number
enum class EWeaponSkin_TexasPoker_Number : uint8_t
{
	Number_Two = 0,
	Number_Three = 1,
	Number_Four = 2,
	Number_Five = 3,
	Number_Six = 4,
	Number_Seven = 5,
	Number_Eight = 6,
	Number_Nine = 7,
	Number_Ten = 8,
	Number_Jack = 9,
	Number_Queen = 10,
	Number_King = 11,
	Number_Ace = 12,
	Number_MAX = 13
};

// Object: Enum GPGameplay.EWeaponSkin_TexasPoker_Pattern
enum class EWeaponSkin_TexasPoker_Pattern : uint8_t
{
	Spade = 0,
	Heart = 1,
	Diamond = 2,
	Club = 3,
	EWeaponSkin_TexasPoker_MAX = 4
};

// Object: Enum GPGameplay.EWeaponSkinPartConfigEnableConditionType
enum class EWeaponSkinPartConfigEnableConditionType : uint8_t
{
	None = 0,
	Always = 1,
	ItemId = 2,
	EWeaponSkinPartConfigEnableConditionType_MAX = 3
};

// Object: Enum GPGameplay.EWeaponSkinPartItemAdditiveLocationRule
enum class EWeaponSkinPartItemAdditiveLocationRule : uint8_t
{
	None = 0,
	Always = 1,
	Socket = 2,
	EWeaponSkinPartItemAdditiveLocationRule_MAX = 3
};

// Object: Enum GPGameplay.EMysticalSkinParamMaterialValueType
enum class EMysticalSkinParamMaterialValueType : uint8_t
{
	Float = 0,
	Texture = 1,
	Color = 2,
	EMysticalSkinParamMaterialValueType_MAX = 3
};

// Object: Enum GPGameplay.EMysticalSkinParamValueType
enum class EMysticalSkinParamValueType : uint8_t
{
	Constant = 0,
	Random = 1,
	Random01 = 2,
	EMysticalSkinParamValueType_MAX = 3
};

// Object: Enum GPGameplay.EWeaponSkinRareType
enum class EWeaponSkinRareType : uint8_t
{
	Normal = 0,
	Rare = 1,
	VeryRare = 2,
	EWeaponSkinRareType_MAX = 3
};

// Object: Enum GPGameplay.ESkinMergeLevel
enum class ESkinMergeLevel : uint8_t
{
	None = 0,
	ForceUse3PMaterial = 1,
	EmptySkin = 2,
	ESkinMergeLevel_MAX = 3
};

// Object: Enum GPGameplay.ESkinEffectTriggerEventType
enum class ESkinEffectTriggerEventType : uint8_t
{
	None = 0,
	PlayMaterialAnim = 1,
	ESkinEffectTriggerEventType_MAX = 2
};

// Object: Enum GPGameplay.EWeaponSkinLogicMode
enum class EWeaponSkinLogicMode : uint8_t
{
	None = 0,
	GameBoy2000 = 1,
	TexasPoker = 2,
	WeatherForecast = 3,
	EWeaponSkinLogicMode_MAX = 4
};

// Object: Enum GPGameplay.EWeaponSkinRenderMode
enum class EWeaponSkinRenderMode : uint8_t
{
	None = 0,
	Dye = 1,
	EWeaponSkinRenderMode_MAX = 2
};

// Object: Enum GPGameplay.EWeaponModifyState
enum class EWeaponModifyState : uint8_t
{
	None = 0,
	LoadMystical = 1,
	LoadAssets = 2,
	Done = 3,
	EWeaponModifyState_MAX = 4
};

// Object: Enum GPGameplay.EAbilityThrowableStickyType
enum class EAbilityThrowableStickyType : uint8_t
{
	None = 0,
	All = 1,
	OnlyVehicle = 2,
	OnlyDFMChar = 3,
	EAbilityThrowableStickyType_MAX = 4
};

// Object: Enum GPGameplay.EWeaponThrowableFXFixedRotationType
enum class EWeaponThrowableFXFixedRotationType : uint8_t
{
	Never = 0,
	OnlyInAir = 1,
	Always = 2,
	EWeaponThrowableFXFixedRotationType_MAX = 3
};

// Object: Enum GPGameplay.EWeaponThrowableType
enum class EWeaponThrowableType : uint8_t
{
	None = 0,
	EWeaponThrowableType_MAX = 1
};

// Object: ScriptStruct GPGameplay.GPModularWeaponAttachInfo
// Size: 0x20 (Inherited: 0x0)
struct FGPModularWeaponAttachInfo
{
	uint32_t SocketId; // 0x0(0x4)
	struct FName SocketName; // 0x4(0x8)
	int32_t PartNodeIndex; // 0xC(0x4)
	uint8_t Pad_0x10[0x10]; // 0x10(0x10)
};

// Object: ScriptStruct GPGameplay.GPModularWeaponPartNode
// Size: 0x128 (Inherited: 0x0)
struct FGPModularWeaponPartNode
{
	uint64_t ItemID; // 0x0(0x8)
	uint64_t FunctionId; // 0x8(0x8)
	uint64_t AnimFunctionId; // 0x10(0x8)
	uint64_t AudioFunctionId; // 0x18(0x8)
	uint64_t FxFunctionId; // 0x20(0x8)
	uint64_t PartsTypeId; // 0x28(0x8)
	uint8_t PartsTypePriority; // 0x30(0x1)
	uint8_t Pad_0x31[0x7]; // 0x31(0x7)
	uint64_t Guid; // 0x38(0x8)
	EAdapterItemType PartType; // 0x40(0x1)
	uint8_t Pad_0x41[0x7]; // 0x41(0x7)
	struct FGPModularWeaponAttachInfo ParentPartInfo; // 0x48(0x20)
	struct TArray<struct FGPModularWeaponAttachInfo> ChildPartInfos; // 0x68(0x10)
	uint8_t Num; // 0x78(0x1)
	uint8_t Pad_0x79[0x1]; // 0x79(0x1)
	int16_t SocketDepth; // 0x7A(0x2)
	uint8_t Pad_0x7C[0x4]; // 0x7C(0x4)
	uint64_t SocketGUID; // 0x80(0x8)
	uint64_t Flag; // 0x88(0x8)
	uint8_t BindType; // 0x90(0x1)
	uint8_t Pad_0x91[0x7]; // 0x91(0x7)
	uint64_t BindPlayerId; // 0x98(0x8)
	uint8_t bRawBinded : 1; // 0xA0(0x1), Mask(0x1)
	uint8_t BitPad_0xA0_1 : 7; // 0xA0(0x1)
	EModularPartNodeType NodeType; // 0xA1(0x1)
	uint8_t Pad_0xA2[0x6]; // 0xA2(0x6)
	uint64_t DependenceWeaponId; // 0xA8(0x8)
	struct TArray<uint64_t> FunctionIds; // 0xB0(0x10)
	int32_t Durability; // 0xC0(0x4)
	struct FVector RelativePositionOffset; // 0xC4(0xC)
	struct FRotator RelativeRotationOffset; // 0xD0(0xC)
	uint8_t Pad_0xDC[0x4]; // 0xDC(0x4)
	struct TArray<uint64_t> TuneIds; // 0xE0(0x10)
	struct TArray<float> TuneValues; // 0xF0(0x10)
	uint64_t FindRelativePositionSocketItemId; // 0x100(0x8)
	uint8_t TacticalEffective : 1; // 0x108(0x1), Mask(0x1)
	uint8_t BitPad_0x108_1 : 7; // 0x108(0x1)
	uint8_t b3PModelExclude : 1; // 0x109(0x1), Mask(0x1)
	uint8_t BitPad_0x109_1 : 7; // 0x109(0x1)
	uint8_t bDefaultMergeMesh : 1; // 0x10A(0x1), Mask(0x1)
	uint8_t BitPad_0x10A_1 : 7; // 0x10A(0x1)
	uint8_t Pad_0x10B[0x1D]; // 0x10B(0x1D)
};

// Object: ScriptStruct GPGameplay.MakeBuffDamageParams
// Size: 0x48 (Inherited: 0x0)
struct FMakeBuffDamageParams
{
	struct FVector Location; // 0x0(0xC)
	EDamageType DamageType; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	uint32_t BufId; // 0x10(0x4)
	int32_t SkillId; // 0x14(0x4)
	int32_t SkillEntityExcuteCount; // 0x18(0x4)
	float BaseHPDamage; // 0x1C(0x4)
	float BaseArmorDamage; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct FGameplayTagContainer TagContainer; // 0x28(0x20)
};

// Object: ScriptStruct GPGameplay.BodyPartDamageCoefficients
// Size: 0x1C (Inherited: 0x0)
struct FBodyPartDamageCoefficients
{
	float HeadDamageRate; // 0x0(0x4)
	float ThoraxDamageRate; // 0x4(0x4)
	float ThoraxUpperDamageRate; // 0x8(0x4)
	float LegDamageRate; // 0xC(0x4)
	float LegUpperDamageRate; // 0x10(0x4)
	float ArmDamageRate; // 0x14(0x4)
	float ArmUpperDamageRate; // 0x18(0x4)
};

// Object: ScriptStruct GPGameplay.MakeDamageParams
// Size: 0x200 (Inherited: 0x0)
struct FMakeDamageParams
{
	float StartTime; // 0x0(0x4)
	struct FVector BulletStartLocation; // 0x4(0xC)
	struct FVector PointStartLocation; // 0x10(0xC)
	struct FVector PointDirection; // 0x1C(0xC)
	struct FVector RadialLocation; // 0x28(0xC)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
	struct TArray<struct AActor*> IgnoreActors; // 0x38(0x10)
	struct TArray<struct AActor*> IgnoreBlockActors; // 0x48(0x10)
	struct TArray<struct UObject*> IngoreClass; // 0x58(0x10)
	float SpecialDamage; // 0x68(0x4)
	EDamageType DamageType; // 0x6C(0x1)
	uint8_t Pad_0x6D[0x3]; // 0x6D(0x3)
	int32_t AttackLevel; // 0x70(0x4)
	int32_t AttackGroupId; // 0x74(0x4)
	uint32_t BufId; // 0x78(0x4)
	uint8_t Pad_0x7C[0x4]; // 0x7C(0x4)
	struct TArray<uint32_t> CharacterPartBuffs; // 0x80(0x10)
	uint64_t AmmoId; // 0x90(0x8)
	int32_t SkillId; // 0x98(0x4)
	int32_t SkillEntityID; // 0x9C(0x4)
	float DamageRate; // 0xA0(0x4)
	float ArmorDamageRate; // 0xA4(0x4)
	float LimbsDamageRate; // 0xA8(0x4)
	uint8_t bEnablePerPartDamageRate : 1; // 0xAC(0x1), Mask(0x1)
	uint8_t BitPad_0xAC_1 : 7; // 0xAC(0x1)
	uint8_t Pad_0xAD[0x3]; // 0xAD(0x3)
	struct FBodyPartDamageCoefficients AmmoPartDamageRates; // 0xB0(0x1C)
	float ThrowBlockingDamageRate; // 0xCC(0x4)
	float BlastShieldGlassDamageRate; // 0xD0(0x4)
	float CameraSwayHitScale; // 0xD4(0x4)
	float GunSwayHitScale; // 0xD8(0x4)
	float WoundRate; // 0xDC(0x4)
	float DizzyRate; // 0xE0(0x4)
	uint8_t Pad_0xE4[0x4]; // 0xE4(0x4)
	uint64_t ShowAttackValueId; // 0xE8(0x8)
	uint64_t ShowWeaponId; // 0xF0(0x8)
	uint64_t ShowWeaponGId; // 0xF8(0x8)
	uint64_t ShowSkillId; // 0x100(0x8)
	struct FVector DamageVelocity; // 0x108(0xC)
	uint32_t VehicleId; // 0x114(0x4)
	uint8_t bIsInVehicleLeanOut : 1; // 0x118(0x1), Mask(0x1)
	uint8_t BitPad_0x118_1 : 7; // 0x118(0x1)
	uint8_t Pad_0x119[0x7]; // 0x119(0x7)
	uint64_t FireIdForVehicle; // 0x120(0x8)
	uint8_t bPenetratedLimbs : 1; // 0x128(0x1), Mask(0x1)
	uint8_t BitPad_0x128_1 : 7; // 0x128(0x1)
	uint8_t bIsPenetratingDamage : 1; // 0x129(0x1), Mask(0x1)
	uint8_t BitPad_0x129_1 : 7; // 0x129(0x1)
	uint8_t Pad_0x12A[0x2]; // 0x12A(0x2)
	int32_t PenetrationLevelDecrease; // 0x12C(0x4)
	float PenetrationCoefficient; // 0x130(0x4)
	struct FHitResult LimbsHitResult; // 0x134(0x88)
	struct TWeakObjectPtr<struct AActor> MineShooter; // 0x1BC(0x8)
	struct TWeakObjectPtr<struct AActor> HomingTargetActor; // 0x1C4(0x8)
	uint8_t Pad_0x1CC[0x4]; // 0x1CC(0x4)
	struct FGameplayTagContainer TagContainer; // 0x1D0(0x20)
	struct FVector AttackSourceLocation; // 0x1F0(0xC)
	uint8_t Pad_0x1FC[0x4]; // 0x1FC(0x4)
};

// Object: ScriptStruct GPGameplay.DamageSourceInfo
// Size: 0x3E0 (Inherited: 0x0)
struct FDamageSourceInfo
{
	EDamageSystemDamageType DamageType; // 0x0(0x1)
	EDamageValidateType ValidateType; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	struct TWeakObjectPtr<struct AActor> MakerInstigator; // 0x4(0x8)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TScriptInterface<IDamageMakerInterface> DamageMaker; // 0x10(0x10)
	struct TScriptInterface<IDamageTakerInterface> DamageTaker; // 0x20(0x10)
	struct FWeaponIdentity MakerWeaponIdentity; // 0x30(0x4)
	struct FWeaponIdentity TakerWeaponIdentity; // 0x34(0x4)
	struct TWeakObjectPtr<struct AActor> MineShooter; // 0x38(0x8)
	struct TWeakObjectPtr<struct AActor> HomingTargetActor; // 0x40(0x8)
	uint8_t TakerSourceStatus; // 0x48(0x1)
	uint8_t Pad_0x49[0x3]; // 0x49(0x3)
	struct TWeakObjectPtr<struct AActor> DamageMakerActor; // 0x4C(0x8)
	struct TWeakObjectPtr<struct AActor> DamageTakerActor; // 0x54(0x8)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
	uint64_t DamageMakerId; // 0x60(0x8)
	uint64_t DamageMakerGId; // 0x68(0x8)
	uint64_t InstigatorUin; // 0x70(0x8)
	uint64_t DamageTakerUin; // 0x78(0x8)
	struct FHitResult HitResult; // 0x80(0x88)
	struct TArray<struct FRadialSampleResult> RadialDamageSampleResult; // 0x108(0x10)
	int32_t SelectHitResultIndex; // 0x118(0x4)
	float NearestHitDistance; // 0x11C(0x4)
	uint64_t AttackerValueId; // 0x120(0x8)
	uint64_t FireId; // 0x128(0x8)
	uint16_t BatchId; // 0x130(0x2)
	uint8_t GamePlayMode; // 0x132(0x1)
	uint8_t Pad_0x133[0x1]; // 0x133(0x1)
	int32_t AttackLevel; // 0x134(0x4)
	int32_t AttackGroupId; // 0x138(0x4)
	float MakerHeadDamageRate; // 0x13C(0x4)
	float MakerThoraxDamageRate; // 0x140(0x4)
	float MakerThoraxUpperDamageRate; // 0x144(0x4)
	float MakerLegDamageRate; // 0x148(0x4)
	float MakerLegUpperDamageRate; // 0x14C(0x4)
	float MakerArmDamageRate; // 0x150(0x4)
	float MakerArmUpperDamageRate; // 0x154(0x4)
	float MakerSOLHealthHitAddBuffRate; // 0x158(0x4)
	uint8_t Pad_0x15C[0x4]; // 0x15C(0x4)
	uint64_t FireIdForVehicle; // 0x160(0x8)
	int32_t ArmorLevel; // 0x168(0x4)
	uint8_t Pad_0x16C[0x4]; // 0x16C(0x4)
	uint64_t ArmorId; // 0x170(0x8)
	float ArmorMaxDurability; // 0x178(0x4)
	uint8_t Pad_0x17C[0x1C]; // 0x17C(0x1C)
	struct FMakeDamageParams DamageParams; // 0x198(0x200)
	struct FMakeBuffDamageParams BuffDamageParams; // 0x398(0x48)
};

// Object: ScriptStruct GPGameplay.C2SEnemyScreenInfo
// Size: 0x18 (Inherited: 0x0)
struct FC2SEnemyScreenInfo
{
	uint8_t Pad_0x0[0x18]; // 0x0(0x18)
};

// Object: ScriptStruct GPGameplay.RequestPointHitValidateData
// Size: 0x70 (Inherited: 0x0)
struct FRequestPointHitValidateData
{
	struct FVector_NetQuantize100 MakerLocation; // 0x0(0xC)
	struct FRotator MakerRotation; // 0xC(0xC)
	struct FVector_NetQuantize100 MakerInstigatorLocation; // 0x18(0xC)
	struct FRotator MakerInstigatorRotation; // 0x24(0xC)
	struct FVector2D RD; // 0x30(0x8)
	struct FVector2D SD; // 0x38(0x8)
	int32_t ZoomFovOnFire; // 0x40(0x4)
	uint8_t Pad_0x44[0x4]; // 0x44(0x4)
	uint64_t SightId; // 0x48(0x8)
	uint8_t CharacterPose; // 0x50(0x1)
	uint8_t Lean; // 0x51(0x1)
	uint8_t bTakerRender : 1; // 0x52(0x1), Mask(0x1)
	uint8_t BitPad_0x52_1 : 7; // 0x52(0x1)
	uint8_t Pad_0x53[0x5]; // 0x53(0x5)
	struct FC2SEnemyScreenInfo EnemyScreenInfo; // 0x58(0x18)
};

// Object: ScriptStruct GPGameplay.RequestPointHitActionParam
// Size: 0x320 (Inherited: 0x0)
struct FRequestPointHitActionParam
{
	uint64_t Guid; // 0x0(0x8)
	uint64_t ProjectileGuid; // 0x8(0x8)
	uint64_t FireId; // 0x10(0x8)
	uint32_t VehicleId; // 0x18(0x4)
	uint8_t IsVehicleLeanOut : 1; // 0x1C(0x1), Mask(0x1)
	uint8_t BitPad_0x1C_1 : 7; // 0x1C(0x1)
	uint8_t Pad_0x1D[0x3]; // 0x1D(0x3)
	int32_t ComboId; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct AActor* MakerInstigator; // 0x28(0x8)
	struct AActor* DamageMakerActor; // 0x30(0x8)
	struct AActor* DamageTakerActor; // 0x38(0x8)
	struct FWeaponIdentity TakerWeaponIdentity; // 0x40(0x4)
	struct FWeaponIdentity TakerWeaponSheildIdentity; // 0x44(0x4)
	struct FVector TakerSheildLocation; // 0x48(0xC)
	struct FRotator TakerSheildRotator; // 0x54(0xC)
	struct FVector TakerWeaponPointLoc; // 0x60(0xC)
	struct FRotator TakerWeaponPointRot; // 0x6C(0xC)
	uint64_t TakerSheildState; // 0x78(0x8)
	struct FHitResult HitResult; // 0x80(0x88)
	int32_t HDetail; // 0x108(0x4)
	EDamageValidateType ValidateType; // 0x10C(0x1)
	uint8_t Pad_0x10D[0x3]; // 0x10D(0x3)
	float StartTime; // 0x110(0x4)
	float DamageTime; // 0x114(0x4)
	float DTCT; // 0x118(0x4)
	float ShotFre; // 0x11C(0x4)
	struct FVector TakerLocation; // 0x120(0xC)
	struct FVector TakerMeshOffset; // 0x12C(0xC)
	struct FRotator TakerRotator; // 0x138(0xC)
	struct FVector PointStartLocation; // 0x144(0xC)
	struct FVector PointDirection; // 0x150(0xC)
	float InWaterTime; // 0x15C(0x4)
	struct TArray<struct AActor*> IgnoreActors; // 0x160(0x10)
	struct TArray<struct UObject*> IngoreClass; // 0x170(0x10)
	uint8_t bPenetratedLimbs : 1; // 0x180(0x1), Mask(0x1)
	uint8_t BitPad_0x180_1 : 7; // 0x180(0x1)
	uint8_t Pad_0x181[0x3]; // 0x181(0x3)
	struct FHitResult LimbsHitResult; // 0x184(0x88)
	int32_t MediumSecIndex; // 0x20C(0x4)
	int32_t MediumBorderIndex; // 0x210(0x4)
	uint8_t Pad_0x214[0x4]; // 0x214(0x4)
	struct FProjectileMediumInfoBase MediumInfo; // 0x218(0x30)
	struct FProjectileACInfo ProjectileACInfo; // 0x248(0x5C)
	uint8_t Pad_0x2A4[0x4]; // 0x2A4(0x4)
	struct FRequestPointHitValidateData ValidateData; // 0x2A8(0x70)
	float SmoothingClientTimeStamp; // 0x318(0x4)
	uint8_t Pad_0x31C[0x4]; // 0x31C(0x4)
};

// Object: ScriptStruct GPGameplay.DamageValidateInfo
// Size: 0x378 (Inherited: 0x0)
struct FDamageValidateInfo
{
	struct FVector MakerLocation; // 0x0(0xC)
	struct FVector MakerRotation; // 0xC(0xC)
	struct FVector MakerInstigatorLocation; // 0x18(0xC)
	struct FVector MakerInstigatorRotation; // 0x24(0xC)
	struct FVector TakerLocation; // 0x30(0xC)
	struct FVector TakerRotation; // 0x3C(0xC)
	float StartTime; // 0x48(0x4)
	float DamageTime; // 0x4C(0x4)
	float ServerLastTransformUpdateTimeStamp; // 0x50(0x4)
	uint8_t Pad_0x54[0x4]; // 0x54(0x4)
	struct FRequestPointHitActionParam HitActionParam; // 0x58(0x320)
};

// Object: ScriptStruct GPGameplay.DamageResultInfo
// Size: 0x8A0 (Inherited: 0x0)
struct FDamageResultInfo
{
	uint64_t Guid; // 0x0(0x8)
	EDamageSystemDamageType DamageType; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
	struct FDamageSourceInfo DamageSourceInfo; // 0x10(0x3E0)
	struct FDamageValidateInfo DamageValidateInfo; // 0x3F0(0x378)
	float BaseDamage; // 0x768(0x4)
	float BaseHealthDamage; // 0x76C(0x4)
	float BaseArmorDamage; // 0x770(0x4)
	float OriginHPDamage; // 0x774(0x4)
	float RealHPDamage; // 0x778(0x4)
	float RealArmorDamage; // 0x77C(0x4)
	float RealHelmetDamage; // 0x780(0x4)
	float RealHealthDamage; // 0x784(0x4)
	uint8_t bCustomHealthDamage : 1; // 0x788(0x1), Mask(0x1)
	uint8_t BitPad_0x788_1 : 7; // 0x788(0x1)
	uint8_t Pad_0x789[0x3]; // 0x789(0x3)
	float ArmorToHPRate; // 0x78C(0x4)
	uint8_t Pad_0x790[0x60]; // 0x790(0x60)
	float PenetrationCoefficient; // 0x7F0(0x4)
	float ArmorHealth; // 0x7F4(0x4)
	uint8_t TakerResultStatus; // 0x7F8(0x1)
	uint8_t bBreakArmor : 1; // 0x7F9(0x1), Mask(0x1)
	uint8_t BitPad_0x7F9_1 : 7; // 0x7F9(0x1)
	uint8_t bBreakHelmetArmor : 1; // 0x7FA(0x1), Mask(0x1)
	uint8_t BitPad_0x7FA_1 : 7; // 0x7FA(0x1)
	uint8_t bShieldBreak : 1; // 0x7FB(0x1), Mask(0x1)
	uint8_t BitPad_0x7FB_1 : 7; // 0x7FB(0x1)
	struct FVector_NetQuantize MakerOwnerLocation; // 0x7FC(0xC)
	uint8_t Pad_0x808[0x70]; // 0x808(0x70)
	struct FGameplayTagContainer TagContainer; // 0x878(0x20)
	uint8_t Pad_0x898[0x8]; // 0x898(0x8)
};

// Object: ScriptStruct GPGameplay.RadialSamplePoint
// Size: 0x14 (Inherited: 0x0)
struct FRadialSamplePoint
{
	struct FVector Point; // 0x0(0xC)
	struct FName BoneName; // 0xC(0x8)
};

// Object: ScriptStruct GPGameplay.RadialSampleResult
// Size: 0xB0 (Inherited: 0x0)
struct FRadialSampleResult
{
	struct FRadialSamplePoint SamplePoint; // 0x0(0x14)
	struct FHitResult HitResult; // 0x14(0x88)
	uint8_t bBlock : 1; // 0x9C(0x1), Mask(0x1)
	uint8_t BitPad_0x9C_1 : 7; // 0x9C(0x1)
	uint8_t Pad_0x9D[0x3]; // 0x9D(0x3)
	struct TArray<struct FHitResult> ThunkerResultResults; // 0xA0(0x10)
};

// Object: ScriptStruct GPGameplay.PointHitActionResult
// Size: 0x20 (Inherited: 0x0)
struct FPointHitActionResult
{
	uint64_t Guid; // 0x0(0x8)
	EDamageValidateResult ResultType; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
	uint64_t RuleId; // 0x10(0x8)
	int32_t Code; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct GPGameplay.TakeHitInfo
// Size: 0xD0 (Inherited: 0x0)
struct FTakeHitInfo
{
	uint64_t Uin; // 0x0(0x8)
	uint64_t VictimUin; // 0x8(0x8)
	uint8_t bEmpty : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	struct FVector_NetQuantize RelHitLocation; // 0x14(0xC)
	struct FVector_NetQuantize Momentum; // 0x20(0xC)
	struct FVector_NetQuantize HitFromLocation; // 0x2C(0xC)
	struct FVector_NetQuantize HitLocation; // 0x38(0xC)
	uint8_t Pad_0x44[0x4]; // 0x44(0x4)
	struct FGameplayTagContainer HitEffectTypeTagContainer; // 0x48(0x20)
	uint8_t ShotDirPitch; // 0x68(0x1)
	uint8_t ShotDirYaw; // 0x69(0x1)
	uint8_t Pad_0x6A[0x2]; // 0x6A(0x2)
	struct FName HitBoneName; // 0x6C(0x8)
	EHitGroupType HitPhysicsType; // 0x74(0x1)
	uint8_t Pad_0x75[0x3]; // 0x75(0x3)
	struct UPhysicalMaterial* HitPhysicsMaterial; // 0x78(0x8)
	uint8_t Count; // 0x80(0x1)
	uint8_t Pad_0x81[0x7]; // 0x81(0x7)
	struct AGPInventory* HitArmor; // 0x88(0x8)
	EDirection HitDirection; // 0x90(0x1)
	uint8_t Pad_0x91[0x7]; // 0x91(0x7)
	struct AActor* HitCauser; // 0x98(0x8)
	EHitDamageApplyType HitDamageApplyType; // 0xA0(0x1)
	EDamageType DamageType; // 0xA1(0x1)
	uint8_t bShowHitDir : 1; // 0xA2(0x1), Mask(0x1)
	uint8_t BitPad_0xA2_1 : 7; // 0xA2(0x1)
	uint8_t Pad_0xA3[0x2D]; // 0xA3(0x2D)
};

// Object: ScriptStruct GPGameplay.RescueInfo
// Size: 0x38 (Inherited: 0x0)
struct FRescueInfo
{
	struct AGPCharacterBase* BeRescueCharacter; // 0x0(0x8)
	uint8_t bCurrentRescueLeft : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	struct FRotator BeRescuueRotator; // 0xC(0xC)
	struct FRotator RescuueRotator; // 0x18(0xC)
	struct FVector RescueLoc; // 0x24(0xC)
	int32_t ChangeCount; // 0x30(0x4)
	uint8_t RescuePreciseType; // 0x34(0x1)
	uint8_t Pad_0x35[0x3]; // 0x35(0x3)
};

// Object: ScriptStruct GPGameplay.AmmoContext
// Size: 0x10 (Inherited: 0x0)
struct FAmmoContext
{
	struct TArray<struct FAmmoDataItem> AmmoDataItems; // 0x0(0x10)
};

// Object: ScriptStruct GPGameplay.ModularWeaponDynamicAttributesBase
// Size: 0x28 (Inherited: 0x0)
struct FModularWeaponDynamicAttributesBase
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct TArray<uint64_t> PartGids; // 0x8(0x10)
	struct TArray<struct FModularWeaponPartNodeAttr> Attributes; // 0x18(0x10)
};

// Object: ScriptStruct GPGameplay.OverHeatContext
// Size: 0x10 (Inherited: 0x0)
struct FOverHeatContext
{
	float TotalHeat; // 0x0(0x4)
	float OverHeatSecondsLeft; // 0x4(0x4)
	float HeatDecreasePerSecond; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct GPGameplay.ModularWeaponDynamicAttrbuites
// Size: 0x50 (Inherited: 0x28)
struct FModularWeaponDynamicAttrbuites : FModularWeaponDynamicAttributesBase
{
	uint64_t CharacterOwnerUin; // 0x28(0x8)
	struct FAmmoContext AmmoContext; // 0x30(0x10)
	struct FOverHeatContext OverHeatContext; // 0x40(0x10)
};

// Object: ScriptStruct GPGameplay.WeaponPerk
// Size: 0x20 (Inherited: 0x0)
struct FWeaponPerk
{
	uint64_t Gid; // 0x0(0x8)
	uint64_t ItemID; // 0x8(0x8)
	uint16_t Duability; // 0x10(0x2)
	uint16_t DuabilityMax; // 0x12(0x2)
	uint8_t Level; // 0x14(0x1)
	uint8_t Pad_0x15[0xB]; // 0x15(0xB)
};

// Object: ScriptStruct GPGameplay.PendantInfo
// Size: 0x40 (Inherited: 0x0)
struct FPendantInfo
{
	uint64_t PendantId; // 0x0(0x8)
	uint64_t PendantGUID; // 0x8(0x8)
	uint64_t UniqueNumber; // 0x10(0x8)
	struct FString CustomName; // 0x18(0x10)
	uint8_t SuitActive : 1; // 0x28(0x1), Mask(0x1)
	uint8_t BitPad_0x28_1 : 7; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
	struct TArray<struct FPendantApperanceInfo> ApperanceInfos; // 0x30(0x10)
};

// Object: ScriptStruct GPGameplay.WeaponSkinInfo
// Size: 0xD0 (Inherited: 0x0)
struct FWeaponSkinInfo
{
	uint64_t SkinGid; // 0x0(0x8)
	uint64_t SkinId; // 0x8(0x8)
	uint64_t SkinApperanceId; // 0x10(0x8)
	uint64_t OriginAvatarId; // 0x18(0x8)
	uint64_t MysticalId; // 0x20(0x8)
	uint64_t FancyColorID; // 0x28(0x8)
	uint64_t Wear; // 0x30(0x8)
	uint64_t MaterialRandomSeed; // 0x38(0x8)
	struct TArray<struct FWeaponSkinParam> Params; // 0x40(0x10)
	uint64_t UniqueNumber; // 0x50(0x8)
	uint64_t KillCnt; // 0x58(0x8)
	struct FString CustomName; // 0x60(0x10)
	uint64_t SourceType; // 0x70(0x8)
	struct TArray<struct FWeaponSkinParam> PendantMaterialParams; // 0x78(0x10)
	struct FPendantInfo PendantInfo; // 0x88(0x40)
	uint8_t bLockApperance : 1; // 0xC8(0x1), Mask(0x1)
	uint8_t BitPad_0xC8_1 : 7; // 0xC8(0x1)
	uint8_t SkillSkinEnemyVisible : 1; // 0xC9(0x1), Mask(0x1)
	uint8_t BitPad_0xC9_1 : 7; // 0xC9(0x1)
	uint8_t SkillSkinTeammateVisible : 1; // 0xCA(0x1), Mask(0x1)
	uint8_t BitPad_0xCA_1 : 7; // 0xCA(0x1)
	uint8_t Pad_0xCB[0x5]; // 0xCB(0x5)
};

// Object: ScriptStruct GPGameplay.ModularWeaponInfo
// Size: 0x170 (Inherited: 0x0)
struct FModularWeaponInfo
{
	struct TArray<struct FGPModularWeaponPartNode> WeaponPartNodes; // 0x0(0x10)
	struct FModularWeaponDynamicAttrbuites WeaponDynamicAttrs; // 0x10(0x50)
	struct FWeaponPerk Perk; // 0x60(0x20)
	uint64_t PoorItemId; // 0x80(0x8)
	uint64_t SkinGid; // 0x88(0x8)
	uint64_t SkinApperanceId; // 0x90(0x8)
	struct FWeaponSkinInfo SkinInfo; // 0x98(0xD0)
	uint8_t bLockApperance : 1; // 0x168(0x1), Mask(0x1)
	uint8_t BitPad_0x168_1 : 7; // 0x168(0x1)
	uint8_t Pad_0x169[0x7]; // 0x169(0x7)
};

// Object: ScriptStruct GPGameplay.PendantApperanceInfo
// Size: 0x28 (Inherited: 0x0)
struct FPendantApperanceInfo
{
	EMysticalPendantShowType ShowType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t Rarity; // 0x4(0x4)
	uint64_t PendantMysticalId; // 0x8(0x8)
	uint64_t PendantMaterialRandomSeed; // 0x10(0x8)
	struct TArray<struct FWeaponSkinParam> PendantMaterialParams; // 0x18(0x10)
};

// Object: ScriptStruct GPGameplay.WeaponSkinParam
// Size: 0x60 (Inherited: 0x0)
struct FWeaponSkinParam
{
	struct TArray<struct FName> ParamNames; // 0x0(0x10)
	uint8_t MaterialValueType; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	float Value; // 0x14(0x4)
	uint8_t bTextureType : 1; // 0x18(0x1), Mask(0x1)
	uint8_t BitPad_0x18_1 : 7; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
	struct FName OnlySetMaterialName; // 0x1C(0x8)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct TSoftObjectPtr<UTexture2D> TexturePath; // 0x28(0x28)
	struct FLinearColor ColorValue; // 0x50(0x10)
};

// Object: ScriptStruct GPGameplay.ModularWeaponPartNodeAttr
// Size: 0x20 (Inherited: 0x0)
struct FModularWeaponPartNodeAttr
{
	struct TArray<struct FName> AttrNames; // 0x0(0x10)
	struct TArray<float> AttrValues; // 0x10(0x10)
};

// Object: ScriptStruct GPGameplay.AmmoDataItem
// Size: 0x20 (Inherited: 0x0)
struct FAmmoDataItem
{
	uint64_t ItemID; // 0x0(0x8)
	uint64_t Guid; // 0x8(0x8)
	int32_t Num; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	uint64_t BindPlayerId; // 0x18(0x8)
};

// Object: ScriptStruct GPGameplay.BasicData
// Size: 0x18 (Inherited: 0x0)
struct FBasicData
{
	uint8_t Pad_0x0[0x18]; // 0x0(0x18)
};

// Object: ScriptStruct GPGameplay.KillInfo
// Size: 0x1A8 (Inherited: 0x18)
struct FKillInfo : FBasicData
{
	uint64_t KillerUin; // 0x18(0x8)
	uint64_t InstigatorUin; // 0x20(0x8)
	uint64_t MineShooterUin; // 0x28(0x8)
	uint64_t KillerWeaponID; // 0x30(0x8)
	uint64_t KillerShowWeaponID; // 0x38(0x8)
	uint64_t KillerShowWeaponGID; // 0x40(0x8)
	uint64_t KillerWeaponGID; // 0x48(0x8)
	uint32_t KillerSkillID; // 0x50(0x4)
	uint32_t KillerSkillEntityID; // 0x54(0x4)
	int32_t KillerVehicleID; // 0x58(0x4)
	uint8_t bKillerInVehicleLeanOut : 1; // 0x5C(0x1), Mask(0x1)
	uint8_t BitPad_0x5C_1 : 7; // 0x5C(0x1)
	EWeaponItemType KillerWeaponType; // 0x5D(0x1)
	uint8_t Pad_0x5E[0x2]; // 0x5E(0x2)
	struct TArray<uint64_t> KillerWeaponModuleID; // 0x60(0x10)
	uint64_t BeKilledUin; // 0x70(0x8)
	EDeadType BeKilledType; // 0x78(0x1)
	uint8_t Pad_0x79[0x3]; // 0x79(0x3)
	float KillDistance; // 0x7C(0x4)
	struct FVector MakerLocation; // 0x80(0xC)
	uint8_t MakerIsPlayer : 1; // 0x8C(0x1), Mask(0x1)
	uint8_t BitPad_0x8C_1 : 7; // 0x8C(0x1)
	uint8_t MakerIsAILAB : 1; // 0x8D(0x1), Mask(0x1)
	uint8_t BitPad_0x8D_1 : 7; // 0x8D(0x1)
	uint8_t MakerIsRobotAI : 1; // 0x8E(0x1), Mask(0x1)
	uint8_t BitPad_0x8E_1 : 7; // 0x8E(0x1)
	uint8_t MakerIsAIBoss : 1; // 0x8F(0x1), Mask(0x1)
	uint8_t BitPad_0x8F_1 : 7; // 0x8F(0x1)
	struct FVector TakerLocation; // 0x90(0xC)
	uint8_t TakerIsPlayer : 1; // 0x9C(0x1), Mask(0x1)
	uint8_t BitPad_0x9C_1 : 7; // 0x9C(0x1)
	uint8_t TakerIsAILAB : 1; // 0x9D(0x1), Mask(0x1)
	uint8_t BitPad_0x9D_1 : 7; // 0x9D(0x1)
	uint8_t TakerIsRobotAI : 1; // 0x9E(0x1), Mask(0x1)
	uint8_t BitPad_0x9E_1 : 7; // 0x9E(0x1)
	uint8_t TakerIsAIBoss : 1; // 0x9F(0x1), Mask(0x1)
	uint8_t BitPad_0x9F_1 : 7; // 0x9F(0x1)
	uint8_t IsHitHead : 1; // 0xA0(0x1), Mask(0x1)
	uint8_t BitPad_0xA0_1 : 7; // 0xA0(0x1)
	uint8_t LastHitPosition; // 0xA1(0x1)
	uint8_t Pad_0xA2[0x2]; // 0xA2(0x2)
	float LastHitAmount; // 0xA4(0x4)
	struct FText BeKilledName; // 0xA8(0x18)
	struct FText KillerName; // 0xC0(0x18)
	struct FText InstigatorName; // 0xD8(0x18)
	struct FVector BeKilledLocation; // 0xF0(0xC)
	float KillTime; // 0xFC(0x4)
	uint64_t KillerAmmoId; // 0x100(0x8)
	int32_t AttackLevel; // 0x108(0x4)
	uint8_t bIsKnockDown : 1; // 0x10C(0x1), Mask(0x1)
	uint8_t BitPad_0x10C_1 : 7; // 0x10C(0x1)
	uint8_t bDirectDead : 1; // 0x10D(0x1), Mask(0x1)
	uint8_t BitPad_0x10D_1 : 7; // 0x10D(0x1)
	uint8_t Pad_0x10E[0x2]; // 0x10E(0x2)
	int32_t TakerDeadTickNum; // 0x110(0x4)
	int32_t TeamId1; // 0x114(0x4)
	int32_t TeamId2; // 0x118(0x4)
	int32_t BuffId; // 0x11C(0x4)
	int32_t BeKilledCampId; // 0x120(0x4)
	int32_t KillerCampId; // 0x124(0x4)
	struct FGameplayTagContainer DamageTags; // 0x128(0x20)
	uint64_t AttackValueId; // 0x148(0x8)
	struct AGPCharacterBase* BeKilledCharacter; // 0x150(0x8)
	struct AGPCharacterBase* KillerCharacter; // 0x158(0x8)
	struct TArray<uint64_t> AssistPlayerIds; // 0x160(0x10)
	uint8_t Pad_0x170[0x10]; // 0x170(0x10)
	uint8_t bKillTeam : 1; // 0x180(0x1), Mask(0x1)
	uint8_t BitPad_0x180_1 : 7; // 0x180(0x1)
	uint8_t Pad_0x181[0x7]; // 0x181(0x7)
	struct TArray<struct FString> InPOINameLocalizedKey; // 0x188(0x10)
	uint8_t Pad_0x198[0x10]; // 0x198(0x10)
};

// Object: ScriptStruct GPGameplay.SubtitleSequenceInfo
// Size: 0xA8 (Inherited: 0x0)
struct FSubtitleSequenceInfo
{
	uint8_t Pad_0x0[0x98]; // 0x0(0x98)
	struct FName SubtitleSequenceId; // 0x98(0x8)
	uint8_t Pad_0xA0[0x8]; // 0xA0(0x8)
};

// Object: ScriptStruct GPGameplay.SubtitleSequenceGroupTableItem
// Size: 0x28 (Inherited: 0x10)
struct FSubtitleSequenceGroupTableItem : FDescRowBase
{
	struct TArray<struct FSubtitleGroupItem> SubtitleGroups; // 0x10(0x10)
	float LoopIntervalTime; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
};

// Object: ScriptStruct GPGameplay.SubtitleGroupInfo
// Size: 0x90 (Inherited: 0x0)
struct FSubtitleGroupInfo
{
	struct FSubtitleSequenceGroupTableItem SubtitleGroupTableItem; // 0x0(0x28)
	struct FName SubtitleGroupId; // 0x28(0x8)
	struct TMap<struct FName, int32_t> SubtitleGroupLoopTimes; // 0x30(0x50)
	int32_t CurrentSubtitleGroupIdx; // 0x80(0x4)
	ESubtitleSequenceType SubtitleSeqType; // 0x84(0x1)
	uint8_t Pad_0x85[0xB]; // 0x85(0xB)
};

// Object: ScriptStruct GPGameplay.SubtitleGroupItem
// Size: 0x18 (Inherited: 0x0)
struct FSubtitleGroupItem
{
	struct FName SubtitleId; // 0x0(0x8)
	float MinShowPercent; // 0x8(0x4)
	uint8_t bNeedInteractToNext : 1; // 0xC(0x1), Mask(0x1)
	uint8_t BitPad_0xC_1 : 7; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	float NextSubtitleSequenceDelay; // 0x10(0x4)
	int32_t LoopTimes; // 0x14(0x4)
};

// Object: ScriptStruct GPGameplay.TeamScoreInfosContainer
// Size: 0x118 (Inherited: 0x108)
struct FTeamScoreInfosContainer : FFastArraySerializer
{
	struct TArray<struct FTeamScoreInfo> RepDatas_Internal; // 0x108(0x10)
};

// Object: ScriptStruct GPGameplay.TeamInfo
// Size: 0x150 (Inherited: 0x0)
struct FTeamInfo
{
	int32_t TeamID; // 0x0(0x4)
	struct FName TeamName; // 0x4(0x8)
	int32_t Camp; // 0xC(0x4)
	uint64_t TeamLeaderID; // 0x10(0x8)
	struct TArray<uint64_t> MemberUinList; // 0x18(0x10)
	struct TArray<int32_t> MemberIndexList; // 0x28(0x10)
	struct FTeamScoreInfosContainer TeamScoreInfos; // 0x38(0x118)
};

// Object: ScriptStruct GPGameplay.TeamScoreInfo
// Size: 0x18 (Inherited: 0xC)
struct FTeamScoreInfo : FFastArraySerializerItem
{
	struct FName ScoreType; // 0xC(0x8)
	int32_t Score; // 0x14(0x4)
};

// Object: ScriptStruct GPGameplay.SimpleKnockDownInfo
// Size: 0x70 (Inherited: 0x18)
struct FSimpleKnockDownInfo : FBasicData
{
	uint64_t KillerUin; // 0x18(0x8)
	uint64_t BeKilledUin; // 0x20(0x8)
	struct FVector BeKilledLocation; // 0x28(0xC)
	int32_t TeamId1; // 0x34(0x4)
	int32_t TeamId2; // 0x38(0x4)
	int32_t BeKilledCampId; // 0x3C(0x4)
	int32_t KillerCampId; // 0x40(0x4)
	float KillTime; // 0x44(0x4)
	uint64_t KillerWeaponID; // 0x48(0x8)
	uint64_t KillerWeaponGID; // 0x50(0x8)
	uint8_t bKillTeam : 1; // 0x58(0x1), Mask(0x1)
	uint8_t BitPad_0x58_1 : 7; // 0x58(0x1)
	uint8_t IsHitHead : 1; // 0x59(0x1), Mask(0x1)
	uint8_t BitPad_0x59_1 : 7; // 0x59(0x1)
	uint8_t Pad_0x5A[0x2]; // 0x5A(0x2)
	float KillDistance; // 0x5C(0x4)
	uint32_t KillerSkillID; // 0x60(0x4)
	EDeadType BeKilledType; // 0x64(0x1)
	uint8_t Pad_0x65[0x3]; // 0x65(0x3)
	uint64_t AttackValueId; // 0x68(0x8)
};

// Object: ScriptStruct GPGameplay.SpectSafeBoxInfo
// Size: 0x10 (Inherited: 0x0)
struct FSpectSafeBoxInfo
{
	uint32_t SafeBoxId; // 0x0(0x4)
	uint32_t OperateId; // 0x4(0x4)
	float params1; // 0x8(0x4)
	float params2; // 0xC(0x4)
};

// Object: ScriptStruct GPGameplay.SpectWeaponInfo
// Size: 0xC (Inherited: 0x0)
struct FSpectWeaponInfo
{
	uint16_t WeaponAmmoCount; // 0x0(0x2)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	int32_t CacheTotalAmmoCount; // 0x4(0x4)
	int32_t FiringMode; // 0x8(0x4)
};

// Object: ScriptStruct GPGameplay.SpectTelescopeInfo
// Size: 0xC (Inherited: 0x0)
struct FSpectTelescopeInfo
{
	uint8_t bIsUsingTelescope : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bStartOpenTransition : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	float CurrentFOV; // 0x4(0x4)
	int32_t CurrentIndex; // 0x8(0x4)
};

// Object: ScriptStruct GPGameplay.GPWeaponDescInfo
// Size: 0x150 (Inherited: 0x0)
struct FGPWeaponDescInfo
{
	struct TArray<struct FGunDescRow> GunDescRows; // 0x0(0x10)
	struct FModularWeaponDynamicAttrbuites DynamicAttributes; // 0x10(0x50)
	uint64_t PoorItemId; // 0x60(0x8)
	uint64_t ModifyTimeStamp; // 0x68(0x8)
	uint64_t AttrModifyTimeStamp; // 0x70(0x8)
	uint64_t SkinId; // 0x78(0x8)
	struct FWeaponSkinInfo SkinInfo; // 0x80(0xD0)
};

// Object: ScriptStruct GPGameplay.GunDescRow
// Size: 0x80 (Inherited: 0x10)
struct FGunDescRow : FDescRowBase
{
	uint64_t DesKey; // 0x10(0x8)
	uint64_t DesId; // 0x18(0x8)
	int16_t Index; // 0x20(0x2)
	uint8_t Pad_0x22[0x6]; // 0x22(0x6)
	uint64_t ItemID; // 0x28(0x8)
	uint64_t Guid; // 0x30(0x8)
	int16_t ParentIndex; // 0x38(0x2)
	uint8_t Pad_0x3A[0x2]; // 0x3A(0x2)
	uint32_t ParentSocketId; // 0x3C(0x4)
	uint32_t SocketId; // 0x40(0x4)
	int16_t Child; // 0x44(0x2)
	uint8_t NodeType; // 0x46(0x1)
	uint8_t Pad_0x47[0x1]; // 0x47(0x1)
	int32_t Durability; // 0x48(0x4)
	uint8_t BindType; // 0x4C(0x1)
	uint8_t Pad_0x4D[0x3]; // 0x4D(0x3)
	uint64_t BindPlayerId; // 0x50(0x8)
	uint8_t bRawBinded : 1; // 0x58(0x1), Mask(0x1)
	uint8_t BitPad_0x58_1 : 7; // 0x58(0x1)
	uint8_t Pad_0x59[0x7]; // 0x59(0x7)
	struct TArray<uint64_t> TuneIds; // 0x60(0x10)
	struct TArray<float> TuneValues; // 0x70(0x10)
};

// Object: ScriptStruct GPGameplay.RightKeyTipsSkillData
// Size: 0x28 (Inherited: 0x0)
struct FRightKeyTipsSkillData
{
	struct FName Key; // 0x0(0x8)
	struct FText Desc; // 0x8(0x18)
	uint8_t bOverrideDesc : 1; // 0x20(0x1), Mask(0x1)
	uint8_t BitPad_0x20_1 : 7; // 0x20(0x1)
	uint8_t Pad_0x21[0x7]; // 0x21(0x7)
};

// Object: ScriptStruct GPGameplay.PlayerLocation
// Size: 0x18 (Inherited: 0x0)
struct FPlayerLocation
{
	int64_t Uin; // 0x0(0x8)
	struct FVector Location; // 0x8(0xC)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct GPGameplay.GPActorChannelInfo
// Size: 0x14 (Inherited: 0x0)
struct FGPActorChannelInfo
{
	uint8_t Pad_0x0[0x14]; // 0x0(0x14)
};

// Object: ScriptStruct GPGameplay.MarkInit
// Size: 0x150 (Inherited: 0x0)
struct FMarkInit
{
	struct FString MarkerTypeString; // 0x0(0x10)
	struct TWeakObjectPtr<struct AActor> TargetActor; // 0x10(0x8)
	struct APlayerController* Controller; // 0x18(0x8)
	struct TArray<EMarkFeature> Features; // 0x20(0x10)
	struct UGPMarkerItemBase* MarkerItemPtr; // 0x30(0x8)
	uint8_t Pad_0x38[0x20]; // 0x38(0x20)
	struct UPaperSprite* Sprite0; // 0x58(0x8)
	struct UPaperSprite* Sprite1; // 0x60(0x8)
	struct UPaperSprite* Sprite2; // 0x68(0x8)
	struct UPaperSprite* Sprite3; // 0x70(0x8)
	struct FColor Color0; // 0x78(0x4)
	struct FColor Color1; // 0x7C(0x4)
	struct AActor* Actor0; // 0x80(0x8)
	struct AActor* Actor1; // 0x88(0x8)
	struct UObject* Object0; // 0x90(0x8)
	struct UObject* Object1; // 0x98(0x8)
	int32_t Int0; // 0xA0(0x4)
	int32_t Int1; // 0xA4(0x4)
	float Float0; // 0xA8(0x4)
	uint8_t Pad_0xAC[0x4]; // 0xAC(0x4)
	uint64_t Int2; // 0xB0(0x8)
	struct FString String0; // 0xB8(0x10)
	struct FText Text0; // 0xC8(0x18)
	struct FName Name0; // 0xE0(0x8)
	uint8_t Pad_0xE8[0x8]; // 0xE8(0x8)
	struct FMatrix Matrix0; // 0xF0(0x40)
	struct FVector Vector0; // 0x130(0xC)
	uint8_t Pad_0x13C[0x4]; // 0x13C(0x4)
	uint64_t Int64; // 0x140(0x8)
	uint8_t Pad_0x148[0x8]; // 0x148(0x8)
};

// Object: ScriptStruct GPGameplay.UnitMarkingInfo
// Size: 0x68 (Inherited: 0x0)
struct FUnitMarkingInfo
{
	struct AGPCharacter* OwnerCharacter; // 0x0(0x8)
	struct AGPPlayerState* OwnerPlayerState; // 0x8(0x8)
	uint64_t OwnerPlayerUin; // 0x10(0x8)
	struct FVector MarkerWorldLocation; // 0x18(0xC)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	uint64_t MarkerUniqueId; // 0x28(0x8)
	EGPMarkerClassType MarkerClassType; // 0x30(0x1)
	uint8_t Pad_0x31[0x3]; // 0x31(0x3)
	uint32_t MarkerType; // 0x34(0x4)
	struct AActor* MarkedActor; // 0x38(0x8)
	EMarkerCampType ShowMarkerCamp; // 0x40(0x1)
	EMarkerCampType MarkedActorCamp; // 0x41(0x1)
	uint8_t Pad_0x42[0x2]; // 0x42(0x2)
	float MarkTime; // 0x44(0x4)
	float ConfigValidTime; // 0x48(0x4)
	EMarkingType UnitMarkingType; // 0x4C(0x1)
	ETeamIdentity SendMarkingIdentity; // 0x4D(0x1)
	uint8_t Pad_0x4E[0x2]; // 0x4E(0x2)
	struct TArray<struct AGPPlayerState*> RespondPlayerStates; // 0x50(0x10)
	uint64_t CustomUniqueId; // 0x60(0x8)
};

// Object: ScriptStruct GPGameplay.HighValueInspectionBroadPara
// Size: 0x20 (Inherited: 0x0)
struct FHighValueInspectionBroadPara
{
	uint8_t bInspectPro : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bThreeInspect : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	int32_t RandomItemInspectionId; // 0x4(0x4)
	uint64_t ItemGid; // 0x8(0x8)
	int32_t SafeBoxValue; // 0x10(0x4)
	uint8_t bIsRedBag : 1; // 0x14(0x1), Mask(0x1)
	uint8_t BitPad_0x14_1 : 7; // 0x14(0x1)
	uint8_t bIsFootballInspect : 1; // 0x15(0x1), Mask(0x1)
	uint8_t BitPad_0x15_1 : 7; // 0x15(0x1)
	uint8_t bIsFootballThrow : 1; // 0x16(0x1), Mask(0x1)
	uint8_t BitPad_0x16_1 : 7; // 0x16(0x1)
	uint8_t bIsFootballGate : 1; // 0x17(0x1), Mask(0x1)
	uint8_t BitPad_0x17_1 : 7; // 0x17(0x1)
	int32_t RandID; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct GPGameplay.CommonCountDownInfo
// Size: 0x60 (Inherited: 0x0)
struct FCommonCountDownInfo
{
	ECountDownPriority CountDowType; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct FText CountDownTitle; // 0x8(0x18)
	float EndCountDownTime; // 0x20(0x4)
	uint8_t bShow : 1; // 0x24(0x1), Mask(0x1)
	uint8_t BitPad_0x24_1 : 7; // 0x24(0x1)
	uint8_t bUseTenSecondsWidgetShow : 1; // 0x25(0x1), Mask(0x1)
	uint8_t BitPad_0x25_1 : 7; // 0x25(0x1)
	uint8_t Pad_0x26[0x2]; // 0x26(0x2)
	int32_t ColorViewType; // 0x28(0x4)
	uint8_t bMiniViewType : 1; // 0x2C(0x1), Mask(0x1)
	uint8_t BitPad_0x2C_1 : 7; // 0x2C(0x1)
	uint8_t ColoredTitle : 1; // 0x2D(0x1), Mask(0x1)
	uint8_t BitPad_0x2D_1 : 7; // 0x2D(0x1)
	uint8_t Pad_0x2E[0x2]; // 0x2E(0x2)
	int32_t UrgentTime; // 0x30(0x4)
	uint8_t EmphasizeTen : 1; // 0x34(0x1), Mask(0x1)
	uint8_t BitPad_0x34_1 : 7; // 0x34(0x1)
	uint8_t Pad_0x35[0x3]; // 0x35(0x3)
	int32_t EmphasizeNum; // 0x38(0x4)
	struct FName KeyName; // 0x3C(0x8)
	uint8_t Pad_0x44[0x4]; // 0x44(0x4)
	struct FText KeyText; // 0x48(0x18)
};

// Object: ScriptStruct GPGameplay.AudioListenerWeaponItemConfig
// Size: 0x18 (Inherited: 0x0)
struct FAudioListenerWeaponItemConfig
{
	EWeaponItemType WeaponType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t AudioFunctionId; // 0x4(0x4)
	uint64_t WeaponID; // 0x8(0x8)
	EGPWeaponInnerEvent WeaponEvent; // 0x10(0x1)
	uint8_t Pad_0x11[0x7]; // 0x11(0x7)
};

// Object: ScriptStruct GPGameplay.AudioListenerGrenadeExplosionItemConfig
// Size: 0x10 (Inherited: 0x0)
struct FAudioListenerGrenadeExplosionItemConfig
{
	struct FVector ExplosionLocation; // 0x0(0xC)
	EAudioListenerGrenadeExplosionType GrenadeType; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
};

// Object: ScriptStruct GPGameplay.DestructibleBreakEventData
// Size: 0x40 (Inherited: 0x0)
struct FDestructibleBreakEventData
{
	EDestructibleBreakType BreakType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct FVector HitLocation; // 0x4(0xC)
	struct FVector HitNormal; // 0x10(0xC)
	struct TWeakObjectPtr<struct AActor> SourceActor; // 0x1C(0x8)
	struct TWeakObjectPtr<struct AActor> DestructibleActor; // 0x24(0x8)
	float DamageValue; // 0x2C(0x4)
	int64_t AttackValueId; // 0x30(0x8)
	uint8_t NeedRebase : 1; // 0x38(0x1), Mask(0x1)
	uint8_t BitPad_0x38_1 : 7; // 0x38(0x1)
	uint8_t Pad_0x39[0x7]; // 0x39(0x7)
};

// Object: ScriptStruct GPGameplay.AttributeOpStructArray
// Size: 0x18 (Inherited: 0x0)
struct FAttributeOpStructArray
{
	struct FName AttribiteName; // 0x0(0x8)
	struct TArray<struct FAttributeOperateData> Datas; // 0x8(0x10)
};

// Object: ScriptStruct GPGameplay.AttributeOperateData
// Size: 0x18 (Inherited: 0x0)
struct FAttributeOperateData
{
	EAttributeAdditionType GameplayModOp; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct TArray<struct FAttributeOperateValue> OperateValues; // 0x8(0x10)
};

// Object: ScriptStruct GPGameplay.AttributeOperateValue
// Size: 0x20 (Inherited: 0x0)
struct FAttributeOperateValue
{
	uint64_t ID; // 0x0(0x8)
	uint64_t BuffId; // 0x8(0x8)
	uint8_t IsValid : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t isPause : 1; // 0x11(0x1), Mask(0x1)
	uint8_t BitPad_0x11_1 : 7; // 0x11(0x1)
	uint8_t Pad_0x12[0x2]; // 0x12(0x2)
	float Value; // 0x14(0x4)
	uint8_t Pad_0x18[0x8]; // 0x18(0x8)
};

// Object: ScriptStruct GPGameplay.AnimAssetStatistics
// Size: 0x108 (Inherited: 0x0)
struct FAnimAssetStatistics
{
	int32_t TotalAssetCount; // 0x0(0x4)
	int32_t LoadedAssetCount; // 0x4(0x4)
	int32_t TotalRefCount; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	int64_t TotalMemoryUsage; // 0x10(0x8)
	struct TMap<struct FName, int32_t> AssetRefCountMap; // 0x18(0x50)
	struct TMap<struct FName, int32_t> AllAssetRefMap; // 0x68(0x50)
	struct TMap<struct FName, int64_t> AssetMemoryMap; // 0xB8(0x50)
};

// Object: ScriptStruct GPGameplay.AnimDataAnalysisReport
// Size: 0x178 (Inherited: 0x0)
struct FAnimDataAnalysisReport
{
	struct FDateTime GenerationTime; // 0x0(0x8)
	int32_t TotalComponentCount; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct FAnimAssetStatistics GlobalAssetStats; // 0x10(0x108)
	struct TArray<struct FComponentAnimStatistics> ComponentStats; // 0x118(0x10)
	struct TMap<struct FString, struct FString> CustomAnalysisResults; // 0x128(0x50)
};

// Object: ScriptStruct GPGameplay.ComponentAnimStatistics
// Size: 0x78 (Inherited: 0x0)
struct FComponentAnimStatistics
{
	struct FString ComponentName; // 0x0(0x10)
	int32_t WeaponAssetTagInfoCount; // 0x10(0x4)
	int32_t RecordAssetTagInfoCount; // 0x14(0x4)
	struct TMap<struct FString, int32_t> AnimIDToAssetCountMap; // 0x18(0x50)
	struct TArray<struct FString> AssetTagInfoDetails; // 0x68(0x10)
};

// Object: ScriptStruct GPGameplay.WeaponDebugInfo
// Size: 0x18 (Inherited: 0x0)
struct FWeaponDebugInfo
{
	uint8_t Pad_0x0[0x18]; // 0x0(0x18)
};

// Object: ScriptStruct GPGameplay.MarkingBaseInfo
// Size: 0x48 (Inherited: 0x0)
struct FMarkingBaseInfo
{
	struct AGPCharacter* OwnerCharacter; // 0x0(0x8)
	struct AGPPlayerState* OwnerPlayerState; // 0x8(0x8)
	uint64_t OwnerPlayerUin; // 0x10(0x8)
	uint64_t MarkerUniqueId; // 0x18(0x8)
	float CurrentLeftTime; // 0x20(0x4)
	struct FVector MarkingLocation; // 0x24(0xC)
	EMarkingType MarkingType; // 0x30(0x1)
	ETeamIdentity MarkingOwnerTeamIdentity; // 0x31(0x1)
	uint8_t Pad_0x32[0x6]; // 0x32(0x6)
	struct TArray<struct AGPPlayerState*> RespondPlayerStates; // 0x38(0x10)
};

// Object: ScriptStruct GPGameplay.GPMarkerEntityCreateParams
// Size: 0x88 (Inherited: 0x0)
struct FGPMarkerEntityCreateParams
{
	EGPMarkerClassType MarkerClassType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	EGPMarkerType MarkerType; // 0x4(0x4)
	int32_t ChildMarkerType; // 0x8(0x4)
	uint32_t MarkerActorGUID; // 0xC(0x4)
	struct FString MarkerTypeString; // 0x10(0x10)
	struct TWeakObjectPtr<struct AActor> TargetActor; // 0x20(0x8)
	struct FVector WorldLocation; // 0x28(0xC)
	uint8_t Pad_0x34[0xC]; // 0x34(0xC)
	struct FMarkingBaseInfo MarkingBaseInfo; // 0x40(0x48)
};

// Object: ScriptStruct GPGameplay.CharacterStats
// Size: 0x60 (Inherited: 0x0)
struct FCharacterStats
{
	uint32_t ExtrapolateTimeMs; // 0x0(0x4)
	uint32_t ExtrapolateCount; // 0x4(0x4)
	uint32_t AvgServerReplicationDeltaTimeMs; // 0x8(0x4)
	uint32_t MinRealtimeInterpolateDelayMs; // 0xC(0x4)
	uint32_t MaxRealtimeInterpolateDelayMs; // 0x10(0x4)
	uint32_t AvgRealtimeInterpolateDelayMs; // 0x14(0x4)
	uint32_t InterploateSnapCount; // 0x18(0x4)
	uint32_t ServerTimeMeanMs; // 0x1C(0x4)
	uint32_t ServerTimeSVMs; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	uint64_t PlayerID3P; // 0x28(0x8)
	struct TArray<struct FTimeLocation> TimeLocations; // 0x30(0x10)
	int32_t LOD; // 0x40(0x4)
	int32_t MinLOD; // 0x44(0x4)
	int32_t MaxLOD; // 0x48(0x4)
	int16_t InterpolateDelayHistGram[0x8]; // 0x4C(0x10)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
};

// Object: ScriptStruct GPGameplay.TimeLocation
// Size: 0x10 (Inherited: 0x0)
struct FTimeLocation
{
	float TimeSeconds; // 0x0(0x4)
	struct FVector Location; // 0x4(0xC)
};

// Object: ScriptStruct GPGameplay.CharacterMoveHandle
// Size: 0x4 (Inherited: 0x0)
struct FCharacterMoveHandle
{
	int32_t Index; // 0x0(0x4)
};

// Object: ScriptStruct GPGameplay.NetworkCosmeticData_Server_Character_OnFire
// Size: 0xF8 (Inherited: 0x0)
struct FNetworkCosmeticData_Server_Character_OnFire
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct FWeaponFireMulticastInfo FireInfo; // 0x8(0x78)
	uint8_t Pad_0x80[0x58]; // 0x80(0x58)
	uint32_t PlayerViewInfo; // 0xD8(0x4)
	struct FVector CameraViewRotVec; // 0xDC(0xC)
	struct FVector CameraViewLoc; // 0xE8(0xC)
	uint8_t Pad_0xF4[0x4]; // 0xF4(0x4)
};

// Object: ScriptStruct GPGameplay.ExplicitDisableBitArray
// Size: 0x20 (Inherited: 0x0)
struct FExplicitDisableBitArray
{
	uint8_t Pad_0x0[0x20]; // 0x0(0x20)
};

// Object: ScriptStruct GPGameplay.StartStopData
// Size: 0x24 (Inherited: 0x0)
struct FStartStopData
{
	uint8_t Pad_0x0[0x1C]; // 0x0(0x1C)
	uint8_t bStoping : 1; // 0x1C(0x1), Mask(0x1)
	uint8_t BitPad_0x1C_1 : 7; // 0x1C(0x1)
	uint8_t StopType; // 0x1D(0x1)
	uint8_t bStarting : 1; // 0x1E(0x1), Mask(0x1)
	uint8_t BitPad_0x1E_1 : 7; // 0x1E(0x1)
	uint8_t bPivot : 1; // 0x1F(0x1), Mask(0x1)
	uint8_t BitPad_0x1F_1 : 7; // 0x1F(0x1)
	uint8_t PivotDirection; // 0x20(0x1)
	uint8_t Pad_0x21[0x3]; // 0x21(0x3)
};

// Object: ScriptStruct GPGameplay.TurningPlaceData
// Size: 0x8 (Inherited: 0x0)
struct FTurningPlaceData
{
	uint8_t bIsTurningPlace : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bIsTurningRight : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t bIsTurningEnter : 1; // 0x2(0x1), Mask(0x1)
	uint8_t BitPad_0x2_1 : 7; // 0x2(0x1)
	uint8_t Pad_0x3[0x1]; // 0x3(0x1)
	float TurnInPlaceBeginYaw; // 0x4(0x4)
};

// Object: ScriptStruct GPGameplay.CharacterSpeedFactor
// Size: 0x3C (Inherited: 0x0)
struct FCharacterSpeedFactor
{
	float StandPeekSpeedFactor; // 0x0(0x4)
	float CrouchPeekSpeedFactor; // 0x4(0x4)
	float StandFireSpeedFactor; // 0x8(0x4)
	float CrouchFireSpeedFactor; // 0xC(0x4)
	float ProneFireSpeedFactor; // 0x10(0x4)
	float StandAimSpeedFactor; // 0x14(0x4)
	float CrouchAimSpeedFactor; // 0x18(0x4)
	float ProneAimSpeedFactor; // 0x1C(0x4)
	float UsingItemSpeedFactor; // 0x20(0x4)
	float UsingItemInWaterSpeedFactor; // 0x24(0x4)
	float StandHoldBreathSpeedFactor; // 0x28(0x4)
	float CrouchHoldBreathSpeedFactor; // 0x2C(0x4)
	float ProneHoldBreathSpeedFactor; // 0x30(0x4)
	float PeekAimSpeedFactor; // 0x34(0x4)
	float SwimmingSurfaceAimSpeedFactor; // 0x38(0x4)
};

// Object: ScriptStruct GPGameplay.InteractiveOptionalParam
// Size: 0xC (Inherited: 0x0)
struct FInteractiveOptionalParam
{
	EWeaponHiddenTag WeaponHiddenTag; // 0x0(0x1)
	uint8_t bUseAnimTime : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	float InAnimTime; // 0x4(0x4)
	uint8_t bEnableHiddenTagGuard : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t bEnableAnimOptimize : 1; // 0x9(0x1), Mask(0x1)
	uint8_t BitPad_0x9_1 : 7; // 0x9(0x1)
	uint8_t bGetStopAll : 1; // 0xA(0x1), Mask(0x1)
	uint8_t BitPad_0xA_1 : 7; // 0xA(0x1)
	uint8_t Pad_0xB[0x1]; // 0xB(0x1)
};

// Object: ScriptStruct GPGameplay.CharOutLineEffectData
// Size: 0x20 (Inherited: 0x0)
struct FCharOutLineEffectData
{
	int32_t DataIndex; // 0x0(0x4)
	int32_t OutLineEffectBitArry; // 0x4(0x4)
	int32_t ProxSensorMarkKey; // 0x8(0x4)
	int32_t PenetratingGunMarkKey; // 0xC(0x4)
	int32_t BreakthroughDefenderMarkKey; // 0x10(0x4)
	int32_t OnlyMarkerMarkKey; // 0x14(0x4)
	int32_t SpiderMarkKey; // 0x18(0x4)
	int32_t C601MarkKey; // 0x1C(0x4)
};

// Object: ScriptStruct GPGameplay.S2CDamageApply
// Size: 0x118 (Inherited: 0x0)
struct FS2CDamageApply
{
	uint64_t Guid; // 0x0(0x8)
	uint64_t FireId; // 0x8(0x8)
	float HPDamage; // 0x10(0x4)
	float ArmorDamage; // 0x14(0x4)
	uint64_t AmmoId; // 0x18(0x8)
	struct FHitResult HitResult; // 0x20(0x88)
	struct FWeaponIdentity MakerWeaponIdentity; // 0xA8(0x4)
	uint8_t Pad_0xAC[0x4]; // 0xAC(0x4)
	struct AActor* MakerActor; // 0xB0(0x8)
	struct AActor* MakerInstigator; // 0xB8(0x8)
	struct AActor* Taker; // 0xC0(0x8)
	uint8_t TakerSourceStatus; // 0xC8(0x1)
	uint8_t TakerResultStatus; // 0xC9(0x1)
	uint8_t ArmorLevel; // 0xCA(0x1)
	uint8_t Pad_0xCB[0x5]; // 0xCB(0x5)
	int64_t AttackerValueId; // 0xD0(0x8)
	uint8_t bBreakArmor : 1; // 0xD8(0x1), Mask(0x1)
	uint8_t BitPad_0xD8_1 : 7; // 0xD8(0x1)
	uint8_t bBreakHelmetArmor : 1; // 0xD9(0x1), Mask(0x1)
	uint8_t BitPad_0xD9_1 : 7; // 0xD9(0x1)
	uint8_t bShieldBreak : 1; // 0xDA(0x1), Mask(0x1)
	uint8_t BitPad_0xDA_1 : 7; // 0xDA(0x1)
	EDamageType HitDamageType; // 0xDB(0x1)
	float CameraSwayHitScale; // 0xDC(0x4)
	float GunSwayHitScale; // 0xE0(0x4)
	struct FVector_NetQuantize MakerOwnerLocation; // 0xE4(0xC)
	struct FGameplayTagContainer TagContainer; // 0xF0(0x20)
	EDamageSystemDamageType DamageType; // 0x110(0x1)
	EDamageType DamageTypeForSound; // 0x111(0x1)
	uint8_t Pad_0x112[0x6]; // 0x112(0x6)
};

// Object: ScriptStruct GPGameplay.S2CDamageApply_Radial
// Size: 0x30 (Inherited: 0x0)
struct FS2CDamageApply_Radial
{
	struct TArray<struct FS2CDamageApplyItem_Radial> DamageItems; // 0x0(0x10)
	struct AActor* MakerActor; // 0x10(0x8)
	struct AActor* MakerInstigator; // 0x18(0x8)
	struct FVector RadialLocation; // 0x20(0xC)
	EDamageType DamageType; // 0x2C(0x1)
	uint8_t Pad_0x2D[0x3]; // 0x2D(0x3)
};

// Object: ScriptStruct GPGameplay.S2CDamageApplyItem_Radial
// Size: 0x40 (Inherited: 0x0)
struct FS2CDamageApplyItem_Radial
{
	uint64_t Guid; // 0x0(0x8)
	float HPDamage; // 0x8(0x4)
	float ArmorDamage; // 0xC(0x4)
	struct AActor* Taker; // 0x10(0x8)
	uint64_t AttackId; // 0x18(0x8)
	uint8_t bBlock : 1; // 0x20(0x1), Mask(0x1)
	uint8_t BitPad_0x20_1 : 7; // 0x20(0x1)
	uint8_t Pad_0x21[0x3]; // 0x21(0x3)
	struct FVector_NetQuantize MakerOwnerLocation; // 0x24(0xC)
	int32_t HitNum; // 0x30(0x4)
	uint8_t bBreakArmor : 1; // 0x34(0x1), Mask(0x1)
	uint8_t BitPad_0x34_1 : 7; // 0x34(0x1)
	uint8_t bBreakHelmetArmor : 1; // 0x35(0x1), Mask(0x1)
	uint8_t BitPad_0x35_1 : 7; // 0x35(0x1)
	uint8_t bShieldBreak : 1; // 0x36(0x1), Mask(0x1)
	uint8_t BitPad_0x36_1 : 7; // 0x36(0x1)
	uint8_t TakerSourceStatus; // 0x37(0x1)
	uint8_t TakerResultStatus; // 0x38(0x1)
	uint8_t Pad_0x39[0x7]; // 0x39(0x7)
};

// Object: ScriptStruct GPGameplay.S2CRequestPointHitActionFaild
// Size: 0x18 (Inherited: 0x0)
struct FS2CRequestPointHitActionFaild
{
	uint64_t Guid; // 0x0(0x8)
	uint64_t FaildRuleId; // 0x8(0x8)
	EDamageValidateResult ResultType; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	int32_t ResultCode; // 0x14(0x4)
};

// Object: ScriptStruct GPGameplay.C2SBatchMakeDamage
// Size: 0x10 (Inherited: 0x0)
struct FC2SBatchMakeDamage
{
	struct TArray<struct FC2SMakeDamage> DamageItems; // 0x0(0x10)
};

// Object: ScriptStruct GPGameplay.C2SMakeDamage
// Size: 0x180 (Inherited: 0x0)
struct FC2SMakeDamage
{
	uint64_t Guid; // 0x0(0x8)
	struct FHitResult HitResult; // 0x8(0x88)
	uint64_t AttackId; // 0x90(0x8)
	struct AActor* MakerActor; // 0x98(0x8)
	struct AActor* MakerInstigator; // 0xA0(0x8)
	struct AActor* Taker; // 0xA8(0x8)
	uint64_t InstigatorUin; // 0xB0(0x8)
	uint64_t DamageTakerUin; // 0xB8(0x8)
	EDamageSystemDamageType DamageType; // 0xC0(0x1)
	uint8_t Pad_0xC1[0x3]; // 0xC1(0x3)
	struct FVector MakerLocation; // 0xC4(0xC)
	struct FVector MakerRotation; // 0xD0(0xC)
	struct FVector MakerInstigatorLocation; // 0xDC(0xC)
	struct FVector MakerInstigatorRotation; // 0xE8(0xC)
	struct FVector TakerLocation; // 0xF4(0xC)
	struct FVector TakerRotation; // 0x100(0xC)
	float StartTime; // 0x10C(0x4)
	struct FVector PointStartLocation; // 0x110(0xC)
	struct FVector PointDirection; // 0x11C(0xC)
	struct FVector RadialLocation; // 0x128(0xC)
	uint8_t Pad_0x134[0x4]; // 0x134(0x4)
	struct TArray<struct AActor*> IgnoreActors; // 0x138(0x10)
	struct TArray<struct UObject*> IngoreClass; // 0x148(0x10)
	EDamageType DamageTag; // 0x158(0x1)
	uint8_t Pad_0x159[0x7]; // 0x159(0x7)
	struct FGameplayTagContainer DamageTagsContainer; // 0x160(0x20)
};

// Object: ScriptStruct GPGameplay.RescueInfoData
// Size: 0x10 (Inherited: 0x0)
struct FRescueInfoData
{
	struct AGPCharacterBase* CHARACTER; // 0x0(0x8)
	uint8_t Pad_0x8[0x8]; // 0x8(0x8)
};

// Object: ScriptStruct GPGameplay.ActorMoveMessage
// Size: 0x2C (Inherited: 0x0)
struct FActorMoveMessage
{
	struct FVector Position; // 0x0(0xC)
	struct FRotator Rotation; // 0xC(0xC)
	struct FVector Velocity; // 0x18(0xC)
	uint32_t ClientTick; // 0x24(0x4)
	uint8_t Snapshot : 1; // 0x28(0x1), Mask(0x1)
	uint8_t BitPad_0x28_1 : 7; // 0x28(0x1)
	uint8_t Pad_0x29[0x3]; // 0x29(0x3)
};

// Object: ScriptStruct GPGameplay.RepOverrideMovementInfo
// Size: 0x2 (Inherited: 0x0)
struct FRepOverrideMovementInfo
{
	uint8_t EnableOverrideSpeedPose : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	EOverrideMovementType CurrentOverridePose; // 0x1(0x1)
};

// Object: ScriptStruct GPGameplay.DeadInfo
// Size: 0x68 (Inherited: 0x0)
struct FDeadInfo
{
	uint8_t bIsDead : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float DyingTime; // 0x4(0x4)
	float DeadTime; // 0x8(0x4)
	uint8_t bMoving : 1; // 0xC(0x1), Mask(0x1)
	uint8_t BitPad_0xC_1 : 7; // 0xC(0x1)
	EDirection DeathDirection; // 0xD(0x1)
	EChracterPoseType DeathPose; // 0xE(0x1)
	EDamageType DeathDamageType; // 0xF(0x1)
	float AngleFromShotDir; // 0x10(0x4)
	struct FVector RawShotDir; // 0x14(0xC)
	struct FName ShotBone; // 0x20(0x8)
	struct FVector RawShotPos; // 0x28(0xC)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
	uint64_t KillerUin; // 0x38(0x8)
	uint64_t KillerGUID; // 0x40(0x8)
	float DeathAnimDelayTime; // 0x48(0x4)
	struct TWeakObjectPtr<struct AWeaponBase> SourceWeapon; // 0x4C(0x8)
	struct FVector DeathLoc; // 0x54(0xC)
	float ServerDeadTime; // 0x60(0x4)
	uint8_t Pad_0x64[0x4]; // 0x64(0x4)
};

// Object: ScriptStruct GPGameplay.CharMarkerData
// Size: 0x18 (Inherited: 0x0)
struct FCharMarkerData
{
	uint8_t Active : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t OwnerCampID; // 0x4(0x4)
	int32_t OwnerTeamID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	uint64_t OwnerUin; // 0x10(0x8)
};

// Object: ScriptStruct GPGameplay.CharacterControlledActorInfo
// Size: 0x20 (Inherited: 0x0)
struct FCharacterControlledActorInfo
{
	struct AActor* ControlledActor; // 0x0(0x8)
	uint8_t bIsControlledActorValid : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
	struct AActor* CorrespondingViewTargetBeforeControlled; // 0x10(0x8)
	uint32_t ControlledId; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct GPGameplay.AntiPeekModeInfo
// Size: 0x28 (Inherited: 0x0)
struct FAntiPeekModeInfo
{
	int32_t TickNumber; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FString> HiddenCharacterNames; // 0x8(0x10)
	struct TArray<struct FString> VisibleCharacterNames; // 0x18(0x10)
};

// Object: ScriptStruct GPGameplay.GPCollisionManager
// Size: 0x38 (Inherited: 0x0)
struct FGPCollisionManager
{
	struct UPrimitiveComponent* CapsuleComp; // 0x0(0x8)
	struct UPrimitiveComponent* ProneComp; // 0x8(0x8)
	struct TArray<struct FGPCollisionInfoSimple> ActivateProneCollisionState; // 0x10(0x10)
	struct TArray<struct FGPCollisionInfoSimple> ActivateCapsuleCollisionState; // 0x20(0x10)
	uint8_t Pad_0x30[0x8]; // 0x30(0x8)
};

// Object: ScriptStruct GPGameplay.GPCollisionInfoSimple
// Size: 0x8 (Inherited: 0x0)
struct FGPCollisionInfoSimple
{
	ECollisionState State; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t Priority; // 0x4(0x4)
};

// Object: ScriptStruct GPGameplay.PoseTransitionTime
// Size: 0x18 (Inherited: 0x0)
struct FPoseTransitionTime
{
	float StandToProneTransitionTime; // 0x0(0x4)
	float StandToCrouchTransitionTime; // 0x4(0x4)
	float CrouchToStandTransitionTime; // 0x8(0x4)
	float CrouchToProneTransitionTime; // 0xC(0x4)
	float ProneToStandTransitionTime; // 0x10(0x4)
	float ProneToCrouchTransitionTime; // 0x14(0x4)
};

// Object: ScriptStruct GPGameplay.InteractingContext
// Size: 0x30 (Inherited: 0x0)
struct FInteractingContext
{
	int32_t OpenDoorInFrontOrBack; // 0x0(0x4)
	int32_t CloseDoorPushOrPull; // 0x4(0x4)
	int32_t OverrideOpenDoorInFrontOrBack; // 0x8(0x4)
	int32_t SingleItemContainerIndex; // 0xC(0x4)
	int32_t Client2ServerIndex; // 0x10(0x4)
	struct FVector OriginPosByClient; // 0x14(0xC)
	struct FVector OriginForwardByClient; // 0x20(0xC)
	uint8_t bHitInteractorByClient : 1; // 0x2C(0x1), Mask(0x1)
	uint8_t BitPad_0x2C_1 : 7; // 0x2C(0x1)
	uint8_t bDownloadItemToSafeBoxFirst : 1; // 0x2D(0x1), Mask(0x1)
	uint8_t BitPad_0x2D_1 : 7; // 0x2D(0x1)
	uint8_t bCanCharacterEnterEgg : 1; // 0x2E(0x1), Mask(0x1)
	uint8_t BitPad_0x2E_1 : 7; // 0x2E(0x1)
	uint8_t bBraveGameConvey_FirstMeet : 1; // 0x2F(0x1), Mask(0x1)
	uint8_t BitPad_0x2F_1 : 7; // 0x2F(0x1)
};

// Object: ScriptStruct GPGameplay.GPGameModeLogicConfig
// Size: 0x50 (Inherited: 0x0)
struct FGPGameModeLogicConfig
{
	uint8_t UseTPPDriving : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t SnapToGetOnOffDriving : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t DisableDeadBodyLootingFeature : 1; // 0x2(0x1), Mask(0x1)
	uint8_t BitPad_0x2_1 : 7; // 0x2(0x1)
	uint8_t DisableLiveSpectatingFeature : 1; // 0x3(0x1), Mask(0x1)
	uint8_t BitPad_0x3_1 : 7; // 0x3(0x1)
	uint8_t DisableMoveAndAttackedImpendingDeath : 1; // 0x4(0x1), Mask(0x1)
	uint8_t BitPad_0x4_1 : 7; // 0x4(0x1)
	uint8_t EnableCarryBody : 1; // 0x5(0x1), Mask(0x1)
	uint8_t BitPad_0x5_1 : 7; // 0x5(0x1)
	uint8_t Pad_0x6[0x2]; // 0x6(0x2)
	float RebornImpendingDeathHealthValue; // 0x8(0x4)
	float FastRescueRebornImpendingDeathHealthValue; // 0xC(0x4)
	uint8_t EnableParachute : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t ForceUseLocalBattleClassSkillSetting : 1; // 0x11(0x1), Mask(0x1)
	uint8_t BitPad_0x11_1 : 7; // 0x11(0x1)
	uint8_t ClientDefaultRecordMemoryReplayForKillcam : 1; // 0x12(0x1), Mask(0x1)
	uint8_t BitPad_0x12_1 : 7; // 0x12(0x1)
	uint8_t Pad_0x13[0x1]; // 0x13(0x1)
	float KillCamTimeBufferBeforeDead; // 0x14(0x4)
	float KillCamTimeBufferAfterDead; // 0x18(0x4)
	float KillCamRecordHz; // 0x1C(0x4)
	struct FString KillCamHUDViewName; // 0x20(0x10)
	struct TArray<struct FString> EnableKillCameraLevelNames; // 0x30(0x10)
	struct TArray<struct FString> EnableKillCameraLevelNames_ABT; // 0x40(0x10)
};

// Object: ScriptStruct GPGameplay.ItemInfoContext
// Size: 0x60 (Inherited: 0x0)
struct FItemInfoContext
{
	int32_t Durability; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<uint64_t> TuneIds; // 0x8(0x10)
	struct TArray<float> TuneValues; // 0x18(0x10)
	uint8_t BindType; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
	uint64_t BindPlayerId; // 0x30(0x8)
	uint8_t bRawBind : 1; // 0x38(0x1), Mask(0x1)
	uint8_t BitPad_0x38_1 : 7; // 0x38(0x1)
	uint8_t Pad_0x39[0x7]; // 0x39(0x7)
	struct FModularWeaponPartNodeAttr NodeAttr; // 0x40(0x20)
};

// Object: ScriptStruct GPGameplay.SceneWeaponOnFireInfo
// Size: 0x8 (Inherited: 0x0)
struct FSceneWeaponOnFireInfo
{
	int32_t SceneWeaponID; // 0x0(0x4)
	int32_t CampId; // 0x4(0x4)
};

// Object: ScriptStruct GPGameplay.GPGameplayAttribute
// Size: 0x38 (Inherited: 0x0)
struct FGPGameplayAttribute
{
	struct FString AttributeName; // 0x0(0x10)
	struct TFieldPath<FProperty> Attribute; // 0x10(0x20)
	struct UObject* AttributeOwner; // 0x30(0x8)
};

// Object: ScriptStruct GPGameplay.CharacterPartBoneArray
// Size: 0x10 (Inherited: 0x0)
struct FCharacterPartBoneArray
{
	struct TArray<struct FName> BoneNameArray; // 0x0(0x10)
};

// Object: ScriptStruct GPGameplay.CharacterPartDamageRateInfo
// Size: 0x18 (Inherited: 0x0)
struct FCharacterPartDamageRateInfo
{
	struct TArray<struct FName> BoneNameArray; // 0x0(0x10)
	float DamageRate; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct GPGameplay.GPPlayerUIN
// Size: 0x8 (Inherited: 0x0)
struct FGPPlayerUIN
{
	uint64_t Uin; // 0x0(0x8)
};

// Object: ScriptStruct GPGameplay.RedeployMarkInit
// Size: 0xD0 (Inherited: 0x0)
struct FRedeployMarkInit
{
	struct AActor* TargetActor; // 0x0(0x8)
	uint64_t UniqueId; // 0x8(0x8)
	struct APlayerController* Controller; // 0x10(0x8)
	struct TArray<EMarkFeature> Features; // 0x18(0x10)
	struct UPaperSprite* Sprite0; // 0x28(0x8)
	struct UPaperSprite* Sprite1; // 0x30(0x8)
	struct UPaperSprite* Sprite2; // 0x38(0x8)
	struct UPaperSprite* Sprite3; // 0x40(0x8)
	struct FColor Color0; // 0x48(0x4)
	struct FColor Color1; // 0x4C(0x4)
	struct AActor* Actor0; // 0x50(0x8)
	struct AActor* Actor1; // 0x58(0x8)
	struct UObject* Object0; // 0x60(0x8)
	struct UObject* Object1; // 0x68(0x8)
	int32_t Int0; // 0x70(0x4)
	int32_t Int1; // 0x74(0x4)
	float Float0; // 0x78(0x4)
	uint8_t Pad_0x7C[0x4]; // 0x7C(0x4)
	uint64_t Int2; // 0x80(0x8)
	struct FString String0; // 0x88(0x10)
	struct FText Text0; // 0x98(0x18)
	struct FName Name0; // 0xB0(0x8)
	struct FVector TargetActorLocation; // 0xB8(0xC)
	float TargetActorRotation; // 0xC4(0x4)
	uint64_t Int64; // 0xC8(0x8)
};

// Object: ScriptStruct GPGameplay.GPAbilityInfo
// Size: 0x38 (Inherited: 0x0)
struct FGPAbilityInfo
{
	int32_t ProjectileId; // 0x0(0x4)
	int32_t BulletId; // 0x4(0x4)
	int32_t SkinApperanceId; // 0x8(0x4)
	int32_t SkillSkinId; // 0xC(0x4)
	uint64_t ItemID; // 0x10(0x8)
	int32_t SkillId; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	struct AActor* CharacterOwner; // 0x20(0x8)
	struct AActor* WeaponOwner; // 0x28(0x8)
	struct AActor* ProjectileOwner; // 0x30(0x8)
};

// Object: ScriptStruct GPGameplay.AbilityEntityQuery
// Size: 0xC0 (Inherited: 0x0)
struct FAbilityEntityQuery
{
	uint8_t Pad_0x0[0xC0]; // 0x0(0xC0)
};

// Object: ScriptStruct GPGameplay.AbilityEntityHandle
// Size: 0xC (Inherited: 0x0)
struct FAbilityEntityHandle
{
	int32_t Index; // 0x0(0x4)
	int32_t SerialNumber; // 0x4(0x4)
	int32_t InsntaceID; // 0x8(0x4)
};

// Object: ScriptStruct GPGameplay.AbilityInstancedStruct
// Size: 0x10 (Inherited: 0x0)
struct FAbilityInstancedStruct
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct GPGameplay.AbilityShareMemoryPool
// Size: 0x50 (Inherited: 0x0)
struct FAbilityShareMemoryPool
{
	uint8_t Pad_0x0[0x50]; // 0x0(0x50)
};

// Object: ScriptStruct GPGameplay.AbilityShareMemoryPoolHandle
// Size: 0x10 (Inherited: 0x0)
struct FAbilityShareMemoryPoolHandle
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct GPGameplay.AbilityShareMemoryWithFreeList
// Size: 0x28 (Inherited: 0x0)
struct FAbilityShareMemoryWithFreeList
{
	uint8_t Pad_0x0[0x28]; // 0x0(0x28)
};

// Object: ScriptStruct GPGameplay.AbilityShareMemoryChunk
// Size: 0x30 (Inherited: 0x0)
struct FAbilityShareMemoryChunk
{
	uint8_t Pad_0x0[0x30]; // 0x0(0x30)
};

// Object: ScriptStruct GPGameplay.AbilityShareMemory
// Size: 0x20 (Inherited: 0x0)
struct FAbilityShareMemory
{
	uint8_t Pad_0x0[0x20]; // 0x0(0x20)
};

// Object: ScriptStruct GPGameplay.AbilityWeaponBlueprintAnimInst
// Size: 0x58 (Inherited: 0x0)
struct FAbilityWeaponBlueprintAnimInst
{
	int64_t SkinId; // 0x0(0x8)
	struct TSoftClassPtr<struct UAnimInstance*> AnimInst_1P; // 0x8(0x28)
	struct TSoftClassPtr<struct UAnimInstance*> AnimInst_3P; // 0x30(0x28)
};

// Object: ScriptStruct GPGameplay.RepAmmoTimeLine
// Size: 0x20 (Inherited: 0x0)
struct FRepAmmoTimeLine
{
	struct TArray<struct FAmmoKeyFrame> Data; // 0x0(0x10)
	int32_t Front; // 0x10(0x4)
	int32_t Rear; // 0x14(0x4)
	int32_t MaxSize; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct GPGameplay.AmmoDelta
// Size: 0x8 (Inherited: 0x0)
struct FAmmoDelta
{
	int32_t ClipAmmo; // 0x0(0x4)
	int32_t CarriedAmmo; // 0x4(0x4)
};

// Object: ScriptStruct GPGameplay.AmmoKeyFrame
// Size: 0x38 (Inherited: 0x28)
struct FAmmoKeyFrame : FBasePreViewFrame
{
	int32_t ClipAmmo; // 0x24(0x4)
	int32_t CarriedAmmo; // 0x28(0x4)
	struct FAmmoDelta Delta; // 0x2C(0x8)
};

// Object: ScriptStruct GPGameplay.AnimDataRealtimeStats
// Size: 0x30 (Inherited: 0x0)
struct FAnimDataRealtimeStats
{
	float Timestamp; // 0x0(0x4)
	int32_t BasicAnimDatasCount; // 0x4(0x4)
	int32_t CharacterAnimDataComponentsCount; // 0x8(0x4)
	int32_t WeaponAnimDataComponentsCount; // 0xC(0x4)
	int32_t LoadedAnimAssetCachesCount; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	int64_t AnimAssetCachesMemoryUsage; // 0x18(0x8)
	int32_t SystemAnimSequenceCount; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	int64_t SystemAnimSequenceMemoryUsage; // 0x28(0x8)
};

// Object: ScriptStruct GPGameplay.AnimLODConfigParam
// Size: 0x14 (Inherited: 0x0)
struct FAnimLODConfigParam
{
	int32_t Index; // 0x0(0x4)
	int32_t ExplicitlyAnimGraphLOD; // 0x4(0x4)
	int32_t ExplicitlyURO; // 0x8(0x4)
	int32_t TickRate; // 0xC(0x4)
	uint8_t TickReverse : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
};

// Object: ScriptStruct GPGameplay.AnimNode_BlendCurveOnly
// Size: 0x80 (Inherited: 0x48)
struct FAnimNode_BlendCurveOnly : FAnimNode_Base
{
	struct FPoseLink BasePose; // 0x48(0x18)
	struct FPoseLink CurvePose; // 0x60(0x18)
	ECurveBlendOption_BCOnly CurveBlendOption; // 0x78(0x1)
	uint8_t Pad_0x79[0x7]; // 0x79(0x7)
};

// Object: ScriptStruct GPGameplay.AnimNode_BulletChain
// Size: 0x178 (Inherited: 0x108)
struct FAnimNode_BulletChain : FAnimNode_SkeletalControlBase
{
	int32_t CurrentBulletNum; // 0x108(0x4)
	uint8_t Pad_0x10C[0x4]; // 0x10C(0x4)
	struct TMap<int32_t, struct FBoneReference> BulletBoneMap; // 0x110(0x50)
	uint8_t Pad_0x160[0x18]; // 0x160(0x18)
};

// Object: ScriptStruct GPGameplay.AnimNode_CopyPartialPoseWithOffset
// Size: 0x258 (Inherited: 0x48)
struct FAnimNode_CopyPartialPoseWithOffset : FAnimNode_Base
{
	struct TWeakObjectPtr<struct USkeletalMeshComponent> SourceMeshComponent; // 0x48(0x8)
	uint8_t bUseAttachedParent : 1; // 0x50(0x1), Mask(0x1)
	uint8_t BitPad_0x50_1 : 7; // 0x50(0x1)
	uint8_t Pad_0x51[0x7]; // 0x51(0x7)
	struct TMap<struct FName, struct FName> BoneMappingGen; // 0x58(0x50)
	struct TMap<struct FName, struct FName> BoneMappingInternal; // 0xA8(0x50)
	struct TMap<struct FName, struct FTransform> BoneOffsets; // 0xF8(0x50)
	struct TSoftObjectPtr<UAnimSequence> PoseAnim; // 0x148(0x28)
	struct FSoftObjectPath CharacterPose; // 0x170(0x18)
	uint8_t Pad_0x188[0xD0]; // 0x188(0xD0)
};

// Object: ScriptStruct GPGameplay.AnimNode_CustomBlendSpacePlayer
// Size: 0x320 (Inherited: 0x300)
struct FAnimNode_CustomBlendSpacePlayer : FAnimNode_BlendSpacePlayer
{
	struct UAnimSequence* CacheDebugPtr; // 0x300(0x8)
	uint8_t Pad_0x308[0x18]; // 0x308(0x18)
};

// Object: ScriptStruct GPGameplay.AnimNode_Parabola
// Size: 0x190 (Inherited: 0x108)
struct FAnimNode_Parabola : FAnimNode_SkeletalControlBase
{
	float InitSpeed; // 0x108(0x4)
	float InitSpeedZ; // 0x10C(0x4)
	struct FVector StartLocaltion; // 0x110(0xC)
	struct FBoneReference ParabolaBoneReference; // 0x11C(0x10)
	float LimitTime; // 0x12C(0x4)
	uint8_t Pad_0x130[0x60]; // 0x130(0x60)
};

// Object: ScriptStruct GPGameplay.AnimNode_PartApplyAdditive
// Size: 0x1A0 (Inherited: 0x128)
struct FAnimNode_PartApplyAdditive : FAnimNode_ApplyAdditive
{
	struct UAnimSequenceBase* Sequence; // 0x128(0x8)
	float SequencePlayTime; // 0x130(0x4)
	EPartNodeFunc PartNodeFunc; // 0x134(0x1)
	uint8_t Pad_0x135[0x6B]; // 0x135(0x6B)
};

// Object: ScriptStruct GPGameplay.AnimNode_PartCopyBone
// Size: 0x88 (Inherited: 0x48)
struct FAnimNode_PartCopyBone : FAnimNode_Base
{
	struct FPoseLink Source; // 0x48(0x18)
	struct FName SourceBoneName; // 0x60(0x8)
	struct USkeletalMesh* SrcSkeletalMesh; // 0x68(0x8)
	struct FName TargetBoneName; // 0x70(0x8)
	struct USkeletalMesh* TargetSkeletalMesh; // 0x78(0x8)
	uint8_t Pad_0x80[0x8]; // 0x80(0x8)
};

// Object: ScriptStruct GPGameplay.VirtualParent_BoneGroup
// Size: 0xB0 (Inherited: 0x0)
struct FVirtualParent_BoneGroup
{
	uint8_t Pad_0x0[0x60]; // 0x0(0x60)
	struct TArray<struct FBoneReference> VirtualChildren; // 0x60(0x10)
	EBoneControlSpace RotationSpace; // 0x70(0x1)
	EBoneControlSpace LocationSpace; // 0x71(0x1)
	uint8_t Pad_0x72[0x3E]; // 0x72(0x3E)
};

// Object: ScriptStruct GPGameplay.AnimNode_SkeletalControlGunSwing
// Size: 0x740 (Inherited: 0x108)
struct FAnimNode_SkeletalControlGunSwing : FAnimNode_SkeletalControlBase
{
	uint8_t Pad_0x108[0x8]; // 0x108(0x8)
	struct FVirtualParent_BoneGroup VBADSGunSwingTwoShoulder; // 0x110(0xB0)
	struct FVirtualParent_BoneGroup VBGunSwingTwoShoulder; // 0x1C0(0xB0)
	struct FVirtualParent_BoneGroup VBGunSwingRightArm; // 0x270(0xB0)
	struct FVirtualParent_BoneGroup VBGunSwingLeftArm; // 0x320(0xB0)
	struct FVirtualParent_BoneGroup VBMovingGunSwingTwoShoulder; // 0x3D0(0xB0)
	struct FVirtualParent_BoneGroup VBMovingGunSwingLeftHand; // 0x480(0xB0)
	struct FVirtualParent_BoneGroup OnlyRightShoulder; // 0x530(0xB0)
	struct FAnimNode_ModifyBone MBMovingGunSwingLeftShoulder; // 0x5E0(0x160)
};

// Object: ScriptStruct GPGameplay.AnimNode_SkeletalControlSpine012
// Size: 0x150 (Inherited: 0x108)
struct FAnimNode_SkeletalControlSpine012 : FAnimNode_SkeletalControlBase
{
	uint8_t Pad_0x108[0x48]; // 0x108(0x48)
};

// Object: ScriptStruct GPGameplay.AbilityEffectData
// Size: 0x34 (Inherited: 0x0)
struct FAbilityEffectData
{
	struct FName ResourceID; // 0x0(0x8)
	struct FName SocketName; // 0x8(0x8)
	struct FVector LocationOffset; // 0x10(0xC)
	struct FRotator RotationOffset; // 0x1C(0xC)
	struct FVector Scale; // 0x28(0xC)
};

// Object: ScriptStruct GPGameplay.CloseEyeScreenFXInfo
// Size: 0xC (Inherited: 0x0)
struct FCloseEyeScreenFXInfo
{
	float CloseEyeBlendInTime; // 0x0(0x4)
	float CloseEyeDurationTime; // 0x4(0x4)
	float CloseEyeBlendOutTime; // 0x8(0x4)
};

// Object: ScriptStruct GPGameplay.TextureConfig
// Size: 0x18 (Inherited: 0x0)
struct FTextureConfig
{
	int32_t MaterialIndex; // 0x0(0x4)
	struct FName ParameterName; // 0x4(0x8)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct UTexture* Texture; // 0x10(0x8)
};

// Object: ScriptStruct GPGameplay.ArmedforceAttrOpTgLogData
// Size: 0x18 (Inherited: 0x0)
struct FArmedforceAttrOpTgLogData
{
	struct FName AttributeName; // 0x0(0x8)
	int64_t AttrOperatorID; // 0x8(0x8)
	int32_t SkillId; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct GPGameplay.ArmedforceCommonData
// Size: 0x168 (Inherited: 0x0)
struct FArmedforceCommonData
{
	uint8_t Pad_0x0[0x58]; // 0x0(0x58)
	int32_t ClaymoreTriggerCount; // 0x58(0x4)
	int32_t ClaymoreKillCount; // 0x5C(0x4)
	int32_t AntiTankTriggerCount; // 0x60(0x4)
	int32_t AntiTankKillCount; // 0x64(0x4)
	int32_t AdrenalineActiveCount; // 0x68(0x4)
	int32_t AdrenalineTotalLevelCount; // 0x6C(0x4)
	int32_t AdrenalineTotalKillCount; // 0x70(0x4)
	int32_t AmmoPackSelfCount; // 0x74(0x4)
	int32_t AmmoPackOtherCount; // 0x78(0x4)
	int32_t HealthPackSelfCount; // 0x7C(0x4)
	int32_t HelthPackOtherCount; // 0x80(0x4)
	int32_t AmmoBoxUseCount; // 0x84(0x4)
	int32_t AmmoBoxEffectCount; // 0x88(0x4)
	int32_t HealthBoxUseCount; // 0x8C(0x4)
	int32_t HealthBoxEffectCount; // 0x90(0x4)
	int32_t HighExplosionFireCount; // 0x94(0x4)
	int32_t HighExplosionKillCount; // 0x98(0x4)
	int32_t SmokeExplosionFireCount; // 0x9C(0x4)
	int32_t SmokeExplosionHitPlayerCount; // 0xA0(0x4)
	int32_t FlameThrowerUseCount; // 0xA4(0x4)
	int32_t FlameThrowerKillCount; // 0xA8(0x4)
	int32_t InjectionUseCount; // 0xAC(0x4)
	int32_t InjectionHealAmount; // 0xB0(0x4)
	int32_t ArmorPlateUseCount; // 0xB4(0x4)
	int32_t ArmorPlateDefenceAmount; // 0xB8(0x4)
	uint8_t Pad_0xBC[0x4]; // 0xBC(0x4)
	int64_t C303PassiveBeTriggeredCount; // 0xC0(0x8)
	float C303PassiveBeTriggeredTime; // 0xC8(0x4)
	float C303PassiveSOLDisturbanceTime; // 0xCC(0x4)
	float C303PassiveMPDisturbanceTime; // 0xD0(0x4)
	int32_t SkillAbilityCustomUse1; // 0xD4(0x4)
	int32_t SkillAbilityCustomUse2; // 0xD8(0x4)
	uint8_t Pad_0xDC[0x30]; // 0xDC(0x30)
	int32_t BFPAntiPersonnelFireCount; // 0x10C(0x4)
	int32_t BFPAntiPersonnelKillCount; // 0x110(0x4)
	int32_t BFPEMPFireCount; // 0x114(0x4)
	int32_t BFPEMPAffectedCount; // 0x118(0x4)
	uint8_t Pad_0x11C[0x4]; // 0x11C(0x4)
	int64_t BFPLaserPointerLockCompleteNum; // 0x120(0x8)
	int64_t BFPLaserPointerAssistNum; // 0x128(0x8)
	int64_t BFPRebornFlagUseNum; // 0x130(0x8)
	int32_t BFPADSDefenceCount; // 0x138(0x4)
	int32_t BFPADSCoolDownCount; // 0x13C(0x4)
	int32_t BFPAT4DestoryVehicleCount; // 0x140(0x4)
	int32_t BFPSpearDestoryVehicleCount; // 0x144(0x4)
	int32_t BFPStingerDestoryVehicleCount; // 0x148(0x4)
	int32_t BFPAT4DamageCount; // 0x14C(0x4)
	int32_t BFPSpearDamageCount; // 0x150(0x4)
	int32_t BFPStingerDamageCount; // 0x154(0x4)
	int32_t StartRescueCount; // 0x158(0x4)
	float AvgFailedRescueTime; // 0x15C(0x4)
	float RemainingHealthWhenImpendingDeath; // 0x160(0x4)
	float RemainingRescueTimeWhenDie; // 0x164(0x4)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlow
// Size: 0x48 (Inherited: 0x0)
struct FArmedforceDataFlow
{
	uint8_t Pad_0x0[0x48]; // 0x0(0x48)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowAssault
// Size: 0x228 (Inherited: 0x0)
struct FArmedforceDataFlowAssault
{
	int64_t PassiveSkillUseCnt; // 0x0(0x8)
	float PassiveSkillUseTime; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	int64_t PassiveSkillBeKill; // 0x10(0x8)
	int64_t Hit2sPassiveSkillUseCnt; // 0x18(0x8)
	int64_t ArmedPropUseCnt; // 0x20(0x8)
	float ArmedPropUse2FireTime; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
	int64_t ArmedPropFireCnt; // 0x30(0x8)
	int64_t ArmedPropKnockDownPlayerCnt; // 0x38(0x8)
	float ArmedPropHitDistance; // 0x40(0x4)
	uint8_t Pad_0x44[0x4]; // 0x44(0x4)
	int64_t ArmedPropDestroyVehicleCnt; // 0x48(0x8)
	int64_t ArmedPropHitVehicleCnt; // 0x50(0x8)
	int64_t ArmedPropHitPlayerCnt; // 0x58(0x8)
	int64_t ArmedPropHitPlayerNum; // 0x60(0x8)
	int64_t ActiveSkillUseCnt; // 0x68(0x8)
	float ActiveSkillUseTime; // 0x70(0x4)
	uint8_t Pad_0x74[0x4]; // 0x74(0x4)
	int64_t ActiveSkillKillPlayerCnt; // 0x78(0x8)
	int64_t ActiveSkillKillAICnt; // 0x80(0x8)
	struct FArmedforceCommonData CommonData; // 0x88(0x168)
	float AntiTankGrenadeTotalDamage; // 0x1F0(0x4)
	float AntiTankGrenadeBullet1TotalDamage; // 0x1F4(0x4)
	float AntiTankGrenadeBullet2TotalDamage; // 0x1F8(0x4)
	float AntiTankGrenadeBullet3TotalDamage; // 0x1FC(0x4)
	int32_t AntiTankGrenadeHitVehicleCnt; // 0x200(0x4)
	float AntiTankGrenadeHitVehicleAvgDamage; // 0x204(0x4)
	int32_t AntiTankGrenadeDestroyVehicleCnt; // 0x208(0x4)
	int32_t AntiPersonnelFireCount; // 0x20C(0x4)
	int32_t AntiPersonnelKillCount; // 0x210(0x4)
	int32_t EMPFireCount; // 0x214(0x4)
	int32_t EMPAffectedCount; // 0x218(0x4)
	uint8_t Pad_0x21C[0x4]; // 0x21C(0x4)
	struct AGPCharacter* OwnerCharacter; // 0x220(0x8)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowC103Butter
// Size: 0x1F8 (Inherited: 0x0)
struct FArmedforceDataFlowC103Butter
{
	int32_t MedicalDroneCureTeammateCnt; // 0x0(0x4)
	int32_t MedicalDronePathCureTeammateCnt; // 0x4(0x4)
	int32_t SelfCureCnt; // 0x8(0x4)
	float MedicalDroneTotalHealing; // 0xC(0x4)
	float MedicalDroneTotalSelfHealing; // 0x10(0x4)
	float MedicalDroneTotalTeammateHealing; // 0x14(0x4)
	float MedicalDronePathTotalHealing; // 0x18(0x4)
	float MedicalDronePathSelfHealing; // 0x1C(0x4)
	float MedicalDronePathTeammateHealing; // 0x20(0x4)
	float CombatSelfHealing; // 0x24(0x4)
	float CombatTeammateHealing; // 0x28(0x4)
	float CombatPathHealing; // 0x2C(0x4)
	int32_t MedicalDroneDestroyCnt; // 0x30(0x4)
	int32_t MedicalDroneDestroyedInWork5s; // 0x34(0x4)
	int32_t MedicalDroneUnableToReachTargetCnt; // 0x38(0x4)
	int32_t MedicalDroneAutoSearchSuccessCnt; // 0x3C(0x4)
	int32_t MedicalDroneLockTargetCnt; // 0x40(0x4)
	float MedicalDroneArrivalTotalTime; // 0x44(0x4)
	int32_t SmokeRemoteThrowCnt; // 0x48(0x4)
	float SmokeRemoteTime; // 0x4C(0x4)
	int32_t SmokeThrowWithin5sAfterHit; // 0x50(0x4)
	int32_t ButterRescueSuccessCnt; // 0x54(0x4)
	int32_t RemoteRescueSuccessCnt; // 0x58(0x4)
	float RemoteRescueTotalTime; // 0x5C(0x4)
	int32_t ButterRescueTimeOutCnt; // 0x60(0x4)
	int32_t RemoteSuccessInCombat; // 0x64(0x4)
	int32_t ButterRescueTimeOutCntInCombat; // 0x68(0x4)
	int32_t ButterRescueTimeOutDiedCnt; // 0x6C(0x4)
	int32_t ButterRescueKilledCnt; // 0x70(0x4)
	float ButterflyArrivalTime; // 0x74(0x4)
	int32_t ButterStartPathTracingCnt; // 0x78(0x4)
	int32_t ShieldRefreshCnt; // 0x7C(0x4)
	int32_t ShieldBreakCnt; // 0x80(0x4)
	int32_t ShieldBreaksByPlayerCnt; // 0x84(0x4)
	float ShieldDamageBlockedCnt; // 0x88(0x4)
	uint8_t Pad_0x8C[0x4]; // 0x8C(0x4)
	struct FArmedforceCommonData CommonData; // 0x90(0x168)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowC202
// Size: 0x268 (Inherited: 0x0)
struct FArmedforceDataFlowC202
{
	int64_t PassiveSkillMarkEnermyNum; // 0x0(0x8)
	int64_t UsePathTracingCnt; // 0x8(0x8)
	int64_t PathTracingMarkPlayerCnt; // 0x10(0x8)
	int64_t PathTracingMarkPawnCnt; // 0x18(0x8)
	int64_t KillMarkedPlayerCnt; // 0x20(0x8)
	int64_t PathTracingUserDieCnt; // 0x28(0x8)
	float PathTracingLineTotalTime; // 0x30(0x4)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
	int64_t UseFlashDroneCnt; // 0x38(0x8)
	int64_t FlashDroneFlowLineCnt; // 0x40(0x8)
	int64_t FlashDroneFlashCnt; // 0x48(0x8)
	int64_t FlashDroneFlashPlayerCnt; // 0x50(0x8)
	int64_t FlashDroneFlashAICnt; // 0x58(0x8)
	int64_t FlashDroneFlashRobotCnt; // 0x60(0x8)
	int64_t FlashDroneNearFlashCnt; // 0x68(0x8)
	int64_t FlashDroneMidFlashCnt; // 0x70(0x8)
	int64_t FlashDroneFarFlashCnt; // 0x78(0x8)
	int64_t FlashDroneBackFlashCnt; // 0x80(0x8)
	int64_t FlashDroneFlashAssistCnt; // 0x88(0x8)
	int64_t FlashDroneFlashBeDestoryCnt; // 0x90(0x8)
	int64_t UseDataKnifeCnt; // 0x98(0x8)
	int64_t DataKnifeHitPlayerCnt; // 0xA0(0x8)
	int64_t DataKnifeHitAICnt; // 0xA8(0x8)
	int64_t DataKnifeHitRobotCnt; // 0xB0(0x8)
	int64_t DataKnifeHitPlayerDamage; // 0xB8(0x8)
	int64_t DataKnifeKillPlayerCnt; // 0xC0(0x8)
	int64_t DataKnifeKillAICnt; // 0xC8(0x8)
	int64_t DataKnifeKillRobotCnt; // 0xD0(0x8)
	int64_t DataKnifeAssistCnt; // 0xD8(0x8)
	int64_t DataKnifeEMPSuppressionMineCnt; // 0xE0(0x8)
	int64_t DataKnifeEMPPathTracingCnt; // 0xE8(0x8)
	int64_t DataKnifeEMPRebornFlagCnt; // 0xF0(0x8)
	struct FArmedforceCommonData CommonData; // 0xF8(0x168)
	struct AGPCharacter* OwnerCharacter; // 0x260(0x8)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowC204
// Size: 0x208 (Inherited: 0x0)
struct FArmedforceDataFlowC204
{
	int32_t PassiveMarkPlayerCnt; // 0x0(0x4)
	int32_t PassiveMarkDeviceCnt; // 0x4(0x4)
	int32_t PassiveMarkDestroyDeviceCnt; // 0x8(0x4)
	int32_t FlashUseCnt; // 0xC(0x4)
	int32_t FlashHitPlayerCnt; // 0x10(0x4)
	int32_t FlashHitAILabCnt; // 0x14(0x4)
	int32_t FlashHitAICnt; // 0x18(0x4)
	int32_t FlashStrongCnt; // 0x1C(0x4)
	int32_t FlashMidCnt; // 0x20(0x4)
	int32_t FlashWeakCnt; // 0x24(0x4)
	int32_t FlashBackCnt; // 0x28(0x4)
	int32_t FlashBeatPlayer10sCnt; // 0x2C(0x4)
	int32_t FlashSkyExplodeCnt; // 0x30(0x4)
	int32_t FlashBounceExplodeCnt; // 0x34(0x4)
	int32_t InterferenceUseCnt; // 0x38(0x4)
	int32_t InterferenceHitPlayerCnt; // 0x3C(0x4)
	int32_t InterferenceHitAILabCnt; // 0x40(0x4)
	int32_t InterferenceHitAICnt; // 0x44(0x4)
	int32_t InterferenceBeatPlayer10sCnt; // 0x48(0x4)
	float InterferenceDamageCnt; // 0x4C(0x4)
	float InterferenceAssistCnt; // 0x50(0x4)
	float InterferenceKillCnt; // 0x54(0x4)
	int32_t SonarDeviceUseCnt; // 0x58(0x4)
	int32_t SonarDeviceDetectPlayerCnt; // 0x5C(0x4)
	float SonarDeviceDetectTotalTime; // 0x60(0x4)
	int32_t SonarDeviceRangeDetectPlayerCnt; // 0x64(0x4)
	int32_t SonarDeviceDestroyCnt; // 0x68(0x4)
	int32_t SonarDeviceDetectBeatPlayerCnt; // 0x6C(0x4)
	int32_t SonarDeviceAssistCnt; // 0x70(0x4)
	float SonarDeviceLifeTotalTime; // 0x74(0x4)
	int32_t SonarDeviceDetectPlayerWithNoiseCnt; // 0x78(0x4)
	int32_t SonarDeviceDetectMarkCnt; // 0x7C(0x4)
	int32_t SonarDeviceDetectPlayerFireCnt; // 0x80(0x4)
	int32_t SonarDeviceDetectPlayerMoveCnt; // 0x84(0x4)
	int32_t SonarDeviceDetectPlayerMedicCnt; // 0x88(0x4)
	int32_t SonarDeviceDetectPlayerRescueCnt; // 0x8C(0x4)
	int32_t SonarDeviceDetectPlayerSkillCnt; // 0x90(0x4)
	uint8_t Pad_0x94[0x4]; // 0x94(0x4)
	struct FArmedforceCommonData CommonData; // 0x98(0x168)
	struct AGPCharacter* OwnerCharacter; // 0x200(0x8)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowC501
// Size: 0x1D8 (Inherited: 0x0)
struct FArmedforceDataFlowC501
{
	int32_t PassiveTriggerCount; // 0x0(0x4)
	int32_t PassiveMarkEnemyCount; // 0x4(0x4)
	int32_t PassiveVOTriggerCount; // 0x8(0x4)
	int32_t FireArrowUseCount; // 0xC(0x4)
	int32_t FireArrowDamagePlayerCount; // 0x10(0x4)
	float FireArrowDamagePlayerTotal; // 0x14(0x4)
	int32_t FireArrowDamageAICount; // 0x18(0x4)
	float FireArrowDamageAITotal; // 0x1C(0x4)
	int32_t FireArrowKillPlayerCount; // 0x20(0x4)
	int32_t FireArrowKillAICount; // 0x24(0x4)
	int32_t FireArrowAssistCount; // 0x28(0x4)
	int32_t RollUseCount; // 0x2C(0x4)
	int32_t RollDeathCount; // 0x30(0x4)
	int32_t UltimateUseCount; // 0x34(0x4)
	float UltimateActiveDuration; // 0x38(0x4)
	int32_t CommandMarkCount; // 0x3C(0x4)
	int32_t CombatStyleSwitchCount; // 0x40(0x4)
	int32_t SummonAIDamagePlayerCount; // 0x44(0x4)
	float SummonAIDamagePlayerTotal; // 0x48(0x4)
	int32_t SummonAIDamageAICount; // 0x4C(0x4)
	float SummonAIDamageAITotal; // 0x50(0x4)
	int32_t SummonAIKillPlayerCount; // 0x54(0x4)
	int32_t SummonAIKillAICount; // 0x58(0x4)
	int32_t SummonAIAssistCount; // 0x5C(0x4)
	int32_t SummonAIBeHitByPlayerCount; // 0x60(0x4)
	float SummonAIBeHitByPlayerTotal; // 0x64(0x4)
	int32_t SummonAIBeKilledByPlayerCount; // 0x68(0x4)
	uint8_t Pad_0x6C[0x4]; // 0x6C(0x4)
	struct FArmedforceCommonData CommonData; // 0x70(0x168)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataC502
// Size: 0x1C8 (Inherited: 0x0)
struct FArmedforceDataC502
{
	int32_t FirstFastTreatBuffTriggerCount; // 0x0(0x4)
	int32_t SecondFastTreatBuffTriggerCount; // 0x4(0x4)
	int32_t SpeedBuffTriggerCount; // 0x8(0x4)
	float SpeedBuffDuration; // 0xC(0x4)
	int32_t FlameThrowerUseCount; // 0x10(0x4)
	int32_t FlamethrowerHitPlayerCount; // 0x14(0x4)
	float FlamethrowerDamageToPlayerTotal; // 0x18(0x4)
	float FlamethrowerDirectDamageToPlayer; // 0x1C(0x4)
	float FlamethrowerGroundFireDamageToPlayer; // 0x20(0x4)
	int32_t FlamethrowerHitAICount; // 0x24(0x4)
	float FlamethrowerDamageToAITotal; // 0x28(0x4)
	int32_t FlamethrowerKillPlayerCount; // 0x2C(0x4)
	int32_t FlamethrowerKillAICount; // 0x30(0x4)
	int32_t FlamethrowerAssistKillPlayerCount; // 0x34(0x4)
	int32_t FlashGrenadeUseCount; // 0x38(0x4)
	int32_t FlashGrenadeHitPlayerCount; // 0x3C(0x4)
	int32_t FlashGrenadeHitHumanLikeAICount; // 0x40(0x4)
	int32_t FlashGrenadeHitAICount; // 0x44(0x4)
	int32_t FlashGrenadeStrongFlashCount; // 0x48(0x4)
	int32_t FlashGrenadeMediumFlashCount; // 0x4C(0x4)
	int32_t FlashGrenadeWeakFlashCount; // 0x50(0x4)
	int32_t FlashGrenadeBackFlashCount; // 0x54(0x4)
	int32_t FlashGrenadeKnockDownWithin10sCount; // 0x58(0x4)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
	struct FArmedforceCommonData CommonData; // 0x60(0x168)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataC503
// Size: 0x1C0 (Inherited: 0x0)
struct FArmedforceDataC503
{
	int32_t FirstFastTreatBuffTriggerCount; // 0x0(0x4)
	int32_t SecondFastTreatBuffTriggerCount; // 0x4(0x4)
	int32_t SpeedBuffTriggerCount; // 0x8(0x4)
	float SpeedBuffDuration; // 0xC(0x4)
	int32_t WireMissileUseCount; // 0x10(0x4)
	int32_t WireMissileDamagePlayerCount; // 0x14(0x4)
	int32_t WireMissileDirectHitPlayerCount; // 0x18(0x4)
	int32_t WireMissileSplashDamagePlayerCount; // 0x1C(0x4)
	float WireMissileTotalDamageToPlayer; // 0x20(0x4)
	float WireMissileDirectHitDamageToPlayer; // 0x24(0x4)
	float WireMissileSplashDamageToPlayer; // 0x28(0x4)
	int32_t WireMissileHitAICount; // 0x2C(0x4)
	float WireMissileTotalDamageToAI; // 0x30(0x4)
	int32_t WireMissileKillAICount; // 0x34(0x4)
	int32_t WireMissileKillPlayerCount; // 0x38(0x4)
	int32_t WireMissileDirectHitKillPlayerCount; // 0x3C(0x4)
	int32_t WireMissileSplashKillPlayerCount; // 0x40(0x4)
	int32_t WireMissileAssistCount; // 0x44(0x4)
	int32_t WireMissileDeathWithin10sCount; // 0x48(0x4)
	int32_t WireMissileDestroyedByEnemyCount; // 0x4C(0x4)
	int32_t SmokeGrenadeUseCount; // 0x50(0x4)
	uint8_t Pad_0x54[0x4]; // 0x54(0x4)
	struct FArmedforceCommonData CommonData; // 0x58(0x168)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowClaire
// Size: 0x238 (Inherited: 0x0)
struct FArmedforceDataFlowClaire
{
	int64_t RopeSkillUseCount; // 0x0(0x8)
	int64_t RopeSkillManualPullCount; // 0x8(0x8)
	int64_t RopeSkillAutoPullCount; // 0x10(0x8)
	int64_t RopeSkillDeadCountWhenPull; // 0x18(0x8)
	int64_t RopeSkillDestoryedCount; // 0x20(0x8)
	int64_t RopeSkillMoveDis; // 0x28(0x8)
	int64_t RopeSkillOverDisCount; // 0x30(0x8)
	int64_t RollCount; // 0x38(0x8)
	int64_t DeadCountWhenRoll; // 0x40(0x8)
	int64_t ElectricShockBombUseCount; // 0x48(0x8)
	int64_t ElectricShockBombAffectedCount; // 0x50(0x8)
	int64_t ElectricShockBombBoxAffectedCount; // 0x58(0x8)
	int64_t ElectricShockBombSphereAffectedCount; // 0x60(0x8)
	int64_t ElectricShockAssistCount; // 0x68(0x8)
	int64_t ElectricShockThrowDis; // 0x70(0x8)
	int64_t PassiveTriggerCount; // 0x78(0x8)
	int64_t PassiveTriggerCountBullet; // 0x80(0x8)
	int64_t PassiveTriggerCountExplosion; // 0x88(0x8)
	int64_t SelfRescueSucceedCount; // 0x90(0x8)
	int64_t KillDuringPassive; // 0x98(0x8)
	int64_t KillDuringPassiveNPC; // 0xA0(0x8)
	int64_t DamageDuringPassive; // 0xA8(0x8)
	int64_t DamageDuringPassiveNPC; // 0xB0(0x8)
	int32_t UltimateReviveSuccessCount; // 0xB8(0x4)
	int32_t UltimateReviveFailCount; // 0xBC(0x4)
	int32_t UltimateKillPlayerCount; // 0xC0(0x4)
	int32_t UltimateReviveOver10SCount; // 0xC4(0x4)
	int32_t UltimateReviveOver12SCount; // 0xC8(0x4)
	int32_t UltimateReviveOver15SCount; // 0xCC(0x4)
	struct FArmedforceCommonData CommonData; // 0xD0(0x168)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowDavid
// Size: 0x218 (Inherited: 0x0)
struct FArmedforceDataFlowDavid
{
	int32_t CruiseMissileAimOnFire; // 0x0(0x4)
	int32_t CruiseMissileAimOffFire; // 0x4(0x4)
	int32_t CruiseMissileMainHitTerrestrial; // 0x8(0x4)
	int32_t CruiseMissileMainHitAerial; // 0xC(0x4)
	float CruiseMissileMainExplosionDamageToTerrestrial; // 0x10(0x4)
	float CruiseMissileMainExplosionDamageToAerial; // 0x14(0x4)
	int32_t CruiseMissileMainDestroyTerrestrial; // 0x18(0x4)
	int32_t CruiseMissileMainDestroyAerial; // 0x1C(0x4)
	int32_t CruiseMissileMainHitPlayerBeforeAcc; // 0x20(0x4)
	int32_t CruiseMissileMainHitPlayerAfterAcc; // 0x24(0x4)
	int32_t CruiseMissileMainExplodePlayer; // 0x28(0x4)
	int32_t CruiseMissileMainExplodeAIPlayer; // 0x2C(0x4)
	int32_t CruiseMissileMainExplodeAINPC; // 0x30(0x4)
	int32_t CruiseMissileSubExplodePlayer; // 0x34(0x4)
	int32_t CruiseMissileSubExplodeAIPlayer; // 0x38(0x4)
	int32_t CruiseMissileSubExplodeAINPC; // 0x3C(0x4)
	float CruiseMissileMainExplosionDamage; // 0x40(0x4)
	float CruiseMissileSubExplosionDamage; // 0x44(0x4)
	int32_t CruiseMissileMainKnockDownPlayer; // 0x48(0x4)
	int32_t CruiseMissileMainKnockDownAIPlayer; // 0x4C(0x4)
	int32_t CruiseMissileMainKnockDownAINPC; // 0x50(0x4)
	int32_t CruiseMissileHurtDeadIn10s; // 0x54(0x4)
	int32_t CruiseMissileMainDestroyed; // 0x58(0x4)
	int32_t CruiseMissileAcc; // 0x5C(0x4)
	int32_t ThrowBlockingThrowNumber; // 0x60(0x4)
	int32_t ThrowBlockingThrowTakeDamageNumber; // 0x64(0x4)
	float ThrowBlockingTakePointDamage; // 0x68(0x4)
	float ThrowBlockingTakeRadialDamage; // 0x6C(0x4)
	float ThrowBlockingTakeDamageLifeTime; // 0x70(0x4)
	float ThrowBlockingMainTakePointDamage; // 0x74(0x4)
	float ThrowBlockingMainTakeRadialDamage; // 0x78(0x4)
	float ThrowBlockingSpawnTakeDamage; // 0x7C(0x4)
	int32_t ThrowBlockingSpawnDestroyed; // 0x80(0x4)
	int32_t ThrowBlockingRadialDestroyed; // 0x84(0x4)
	int32_t ThrowBlockingPointDestroyed; // 0x88(0x4)
	int32_t ThrowBlockingMainPartDestroyed; // 0x8C(0x4)
	int32_t IncendiaryThrowNumber; // 0x90(0x4)
	int32_t IncendiaryHitPlayer; // 0x94(0x4)
	float IncendiaryPlayerDamage; // 0x98(0x4)
	int32_t IncendiaryInsidePlayerKillNum; // 0x9C(0x4)
	int32_t IncendiaryOutsidePlayerKillNum; // 0xA0(0x4)
	int32_t IncendiaryExtinguishedNum; // 0xA4(0x4)
	int32_t IncendiaryDestroyBlockingNum; // 0xA8(0x4)
	int32_t IncendiaryDestroyBlockingDamage; // 0xAC(0x4)
	struct FArmedforceCommonData CommonData; // 0xB0(0x168)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowEngineer
// Size: 0x248 (Inherited: 0x0)
struct FArmedforceDataFlowEngineer
{
	int64_t PassiveSkillEffectValue; // 0x0(0x8)
	int64_t PassiveSkillEffectCnt; // 0x8(0x8)
	int64_t FixVehicleAndWeaponCnt; // 0x10(0x8)
	int64_t ArmedPropUseCnt; // 0x18(0x8)
	float ArmedPropUse2FireTime; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	int64_t ArmedPropBeDestroyCnt; // 0x28(0x8)
	int64_t ArmedPropActivatedNum; // 0x30(0x8)
	int32_t ArmedPropKillNum; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
	int64_t ArmedPropPlacementCnt; // 0x40(0x8)
	int64_t ActiveSkillWave1EffectNum; // 0x48(0x8)
	int64_t ActiveSkillWave2EffectNum; // 0x50(0x8)
	int64_t ActiveSkillWave3EffectNum; // 0x58(0x8)
	int64_t ActiveSkillWave4EffectNum; // 0x60(0x8)
	int64_t ActiveSkillDetectDefense; // 0x68(0x8)
	int64_t ActiveSkillUseCnt; // 0x70(0x8)
	int64_t ActiveSkillKillPlayerNum; // 0x78(0x8)
	int64_t ActiveSkillKillAINum; // 0x80(0x8)
	struct FArmedforceCommonData CommonData; // 0x88(0x168)
	int32_t CampVehicleAvgFixCnt; // 0x1F0(0x4)
	float CampVehicleAvgFixHealth; // 0x1F4(0x4)
	float CampVehicleAvgFixTime; // 0x1F8(0x4)
	int32_t WeaponAvgFixCnt; // 0x1FC(0x4)
	float WeaponAvgFixHealth; // 0x200(0x4)
	float WeaponAvgFixTime; // 0x204(0x4)
	int32_t UseActiveAbilityClickCnt; // 0x208(0x4)
	int32_t UseActiveAbilityLongPressCnt; // 0x20C(0x4)
	int32_t BeKillActivateMineIn8s; // 0x210(0x4)
	int32_t ADSDefenceCount; // 0x214(0x4)
	int32_t ADSCoolDownCount; // 0x218(0x4)
	int32_t AT4DestoryVehicleCount; // 0x21C(0x4)
	int32_t SpearDestoryVehicleCount; // 0x220(0x4)
	int32_t StingerDestoryVehicleCount; // 0x224(0x4)
	int32_t AT4DamageCount; // 0x228(0x4)
	int32_t SpearDamageCount; // 0x22C(0x4)
	int32_t StingerDamageCount; // 0x230(0x4)
	int32_t EMPFireCount; // 0x234(0x4)
	int32_t EMPAffectedCount; // 0x238(0x4)
	uint8_t Pad_0x23C[0x4]; // 0x23C(0x4)
	struct AGPCharacter* OwnerCharacter; // 0x240(0x8)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowOldDeng
// Size: 0x1D0 (Inherited: 0x0)
struct FArmedforceDataFlowOldDeng
{
	int64_t FootprintSearchCount; // 0x0(0x8)
	int64_t BionicSpyUseCount; // 0x8(0x8)
	int64_t BionicSpySuccessCount; // 0x10(0x8)
	int64_t BionicSpyFailedCount; // 0x18(0x8)
	int64_t BionicSpyDeadCount; // 0x20(0x8)
	int64_t BionicBirdUseCount; // 0x28(0x8)
	int64_t BionicBirdMarkCount; // 0x30(0x8)
	int64_t BionicBirdLaunchCount; // 0x38(0x8)
	int64_t BionicBirdLaunchHitCount; // 0x40(0x8)
	int64_t BionicBirdDestroyedCount; // 0x48(0x8)
	int64_t C203EMPCastCount; // 0x50(0x8)
	int64_t C203EMPHitPlayerCount; // 0x58(0x8)
	int64_t C203EMPAssistCount; // 0x60(0x8)
	struct FArmedforceCommonData CommonData; // 0x68(0x168)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowScout
// Size: 0x200 (Inherited: 0x0)
struct FArmedforceDataFlowScout
{
	int64_t PassiveSkillMarkEnermyNum; // 0x0(0x8)
	int64_t ArmedPropUseCnt; // 0x8(0x8)
	float ArmedPropUse2FireTime; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	int64_t ArmedPropFireCnt; // 0x18(0x8)
	int64_t ArmedPropKnockDownNum; // 0x20(0x8)
	float ArmedPropHitDistance; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
	int64_t ArmedPropDestroyVehcleCnt; // 0x30(0x8)
	int64_t ArmedPropHitVehcleCnt; // 0x38(0x8)
	int64_t ArmedPropHitPlayerCnt; // 0x40(0x8)
	int64_t ArmedPropHitPlayerNum; // 0x48(0x8)
	int64_t ActiveSkillFireCnt; // 0x50(0x8)
	int64_t ActiveSkillUseCnt; // 0x58(0x8)
	int64_t ActiveSkillEffectEnermyNum; // 0x60(0x8)
	int64_t ActiveSkillEffectPlayerNum; // 0x68(0x8)
	int64_t ActiveSkillEffectAINum; // 0x70(0x8)
	int64_t LaserPointerLockCompleteNum; // 0x78(0x8)
	int64_t LaserPointerAssistNum; // 0x80(0x8)
	int64_t RebornFlagUseNum; // 0x88(0x8)
	struct FArmedforceCommonData CommonData; // 0x90(0x168)
	struct AGPCharacter* OwnerCharacter; // 0x1F8(0x8)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowSineva
// Size: 0x238 (Inherited: 0x0)
struct FArmedforceDataFlowSineva
{
	int64_t UseBlastShieldCount; // 0x0(0x8)
	int64_t UseChainHookCount; // 0x8(0x8)
	int64_t UseBarbedWireGrenadeCount; // 0x10(0x8)
	int64_t BlastShieldCounterProjectileCount; // 0x18(0x8)
	float BlastShieldBlockingDamage; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	int64_t BlastShieldKnockBackCount; // 0x28(0x8)
	float BlastShieldDamage; // 0x30(0x4)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
	int64_t ChainHookHitAllyCount; // 0x38(0x8)
	int64_t ChainHookHitEnemyCount; // 0x40(0x8)
	int64_t ChainHookHitImpendingDeathAllyCount; // 0x48(0x8)
	int64_t BarbedWireGrenadeHitCount; // 0x50(0x8)
	float PassiveSkillBlockingDamage; // 0x58(0x4)
	int32_t PassiveSkillBlockingCounter; // 0x5C(0x4)
	int64_t DeadCountWhenEquipBlastShield; // 0x60(0x8)
	int64_t DeadCountWhenBlastShieldGlassBroken; // 0x68(0x8)
	int64_t DeadCountWhenBlastShieldGlassNotBroken; // 0x70(0x8)
	int64_t BlastShieldBlockingBulletDamage; // 0x78(0x8)
	int64_t BlastShieldBlockingOtherDamage; // 0x80(0x8)
	int64_t ChainHookHitRealPlayerCount; // 0x88(0x8)
	int64_t ChainHookPullRealPlayerCount; // 0x90(0x8)
	int64_t ChainHookBrokenCount; // 0x98(0x8)
	int64_t ChainHookBrokenByBulletCount; // 0xA0(0x8)
	int64_t ChainHookBrokenByMeleeCount; // 0xA8(0x8)
	int64_t BarbedWireGrenadeBrokenCount; // 0xB0(0x8)
	int64_t BarbedWireGrenadeBrokenByBulletCount; // 0xB8(0x8)
	int64_t BarbedWireGrenadeBrokenByExplosionCount; // 0xC0(0x8)
	int64_t BarbedWireGrenadeBrokenByMeleeCount; // 0xC8(0x8)
	struct FArmedforceCommonData CommonData; // 0xD0(0x168)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowSpiderMan
// Size: 0x208 (Inherited: 0x0)
struct FArmedforceDataFlowSpiderMan
{
	int64_t PassiveKillCount; // 0x0(0x8)
	int64_t PassiveAssistKillCount; // 0x8(0x8)
	int64_t NetSpiderHitPlayerCount; // 0x10(0x8)
	int64_t NetSpiderNotHitCount; // 0x18(0x8)
	int64_t NetSpiderBeDestroyedCount; // 0x20(0x8)
	int64_t NetSpiderKillCount; // 0x28(0x8)
	int64_t NetSpiderAssistKillCount; // 0x30(0x8)
	int64_t NetCatchPlayerKillCount; // 0x38(0x8)
	int64_t SentryHiveTriggerCount; // 0x40(0x8)
	int64_t SentrySpiderHitCount; // 0x48(0x8)
	int64_t SentrySpiderRustKillCount; // 0x50(0x8)
	int64_t SentrySpiderKillCount; // 0x58(0x8)
	int64_t SentrySpiderAssistKillCount; // 0x60(0x8)
	int64_t SentrySpiderSleepBeDestroyedCount; // 0x68(0x8)
	int64_t SentrySpiderAwakeBeDestroyedCount; // 0x70(0x8)
	int64_t SentryHiveBeDestroyedCount; // 0x78(0x8)
	int64_t IntelligentSmokeTriggerCount; // 0x80(0x8)
	int64_t IntelligentSmokeBeDestroyedCount; // 0x88(0x8)
	int64_t IntelligentSmokeKillCount; // 0x90(0x8)
	int64_t SmokeAndRustOutlineCount; // 0x98(0x8)
	struct FArmedforceCommonData CommonData; // 0xA0(0x168)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowSupport
// Size: 0x1F0 (Inherited: 0x0)
struct FArmedforceDataFlowSupport
{
	int64_t PassiveSkillRescueSuceesCnt; // 0x0(0x8)
	int64_t PassiveSkillRescueCnt; // 0x8(0x8)
	float PassiveSkillRescueFailedTime; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	int64_t ArmedPropFireCnt; // 0x18(0x8)
	int64_t Hit5sArmedPropFireCnt; // 0x20(0x8)
	int64_t ArmedProp5sPassiveSkillRescueCnt; // 0x28(0x8)
	int64_t ArmedProp5sKillEnermyCnt; // 0x30(0x8)
	int64_t ArmedProp5sBeKillCnt; // 0x38(0x8)
	int64_t ActiveSkillUseCnt; // 0x40(0x8)
	float ActiveSkillUse2FireTime; // 0x48(0x4)
	uint8_t Pad_0x4C[0x4]; // 0x4C(0x4)
	int64_t Hit5sSelfCureCnt; // 0x50(0x8)
	int64_t SelfCureCnt; // 0x58(0x8)
	int64_t ActiveSkillEffectPlayerNum; // 0x60(0x8)
	int64_t WeaponFireCnt; // 0x68(0x8)
	struct FArmedforceCommonData CommonData; // 0x70(0x168)
	float SelfCureHealth; // 0x1D8(0x4)
	float TeammateCureHealth; // 0x1DC(0x4)
	int32_t SmokeResuceCntIn15s; // 0x1E0(0x4)
	uint8_t Pad_0x1E4[0x4]; // 0x1E4(0x4)
	struct AGPCharacter* OwnerCharacter; // 0x1E8(0x8)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowWolfWarriors
// Size: 0x1E0 (Inherited: 0x0)
struct FArmedforceDataFlowWolfWarriors
{
	int32_t PassiveActivateCnt; // 0x0(0x4)
	int32_t PassiveActivateCntTryCount; // 0x4(0x4)
	int32_t FallReduceDamageCnt; // 0x8(0x4)
	int32_t FallReduceDamageCnt1; // 0xC(0x4)
	int32_t FallReduceDamageCnt2; // 0x10(0x4)
	int32_t FallDamageBreakBoneCnt; // 0x14(0x4)
	int32_t FireAirCannonCnt; // 0x18(0x4)
	int32_t AirCannonHitPlayerCnt; // 0x1C(0x4)
	float AirCannonHitPlayerDistance; // 0x20(0x4)
	int32_t AirCannonHitAICnt; // 0x24(0x4)
	int32_t AirCannonKnockbackKillCnt; // 0x28(0x4)
	int32_t AirCannonKnockbackBeKillCnt; // 0x2C(0x4)
	int32_t AirCannonKnockbackMultiPlayerCnt; // 0x30(0x4)
	int32_t RushForwardCnt; // 0x34(0x4)
	int32_t RushBackCnt; // 0x38(0x4)
	int32_t RushLeftCnt; // 0x3C(0x4)
	int32_t RushRightCnt; // 0x40(0x4)
	int32_t RushCnt; // 0x44(0x4)
	int32_t RushBeHit2s; // 0x48(0x4)
	int32_t UseRushCntInCDAwards2s; // 0x4C(0x4)
	int32_t KillRush2s; // 0x50(0x4)
	int32_t BekillRushing; // 0x54(0x4)
	int32_t ThrowC4Cnt; // 0x58(0x4)
	int32_t C4KillPlayerCnt; // 0x5C(0x4)
	int32_t C4KillAICnt; // 0x60(0x4)
	int32_t C4HitPlayerCnt; // 0x64(0x4)
	int32_t C4HitAICnt; // 0x68(0x4)
	int32_t C4HitVehicle; // 0x6C(0x4)
	int32_t C4DestroyVehicle; // 0x70(0x4)
	uint8_t Pad_0x74[0x4]; // 0x74(0x4)
	struct FArmedforceCommonData CommonData; // 0x78(0x168)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowWuMing
// Size: 0x220 (Inherited: 0x0)
struct FArmedforceDataFlowWuMing
{
	int64_t C303PassiveTriggerCount; // 0x0(0x8)
	int64_t KnockCountWhenUseSilenceZone; // 0x8(0x8)
	int64_t SilenceZoneUseCount; // 0x10(0x8)
	int64_t BeKnockedCountWhenUseSilenceZone; // 0x18(0x8)
	int64_t SilenceZoneAntiDetectCount; // 0x20(0x8)
	int64_t KnifeDroneUseCount; // 0x28(0x8)
	int64_t KnifeDroneLockedUseCount; // 0x30(0x8)
	int64_t KnifeDroneKillCount; // 0x38(0x8)
	int64_t KnifeDroneLockedKillCount; // 0x40(0x8)
	int64_t KnifeDroneLockedHitCount; // 0x48(0x8)
	float KnifeDroneTimeBetweenHitAndKnocked; // 0x50(0x4)
	uint8_t Pad_0x54[0x4]; // 0x54(0x4)
	int64_t KnifeDroneDestoryedCount; // 0x58(0x8)
	int64_t C303FlashUseCount; // 0x60(0x8)
	int64_t C303FlashHitRealPlayerCount; // 0x68(0x8)
	int64_t C303FlashHitAILabCount; // 0x70(0x8)
	int64_t C303FlashHitAICount; // 0x78(0x8)
	int64_t C303FlashHeavyHitCount; // 0x80(0x8)
	int64_t C303FlashMidHitCount; // 0x88(0x8)
	int64_t C303FlashLightHitCount; // 0x90(0x8)
	int64_t C303FlashBackHitCount; // 0x98(0x8)
	int64_t C303FlashKnockedAfter10sCount; // 0xA0(0x8)
	int64_t KnifeDroneHitPlayerCount; // 0xA8(0x8)
	int64_t KnifeDroneLockedHitPlayerCount; // 0xB0(0x8)
	struct FArmedforceCommonData CommonData; // 0xB8(0x168)
};

// Object: ScriptStruct GPGameplay.ArmedforceDataFlowZoya
// Size: 0x1C8 (Inherited: 0x0)
struct FArmedforceDataFlowZoya
{
	int32_t SwarmsEquipCount; // 0x0(0x4)
	float SwarmsCastTotalDelayTime; // 0x4(0x4)
	int32_t SwarmsCastCount; // 0x8(0x4)
	int32_t SwarmsHitPlayerCount; // 0xC(0x4)
	int32_t SwarmsHitAICount; // 0x10(0x4)
	int32_t SwarmsKillCount; // 0x14(0x4)
	int32_t SwarmsAssistKillCount; // 0x18(0x4)
	int32_t SwarmsHitCount0_20; // 0x1C(0x4)
	int32_t SwarmsHitCount20_40; // 0x20(0x4)
	int32_t SwarmsHitCount40_60; // 0x24(0x4)
	int32_t SwarmsManualClearCount; // 0x28(0x4)
	int32_t BlindingSmokeEquipCount; // 0x2C(0x4)
	int32_t BlindingSmokeUseCount; // 0x30(0x4)
	int32_t BlindingSmokeHitPlayerCount; // 0x34(0x4)
	int32_t BlindingSmokeHitAICount; // 0x38(0x4)
	float BlindingSmokeHitPlayerTime; // 0x3C(0x4)
	int32_t BlindingSmokeKillPlayerCount; // 0x40(0x4)
	int32_t BlindingSmokeKillAICount; // 0x44(0x4)
	int32_t BlindingSmoke3SecondsKillPlayerCount; // 0x48(0x4)
	int32_t BlindingSmokeDestroyCount; // 0x4C(0x4)
	int32_t BlindingSmokeHitMoreThanOnePlayerCount; // 0x50(0x4)
	int32_t AdrenalineTotalAssistCount; // 0x54(0x4)
	int32_t AdrenalineFrightingUseCount; // 0x58(0x4)
	float PassiveSkillTotalSaveTime; // 0x5C(0x4)
	struct FArmedforceCommonData CommonData; // 0x60(0x168)
};

// Object: ScriptStruct GPGameplay.KillInfoWeaponImageRow
// Size: 0x78 (Inherited: 0x10)
struct FKillInfoWeaponImageRow : FDescRowBase
{
	struct TArray<uint64_t> WeaponIdArray; // 0x10(0x10)
	struct TArray<uint64_t> AttackerValueIdArray; // 0x20(0x10)
	struct TArray<int32_t> VehicleIdArray; // 0x30(0x10)
	EWeaponItemType WeaponItemType; // 0x40(0x1)
	uint8_t Pad_0x41[0x7]; // 0x41(0x7)
	struct FText DescName; // 0x48(0x18)
	struct FSoftObjectPath WeaponImagePath; // 0x60(0x18)
};

// Object: ScriptStruct GPGameplay.FuzzyMatchIdCollection
// Size: 0x18 (Inherited: 0x0)
struct FFuzzyMatchIdCollection
{
	uint64_t WeaponID; // 0x0(0x8)
	uint64_t AttackValueId; // 0x8(0x8)
	int32_t VehicleId; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct GPGameplay.VehicleArmorDamageCorrectConfig
// Size: 0x60 (Inherited: 0x10)
struct FVehicleArmorDamageCorrectConfig : FDescRowBase
{
	uint64_t ID; // 0x10(0x8)
	float Default; // 0x18(0x4)
	float Light; // 0x1C(0x4)
	float LightMiddle; // 0x20(0x4)
	float Middle; // 0x24(0x4)
	float Heavy; // 0x28(0x4)
	float Raid; // 0x2C(0x4)
	float RaidTankBoss; // 0x30(0x4)
	float LittleBird; // 0x34(0x4)
	float SOLHelicopter; // 0x38(0x4)
	float FSV; // 0x3C(0x4)
	float GTQ35; // 0x40(0x4)
	float MotorBoat; // 0x44(0x4)
	float AgainstBoat_SOL; // 0x48(0x4)
	float MotorBoat_SOL; // 0x4C(0x4)
	float F35; // 0x50(0x4)
	float SceneWeapon; // 0x54(0x4)
	float AAV7; // 0x58(0x4)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
};

// Object: ScriptStruct GPGameplay.AttackLevelParamGroup
// Size: 0x14 (Inherited: 0x0)
struct FAttackLevelParamGroup
{
	uint8_t PenetrateTag : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float HelmetDifferenceParam; // 0x4(0x4)
	float ArmorDifferenceParam; // 0x8(0x4)
	float HPDifferenceParam; // 0xC(0x4)
	float HelmetHPDifferenceParam; // 0x10(0x4)
};

// Object: ScriptStruct GPGameplay.AttackLevelCorrection
// Size: 0x138 (Inherited: 0x10)
struct FAttackLevelCorrection : FDescRowBase
{
	int32_t GroupID; // 0x10(0x4)
	uint8_t bCommon : 1; // 0x14(0x1), Mask(0x1)
	uint8_t BitPad_0x14_1 : 7; // 0x14(0x1)
	uint8_t Pad_0x15[0x3]; // 0x15(0x3)
	struct FAttackLevelParamGroup NegativeLevel1; // 0x18(0x14)
	struct FAttackLevelParamGroup NegativeLevel2; // 0x2C(0x14)
	struct FAttackLevelParamGroup NegativeLevel3; // 0x40(0x14)
	struct FAttackLevelParamGroup NegativeLevel4; // 0x54(0x14)
	struct FAttackLevelParamGroup NegativeLevel5; // 0x68(0x14)
	struct FAttackLevelParamGroup NegativeLevel6; // 0x7C(0x14)
	struct FAttackLevelParamGroup Level0; // 0x90(0x14)
	struct FAttackLevelParamGroup Level1; // 0xA4(0x14)
	struct FAttackLevelParamGroup Level2; // 0xB8(0x14)
	struct FAttackLevelParamGroup Level3; // 0xCC(0x14)
	struct FAttackLevelParamGroup Level4; // 0xE0(0x14)
	struct FAttackLevelParamGroup Level5; // 0xF4(0x14)
	struct FAttackLevelParamGroup Level6; // 0x108(0x14)
	uint8_t Pad_0x11C[0x4]; // 0x11C(0x4)
	struct FText DisplayLevelTxt; // 0x120(0x18)
};

// Object: ScriptStruct GPGameplay.WeaponDataModifierAttributeInterface
// Size: 0x8 (Inherited: 0x0)
struct FWeaponDataModifierAttributeInterface
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
};

// Object: ScriptStruct GPGameplay.WeaponDataModifierAttributeInfo
// Size: 0x40 (Inherited: 0x8)
struct FWeaponDataModifierAttributeInfo : FWeaponDataModifierAttributeInterface
{
	uint8_t Pad_0x8[0x38]; // 0x8(0x38)
};

// Object: ScriptStruct GPGameplay.WeaponDataBase
// Size: 0x68 (Inherited: 0x10)
struct FWeaponDataBase : FDescRowBase
{
	struct FWeaponDataModifierAttributeInfo ModifierAttributeInfo; // 0x10(0x40)
	uint8_t Pad_0x50[0x10]; // 0x50(0x10)
	uint8_t bApplyModified : 1; // 0x60(0x1), Mask(0x1)
	uint8_t BitPad_0x60_1 : 7; // 0x60(0x1)
	uint8_t bApplyWithPool : 1; // 0x61(0x1), Mask(0x1)
	uint8_t BitPad_0x61_1 : 7; // 0x61(0x1)
	uint8_t Pad_0x62[0x6]; // 0x62(0x6)
};

// Object: ScriptStruct GPGameplay.BossOverrideDamageValue
// Size: 0x8 (Inherited: 0x0)
struct FBossOverrideDamageValue
{
	float Damage; // 0x0(0x4)
	uint8_t bRealDamage : 1; // 0x4(0x1), Mask(0x1)
	uint8_t BitPad_0x4_1 : 7; // 0x4(0x1)
	uint8_t bAlwaysDamage : 1; // 0x5(0x1), Mask(0x1)
	uint8_t BitPad_0x5_1 : 7; // 0x5(0x1)
	uint8_t Pad_0x6[0x2]; // 0x6(0x2)
};

// Object: ScriptStruct GPGameplay.BossOverridePointDamageValue
// Size: 0xC (Inherited: 0x8)
struct FBossOverridePointDamageValue : FBossOverrideDamageValue
{
	float ArmorDamage; // 0x8(0x4)
};

// Object: ScriptStruct GPGameplay.DamagePointAttackValue
// Size: 0x138 (Inherited: 0x68)
struct FDamagePointAttackValue : FWeaponDataBase
{
	uint64_t AttackerValueId; // 0x68(0x8)
	float Damage; // 0x70(0x4)
	uint8_t Pad_0x74[0x4]; // 0x74(0x4)
	uint64_t VehicleArmorDamageId; // 0x78(0x8)
	float VehicleDamage; // 0x80(0x4)
	float HealthDamage; // 0x84(0x4)
	float ArmorDamage; // 0x88(0x4)
	int32_t PenetrateLevel; // 0x8C(0x4)
	uint8_t bOverrideAIDamageValue : 1; // 0x90(0x1), Mask(0x1)
	uint8_t BitPad_0x90_1 : 7; // 0x90(0x1)
	uint8_t Pad_0x91[0x3]; // 0x91(0x3)
	float AIDamage; // 0x94(0x4)
	uint32_t AddCharcaterBuffId; // 0x98(0x4)
	uint32_t AddVehicleBuffId; // 0x9C(0x4)
	float DamageApplyFreezeValue; // 0xA0(0x4)
	int32_t AttackLevelDetailGroup; // 0xA4(0x4)
	float HeadDamageRate; // 0xA8(0x4)
	float ThoraxDamageRate; // 0xAC(0x4)
	float ThoraxUpperDamageRate; // 0xB0(0x4)
	float LegDamageRate; // 0xB4(0x4)
	float LegUpperDamageRate; // 0xB8(0x4)
	float ArmDamageRate; // 0xBC(0x4)
	float ArmUpperDamageRate; // 0xC0(0x4)
	float ThrowBlockingDamageRate; // 0xC4(0x4)
	float BlastShieldGlassDamageRate; // 0xC8(0x4)
	float UnderWaterDamageRate; // 0xCC(0x4)
	uint8_t bOverrideBossValue : 1; // 0xD0(0x1), Mask(0x1)
	uint8_t BitPad_0xD0_1 : 7; // 0xD0(0x1)
	uint8_t Pad_0xD1[0x3]; // 0xD1(0x3)
	struct FBossOverridePointDamageValue BossOverrideValueParam; // 0xD4(0xC)
	uint8_t bRealDamage : 1; // 0xE0(0x1), Mask(0x1)
	uint8_t BitPad_0xE0_1 : 7; // 0xE0(0x1)
	uint8_t bAlwaysDamage : 1; // 0xE1(0x1), Mask(0x1)
	uint8_t BitPad_0xE1_1 : 7; // 0xE1(0x1)
	uint8_t Pad_0xE2[0x6]; // 0xE2(0x6)
	struct FGameplayTagContainer DamageTags; // 0xE8(0x20)
	struct FSoftObjectPath KillIconPath; // 0x108(0x18)
	struct FSoftObjectPath DeathInfoIconPath; // 0x120(0x18)
};

// Object: ScriptStruct GPGameplay.AIWeaponDataAttackerValue
// Size: 0x140 (Inherited: 0x138)
struct FAIWeaponDataAttackerValue : FDamagePointAttackValue
{
	uint8_t bIsCover : 1; // 0x138(0x1), Mask(0x1)
	uint8_t BitPad_0x138_1 : 7; // 0x138(0x1)
	uint8_t Pad_0x139[0x7]; // 0x139(0x7)
};

// Object: ScriptStruct GPGameplay.DamageBuffValue
// Size: 0x58 (Inherited: 0x10)
struct FDamageBuffValue : FDescRowBase
{
	uint64_t ID; // 0x10(0x8)
	EGPDamageEnableType EnableDamageToFriend; // 0x18(0x1)
	EGPDamageEnableType EnableDamageToSelf; // 0x19(0x1)
	uint8_t Pad_0x1A[0x2]; // 0x1A(0x2)
	float FriendDamageRate; // 0x1C(0x4)
	EGPDamageEnableType EnableDamageToFriend_MP; // 0x20(0x1)
	EGPDamageEnableType EnableDamageToSelf_MP; // 0x21(0x1)
	uint8_t Pad_0x22[0x2]; // 0x22(0x2)
	float FriendDamageRate_MP; // 0x24(0x4)
	struct FSoftObjectPath KillIconPath; // 0x28(0x18)
	struct FSoftObjectPath DeathInfoIconPath; // 0x40(0x18)
};

// Object: ScriptStruct GPGameplay.BossOverridePhysicalDamageValue
// Size: 0x8 (Inherited: 0x8)
struct FBossOverridePhysicalDamageValue : FBossOverrideDamageValue
{
};

// Object: ScriptStruct GPGameplay.DamagePhysicalValue
// Size: 0xC0 (Inherited: 0x68)
struct FDamagePhysicalValue : FWeaponDataBase
{
	uint64_t PhysicalValueId; // 0x68(0x8)
	float Damage; // 0x70(0x4)
	int32_t PenetrateLevel; // 0x74(0x4)
	float VehicleDamage; // 0x78(0x4)
	uint8_t IgnoreImpendingDeath : 1; // 0x7C(0x1), Mask(0x1)
	uint8_t BitPad_0x7C_1 : 7; // 0x7C(0x1)
	uint8_t bOverrideBossValue : 1; // 0x7D(0x1), Mask(0x1)
	uint8_t BitPad_0x7D_1 : 7; // 0x7D(0x1)
	uint8_t Pad_0x7E[0x2]; // 0x7E(0x2)
	struct FBossOverridePhysicalDamageValue BossOverrideValueParam; // 0x80(0x8)
	uint8_t bRealDamage : 1; // 0x88(0x1), Mask(0x1)
	uint8_t BitPad_0x88_1 : 7; // 0x88(0x1)
	uint8_t bAlwaysDamage : 1; // 0x89(0x1), Mask(0x1)
	uint8_t BitPad_0x89_1 : 7; // 0x89(0x1)
	uint8_t Pad_0x8A[0x6]; // 0x8A(0x6)
	struct FSoftObjectPath KillIconPath; // 0x90(0x18)
	struct FSoftObjectPath DeathInfoIconPath; // 0xA8(0x18)
};

// Object: ScriptStruct GPGameplay.BossOverrideExplodeDamageValue
// Size: 0x10 (Inherited: 0x8)
struct FBossOverrideExplodeDamageValue : FBossOverrideDamageValue
{
	float MinDamage; // 0x8(0x4)
	int32_t PenetrateLevel; // 0xC(0x4)
};

// Object: ScriptStruct GPGameplay.ExplodeDamageValueWithDistance
// Size: 0x10 (Inherited: 0x0)
struct FExplodeDamageValueWithDistance
{
	struct TArray<struct FExplodeDamageConfigDistancePair> DamageConfigArray; // 0x0(0x10)
};

// Object: ScriptStruct GPGameplay.DamageExplodeValue
// Size: 0x190 (Inherited: 0x68)
struct FDamageExplodeValue : FWeaponDataBase
{
	uint64_t ExplodeValueId; // 0x68(0x8)
	float ExplodeRadius; // 0x70(0x4)
	float ExplodeRadiusVehicle; // 0x74(0x4)
	float Damage; // 0x78(0x4)
	float VehicleDamage; // 0x7C(0x4)
	int32_t PenetrateLevel; // 0x80(0x4)
	uint8_t bOverrideArmorDamage : 1; // 0x84(0x1), Mask(0x1)
	uint8_t BitPad_0x84_1 : 7; // 0x84(0x1)
	uint8_t Pad_0x85[0x3]; // 0x85(0x3)
	float OverrideArmorDamage; // 0x88(0x4)
	int32_t AttackLevelDetailGroup; // 0x8C(0x4)
	float HealthHeadDamageRate; // 0x90(0x4)
	float HealthThoraxDamageRate; // 0x94(0x4)
	float HealthAbdomenDamageRate; // 0x98(0x4)
	float HealthLegDamageRate; // 0x9C(0x4)
	float HealthArmDamageRate; // 0xA0(0x4)
	float HealthLegRightDamageRate; // 0xA4(0x4)
	float HealthArmRightDamageRate; // 0xA8(0x4)
	uint8_t Pad_0xAC[0x4]; // 0xAC(0x4)
	uint64_t VehicleArmorDamageId; // 0xB0(0x8)
	uint8_t IsRangeAttenuation : 1; // 0xB8(0x1), Mask(0x1)
	uint8_t BitPad_0xB8_1 : 7; // 0xB8(0x1)
	uint8_t bEnableFlyDistanceConfigDamage : 1; // 0xB9(0x1), Mask(0x1)
	uint8_t BitPad_0xB9_1 : 7; // 0xB9(0x1)
	uint8_t Pad_0xBA[0x6]; // 0xBA(0x6)
	struct FExplodeDamageValueWithDistance DistanceConfigDamage; // 0xC0(0x10)
	float FullExplodeRadius; // 0xD0(0x4)
	float FullExplodeRadiusVehicle; // 0xD4(0x4)
	float MinDamage; // 0xD8(0x4)
	float MinVehicleDamage; // 0xDC(0x4)
	uint8_t bOverrideAIDamage : 1; // 0xE0(0x1), Mask(0x1)
	uint8_t BitPad_0xE0_1 : 7; // 0xE0(0x1)
	uint8_t Pad_0xE1[0x3]; // 0xE1(0x3)
	float AIDamage; // 0xE4(0x4)
	float MinAIDamage; // 0xE8(0x4)
	uint8_t bOverrideBossValue : 1; // 0xEC(0x1), Mask(0x1)
	uint8_t BitPad_0xEC_1 : 7; // 0xEC(0x1)
	uint8_t Pad_0xED[0x3]; // 0xED(0x3)
	struct FBossOverrideExplodeDamageValue BossOverrideValueParam; // 0xF0(0x10)
	uint8_t IsThroughBunker : 1; // 0x100(0x1), Mask(0x1)
	uint8_t BitPad_0x100_1 : 7; // 0x100(0x1)
	uint8_t Pad_0x101[0x3]; // 0x101(0x3)
	float BunkerDamageRate; // 0x104(0x4)
	EDamageExplodeBlockCheckType DamageExplodeBlockCheckType; // 0x108(0x1)
	uint8_t Pad_0x109[0x3]; // 0x109(0x3)
	float CheckBlockDistOffset; // 0x10C(0x4)
	EGPDamageEnableType EnableDamageToFriend; // 0x110(0x1)
	EGPDamageEnableType EnableDamageToSelf; // 0x111(0x1)
	uint8_t Pad_0x112[0x2]; // 0x112(0x2)
	float FriendDamageRate; // 0x114(0x4)
	uint8_t bRealDamage : 1; // 0x118(0x1), Mask(0x1)
	uint8_t BitPad_0x118_1 : 7; // 0x118(0x1)
	uint8_t bAlwaysDamage : 1; // 0x119(0x1), Mask(0x1)
	uint8_t BitPad_0x119_1 : 7; // 0x119(0x1)
	uint8_t Pad_0x11A[0x6]; // 0x11A(0x6)
	struct FSoftObjectPath KillIconPath; // 0x120(0x18)
	struct FSoftObjectPath DeathInfoIconPath; // 0x138(0x18)
	uint8_t bApplyBuffWhileMakingDamage : 1; // 0x150(0x1), Mask(0x1)
	uint8_t BitPad_0x150_1 : 7; // 0x150(0x1)
	uint8_t Pad_0x151[0x7]; // 0x151(0x7)
	struct TArray<struct FRangeBuffParam> OriginDamageIntervalBuffMap; // 0x158(0x10)
	struct TArray<struct FRangeBuffParam> RealDamageIntervalBuffMap; // 0x168(0x10)
	EExplodeRagdollImpulseType RagdollImpulseType; // 0x178(0x1)
	uint8_t Pad_0x179[0x3]; // 0x179(0x3)
	struct FName SmokeBreakerID; // 0x17C(0x8)
	float FreezeAreaDamageRate; // 0x184(0x4)
	float DamageApplyFreezeValue; // 0x188(0x4)
	uint8_t Pad_0x18C[0x4]; // 0x18C(0x4)
};

// Object: ScriptStruct GPGameplay.RangeBuffParam
// Size: 0x20 (Inherited: 0x0)
struct FRangeBuffParam
{
	float BuffApplyProbability; // 0x0(0x4)
	float DamageUpperBound; // 0x4(0x4)
	float DamageLowerBound; // 0x8(0x4)
	uint32_t BuffId; // 0xC(0x4)
	struct TArray<EDFMGamePlayMode> EnabledGameModes; // 0x10(0x10)
};

// Object: ScriptStruct GPGameplay.ExplodeDamageConfig
// Size: 0x28 (Inherited: 0x0)
struct FExplodeDamageConfig
{
	float ExplodeRadius; // 0x0(0x4)
	float ExplodeRadiusVehicle; // 0x4(0x4)
	float Damage; // 0x8(0x4)
	float VehicleDamage; // 0xC(0x4)
	uint64_t VehicleArmorDamageId; // 0x10(0x8)
	float FullExplodeRadius; // 0x18(0x4)
	float FullExplodeRadiusVehicle; // 0x1C(0x4)
	float MinDamage; // 0x20(0x4)
	float MinVehicleDamage; // 0x24(0x4)
};

// Object: ScriptStruct GPGameplay.ExplodeDamageConfigDistancePair
// Size: 0x30 (Inherited: 0x0)
struct FExplodeDamageConfigDistancePair
{
	float ConfigEndDistance; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FExplodeDamageConfig DamageConfig; // 0x8(0x28)
};

// Object: ScriptStruct GPGameplay.AttackerValueData
// Size: 0xF8 (Inherited: 0x68)
struct FAttackerValueData : FWeaponDataBase
{
	uint64_t AttackerValueId; // 0x68(0x8)
	struct FText DisplayName; // 0x70(0x18)
	EDamageSystemDamageType DamageType; // 0x88(0x1)
	uint8_t Pad_0x89[0x3]; // 0x89(0x3)
	struct FName DestructibleItemDemageType; // 0x8C(0x8)
	uint8_t Pad_0x94[0x4]; // 0x94(0x4)
	uint64_t DefaultDamageId; // 0x98(0x8)
	uint64_t DamageIdGameMode01; // 0xA0(0x8)
	uint64_t DamageIdGameMode02; // 0xA8(0x8)
	uint64_t DamageIdGameMode03; // 0xB0(0x8)
	uint64_t DamageIdGameMode04; // 0xB8(0x8)
	uint64_t DefaultDamageId_Mobile; // 0xC0(0x8)
	uint64_t DamageIdGameMode01_Mobile; // 0xC8(0x8)
	uint64_t DamageIdGameMode02_Mobile; // 0xD0(0x8)
	uint64_t DamageIdGameMode03_Mobile; // 0xD8(0x8)
	uint64_t DamageIdGameMode04_Mobile; // 0xE0(0x8)
	uint8_t NeedHitMark : 1; // 0xE8(0x1), Mask(0x1)
	uint8_t BitPad_0xE8_1 : 7; // 0xE8(0x1)
	uint8_t Pad_0xE9[0x3]; // 0xE9(0x3)
	int32_t HitMarkMakerFeedBackId; // 0xEC(0x4)
	int32_t HitMarkFeedBackId; // 0xF0(0x4)
	uint8_t bHitDirForCharacter : 1; // 0xF4(0x1), Mask(0x1)
	uint8_t BitPad_0xF4_1 : 7; // 0xF4(0x1)
	uint8_t NeedBeHitFeedback : 1; // 0xF5(0x1), Mask(0x1)
	uint8_t BitPad_0xF5_1 : 7; // 0xF5(0x1)
	uint8_t Pad_0xF6[0x2]; // 0xF6(0x2)
};

// Object: ScriptStruct GPGameplay.AttributeSystemTagRow
// Size: 0x18 (Inherited: 0x10)
struct FAttributeSystemTagRow : FDescRowBase
{
	struct FName SystemTag; // 0x10(0x8)
};

// Object: ScriptStruct GPGameplay.AttributeOperatesRow
// Size: 0x48 (Inherited: 0x10)
struct FAttributeOperatesRow : FDescRowBase
{
	uint32_t AttributeOperateID; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct TArray<uint32_t> AttributeIDArray; // 0x18(0x10)
	EAttributeAdditionType GameplayModOp; // 0x28(0x1)
	uint8_t bCustomValue : 1; // 0x29(0x1), Mask(0x1)
	uint8_t BitPad_0x29_1 : 7; // 0x29(0x1)
	uint8_t Pad_0x2A[0x2]; // 0x2A(0x2)
	float OperateValue; // 0x2C(0x4)
	struct FText Description; // 0x30(0x18)
};

// Object: ScriptStruct GPGameplay.DFMAttributeNameRow
// Size: 0x20 (Inherited: 0x10)
struct FDFMAttributeNameRow : FDescRowBase
{
	uint32_t AttributeID; // 0x10(0x4)
	struct FName AttributeName; // 0x14(0x8)
	uint8_t NotSyncToServer : 1; // 0x1C(0x1), Mask(0x1)
	uint8_t BitPad_0x1C_1 : 7; // 0x1C(0x1)
	uint8_t Pad_0x1D[0x3]; // 0x1D(0x3)
};

// Object: ScriptStruct GPGameplay.GPAttributeEffect
// Size: 0x88 (Inherited: 0x0)
struct FGPAttributeEffect
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	uint32_t AttributeOperateID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TArray<struct FDFMAttributeModEffect> ModEffects; // 0x10(0x10)
	uint8_t bIsDamage : 1; // 0x20(0x1), Mask(0x1)
	uint8_t BitPad_0x20_1 : 7; // 0x20(0x1)
	uint8_t Pad_0x21[0x3]; // 0x21(0x3)
	float HPDamage; // 0x24(0x4)
	float ArmorDamage; // 0x28(0x4)
	struct TWeakObjectPtr<struct AActor> Instigator; // 0x2C(0x8)
	struct TWeakObjectPtr<struct AActor> Taker; // 0x34(0x8)
	struct TWeakObjectPtr<struct AActor> EffectCauser; // 0x3C(0x8)
	uint8_t Pad_0x44[0x14]; // 0x44(0x14)
	uint32_t GameplayTag; // 0x58(0x4)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
	struct FGameplayTagContainer TagContainer; // 0x60(0x20)
	uint8_t Pad_0x80[0x8]; // 0x80(0x8)
};

// Object: ScriptStruct GPGameplay.DFMAttributeModEffect
// Size: 0x10 (Inherited: 0x0)
struct FDFMAttributeModEffect
{
	struct FName AttributeName; // 0x0(0x8)
	EAttributeAdditionType GameplayModOp; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	float OperateValue; // 0xC(0x4)
};

// Object: ScriptStruct GPGameplay.ItemHealthAttributeEffect
// Size: 0x90 (Inherited: 0x88)
struct FItemHealthAttributeEffect : FGPAttributeEffect
{
	uint64_t ItemID; // 0x88(0x8)
};

// Object: ScriptStruct GPGameplay.EquipmentAttributeEffect
// Size: 0x90 (Inherited: 0x88)
struct FEquipmentAttributeEffect : FGPAttributeEffect
{
	uint64_t EquipmentItemId; // 0x88(0x8)
};

// Object: ScriptStruct GPGameplay.BuffAttributeEffect
// Size: 0x90 (Inherited: 0x88)
struct FBuffAttributeEffect : FGPAttributeEffect
{
	uint32_t BuffGUID; // 0x84(0x4)
	uint32_t BuffId; // 0x88(0x4)
	int32_t SkillId; // 0x8C(0x4)
};

// Object: ScriptStruct GPGameplay.DamageAttributeEffect
// Size: 0xA0 (Inherited: 0x88)
struct FDamageAttributeEffect : FGPAttributeEffect
{
	uint64_t AttackValueId; // 0x88(0x8)
	uint8_t Pad_0x90[0x10]; // 0x90(0x10)
};

// Object: ScriptStruct GPGameplay.HeadsetAudioPostProcessTableRow
// Size: 0x28 (Inherited: 0x10)
struct FHeadsetAudioPostProcessTableRow : FDescRowBase
{
	int32_t HeadsetId; // 0x10(0x4)
	float AudioRangeScaler; // 0x14(0x4)
	float AmbientVolunme; // 0x18(0x4)
	float CutOfFrequence; // 0x1C(0x4)
	float Resonance; // 0x20(0x4)
	int32_t CompressorId; // 0x24(0x4)
};

// Object: ScriptStruct GPGameplay.PhysicalSurfaceToBFERow
// Size: 0x28 (Inherited: 0x10)
struct FPhysicalSurfaceToBFERow : FDescRowBase
{
	EGPPhysicalSurfaceGroup PhysicalSurfaceGroup; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	struct FName BattelFieldEffectName; // 0x14(0x8)
	struct FName BFEffectNameForExplosiones; // 0x1C(0x8)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
};

// Object: ScriptStruct GPGameplay.BFEAvatarWeightRow
// Size: 0x18 (Inherited: 0x10)
struct FBFEAvatarWeightRow : FDescRowBase
{
	float Weight; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct GPGameplay.BattlefieldEffectGroupRow
// Size: 0x18 (Inherited: 0x10)
struct FBattlefieldEffectGroupRow : FDescRowBase
{
	EBattlefieldEffectGroup Group; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	int32_t MaxCount; // 0x14(0x4)
};

// Object: ScriptStruct GPGameplay.BattlefieldEffectEnergyParamRow
// Size: 0x20 (Inherited: 0x0)
struct FBattlefieldEffectEnergyParamRow
{
	float MaxEnergy; // 0x0(0x4)
	float StartupPerSecond; // 0x4(0x4)
	float CleanupPerSecondDefault; // 0x8(0x4)
	float CleanupPerSecondExceedMaxNum; // 0xC(0x4)
	float CleanupPerSecondEnterWater; // 0x10(0x4)
	float ReplaceThreshold; // 0x14(0x4)
	float MinEnergyDistance; // 0x18(0x4)
	float MaxEnergyDistance; // 0x1C(0x4)
};

// Object: ScriptStruct GPGameplay.BattlefieldEffectRow
// Size: 0x68 (Inherited: 0x10)
struct FBattlefieldEffectRow : FDescRowBase
{
	EBattlefieldEffectType EffectType; // 0x10(0x1)
	EBattlefieldEffectGroup Group; // 0x11(0x1)
	uint8_t Pad_0x12[0x2]; // 0x12(0x2)
	int32_t MaxCount; // 0x14(0x4)
	int32_t Priority; // 0x18(0x4)
	struct FBattlefieldEffectEnergyParamRow EnergyParams; // 0x1C(0x20)
	float DurationTime; // 0x3C(0x4)
	struct TArray<struct FBattlefieldEffectMatFloatParamRow> MatFloatParams; // 0x40(0x10)
	struct TArray<struct FBattlefieldEffectMatVectorParamRow> MatVectorParams; // 0x50(0x10)
	uint8_t bUsedForAllMaterials : 1; // 0x60(0x1), Mask(0x1)
	uint8_t BitPad_0x60_1 : 7; // 0x60(0x1)
	uint8_t Pad_0x61[0x7]; // 0x61(0x7)
};

// Object: ScriptStruct GPGameplay.BattlefieldEffectMatVectorParamRow
// Size: 0x2C (Inherited: 0x0)
struct FBattlefieldEffectMatVectorParamRow
{
	struct FName ParamName; // 0x0(0x8)
