#pragma once

#include "../CoreUObject_classes.hpp"
#include "AIActionPointGeneratorRuntime.hpp"
#include "AIModule.hpp"
#include "DeveloperSettings.hpp"
#include "Engine.hpp"
#include "NavigationSystem.hpp"

namespace SDK
{

// Package: MFNPCAI
// Enums: 75
// Structs: 169
// Classes: 305

struct AAIController;
struct AActor;
struct ACharacter;
struct AController;
struct ACoverSystemActor;
struct AGameState;
struct AMFVoxelEnvAreaClusterActor;
struct ANavMeshBoundsVolume;
struct ANavigationData;
struct APawn;
struct ARecastNavMesh;
struct ATacticSystemActor;
struct AVolume;
enum class ENPCPoseType : uint8_t;
enum class ETacticPointType : uint8_t;
struct FAINoiseEvent;
struct FAIRequestID;
struct FAIStimulus;
struct FActionPointRadianSafe;
struct FCoverPointOctreeData;
struct FCoverPointOctreeElement;
struct FCoverPoseData;
struct FDamageEvent;
struct FHitResult;
struct FKeyRoutePointData;
struct FTacticPointData;
struct UAISenseConfig_Damage;
struct UAISenseConfig_Hearing;
struct UAISenseConfig_Sight;
struct UAISenseConfig_Touch;
struct UActorComponent;
struct UAkAudioEvent;
struct UBTNode;
struct UBTService;
struct UBoxComponent;
struct UCapsuleComponent;
struct UCoverSystem;
struct UCurveFloat;
struct UCurveVector;
struct UDataTable;
struct UEnvQuery;
struct UEnvQueryContext;
struct UEnvQueryContext_BlueprintBase;
struct UEnvQueryInstanceBlueprintWrapper;
struct UNavArea;
struct UNavLinkComponent;
struct UNavLinkCustomComponent;
struct UNavigationQueryFilter;

struct INPCAITeamInterface;
struct UNPCAIThrowSystem;
struct UAITrackLOGUnit;
struct UNPCAITrackLogger;
struct UAIPortraitBase;
struct UAIPortraitDefault;
struct INPCAIUALootSubAreaVolumeInterface;
struct INPCAIVehicleInterface;
struct INPCAIVolumeInterface;
struct UNPCAIZoneGroupInfo;
struct UNPCBTDecorator;
struct UNPCBTDecorator_AIPropertyComparison;
struct UNPCBTDecorator_BBConditionBase;
struct UNPCBTDecorator_BBConditionBool;
struct UNPCBTDecorator_BBConditionFloat;
struct UNPCBTDecorator_BBConditionInt;
struct UNPCBTDecorator_BBConditionObject;
struct UNPCBTDecorator_BBConditionString;
struct UNPCBTDecorator_BlueprintBase;
struct UNPCBTDecorator_CheckComponent;
struct UNPCBTDecorator_HasSuspectPoints;
struct UNPCBTDecorator_IsCloseEnough;
struct UNPCBTDecorator_ShouldWaitAtPathNode;
struct UNPCBTDecorator_SingletonBlueprintBase;
struct UNPCBTDecorator_TickIntervalBase;
struct UNPCBTDecorator_Wait;
struct UNPCBTService;
struct UNPCBTService_BlueprintBase;
struct UNPCBTService_FindRandomPosition;
struct UNPCBTService_SetSenseRangeScale;
struct UNPCBTService_SetVisionHalfAngle;
struct UNPCBTService_SingletonBlueprintBase;
struct UNPCBTTask_BlueprintBase;
struct UNPCBTTask_LatenTaskBase;
struct UNPCBTTask_AimAndFireEnemy;
struct UNPCBTTaskNode;
struct UNPCBTTask_AttackEnemy;
struct UNPCBTTask_CalcNextAttackPosition;
struct UNPCBTTask_CalcNextWanderPathNode;
struct UNPCBTTask_ClearFocalPoint;
struct UNPCBTTask_DBNORescue;
struct UNPCBTTask_FireEnemy;
struct UNPCBTTask_FireEnemyEx;
struct UNPCBTTask_FollowPathNode;
struct UNPCBTTask_MeleeAttackEnemy;
struct UNPCBTTask_MoveToEx;
struct UNPCBTTask_PlayAkSound;
struct UNPCBTTask_ResetTargetLocation;
struct UNPCBTTask_SetAIPose;
struct UNPCBTTask_SetBlackboardValue;
struct UNPCBTTask_SetFocalPoint;
struct UNPCBTTask_SetMovementSpeed;
struct UNPCBTTask_SetSenseRangeScale;
struct UNPCBTTask_SetTargetHatred;
struct UNPCBTTask_SetVisionHalfAngle;
struct UNPCBTTask_StartShoulderAimingTarget;
struct UNPCBTTask_StopShoulderAimingTarget;
struct INPCCharacterAIDBNOInterface;
struct INPCCharacterAIDeathInterface;
struct INPCCharacterAIDebugInterface;
struct INPCCharacterAIExplodeInterface;
struct INPCCharacterAIFireInterface;
struct INPCCharacterAIIKInterface;
struct INPCCharacterAIInventoryInterface;
struct INPCCharacterAIMoveInterface;
struct INPCCharacterAIPathNodeInterface;
struct INPCCharacterAIPerceptionInterface;
struct INPCCharacterAIPickUpInterface;
struct INPCCharacterAIPoseCacheInterface;
struct INPCCharacterAIPoseInterface;
struct INPCCharacterAISenseAbilityInterface;
struct INPCCharacterAISoundInterface;
struct INPCCharacterAITakeCoverInterface;
struct INPCCharacterAITeamRescueInterface;
struct INPCCharacterAITurnInterface;
struct INPCCharacterHealthInterface;
struct INPCCharacterTakeDamageInterface;
struct INPCDroneCharacterInterface;
struct ANPCGrassIdentificationVolume;
struct ISGActorFactionCompInterface;
struct ISGFactionInterface;
struct ISGTeamInterface;

// Object: Enum MFNPCAI.EMFGraphAStarResult
enum class EMFGraphAStarResult : uint8_t
{
	WaitToSearch = 0,
	SearchFail = 1,
	SearchInProgress = 2,
	SearchAborted = 3,
	SearchDone = 4,
	SearchSuccess = 5,
	GoalUnreachable = 6,
	InfiniteLoop = 7,
	NotFound = 8,
	RequestNotFound = 9,
	EMFGraphAStarResult_MAX = 10
};

// Object: Enum MFNPCAI.ENPCAIGoDirectlyResult
enum class ENPCAIGoDirectlyResult : uint8_t
{
	Success = 0,
	ReachBoundary = 1,
	AIPawnNotFound = 2,
	ENPCAIGoDirectlyResult_MAX = 3
};

// Object: Enum MFNPCAI.ENPCAICellGridValue
enum class ENPCAICellGridValue : uint8_t
{
	None = 0,
	NoNavMesh = 1,
	Vehicle = 2,
	BreakableObj = 4,
	Paradrop = 8,
	ENPCAICellGridValue_MAX = 9
};

// Object: Enum MFNPCAI.EAISpawnSceneEvtType
enum class EAISpawnSceneEvtType : uint8_t
{
	None = 0,
	TriggerEvent = 1,
	SpawnVector = 2,
	AutoFillVectorAI = 3,
	SpawnAllyAI = 4,
	EAISpawnSceneEvtType_MAX = 5
};

// Object: Enum MFNPCAI.EAISceneEventState
enum class EAISceneEventState : uint8_t
{
	Trigger = 0,
	Completed = 1,
	Expired = 2,
	Removed = 3,
	EAISceneEventState_MAX = 4
};

// Object: Enum MFNPCAI.EAIAimingType
enum class EAIAimingType : uint8_t
{
	Normal = 0,
	Regular = 1,
	EAIAimingType_MAX = 2
};

// Object: Enum MFNPCAI.EAIAimStatus
enum class EAIAimStatus : uint8_t
{
	Aiming = 0,
	NoTarget = 1,
	AimComplete = 2,
	EAIAimStatus_MAX = 3
};

// Object: Enum MFNPCAI.ENPCAIAsyncTaskType
enum class ENPCAIAsyncTaskType : uint8_t
{
	None = 0,
	FindAmbushAgainstPoint = 1,
	PeekPoint = 2,
	FindPathByKeyRoute = 3,
	QueryRoundEnvironment = 4,
	ENPCAIAsyncTaskType_MAX = 5
};

// Object: Enum MFNPCAI.ENPCPlaceForCheckType
enum class ENPCPlaceForCheckType : uint8_t
{
	Simple = 0,
	Danger = 1,
	Suspicious = 2,
	Fatal = 3,
	GrenadeHit_Near = 4,
	GrenadeHit_Far = 5,
	GrenadeComeing = 6,
	FarFootStep = 7,
	CloseFootStep = 8,
	FarGunFire = 9,
	CloseGunFire = 10,
	GrenadeHolding = 11,
	Fuzzy = 12,
	CloseVehicleNoise = 13,
	FarVehicleNoise = 14,
	VehicleRushMe = 15,
	CloseVehicleHorn = 16,
	FarVehicleHorn = 17,
	Drone = 18,
	ENPCPlaceForCheckType_MAX = 19
};

// Object: Enum MFNPCAI.EAIProfileEditState
enum class EAIProfileEditState : uint8_t
{
	None = 0,
	ChoosingProperty = 1,
	EditingProperty = 2,
	Comparing = 3,
	EAIProfileEditState_MAX = 4
};

// Object: Enum MFNPCAI.EAIProfileCoverType
enum class EAIProfileCoverType : uint8_t
{
	CoverType_None = 0,
	CoverType_int32 = 1,
	CoverType_int64 = 2,
	CoverType_float = 3,
	CoverType_bool = 4,
	CoverType_Byte = 5,
	CoverType_Enum = 6,
	CoverType_Set = 7,
	CoverType_Array = 8,
	CoverType_Map = 9,
	CoverType_Vector = 10,
	CoverType_AIMindGoalEnemyAngleMultiple = 11,
	CoverType_AIBodyBulkAimingChoice = 12,
	CoverType_AISenseSightNormal = 13,
	CoverType_String = 14,
	CoverType_Object = 15,
	CoverType_SoftClassPtr = 16,
	CoverType_MAX = 17
};

// Object: Enum MFNPCAI.ENPCAIMovementKind
enum class ENPCAIMovementKind : uint8_t
{
	GotoPoint = 0,
	GoDirectly = 1,
	GoAccordingToWayPoints = 2,
	ENPCAIMovementKind_MAX = 3
};

// Object: Enum MFNPCAI.ENPCAIMoveResult
enum class ENPCAIMoveResult : uint8_t
{
	None = 0,
	WaitPerform = 1,
	Succeeded = 2,
	Failed = 3,
	Aborted = 4,
	InProgress = 5,
	ENPCAIMoveResult_MAX = 6
};

// Object: Enum MFNPCAI.EGetLinkUsageCountStatus
enum class EGetLinkUsageCountStatus : uint8_t
{
	Success = 0,
	GetNavMeshManagerFailed = 1,
	GetSourceRegionIndexFailed = 2,
	GetTargetRegionIndexFailed = 3,
	RegionIndexNotValidNodeIndex = 4,
	RegionIndexNotValidAdjacencyIndex = 5,
	Unreachable = 6,
	EGetLinkUsageCountStatus_MAX = 7
};

// Object: Enum MFNPCAI.ENavLinkType
enum class ENavLinkType : uint8_t
{
	None = 0,
	Door = 1,
	Cabinet = 2,
	JumpDown = 3,
	JumpForward = 4,
	Climb = 5,
	Vault = 6,
	HighClimb = 7,
	HighVault = 8,
	ENavLinkType_MAX = 9
};

// Object: Enum MFNPCAI.ENavSkeletonPointGetterFlag
enum class ENavSkeletonPointGetterFlag : uint16_t
{
	None = 0,
	LinkId = 1,
	NeighbourIndices = 2,
	VisibleIndices = 3,
	All = 255,
	ENavSkeletonPointGetterFlag_MAX = 256
};

// Object: Enum MFNPCAI.ENavSkeletonDivergenceMethod
enum class ENavSkeletonDivergenceMethod : uint8_t
{
	Laplacian = 0,
	GradientFlux = 1,
	Neighbour = 2,
	ENavSkeletonDivergenceMethod_MAX = 3
};

// Object: Enum MFNPCAI.ENavSkeletonSamplePointKind
enum class ENavSkeletonSamplePointKind : uint8_t
{
	None = 0,
	Isolate = 1,
	Endpoint = 2,
	Normal = 3,
	KeptNormal = 4,
	DoorLink = 5,
	Junction = 6,
	ENavSkeletonSamplePointKind_MAX = 7
};

// Object: Enum MFNPCAI.ENavSkeletonSamplePointDropReason
enum class ENavSkeletonSamplePointDropReason : uint8_t
{
	None = 0,
	CannotBeSkeletonPoint = 1,
	FindDistanceToWallFailed = 2,
	TooCloseToWall = 3,
	InvalidWallHitNormal = 4,
	MismatchedNeighbours = 5,
	InvalidGradientSize = 6,
	InvalidDivergence = 7,
	TooLessWallCount = 8,
	Isolated = 9,
	NotMainPoint = 10,
	CloseToAnotherMainPoint = 11,
	CannotFindProperPointToConnect = 12,
	InvalidPointKind = 13,
	BeSimplified = 14,
	InPrunedEndBranch = 15,
	Count = 16,
	ENavSkeletonSamplePointDropReason_MAX = 17
};

// Object: Enum MFNPCAI.EPathExistenceTestMode
enum class EPathExistenceTestMode : uint8_t
{
	Regular = 0,
	Hierarchical = 1,
	EPathExistenceTestMode_MAX = 2
};

// Object: Enum MFNPCAI.ENavAreaKind
enum class ENavAreaKind : uint8_t
{
	Burning = 0,
	TearGas = 1,
	TripMine = 2,
	Claymore = 3,
	Paradrop = 4,
	ENavAreaKind_MAX = 5
};

// Object: Enum MFNPCAI.ENavMeshTileLabel
enum class ENavMeshTileLabel : uint16_t
{
	AllPolysReachable = 0,
	PartialPolysReachable = 1,
	InvalidBeginIndex = 2,
	ConsiderUnreachablePolys = 252,
	AllPolysUnreachable = 253,
	InvalidHeader = 254,
	Unknown = 255,
	ENavMeshTileLabel_MAX = 256
};

// Object: Enum MFNPCAI.EMETIS_OBJTYPE
enum class EMETIS_OBJTYPE : uint8_t
{
	METIS_OBJTYPE_CUT = 0,
	METIS_OBJTYPE_VOL = 1,
	METIS_OBJTYPE_NODE = 2,
	METIS_OBJTYPE_MAX = 3
};

// Object: Enum MFNPCAI.EMETIS_RTYPE
enum class EMETIS_RTYPE : uint8_t
{
	METIS_RTYPE_FM = 0,
	METIS_RTYPE_GREEDY = 1,
	METIS_RTYPE_SEP2SIDED = 2,
	METIS_RTYPE_SEP1SIDED = 3,
	METIS_RTYPE_MAX = 4
};

// Object: Enum MFNPCAI.EMETIS_IPTYPE
enum class EMETIS_IPTYPE : uint8_t
{
	METIS_IPTYPE_GROW = 0,
	METIS_IPTYPE_RANDOM = 1,
	METIS_IPTYPE_EDGE = 2,
	METIS_IPTYPE_NODE = 3,
	METIS_IPTYPE_METISRB = 4,
	METIS_IPTYPE_MAX = 5
};

// Object: Enum MFNPCAI.EMETIS_CTYPE
enum class EMETIS_CTYPE : uint8_t
{
	METIS_CTYPE_RM = 0,
	METIS_CTYPE_SHEM = 1,
	METIS_CTYPE_MAX = 2
};

// Object: Enum MFNPCAI.EMETIS_PTYPE
enum class EMETIS_PTYPE : uint8_t
{
	METIS_PTYPE_RB = 0,
	METIS_PTYPE_KWAY = 1,
	METIS_PTYPE_MAX = 2
};

// Object: Enum MFNPCAI.ENPCAIDisableFocusReason
enum class ENPCAIDisableFocusReason : uint8_t
{
	None = 0,
	Debugging = 1,
	ENPCAIDisableFocusReason_MAX = 2
};

// Object: Enum MFNPCAI.ENPCAIPausePathFollowReason
enum class ENPCAIPausePathFollowReason : uint8_t
{
	None = 0,
	Debugging = 1,
	Attacking = 2,
	Falling = 3,
	PuppetPause = 4,
	Die = 5,
	Land = 6,
	ENPCAIPausePathFollowReason_MAX = 7
};

// Object: Enum MFNPCAI.EnumAIGrassType
enum class EnumAIGrassType : uint8_t
{
	E_Foliage = 0,
	E_Landscape = 1,
	E_MAX = 2
};

// Object: Enum MFNPCAI.EnumAIGrassDebugBox
enum class EnumAIGrassDebugBox : uint8_t
{
	E_NONE = 0,
	E_Foliage = 1,
	E_Landscape = 2,
	E_FoliageCylinders = 3,
	E_ALL = 4,
	E_MAX = 5
};

// Object: Enum MFNPCAI.EAILODActionPlan
enum class EAILODActionPlan : uint8_t
{
	NoLOD = 0,
	Normal = 1,
	Elite = 2,
	Boss = 3,
	Puppet = 4,
	EAILODActionPlan_MAX = 5
};

// Object: Enum MFNPCAI.EAimingType
enum class EAimingType : uint8_t
{
	Normal = 0,
	Regular = 1,
	EAimingType_MAX = 2
};

// Object: Enum MFNPCAI.ENPCAISceneEventID
enum class ENPCAISceneEventID : uint8_t
{
	None = 0,
	Armory_Alarm_EscapeG1 = 1,
	Armory_Alarm_EscapeWater = 2,
	Valley_Alarm_BossHouse = 3,
	Valley_Alarm_BossFactory = 4,
	CallHelp = 5,
	ArmoryAlarmEscapeMine = 6,
	TVStation_Escape_Elevator = 7,
	ArmoryAlarmEscapeBunker = 8,
	Call_Defender_TVStation = 9,
	ENPCAISceneEventID_MAX = 10
};

// Object: Enum MFNPCAI.ESteepZoneSamplePointDropReason
enum class ESteepZoneSamplePointDropReason : uint8_t
{
	None = 0,
	InvalidTrace = 1,
	StartPenetrating = 2,
	WalkableFloor = 3,
	NotEnoughNeighbours = 4,
	Count = 5,
	ESteepZoneSamplePointDropReason_MAX = 6
};

// Object: Enum MFNPCAI.ESteepZoneNavMeshPolyDropReason
enum class ESteepZoneNavMeshPolyDropReason : uint8_t
{
	None = 0,
	GetTileAndPolyByRefFailed = 1,
	NotPoly = 2,
	InvalidNormal = 3,
	ValidIncludedAngle = 4,
	AllTrianglesDropped = 5,
	Count = 6,
	ESteepZoneNavMeshPolyDropReason_MAX = 7
};

// Object: Enum MFNPCAI.EAIKeyRouteQueryType
enum class EAIKeyRouteQueryType : uint8_t
{
	Safe = 0,
	Short = 1,
	EAIKeyRouteQueryType_MAX = 2
};

// Object: Enum MFNPCAI.ENPCSetPartType
enum class ENPCSetPartType : uint8_t
{
	None = 0,
	Close = 1,
	Middle = 2,
	Far = 3,
	ENPCSetPartType_MAX = 4
};

// Object: Enum MFNPCAI.EAITrackLOGType
enum class EAITrackLOGType : uint8_t
{
	Move = 0,
	AimingBodyPart = 1,
	AimingTime = 2,
	AimingPredestined = 3,
	Shoot = 4,
	BeHit = 5,
	Decision = 6,
	EAITrackLOGType_MAX = 7
};

// Object: Enum MFNPCAI.ENPCAITactic
enum class ENPCAITactic : uint8_t
{
	None = 0,
	CloseFight = 1,
	MidFight = 2,
	LongFight = 3,
	RushFace = 4,
	FlankAttack = 5,
	BackAround = 6,
	Hide = 7,
	RunAway = 8,
	ENPCAITactic_MAX = 9
};

// Object: Enum MFNPCAI.EAIMainType
enum class EAIMainType : uint8_t
{
	EAIMainType_Scav = 0,
	EAIMainType_Boss = 1,
	EAIMainType_Follower = 2,
	EAIMainType_PMCAI = 3,
	EAIMainType_TeachingAI = 4,
	EAIMainType_TestAI = 5,
	EAIMainType_Elit = 6,
	EAIMainType_Elit_PlayerScavAI = 7,
	EAIMainType_AllyAI = 8,
	EAIMainType_EventScav = 9,
	EAIMainType_Zombie_Normal = 10,
	EAIMainType_Zombie_Elit = 11,
	EAIMainType_Zombie_Boss = 12,
	EAIMainType_MAX = 13
};

// Object: Enum MFNPCAI.EAIEnemyVisibilityType
enum class EAIEnemyVisibilityType : uint8_t
{
	NotVisible = 0,
	VisibleBySense = 1,
	Visible = 2,
	EAIEnemyVisibilityType_MAX = 3
};

// Object: Enum MFNPCAI.EAIEnemyPriority
enum class EAIEnemyPriority : uint8_t
{
	EAIEnemyPriority_High = 0,
	EAIEnemyPriority_Medium = 1,
	EAIEnemyPriority_Low = 2,
	EAIEnemyPriority_MAX = 3
};

// Object: Enum MFNPCAI.EAIAimingBodyPartTrend
enum class EAIAimingBodyPartTrend : uint8_t
{
	None = 0,
	Armor = 1,
	NoArmor = 2,
	Fatal = 3,
	MinDamage = 4,
	EAIAimingBodyPartTrend_MAX = 5
};

// Object: Enum MFNPCAI.EAIBodyBulkType
enum class EAIBodyBulkType : uint8_t
{
	HeadGroup = 0,
	BodyGroup = 1,
	LegsGroup = 2,
	EAIBodyBulkType_MAX = 3
};

// Object: Enum MFNPCAI.EAIBodyPartType
enum class EAIBodyPartType : uint8_t
{
	EAIBodyPartType_Head = 0,
	EAIBodyPartType_Chest = 1,
	EAIBodyPartType_LefyArm = 2,
	EAIBodyPartType_RightArm = 3,
	EAIBodyPartType_LeftLeg = 4,
	EAIBodyPartType_RightLeg = 5,
	EAIBodyPartType_Stomach = 6,
	EAIBodyPartType_Max = 7
};

// Object: Enum MFNPCAI.ECrossShot_ToStance
enum class ECrossShot_ToStance : uint8_t
{
	Stand = 0,
	Crouch = 1,
	ECrossShot_MAX = 2
};

// Object: Enum MFNPCAI.EAISenseBehaviorType
enum class EAISenseBehaviorType : uint8_t
{
	None = 0,
	Loot = 1,
	EAISenseBehaviorType_MAX = 2
};

// Object: Enum MFNPCAI.EAISoundType
enum class EAISoundType : uint8_t
{
	EAISoundType_ConfirmTargetScream = 0,
	EAISoundType_MAX = 1
};

// Object: Enum MFNPCAI.ENPCAIPerceptibleTile
enum class ENPCAIPerceptibleTile : uint8_t
{
	None = 0,
	Bomb = 1,
	Stun = 2,
	Smoke = 3,
	Molotov = 4,
	C4 = 5,
	Flash = 6,
	FootSounder = 7,
	TearGas = 8,
	OffensiveGrenade = 9,
	TripMine = 10,
	ClaymoreMine = 11,
	SignalDetonator = 12,
	AlwaysOn = 13,
	RPG = 14,
	Monitor = 15,
	CustomIndex = 16,
	DefaultArea = 17,
	AvoidanceArea = 18,
	ObstacleArea = 19,
	ParadropArea = 20,
	VehicleArea = 21,
	UnderPlatform = 22,
	Unknown = 23,
	Max = 24
};

// Object: Enum MFNPCAI.EAIWorkResult
enum class EAIWorkResult : uint8_t
{
	Success = 0,
	Failed = 1,
	Wait = 2,
	EAIWorkResult_MAX = 3
};

// Object: Enum MFNPCAI.EAISenseSightConf
enum class EAISenseSightConf : uint8_t
{
	Normal = 0,
	Night = 1,
	Light = 2,
	EAISenseSightConf_MAX = 3
};

// Object: Enum MFNPCAI.ENPCAISenseChannel
enum class ENPCAISenseChannel : uint8_t
{
	NONE = 0,
	Weapon_Channel = 15,
	AISight_Channel = 25,
	ENPCAISenseChannel_MAX = 26
};

// Object: Enum MFNPCAI.EAISenseType
enum class EAISenseType : uint8_t
{
	ALL = 0,
	Sight = 1,
	Hearing = 2,
	Damage = 3,
	ComingExplosion = 4,
	EAISenseType_MAX = 5
};

// Object: Enum MFNPCAI.ENPCAISenseBarrier
enum class ENPCAISenseBarrier : uint8_t
{
	None = 0,
	Normal = 1,
	Grass = 2,
	ALLY = 3,
	OtherEnemy = 4,
	Smoke = 5,
	ENPCAISenseBarrier_MAX = 6
};

// Object: Enum MFNPCAI.ENPCAIPriority
enum class ENPCAIPriority : uint8_t
{
	Low = 0,
	Middle = 1,
	High = 2,
	Max = 3
};

// Object: Enum MFNPCAI.EAIGroupRequestPriority
enum class EAIGroupRequestPriority : uint8_t
{
	Low = 0,
	Normal = 1,
	Top = 2,
	Fatal = 3,
	EAIGroupRequestPriority_MAX = 4
};

// Object: Enum MFNPCAI.EAIProfileType
enum class EAIProfileType : uint8_t
{
	Aiming = 0,
	AIType = 1,
	Boss = 2,
	Core = 3,
	Curve = 4,
	Global = 5,
	Grenade = 6,
	Hearing = 7,
	Lay = 8,
	Look = 9,
	Mind = 10,
	Move = 11,
	Shoot = 12,
	Sound = 13,
	Weapon = 14,
	Damage = 15,
	Health = 16,
	PlayerActionReaction = 17,
	BTBlock = 18,
	Strategy = 19,
	Smart = 20,
	Tactic = 21,
	RequestRun = 22,
	Nav = 23,
	MAX = 24
};

// Object: Enum MFNPCAI.ENPCAIDecision
enum class ENPCAIDecision : uint8_t
{
	None = 0,
	RushFaceWhenDisable = 1,
	ShootFromCover = 2,
	ShootFromGround = 3,
	ShootPrecisely = 4,
	RushFaceWithAlly = 5,
	FindCoverToHide = 6,
	ChangeCoverAfterNotSafe = 7,
	MoveFurther = 8,
	MoveCloser = 9,
	MoveToFlank = 10,
	MoveToAttackPoint = 11,
	ChangeCover = 12,
	SearchEnemy = 13,
	HoldPosition = 14,
	BackToCover = 15,
	DogFight = 16,
	CautionInPlace = 17,
	CautionInCover = 18,
	CheckSuspiciousPoint = 19,
	SuspiciousPointClear = 20,
	GoToNextPathNode = 21,
	FollowTargetBoss = 22,
	StandAndLookAround = 23,
	PacingInPlace = 24,
	TakeMedicine = 25,
	CallHelp = 26,
	RushStrike = 27,
	RushFace = 28,
	LootNearby = 29,
	DodgeGrenade = 30,
	ThrowGrenade = 31,
	WaitInEscapeVolume = 32,
	ShootFootstepCreator = 33,
	KillDBNOEnemy = 34,
	SneakApproaching = 35,
	ReloadInGround = 36,
	ReloadInCover = 37,
	Overwatch = 38,
	ActiveAlarmDevice = 39,
	Escape = 40,
	DodgeFire = 41,
	ThrowSmoke = 42,
	ProneShoot = 43,
	FindPronePoint = 44,
	CrouchShoot = 45,
	ProneSuppress = 46,
	CrouchSuppress = 47,
	StandSuppress = 48,
	DualCharge = 49,
	DualGuard = 50,
	Retreat = 51,
	ChangeCoverAfterNotAdvantage = 52,
	QuickToHide = 53,
	ChangeCoverToCrouch = 54,
	CrouchAimingInCover = 55,
	CallForHelp = 56,
	RidiculeVoice = 57,
	StayInPlace = 58,
	PositionAdjustment = 59,
	DodgeAttackMove = 60,
	MoveToLocNeedArrive = 61,
	SmokeToAssistHide = 62,
	TacticAction_RushFace = 63,
	GrenadeToPeek = 64,
	DodgeGrenadeHold = 65,
	TeamMove = 66,
	ThrowStepCreator = 67,
	SuppressionChangeClose = 68,
	SuppressionInPlace = 69,
	SuppressionControlDistance = 70,
	SuppressionDoor = 71,
	OutBattleVolume = 72,
	SlientDefenseDoor = 73,
	SlientDefenseChangeFar = 74,
	SlientDefenseControlDistance = 75,
	HoldAreaWithWall = 76,
	HoldRoomWithWall = 77,
	FootStepCreatorMoveClose = 78,
	FootStepCreatorMoveFar = 79,
	OpenDoorRush = 80,
	OpenDoorSlient = 81,
	MoveToDoorSafePoint = 82,
	EscapeRush = 83,
	EscapeSlient = 84,
	DodgeFlashProjectile = 85,
	RandomRangeShoot = 86,
	GrassMove = 87,
	ProtectSafeBox = 88,
	PeekFromPeekMark = 89,
	PlaceTrapDevice = 90,
	CallHelpOnHit = 91,
	AroundFindEnemy = 92,
	AlwaysReload = 93,
	MeleeAttackOnReload = 94,
	TakeMedicineOnHit = 95,
	FoolShootOnHit = 96,
	BattleShow = 97,
	OutOfBattleAct = 98,
	OutOfAllyRange = 99,
	WildlyShootInCover = 100,
	AntiCamper = 101,
	TeamOrder_StayInLoc = 102,
	TeamOrder_AttackAndBack = 103,
	ENPCAIDecision_MAX = 104
};

// Object: Enum MFNPCAI.EAIPerformance
enum class EAIPerformance : uint8_t
{
	None = 0,
	Camp1 = 1,
	Camp2 = 2,
	Camp3 = 3,
	Camp4 = 4,
	Camp5 = 5,
	Camp6 = 6,
	Camp7 = 7,
	Camp8 = 8,
	Camp9 = 9,
	Camp10 = 10,
	Camp11 = 11,
	Camp12 = 12,
	Camp13 = 13,
	Camp14 = 14,
	Boss1 = 15,
	Boss2 = 16,
	Boss3 = 17,
	Boss4 = 18,
	Boss5_1 = 19,
	Boss5_2 = 20,
	Boss5_3 = 21,
	Boss_6 = 22,
	Boss_7 = 23,
	EventBoss1 = 24,
	EventBoss2 = 25,
	EventBoss3 = 26,
	EventFollower1 = 27,
	EventFollower2 = 28,
	Follower1 = 29,
	Follower2 = 30,
	Follower3 = 31,
	Follower4 = 32,
	Follower5 = 33,
	Follower5_3 = 34,
	Follower_6_1 = 35,
	Follower_6_2 = 36,
	Follower_6_3 = 37,
	Follower_6_4 = 38,
	Follower_6_5 = 39,
	Follower_6_6 = 40,
	Follower7 = 41,
	PMC1 = 42,
	PlayerScav1 = 43,
	EventScav1_1 = 44,
	EventScav1_2 = 45,
	EventScav2 = 46,
	EventScav3 = 47,
	EventBossDoss1 = 48,
	EventFollowerDoss1 = 49,
	EventFollowerDoss2 = 50,
	EventGnesk = 51,
	Event_260_Camp3 = 52,
	Event_260_Camp6 = 53,
	Event_260_Camp14 = 54,
	Camp15 = 55,
	Boss_8 = 56,
	Boss_9_1 = 57,
	Boss_9_2 = 58,
	Boss_9_3 = 59,
	Boss_9_4 = 60,
	EAIPerformance_MAX = 61
};

// Object: Enum MFNPCAI.EAISenseSourceType
enum class EAISenseSourceType : uint8_t
{
	EAISenseSourceType_Grenade = 0,
	EAISenseSourceType_MAX = 1
};

// Object: Enum MFNPCAI.EBlackboardEntryCondition
enum class EBlackboardEntryCondition : uint8_t
{
	BlackboardEntryCondition_Equal = 0,
	BlackboardEntryCondition_Greater = 1,
	BlackboardEntryCondition_Less = 2,
	BlackboardEntryCondition_MAX = 3
};

// Object: Enum MFNPCAI.ENPCKnowWeather
enum class ENPCKnowWeather : uint8_t
{
	Normal = 0,
	Fog = 1,
	ENPCKnowWeather_MAX = 2
};

// Object: Enum MFNPCAI.ENPCWeakenDebuffType
enum class ENPCWeakenDebuffType : uint8_t
{
	LoseSight = 0,
	Tinnitus = 1,
	Slowdown = 2,
	ENPCWeakenDebuffType_MAX = 3
};

// Object: Enum MFNPCAI.EUANPCAllyOrder
enum class EUANPCAllyOrder : uint8_t
{
	None = 0,
	Stop = 1,
	ChangeDetil = 2,
	Protect = 3,
	Move = 4,
	Reconnoiter = 5,
	ThrowGrenade = 6,
	Attack = 7,
	Follow = 8,
	SearchEnemy = 9,
	EUANPCAllyOrder_MAX = 10
};

// Object: Enum MFNPCAI.ENPCAIJobType
enum class ENPCAIJobType : uint8_t
{
	None = 0,
	AIPuppet = 1,
	AIFakeman = 2,
	AIHidingmain = 3,
	ENPCAIJobType_MAX = 4
};

// Object: Enum MFNPCAI.ENPCAICharacterType
enum class ENPCAICharacterType : uint8_t
{
	None = 0,
	AI = 1,
	Zombie = 2,
	ENPCAICharacterType_MAX = 3
};

// Object: Enum MFNPCAI.ENPCPanicType
enum class ENPCPanicType : uint8_t
{
	None = 0,
	Run = 1,
	Crouch = 2,
	Prone = 3,
	ENPCPanicType_MAX = 4
};

// Object: Enum MFNPCAI.EAILiveState
enum class EAILiveState : uint8_t
{
	None = 0,
	Spawned = 1,
	Actived = 2,
	Dead = 3,
	EAILiveState_MAX = 4
};

// Object: Enum MFNPCAI.EAIMoveType
enum class EAIMoveType : uint8_t
{
	AIMoveType_Walk = 0,
	AIMoveType_Run = 1,
	AIMoveType_Sprint = 2,
	AIMoveType_MAX = 3
};

// Object: Enum MFNPCAI.EAILeanType
enum class EAILeanType : uint8_t
{
	AILeanType_Center = 0,
	AILeanType_Left = 1,
	AILeanType_Right = 2,
	AILeanType_MAX = 3
};

// Object: Enum MFNPCAI.EAIPerceptionTargetType
enum class EAIPerceptionTargetType : uint8_t
{
	None = 0,
	Player = 1,
	OtherAI = 2,
	DroneActor = 3,
	EAIPerceptionTargetType_MAX = 4
};

// Object: Enum MFNPCAI.EAIPose
enum class EAIPose : uint8_t
{
	AIPose_Stand = 0,
	AIPose_Crouch = 1,
	AIPose_Prone = 2,
	AIPose_Slide = 3,
	AIPose_Move = 4,
	AIPose_Vehicle = 5,
	AIPose_MAX = 6
};

// Object: Enum MFNPCAI.EAISpecialFireType
enum class EAISpecialFireType : uint8_t
{
	EAISpecialFireType_Miss = 0,
	EAISpecialFireType_MAX = 1
};

// Object: Enum MFNPCAI.EAILookPointMode
enum class EAILookPointMode : uint8_t
{
	ToMovingDirection = 0,
	ToCustomPoint = 1,
	NoSteering = 2,
	EAILookPointMode_MAX = 3
};

// Object: ScriptStruct MFNPCAI.NavSkeletonGraphFindResult
// Size: 0x38 (Inherited: 0x0)
struct FNavSkeletonGraphFindResult
{
	EMFGraphAStarResult Status; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct TArray<struct FNavSkeletonGraphResultNode> Nodes; // 0x8(0x10)
	struct TArray<int32_t> DesiredNodeIndices; // 0x18(0x10)
	struct TArray<int32_t> DesiredPointIDs; // 0x28(0x10)
};

// Object: ScriptStruct MFNPCAI.NavSkeletonGraphResultNode
// Size: 0x10 (Inherited: 0x0)
struct FNavSkeletonGraphResultNode
{
	int32_t PointID; // 0x0(0x4)
	int32_t ParentID; // 0x4(0x4)
	float PathLength; // 0x8(0x4)
	float UnreachablePathLength; // 0xC(0x4)
};

// Object: ScriptStruct MFNPCAI.NPCAIQueryRoundEnvironmentResult
// Size: 0x5C (Inherited: 0x0)
struct FNPCAIQueryRoundEnvironmentResult
{
	struct FVector AILocation; // 0x0(0xC)
	struct FVector EnemyLocation; // 0xC(0xC)
	bool LCanMove; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
	struct FVector LMovePoint; // 0x1C(0xC)
	bool RCanMove; // 0x28(0x1)
	uint8_t Pad_0x29[0x3]; // 0x29(0x3)
	struct FVector RMovePoint; // 0x2C(0xC)
	bool FCanMove; // 0x38(0x1)
	uint8_t Pad_0x39[0x3]; // 0x39(0x3)
	struct FVector FMovePoint; // 0x3C(0xC)
	bool BCanMove; // 0x48(0x1)
	uint8_t Pad_0x49[0x3]; // 0x49(0x3)
	struct FVector BMovePoint; // 0x4C(0xC)
	bool LCanDefense; // 0x58(0x1)
	bool RCanDefense; // 0x59(0x1)
	bool LCanAttack; // 0x5A(0x1)
	bool RCanAttack; // 0x5B(0x1)
};

// Object: ScriptStruct MFNPCAI.NPCAIFindAmbushAgainstPointResult
// Size: 0x10 (Inherited: 0x0)
struct FNPCAIFindAmbushAgainstPointResult
{
	struct FVector AgainstPoint; // 0x0(0xC)
	bool bCanFind; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
};

// Object: ScriptStruct MFNPCAI.NPCAIFindPathByKeyRouteResult
// Size: 0x10 (Inherited: 0x0)
struct FNPCAIFindPathByKeyRouteResult
{
	struct TArray<struct FKeyRoutePointData> Path; // 0x0(0x10)
};

// Object: ScriptStruct MFNPCAI.NPCAIPeekPointResult
// Size: 0x10 (Inherited: 0x0)
struct FNPCAIPeekPointResult
{
	struct FVector PeekPoint; // 0x0(0xC)
	bool bWillExpose; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
};

// Object: ScriptStruct MFNPCAI.ReinforceAllyAISpawn
// Size: 0x10 (Inherited: 0x0)
struct FReinforceAllyAISpawn
{
	int32_t AIID; // 0x0(0x4)
	int32_t EquipId; // 0x4(0x4)
	int32_t CampID; // 0x8(0x4)
	int32_t HeadBarType; // 0xC(0x4)
};

// Object: ScriptStruct MFNPCAI.AIRuntimeMonitorStatInfo
// Size: 0x2C (Inherited: 0x0)
struct FAIRuntimeMonitorStatInfo
{
	float HistoryIncAvg; // 0x0(0x4)
	float HistoryIncMax; // 0x4(0x4)
	int32_t HistoryMaxCallCount; // 0x8(0x4)
	float HistoryAvgCallCount; // 0xC(0x4)
	int32_t TotalIncCount; // 0x10(0x4)
	float TotalIncExeTime; // 0x14(0x4)
	int32_t TotalSavedNum; // 0x18(0x4)
	uint32_t NowFrame32; // 0x1C(0x4)
	int32_t NowFrameCallCount; // 0x20(0x4)
	float NowFrameExeUseTime; // 0x24(0x4)
	float WarningTopCost; // 0x28(0x4)
};

// Object: ScriptStruct MFNPCAI.AISGDoorUsed
// Size: 0x18 (Inherited: 0x0)
struct FAISGDoorUsed
{
	struct AActor* SGDoor; // 0x0(0x8)
	struct ACharacter* AIPawn; // 0x8(0x8)
	float UsedTime; // 0x10(0x4)
	uint8_t WaitPersons; // 0x14(0x1)
	uint8_t Pad_0x15[0x3]; // 0x15(0x3)
};

// Object: ScriptStruct MFNPCAI.NPCAIActivityAIIDModifierTableRow
// Size: 0x40 (Inherited: 0x8)
struct FNPCAIActivityAIIDModifierTableRow : FTableRowBase
{
	uint8_t Pad_0x8[0x8]; // 0x8(0x8)
	int64_t ActivityID; // 0x10(0x8)
	int32_t Priority; // 0x18(0x4)
	int32_t SourceCategory; // 0x1C(0x4)
	int32_t SourceCareer; // 0x20(0x4)
	int32_t SourceTendency; // 0x24(0x4)
	int32_t SourceDifficulty; // 0x28(0x4)
	int32_t TargetCategory; // 0x2C(0x4)
	int32_t TargetCareer; // 0x30(0x4)
	int32_t TargetTendency; // 0x34(0x4)
	int32_t TargetDifficulty; // 0x38(0x4)
	int32_t TargetEquipPoolID; // 0x3C(0x4)
};

// Object: ScriptStruct MFNPCAI.NPCAIAsyncTask
// Size: 0x18 (Inherited: 0x0)
struct FNPCAIAsyncTask
{
	struct AActor* AIPawn; // 0x0(0x8)
	ENPCAIAsyncTaskType Type; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
	struct UNPCAIAsyncTaskBase* AsyncTask; // 0x10(0x8)
};

// Object: ScriptStruct MFNPCAI.AIDataProviderFVectorValue
// Size: 0x40 (Inherited: 0x30)
struct FAIDataProviderFVectorValue : FAIDataProviderTypedValue
{
	struct FVector DefaultValue; // 0x30(0xC)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
};

// Object: ScriptStruct MFNPCAI.AIDoorSingleSafetyPoint
// Size: 0x10 (Inherited: 0x0)
struct FAIDoorSingleSafetyPoint
{
	struct FVector Location; // 0x0(0xC)
	float DangerValue; // 0xC(0x4)
};

// Object: ScriptStruct MFNPCAI.AISafetyOpenDoorResp
// Size: 0x20 (Inherited: 0x0)
struct FAISafetyOpenDoorResp
{
	struct AActor* SGDoor; // 0x0(0x8)
	struct FVector NavLinkPoint; // 0x8(0xC)
	struct FVector SafetyWaitPoint; // 0x14(0xC)
};

// Object: ScriptStruct MFNPCAI.NPCAIProfileCover
// Size: 0x28 (Inherited: 0x0)
struct FNPCAIProfileCover
{
	struct TArray<uint8_t> Ars; // 0x0(0x10)
	uint8_t Pad_0x10[0x8]; // 0x10(0x8)
	struct FString CoverName; // 0x18(0x10)
};

// Object: ScriptStruct MFNPCAI.NPCAIProfileCoverTag
// Size: 0x18 (Inherited: 0x0)
struct FNPCAIProfileCoverTag
{
	struct UNPCAIPropertyProfile* ProfileClass; // 0x0(0x8)
	EAIProfileType ProfileType; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	struct FName VarName; // 0xC(0x8)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct MFNPCAI.AIProtectTreasureBox
// Size: 0x60 (Inherited: 0x0)
struct FAIProtectTreasureBox
{
	struct AActor* BoxInstance; // 0x0(0x8)
	uint8_t Pad_0x8[0x58]; // 0x8(0x58)
};

// Object: ScriptStruct MFNPCAI.AIEnemyInfo
// Size: 0x48 (Inherited: 0x0)
struct FAIEnemyInfo
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	int64_t UniqueID; // 0x8(0x8)
	float FireTime; // 0x10(0x4)
	float FireTimeInterval; // 0x14(0x4)
	struct FVector FireLocation; // 0x18(0xC)
	struct FVector FireDirection; // 0x24(0xC)
	float LastUpdateTime; // 0x30(0x4)
	struct FVector LastUpdateLocation; // 0x34(0xC)
	int32_t PathPointID; // 0x40(0x4)
	uint8_t Pad_0x44[0x4]; // 0x44(0x4)
};

// Object: ScriptStruct MFNPCAI.AIAnalysisReport
// Size: 0x4 (Inherited: 0x0)
struct FAIAnalysisReport
{
	uint8_t Pad_0x0[0x4]; // 0x0(0x4)
};

// Object: ScriptStruct MFNPCAI.AIGlobalCacheActors
// Size: 0x18 (Inherited: 0x0)
struct FAIGlobalCacheActors
{
	float LastTimeSeconds; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct TWeakObjectPtr<struct AActor>> CacheActors; // 0x8(0x10)
};

// Object: ScriptStruct MFNPCAI.MFGraphAStarPolicy
// Size: 0x10 (Inherited: 0x0)
struct FMFGraphAStarPolicy
{
	int32_t NodePoolSize; // 0x0(0x4)
	int32_t OpenSetSize; // 0x4(0x4)
	int32_t MaxPathNodeCount; // 0x8(0x4)
	bool bReuseNodePoolInSubsequentSearches; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
};

// Object: ScriptStruct MFNPCAI.HNavSearchInfo
// Size: 0x60 (Inherited: 0x0)
struct FHNavSearchInfo
{
	uint8_t Pad_0x0[0x60]; // 0x0(0x60)
};

// Object: ScriptStruct MFNPCAI.MetisOptions
// Size: 0x20 (Inherited: 0x0)
struct FMetisOptions
{
	bool bUseDefault; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	EMETIS_OBJTYPE ObjectiveType; // 0x4(0x4)
	EMETIS_CTYPE CoarsenType; // 0x8(0x4)
	EMETIS_IPTYPE InitialPartitioningType; // 0xC(0x4)
	EMETIS_RTYPE RifinementType; // 0x10(0x4)
	int32_t NCuts; // 0x14(0x4)
	int32_t IterateTimes; // 0x18(0x4)
	bool bMinimizeMaximumConnectivity; // 0x1C(0x1)
	bool bNo2Hop; // 0x1D(0x1)
	bool bForcesContiguousPartitions; // 0x1E(0x1)
	uint8_t Pad_0x1F[0x1]; // 0x1F(0x1)
};

// Object: ScriptStruct MFNPCAI.HNavSettings
// Size: 0x3C (Inherited: 0x0)
struct FHNavSettings
{
	bool bAutoBuildAfterNavigationGenerationFinished; // 0x0(0x1)
	bool bBuildIntermediateGraph; // 0x1(0x1)
	bool bRemoveIntermediateGraph; // 0x2(0x1)
	bool bIntraPathOnlyInSelfNode; // 0x3(0x1)
	bool bCombineMultiEdges; // 0x4(0x1)
	bool bEnableEdgeWeight; // 0x5(0x1)
	bool bBreakNavLinkConnection; // 0x6(0x1)
	uint8_t Pad_0x7[0x1]; // 0x7(0x1)
	int32_t MaxGraphLevel; // 0x8(0x4)
	int32_t PartitionSize; // 0xC(0x4)
	int32_t ForceBuildForTopK; // 0x10(0x4)
	int32_t MinNodeCountToBuild; // 0x14(0x4)
	int32_t MaxSearchNode; // 0x18(0x4)
	struct FMetisOptions MetisOptions; // 0x1C(0x20)
};

// Object: ScriptStruct MFNPCAI.HNavGraph
// Size: 0x150 (Inherited: 0x0)
struct FHNavGraph
{
	int32_t Level; // 0x0(0x4)
	int32_t NodeCount; // 0x4(0x4)
	bool bIntermediate; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
	struct TArray<int32_t> ParentIndices; // 0x10(0x10)
	uint8_t Pad_0x20[0x20]; // 0x20(0x20)
	struct TArray<int32_t> ChildIndexOffsets; // 0x40(0x10)
	struct TArray<int32_t> ChildIndices; // 0x50(0x10)
	struct TArray<int32_t> PortalEdgeOffsets; // 0x60(0x10)
	struct TArray<struct FPortalEdge> PortalEdges; // 0x70(0x10)
	struct TArray<int32_t> IntraPathOffsets; // 0x80(0x10)
	struct TArray<struct FIntraPath> IntraPaths; // 0x90(0x10)
	struct TArray<int32_t> IntraPathSourceIndexOffsets; // 0xA0(0x10)
	struct TArray<int32_t> IntraPathSourceIndices; // 0xB0(0x10)
	struct TArray<int32_t> IntraPathTargetIndexOffsets; // 0xC0(0x10)
	uint8_t Pad_0xD0[0x10]; // 0xD0(0x10)
	struct TArray<uint64_t> IntraPathCounts; // 0xE0(0x10)
	struct TArray<int32_t> IntraPathPolyRefOffsets; // 0xF0(0x10)
	struct TArray<uint64_t> IntraPathPolyRefs; // 0x100(0x10)
	struct TArray<float> IntraPathCosts; // 0x110(0x10)
	struct TArray<float> IntraPathLengths; // 0x120(0x10)
	uint8_t Pad_0x130[0x20]; // 0x130(0x20)
};

// Object: ScriptStruct MFNPCAI.IntraPath
// Size: 0x20 (Inherited: 0x0)
struct FIntraPath
{
	uint64_t PackedData; // 0x0(0x8)
	struct TArray<uint64_t> Nodes; // 0x8(0x10)
	float Length; // 0x18(0x4)
	float Cost; // 0x1C(0x4)
};

// Object: ScriptStruct MFNPCAI.PortalEdge
// Size: 0x8 (Inherited: 0x0)
struct FPortalEdge
{
	uint64_t PackedData; // 0x0(0x8)
};

// Object: ScriptStruct MFNPCAI.NPCAIIDModifierTableRow
// Size: 0x10 (Inherited: 0x8)
struct FNPCAIIDModifierTableRow : FTableRowBase
{
	int64_t TargetAIID; // 0x8(0x8)
};

// Object: ScriptStruct MFNPCAI.AIRoundPathFindingNodes
// Size: 0x80 (Inherited: 0x0)
struct FAIRoundPathFindingNodes
{
	float LastTimeCheckUpdate; // 0x0(0x4)
	int32_t CheckUpdateCount; // 0x4(0x4)
	float RoundPathLength; // 0x8(0x4)
	float RadiusReCalcRoundPathNodes; // 0xC(0x4)
	int64_t CurrentPolyId; // 0x10(0x8)
	struct FVector LastLocationCalcRoundPathNodes; // 0x18(0xC)
	uint8_t Pad_0x24[0x5C]; // 0x24(0x5C)
};

// Object: ScriptStruct MFNPCAI.NavPlatformGraphFindResult
// Size: 0x18 (Inherited: 0x0)
struct FNavPlatformGraphFindResult
{
	EMFGraphAStarResult Status; // 0x0(0x1)
	uint8_t Pad_0x1[0x17]; // 0x1(0x17)
};

// Object: ScriptStruct MFNPCAI.NavPlatformGraphAStarFilter
// Size: 0xD8 (Inherited: 0x0)
struct FNavPlatformGraphAStarFilter
{
	struct UNPCAINavPlatformSystem* PlatformSystem; // 0x0(0x8)
	uint8_t Pad_0x8[0xD0]; // 0x8(0xD0)
};

// Object: ScriptStruct MFNPCAI.NavPlatformGraphWrapper
// Size: 0xE0 (Inherited: 0x0)
struct FNavPlatformGraphWrapper
{
	struct FNavPlatformGraphAStarFilter Filter; // 0x0(0xD8)
	struct UNPCAINavPlatformSystem* PlatformSystem; // 0xD8(0x8)
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonBuildStage
// Size: 0x20 (Inherited: 0x0)
struct FNPCAINavSkeletonBuildStage
{
	uint8_t Pad_0x0[0x20]; // 0x0(0x20)
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonAddRegionConnectionStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonAddRegionConnectionStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonBuilder
// Size: 0x4E0 (Inherited: 0x0)
struct FNPCAINavSkeletonBuilder
{
	struct UObject* WorldContextObject; // 0x0(0x8)
	uint8_t Pad_0x8[0xB0]; // 0x8(0xB0)
	struct UWorld* World; // 0xB8(0x8)
	uint8_t Pad_0xC0[0x8]; // 0xC0(0x8)
	struct ARecastNavMesh* MainNavData; // 0xC8(0x8)
	struct ANPCAINavMeshManager* NavMeshManager; // 0xD0(0x8)
	uint8_t Pad_0xD8[0x8]; // 0xD8(0x8)
	struct TArray<struct ANPCAINavLinkProxy*> LinkProxies; // 0xE0(0x10)
	uint8_t Pad_0xF0[0x3F0]; // 0xF0(0x3F0)
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonCalculateCoverageStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonCalculateCoverageStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonCalculateDivergenceStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonCalculateDivergenceStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonCalculateGradientStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonCalculateGradientStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonCalculateSymmetricAttributeStage
// Size: 0x28 (Inherited: 0x20)
struct FNPCAINavSkeletonCalculateSymmetricAttributeStage : FNPCAINavSkeletonBuildStage
{
	uint8_t Pad_0x20[0x8]; // 0x20(0x8)
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonCalculateMovingStage
// Size: 0x28 (Inherited: 0x28)
struct FNPCAINavSkeletonCalculateMovingStage : FNPCAINavSkeletonCalculateSymmetricAttributeStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonCalculateOutdoorsStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonCalculateOutdoorsStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonCalculateProtectionStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonCalculateProtectionStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonCalculateThrowingStage
// Size: 0x28 (Inherited: 0x28)
struct FNPCAINavSkeletonCalculateThrowingStage : FNPCAINavSkeletonCalculateSymmetricAttributeStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonCalculateVisibilityStage
// Size: 0xA8 (Inherited: 0x28)
struct FNPCAINavSkeletonCalculateVisibilityStage : FNPCAINavSkeletonCalculateSymmetricAttributeStage
{
	uint8_t Pad_0x28[0x80]; // 0x28(0x80)
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonCalculateWallDistanceStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonCalculateWallDistanceStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonCheckEdgeOnNavMeshStage
// Size: 0x28 (Inherited: 0x20)
struct FNPCAINavSkeletonCheckEdgeOnNavMeshStage : FNPCAINavSkeletonBuildStage
{
	uint8_t Pad_0x20[0x8]; // 0x20(0x8)
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonCollectConnectionInfoStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonCollectConnectionInfoStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonCollectNeighbourInfoStage
// Size: 0x28 (Inherited: 0x20)
struct FNPCAINavSkeletonCollectNeighbourInfoStage : FNPCAINavSkeletonBuildStage
{
	uint8_t Pad_0x20[0x8]; // 0x20(0x8)
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonFindPathForUnstableSegmentStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonFindPathForUnstableSegmentStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonFindWallsInNeighbourhoodStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonFindWallsInNeighbourhoodStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonGeneratePolylineStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonGeneratePolylineStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonGenerateRawPointStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonGenerateRawPointStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NavSkeletonPathFindingRequest
// Size: 0x1B8 (Inherited: 0x0)
struct FNavSkeletonPathFindingRequest
{
	uint8_t Pad_0x0[0x1B8]; // 0x0(0x1B8)
};

// Object: ScriptStruct MFNPCAI.NavSkeletonPathFindingQueue
// Size: 0x88 (Inherited: 0x0)
struct FNavSkeletonPathFindingQueue
{
	uint8_t Pad_0x0[0x18]; // 0x0(0x18)
	struct TMap<struct TWeakObjectPtr<struct UObject>, struct FNavSkeletonPathFindingRequest> QuerierToRequest; // 0x18(0x50)
	uint8_t Pad_0x68[0x20]; // 0x68(0x20)
};

// Object: ScriptStruct MFNPCAI.NavSkeletonGraphAStarFilter
// Size: 0xC8 (Inherited: 0x0)
struct FNavSkeletonGraphAStarFilter
{
	struct TWeakObjectPtr<struct UObject> WeakOwner; // 0x0(0x8)
	int32_t MaxSearchNodes; // 0x8(0x4)
	float CostLimit; // 0xC(0x4)
	float MaxUnreachablePathCostLimit; // 0x10(0x4)
	float TimeLimit; // 0x14(0x4)
	float RadiusLimit; // 0x18(0x4)
	bool bShouldIncludeStartNodeInPath; // 0x1C(0x1)
	uint8_t Pad_0x1D[0x3]; // 0x1D(0x3)
	struct TSet<int32_t> UnreachablePointIDs; // 0x20(0x50)
	bool bOnTryBestToIncludePointIDs; // 0x70(0x1)
	uint8_t Pad_0x71[0x7]; // 0x71(0x7)
	struct TSet<int32_t> TryBestToIncludePointIDs; // 0x78(0x50)
};

// Object: ScriptStruct MFNPCAI.NavSkeletonGraphCostType
// Size: 0x8 (Inherited: 0x0)
struct FNavSkeletonGraphCostType
{
	float PathCost; // 0x0(0x4)
	float UnreachablePathCost; // 0x4(0x4)
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonInitializePointExtraAttributeStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonInitializePointExtraAttributeStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonLabelNavMeshStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonLabelNavMeshStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonPrunePointStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonPrunePointStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonRemoveIsolatedPointStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonRemoveIsolatedPointStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonRemoveTriangleConnectionStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonRemoveTriangleConnectionStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonSavePointStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonSavePointStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonSetupPointBattleIntensityExpectation
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonSetupPointBattleIntensityExpectation : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonSetupPointBattleVolumeStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonSetupPointBattleVolumeStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonSetupPointKindStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonSetupPointKindStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAINavSkeletonSimplifyPolylineStage
// Size: 0x20 (Inherited: 0x20)
struct FNPCAINavSkeletonSimplifyPolylineStage : FNPCAINavSkeletonBuildStage
{
};

// Object: ScriptStruct MFNPCAI.NavSkeletonMoveSettings
// Size: 0x1 (Inherited: 0x0)
struct FNavSkeletonMoveSettings
{
	bool bWantPathOptimization; // 0x0(0x1)
};

// Object: ScriptStruct MFNPCAI.NavSkeletonPatchedPath
// Size: 0x10 (Inherited: 0x0)
struct FNavSkeletonPatchedPath
{
	struct TArray<struct FNavSkeletonPathPoint> PathPoints; // 0x0(0x10)
};

// Object: ScriptStruct MFNPCAI.NavSkeletonData
// Size: 0x60 (Inherited: 0x0)
struct FNavSkeletonData
{
	struct TArray<struct FNavSkeletonPoint> Points; // 0x0(0x10)
	struct TMap<uint64_t, struct FNavSkeletonPatchedPath> UnstableSegmentPatchPaths; // 0x10(0x50)
};

// Object: ScriptStruct MFNPCAI.NavSkeletonPathPoint
// Size: 0x28 (Inherited: 0x0)
struct FNavSkeletonPathPoint
{
	struct FVector Location; // 0x0(0xC)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	uint64_t NodeRef; // 0x10(0x8)
	uint32_t Flags; // 0x18(0x4)
	uint32_t CustomLinkId; // 0x1C(0x4)
	uint8_t Pad_0x20[0x8]; // 0x20(0x8)
};

// Object: ScriptStruct MFNPCAI.NavSkeletonPoint
// Size: 0xA0 (Inherited: 0x10)
struct FNavSkeletonPoint : FActionPointData
{
	bool Outdoors; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	float Radius; // 0x14(0x4)
	float EffectiveRange; // 0x18(0x4)
	int32_t LinkId; // 0x1C(0x4)
	uint64_t AtPolyRef; // 0x20(0x8)
	struct FVector ProtectionDirection; // 0x28(0xC)
	float ProtectionHalfAngle; // 0x34(0x4)
	int32_t BattleIntensityExpectation; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
	struct TArray<int32_t> NeighbourIndices; // 0x40(0x10)
	struct TArray<float> NeighbourDistances; // 0x50(0x10)
	struct TArray<int32_t> VisibleIndices; // 0x60(0x10)
	struct TArray<int32_t> ThrowableIndices; // 0x70(0x10)
	struct TArray<int32_t> MovableIndices; // 0x80(0x10)
	struct TArray<int32_t> FriendIndices; // 0x90(0x10)
};

// Object: ScriptStruct MFNPCAI.NavSkeletonPolyline
// Size: 0x18 (Inherited: 0x0)
struct FNavSkeletonPolyline
{
	struct TArray<int32_t> PointIDs; // 0x0(0x10)
	float PolylineLength; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct MFNPCAI.NavSkeletonBuildSettings
// Size: 0x8C (Inherited: 0x0)
struct FNavSkeletonBuildSettings
{
	struct FVector NavQueryExtent; // 0x0(0xC)
	float SampleSpacing; // 0xC(0x4)
	float DeltaLength; // 0x10(0x4)
	int32_t GradientNeighbourRadius; // 0x14(0x4)
	float DivergenceFilterThreshold; // 0x18(0x4)
	float DivergenceNeighbourRadius; // 0x1C(0x4)
	float CoarseCoverageNeighbourRadius; // 0x20(0x4)
	float RefinedCoverageNeighbourRadius; // 0x24(0x4)
	float PolylineSimplificationDistanceThreshold; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
	bool bUseNewBuilder; // 0x30(0x1)
	bool bCheckEdgeOnNavMesh; // 0x31(0x1)
	bool bRemoveUnreachablePoints; // 0x32(0x1)
	bool bHintProjection2D; // 0x33(0x1)
	bool bAddRegionConnection; // 0x34(0x1)
	bool bEnableCollapseShortPolylines; // 0x35(0x1)
	bool bEnableParallelFindWallsInNeighbourhood; // 0x36(0x1)
	bool bEnableParallelCalculateWallDistance; // 0x37(0x1)
	bool bEnableParallelGenerateRawPoints; // 0x38(0x1)
	bool bEnableParallelCalculateGradient; // 0x39(0x1)
	bool bEnableParallelCalculateDivergence; // 0x3A(0x1)
	bool bEnableParallelCalculateOutdoors; // 0x3B(0x1)
	bool bEnableParallelPruneSamplePoints; // 0x3C(0x1)
	bool bEnableParallelCalculateProtection; // 0x3D(0x1)
	bool bEnableParallelCalculateVisibility; // 0x3E(0x1)
	bool bEnableParallelCalculateThrowing; // 0x3F(0x1)
	bool bEnableParallelCalculateMoving; // 0x40(0x1)
	bool bEnablePruneSamplePoints; // 0x41(0x1)
	bool bEnableRemoveTooCloseMainPointAtCoverageStage; // 0x42(0x1)
	bool bEnableRefineCoverage; // 0x43(0x1)
	bool bEnablePruneEndBranch; // 0x44(0x1)
	bool bEnableCalculateVisibilityStage; // 0x45(0x1)
	bool bEnableCalculateThrowingStage; // 0x46(0x1)
	ENavSkeletonDivergenceMethod DivergenceMethod; // 0x47(0x1)
	float FindWallInRadius; // 0x48(0x4)
	int32_t MaxWallCount; // 0x4C(0x4)
	float PolylineLengthLowerBound; // 0x50(0x4)
	float RegionConnectionDistanceTolerance; // 0x54(0x4)
	float VisiblityQueryZExtent; // 0x58(0x4)
	float VisiblityTraceZOffset; // 0x5C(0x4)
	float VisiblityMaxRange; // 0x60(0x4)
	float ProtectionTraceAngleStep; // 0x64(0x4)
	float ProtectionTraceZOffset; // 0x68(0x4)
	float ProtectionTraceMaxRange; // 0x6C(0x4)
	float EndpointProtectionLowerBound; // 0x70(0x4)
	float ThrowingInitialSpeed; // 0x74(0x4)
	float ThrowingMaxRange; // 0x78(0x4)
	float MovingMaxRange; // 0x7C(0x4)
	uint8_t Pad_0x80[0x4]; // 0x80(0x4)
	float CheckOutdoorsRadius; // 0x84(0x4)
	float CheckOutdoorsHeight; // 0x88(0x4)
};

// Object: ScriptStruct MFNPCAI.NavSkeletonSamplePoint
// Size: 0x58 (Inherited: 0x0)
struct FNavSkeletonSamplePoint
{
	uint8_t Pad_0x0[0x58]; // 0x0(0x58)
};

// Object: ScriptStruct MFNPCAI.NavSkeletonSamplePolyline
// Size: 0x40 (Inherited: 0x0)
struct FNavSkeletonSamplePolyline
{
	uint8_t Pad_0x0[0x40]; // 0x0(0x40)
};

// Object: ScriptStruct MFNPCAI.NavLinkAcceptanceRadiusEntry
// Size: 0xC (Inherited: 0x0)
struct FNavLinkAcceptanceRadiusEntry
{
	ENavLinkType LinkType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float AdditionAcceptanceRadius; // 0x4(0x4)
	float AdditionAcceptanceRadiusEnd; // 0x8(0x4)
};

// Object: ScriptStruct MFNPCAI.NPCAINavPlatformNavMeshBoundsVolumeData
// Size: 0x30 (Inherited: 0x0)
struct FNPCAINavPlatformNavMeshBoundsVolumeData
{
	struct ANavMeshBoundsVolume* NavMeshBoundsVolume; // 0x0(0x8)
	struct FVector Location; // 0x8(0xC)
	struct FVector Extent; // 0x14(0xC)
	struct FVector NewPlatformLoc; // 0x20(0xC)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct MFNPCAI.NPCAINavPlatformBuildData
// Size: 0x48 (Inherited: 0x0)
struct FNPCAINavPlatformBuildData
{
	struct FNPCAINavPlatformNavMeshBoundsVolumeData NavMeshBoundsVolumeData; // 0x0(0x30)
	struct TArray<struct FNPCAINavPlatformRegion> PlatformRegions; // 0x30(0x10)
	float MaxLinkLineLength; // 0x40(0x4)
	uint8_t Pad_0x44[0x4]; // 0x44(0x4)
};

// Object: ScriptStruct MFNPCAI.NPCAINavPlatformRegion
// Size: 0xA8 (Inherited: 0x0)
struct FNPCAINavPlatformRegion
{
	struct TMap<int32_t, int64_t> LinkLineIDs; // 0x0(0x50)
	struct TSet<int64_t> PolyRefs; // 0x50(0x50)
	int32_t LinkLinesNum; // 0xA0(0x4)
	uint8_t Pad_0xA4[0x4]; // 0xA4(0x4)
};

// Object: ScriptStruct MFNPCAI.NPCAINavPlatformPathInfo
// Size: 0x48 (Inherited: 0x0)
struct FNPCAINavPlatformPathInfo
{
	struct TArray<struct FVector> PathPoints; // 0x0(0x10)
	struct TArray<uint64_t> PathPointPolyRefs; // 0x10(0x10)
	float PathCost; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct TArray<uint64_t> PathCorridor; // 0x28(0x10)
	struct TArray<float> PathCorridorCost; // 0x38(0x10)
};

// Object: ScriptStruct MFNPCAI.NPCAINavPlatformLinkLine
// Size: 0x78 (Inherited: 0x0)
struct FNPCAINavPlatformLinkLine
{
	struct FVector LinkLineStart; // 0x0(0xC)
	struct FVector LinkLineEnd; // 0xC(0xC)
	struct FVector LinkLineDir; // 0x18(0xC)
	float ProjectHeight; // 0x24(0x4)
	struct TMap<int32_t, struct FNPCAINavPlatformPathInfo> PathInfos; // 0x28(0x50)
};

// Object: ScriptStruct MFNPCAI.NPCAINavPlatformBuildConfig
// Size: 0x48 (Inherited: 0x0)
struct FNPCAINavPlatformBuildConfig
{
	struct FVector FirstOffset; // 0x0(0xC)
	struct FVector AdjustOffset; // 0xC(0xC)
	struct FVector WrapBoxExtent; // 0x18(0xC)
	float CeilingHeight; // 0x24(0x4)
	bool AutoBuildLinkLine; // 0x28(0x1)
	uint8_t Pad_0x29[0x3]; // 0x29(0x3)
	float LinkLineLengthDefault; // 0x2C(0x4)
	float LinkPointMinIntervalDefault; // 0x30(0x4)
	float LinkLineProjectHeightDefault; // 0x34(0x4)
	struct TArray<struct AActor*> LinkLineHitIgnoreClassList; // 0x38(0x10)
};

// Object: ScriptStruct MFNPCAI.NPCAINavPlatformBuildTemplate
// Size: 0x10 (Inherited: 0x0)
struct FNPCAINavPlatformBuildTemplate
{
	struct AActor* Platform; // 0x0(0x8)
	int32_t ConfigID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct MFNPCAI.NavCostModifierSharedPointer
// Size: 0x10 (Inherited: 0x0)
struct FNavCostModifierSharedPointer
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct MFNPCAI.NavCostModifier
// Size: 0x58 (Inherited: 0x0)
struct FNavCostModifier
{
	ENPCAIPerceptibleTile Kind; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct TWeakObjectPtr<struct UObject> Instigator; // 0x4(0x8)
	float BeginTime; // 0xC(0x4)
	float endTime; // 0x10(0x4)
	struct FVector Location; // 0x14(0xC)
	struct FBox Boundary; // 0x20(0x1C)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
	struct TArray<uint64_t> AffectedPolyRefs; // 0x40(0x10)
	int32_t LocalNavigationGridId; // 0x50(0x4)
	bool bMoving; // 0x54(0x1)
	uint8_t Pad_0x55[0x3]; // 0x55(0x3)
};

// Object: ScriptStruct MFNPCAI.NavCostDescriptor
// Size: 0x10 (Inherited: 0x0)
struct FNavCostDescriptor
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct MFNPCAI.NPCAINavPathForBP
// Size: 0x18 (Inherited: 0x0)
struct FNPCAINavPathForBP
{
	uint8_t Pad_0x0[0x18]; // 0x0(0x18)
};

// Object: ScriptStruct MFNPCAI.NPCAIMoveRequestCustomDataImpl
// Size: 0x18 (Inherited: 0x0)
struct FNPCAIMoveRequestCustomDataImpl
{
	struct UNavigationQueryFilter* NavFilterClass; // 0x0(0x8)
	float PathExtendLength; // 0x8(0x4)
	float MaxTurnAngleDeg; // 0xC(0x4)
	bool bSafetyDoor; // 0x10(0x1)
	bool bSwing; // 0x11(0x1)
	uint8_t Pad_0x12[0x6]; // 0x12(0x6)
};

// Object: ScriptStruct MFNPCAI.MFNavMeshRegionMap
// Size: 0xA0 (Inherited: 0x0)
struct FMFNavMeshRegionMap
{
	uint8_t Pad_0x0[0xA0]; // 0x0(0xA0)
};

// Object: ScriptStruct MFNPCAI.MFNavMeshRegion
// Size: 0x58 (Inherited: 0x0)
struct FMFNavMeshRegion
{
	uint8_t Pad_0x0[0x58]; // 0x0(0x58)
};

// Object: ScriptStruct MFNPCAI.NavPolyRefArray
// Size: 0x10 (Inherited: 0x0)
struct FNavPolyRefArray
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct MFNPCAI.NavConnectivityInfo
// Size: 0x58 (Inherited: 0x0)
struct FNavConnectivityInfo
{
	uint8_t Pad_0x0[0x58]; // 0x0(0x58)
};

// Object: ScriptStruct MFNPCAI.SoAStorage
// Size: 0x10 (Inherited: 0x0)
struct FSoAStorage
{
	struct TArray<int32_t> Offsets; // 0x0(0x10)
};

// Object: ScriptStruct MFNPCAI.PortalEdgeStorage
// Size: 0x20 (Inherited: 0x10)
struct FPortalEdgeStorage : FSoAStorage
{
	struct TArray<struct FPortalEdge> Items; // 0x10(0x10)
};

// Object: ScriptStruct MFNPCAI.UInt64Storage
// Size: 0x20 (Inherited: 0x10)
struct FUInt64Storage : FSoAStorage
{
	struct TArray<uint64_t> Items; // 0x10(0x10)
};

// Object: ScriptStruct MFNPCAI.Int32Storage
// Size: 0x20 (Inherited: 0x10)
struct FInt32Storage : FSoAStorage
{
	struct TArray<int32_t> Items; // 0x10(0x10)
};

// Object: ScriptStruct MFNPCAI.NavLinkInfo
// Size: 0x1C (Inherited: 0x0)
struct FNavLinkInfo
{
	bool bValid; // 0x0(0x1)
	bool bEnabled; // 0x1(0x1)
	uint8_t Direction; // 0x2(0x1)
	ENavLinkType LinkType; // 0x3(0x1)
	uint32_t LinkId; // 0x4(0x4)
	int32_t LinkIndex; // 0x8(0x4)
	int32_t LeftIndex; // 0xC(0x4)
	int32_t RightIndex; // 0x10(0x4)
	int32_t LeftRegionIndex; // 0x14(0x4)
	int32_t RightRegionIndex; // 0x18(0x4)
};

// Object: ScriptStruct MFNPCAI.CoverPointPathLengthResult
// Size: 0x8 (Inherited: 0x0)
struct FCoverPointPathLengthResult
{
	int32_t PointID; // 0x0(0x4)
	float PathLength; // 0x4(0x4)
};

// Object: ScriptStruct MFNPCAI.AICandidateStandPosition
// Size: 0x10 (Inherited: 0x0)
struct FAICandidateStandPosition
{
	float PathLength; // 0x0(0x4)
	struct FVector Location; // 0x4(0xC)
};

// Object: ScriptStruct MFNPCAI.AIGrassOctreeElement
// Size: 0x30 (Inherited: 0x0)
struct FAIGrassOctreeElement
{
	uint8_t Pad_0x0[0x30]; // 0x0(0x30)
};

// Object: ScriptStruct MFNPCAI.AIGrassOctreeData
// Size: 0x10 (Inherited: 0x0)
struct FAIGrassOctreeData
{
	int32_t GrassBlockIndex; // 0x0(0x4)
	struct FVector Location; // 0x4(0xC)
};

// Object: ScriptStruct MFNPCAI.AINearGrassBounds
// Size: 0x20 (Inherited: 0x0)
struct FAINearGrassBounds
{
	struct FVector Center; // 0x0(0xC)
	float Radius; // 0xC(0x4)
	struct TArray<int32_t> GrassIndexs; // 0x10(0x10)
};

// Object: ScriptStruct MFNPCAI.AIGrassClusterInfo
// Size: 0x30 (Inherited: 0x0)
struct FAIGrassClusterInfo
{
	struct FBox Bounds; // 0x0(0x1C)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	struct TArray<struct FBox> BoxList; // 0x20(0x10)
};

// Object: ScriptStruct MFNPCAI.AIGrassGrayBMP
// Size: 0x50 (Inherited: 0x0)
struct FAIGrassGrayBMP
{
	int32_t BMPWidth; // 0x0(0x4)
	int32_t BMPHeight; // 0x4(0x4)
	struct TArray<struct FColor> Colors; // 0x8(0x10)
	struct FVector2D ZeroPoint; // 0x18(0x8)
	float ScaleValue; // 0x20(0x4)
	int32_t MinLine; // 0x24(0x4)
	int32_t MaxLine; // 0x28(0x4)
	int32_t MinRow; // 0x2C(0x4)
	int32_t MaxRow; // 0x30(0x4)
	struct FBox OriginBoundBox; // 0x34(0x1C)
};

// Object: ScriptStruct MFNPCAI.AILandscapeGrassBlock
// Size: 0x28 (Inherited: 0x0)
struct FAILandscapeGrassBlock
{
	struct FBox Bounds; // 0x0(0x1C)
	struct FVector Location; // 0x1C(0xC)
};

// Object: ScriptStruct MFNPCAI.AIGrassBlock
// Size: 0x58 (Inherited: 0x28)
struct FAIGrassBlock : FAILandscapeGrassBlock
{
	struct FName AIGrassName; // 0x28(0x8)
	uint8_t Density; // 0x30(0x1)
	uint8_t Pad_0x31[0x7]; // 0x31(0x7)
	struct TArray<struct FAIGrassBox> GrassBoxList; // 0x38(0x10)
	struct TArray<struct FAIGrassCylinder> GrassCylinderList; // 0x48(0x10)
};

// Object: ScriptStruct MFNPCAI.AIGrassCylinder
// Size: 0x20 (Inherited: 0x0)
struct FAIGrassCylinder
{
	float ZCenter; // 0x0(0x4)
	float HalfHeight; // 0x4(0x4)
	float Radius; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TArray<uint8_t> PartsDensities; // 0x10(0x10)
};

// Object: ScriptStruct MFNPCAI.AIGrassBox
// Size: 0x1C (Inherited: 0x0)
struct FAIGrassBox
{
	struct FVector Center; // 0x0(0xC)
	struct FVector Extent; // 0xC(0xC)
	float Density; // 0x18(0x4)
};

// Object: ScriptStruct MFNPCAI.AIGrassEditorBlock
// Size: 0x60 (Inherited: 0x58)
struct FAIGrassEditorBlock : FAIGrassBlock
{
	struct UStaticMesh* StaticMesh; // 0x58(0x8)
};

// Object: ScriptStruct MFNPCAI.AIFoliageGrassBlock
// Size: 0x38 (Inherited: 0x0)
struct FAIFoliageGrassBlock
{
	int32_t Index; // 0x0(0x4)
	struct FBox Bounds; // 0x4(0x1C)
	struct FVector Location; // 0x20(0xC)
	float RotatonYaw; // 0x2C(0x4)
	uint8_t Density; // 0x30(0x1)
	uint8_t Pad_0x31[0x3]; // 0x31(0x3)
	float ScaleValue; // 0x34(0x4)
};

// Object: ScriptStruct MFNPCAI.AIGrassMapInfo
// Size: 0x80 (Inherited: 0x0)
struct FAIGrassMapInfo
{
	struct FString MapName; // 0x0(0x10)
	float MapTopX; // 0x10(0x4)
	float MapTopY; // 0x14(0x4)
	float MapSizeX; // 0x18(0x4)
	float MapSizeY; // 0x1C(0x4)
	int32_t MapLandscapeGrassCellCountX; // 0x20(0x4)
	int32_t MapLandscapeGrassCellCountY; // 0x24(0x4)
	float LandscapeGrassCellSize; // 0x28(0x4)
	int32_t MinLandscapeGrassCountInCell; // 0x2C(0x4)
	float MinCellCoverPercent; // 0x30(0x4)
	float MinLandscapeGrassHeight; // 0x34(0x4)
	float LandscapeGrassZGapLimit; // 0x38(0x4)
	float MinGrassHeight; // 0x3C(0x4)
	float AverageDensityLimit; // 0x40(0x4)
	uint8_t Pad_0x44[0x4]; // 0x44(0x4)
	struct FString IgnoreFoliageTags; // 0x48(0x10)
	bool bIsGenerateMeshGrass; // 0x58(0x1)
	uint8_t Pad_0x59[0x7]; // 0x59(0x7)
	struct FString MeshGrassTags; // 0x60(0x10)
	struct FString SaveLevelName; // 0x70(0x10)
};

// Object: ScriptStruct MFNPCAI.AISenseFlashBlock
// Size: 0x44 (Inherited: 0x0)
struct FAISenseFlashBlock
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct FVector StartPos; // 0x8(0xC)
	struct FVector Dir; // 0x14(0xC)
	float FarDim; // 0x20(0x4)
	float NearDim; // 0x24(0x4)
	float ZoneAngle; // 0x28(0x4)
	float FaceAngle; // 0x2C(0x4)
	float SevereDebuffDistance; // 0x30(0x4)
	float ModerateDebuffDistance; // 0x34(0x4)
	float MildDebuffDistance; // 0x38(0x4)
	float Height; // 0x3C(0x4)
	float MaxHeight; // 0x40(0x4)
};

// Object: ScriptStruct MFNPCAI.AIBlockArea
// Size: 0x64 (Inherited: 0x0)
struct FAIBlockArea
{
	int32_t UniqueID; // 0x0(0x4)
	ENPCAIPerceptibleTile TileType; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
	struct FBox BlockBox; // 0x8(0x1C)
	struct FBox EffectiveBox; // 0x24(0x1C)
	struct FVector Center; // 0x40(0xC)
	float Radius; // 0x4C(0x4)
	float Heigh; // 0x50(0x4)
	float startTime; // 0x54(0x4)
	float endTime; // 0x58(0x4)
	float BlockStartTime; // 0x5C(0x4)
	float BlockEndTime; // 0x60(0x4)
};

// Object: ScriptStruct MFNPCAI.NPCAIPortraitToIDTableRow
// Size: 0x38 (Inherited: 0x8)
struct FNPCAIPortraitToIDTableRow : FTableRowBase
{
	struct TSoftClassPtr<struct UAIPortraitBase*> PortraitClass; // 0x8(0x28)
	int64_t AIID; // 0x30(0x8)
};

// Object: ScriptStruct MFNPCAI.AIBodyPartHPDamageLimit
// Size: 0x8 (Inherited: 0x0)
struct FAIBodyPartHPDamageLimit
{
	EAIBodyPartType BodyPart; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float LimitValue; // 0x4(0x4)
};

// Object: ScriptStruct MFNPCAI.AIPerkInfos
// Size: 0x10 (Inherited: 0x0)
struct FAIPerkInfos
{
	struct TArray<int32_t> PerkIDs; // 0x0(0x10)
};

// Object: ScriptStruct MFNPCAI.AIMindGoalEnemyAngleMultiple
// Size: 0xC (Inherited: 0x0)
struct FAIMindGoalEnemyAngleMultiple
{
	float Angle; // 0x0(0x4)
	float ScoreMultiple; // 0x4(0x4)
	float AngleCos; // 0x8(0x4)
};

// Object: ScriptStruct MFNPCAI.AIPropertyNavProfile_Clamp
// Size: 0xC (Inherited: 0x0)
struct FAIPropertyNavProfile_Clamp
{
	float Min; // 0x0(0x4)
	float Max; // 0x4(0x4)
	uint8_t Pad_0x8[0x4]; // 0x8(0x4)
};

// Object: ScriptStruct MFNPCAI.NPCAISceneEventInfo
// Size: 0x40 (Inherited: 0x0)
struct FNPCAISceneEventInfo
{
	int32_t UniqueID; // 0x0(0x4)
	ENPCAISceneEventID EventId; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
	float startTime; // 0x8(0x4)
	float endTime; // 0xC(0x4)
	float ValidScope; // 0x10(0x4)
	struct FVector TriggerLocation; // 0x14(0xC)
	struct TArray<int64_t> AIIDs; // 0x20(0x10)
	struct TArray<int64_t> AIPathGroupIDs; // 0x30(0x10)
};

// Object: ScriptStruct MFNPCAI.NPCAISceneEventTableRow
// Size: 0x48 (Inherited: 0x8)
struct FNPCAISceneEventTableRow : FTableRowBase
{
	ENPCAISceneEventID EventId; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	float ValidTime; // 0xC(0x4)
	float ValidScope; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct TArray<int64_t> AIIDs; // 0x18(0x10)
	struct TArray<int64_t> PathGroupIDs; // 0x28(0x10)
	struct FString Comments; // 0x38(0x10)
};

// Object: ScriptStruct MFNPCAI.NPCAIComingExplosionEvent
// Size: 0x30 (Inherited: 0x0)
struct FNPCAIComingExplosionEvent
{
	uint8_t Pad_0x0[0x4]; // 0x0(0x4)
	struct FVector ExplosionLocation; // 0x4(0xC)
	float Damage; // 0x10(0x4)
	float MaxRange; // 0x14(0x4)
	struct AActor* Instigator; // 0x18(0x8)
	struct FName Tag; // 0x20(0x8)
	uint8_t Pad_0x28[0x8]; // 0x28(0x8)
};

// Object: ScriptStruct MFNPCAI.NPCAIDamageEvent
// Size: 0x38 (Inherited: 0x30)
struct FNPCAIDamageEvent : FAIDamageEvent
{
	struct FName Tag; // 0x30(0x8)
};

// Object: ScriptStruct MFNPCAI.NPCAINoiseEvent
// Size: 0x38 (Inherited: 0x38)
struct FNPCAINoiseEvent : FAINoiseEvent
{
};

// Object: ScriptStruct MFNPCAI.NPCAISteepZoneDeleteStage
// Size: 0x10 (Inherited: 0x0)
struct FNPCAISteepZoneDeleteStage
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct MFNPCAI.NPCAISteepZoneCalculatePointNormalStage
// Size: 0x10 (Inherited: 0x10)
struct FNPCAISteepZoneCalculatePointNormalStage : FNPCAISteepZoneDeleteStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAISteepZoneCalculatePointSteepDensityStage
// Size: 0x10 (Inherited: 0x10)
struct FNPCAISteepZoneCalculatePointSteepDensityStage : FNPCAISteepZoneDeleteStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAISteepZoneCalculatePolyNormalStage
// Size: 0x10 (Inherited: 0x10)
struct FNPCAISteepZoneCalculatePolyNormalStage : FNPCAISteepZoneDeleteStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAISteepZoneCollectNavMeshPolyStage
// Size: 0x10 (Inherited: 0x10)
struct FNPCAISteepZoneCollectNavMeshPolyStage : FNPCAISteepZoneDeleteStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAISteepZoneDeleter
// Size: 0x1D0 (Inherited: 0x0)
struct FNPCAISteepZoneDeleter
{
	struct UObject* WorldContextObject; // 0x0(0x8)
	uint8_t Pad_0x8[0x18]; // 0x8(0x18)
	struct UWorld* World; // 0x20(0x8)
	uint8_t Pad_0x28[0x8]; // 0x28(0x8)
	struct ARecastNavMesh* MainNavData; // 0x30(0x8)
	struct ANPCAINavMeshManager* NavMeshManager; // 0x38(0x8)
	uint8_t Pad_0x40[0x190]; // 0x40(0x190)
};

// Object: ScriptStruct MFNPCAI.NPCAISteepZoneGenerateSamplePointStage
// Size: 0x10 (Inherited: 0x10)
struct FNPCAISteepZoneGenerateSamplePointStage : FNPCAISteepZoneDeleteStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAISteepZoneModifyTileCacheStage
// Size: 0x10 (Inherited: 0x10)
struct FNPCAISteepZoneModifyTileCacheStage : FNPCAISteepZoneDeleteStage
{
};

// Object: ScriptStruct MFNPCAI.NPCAISteepZoneRebuildNavMeshStage
// Size: 0x10 (Inherited: 0x10)
struct FNPCAISteepZoneRebuildNavMeshStage : FNPCAISteepZoneDeleteStage
{
};

// Object: ScriptStruct MFNPCAI.SteepZoneSamplePoint
// Size: 0x50 (Inherited: 0x0)
struct FSteepZoneSamplePoint
{
	uint8_t Pad_0x0[0x50]; // 0x0(0x50)
};

// Object: ScriptStruct MFNPCAI.SteepZoneNavMeshPoly
// Size: 0x48 (Inherited: 0x0)
struct FSteepZoneNavMeshPoly
{
	uint8_t Pad_0x0[0x48]; // 0x0(0x48)
};

// Object: ScriptStruct MFNPCAI.SteepZoneDetailTriangle
// Size: 0x70 (Inherited: 0x0)
struct FSteepZoneDetailTriangle
{
	uint8_t Pad_0x0[0x70]; // 0x0(0x70)
};

// Object: ScriptStruct MFNPCAI.SteepZoneDeleteSettings
// Size: 0x34 (Inherited: 0x0)
struct FSteepZoneDeleteSettings
{
	struct FVector NavQueryExtent; // 0x0(0xC)
	bool bHintProjection2D; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	float SampleSpacing; // 0x10(0x4)
	float TraceRadius; // 0x14(0x4)
	float IncludedAngleTolerance; // 0x18(0x4)
	float WalkableFloorAngle; // 0x1C(0x4)
	float DensityQuerySize; // 0x20(0x4)
	uint8_t Pad_0x24[0x8]; // 0x24(0x8)
	uint8_t TraceChannel; // 0x2C(0x1)
	bool bTraceComplex; // 0x2D(0x1)
	bool bParallelCollectNavMeshPoly; // 0x2E(0x1)
	bool bParallelCalculatePolyNormal; // 0x2F(0x1)
	bool bParallelGenerateSamplePoint; // 0x30(0x1)
	bool bParallelCalculatePointNormal; // 0x31(0x1)
	bool bParallelCalculateSteepDensity; // 0x32(0x1)
	bool bParallelModifyTileCache; // 0x33(0x1)
};

// Object: ScriptStruct MFNPCAI.AIGroupAllyDeathInfo
// Size: 0x1C (Inherited: 0x0)
struct FAIGroupAllyDeathInfo
{
	float DeathTime; // 0x0(0x4)
	struct FVector DeathLocation; // 0x4(0xC)
	struct FVector KillerLocation; // 0x10(0xC)
};

// Object: ScriptStruct MFNPCAI.AITrackLOGTemplateForDataTable
// Size: 0x20 (Inherited: 0x8)
struct FAITrackLOGTemplateForDataTable : FTableRowBase
{
	EAITrackLOGType LogType; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
	struct FString Template; // 0x10(0x10)
};

// Object: ScriptStruct MFNPCAI.AITrackLOG
// Size: 0x18 (Inherited: 0x0)
struct FAITrackLOG
{
	EAITrackLOGType LogType; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	int64_t LOGTime; // 0x8(0x8)
	struct FName LOGKValues; // 0x10(0x8)
};

// Object: ScriptStruct MFNPCAI.AIActorArray
// Size: 0x10 (Inherited: 0x0)
struct FAIActorArray
{
	struct TArray<struct AActor*> ActorArray; // 0x0(0x10)
};

// Object: ScriptStruct MFNPCAI.AICaredVehicleInfo
// Size: 0x20 (Inherited: 0x0)
struct FAICaredVehicleInfo
{
	struct AActor* Vehicle; // 0x0(0x8)
	float LoseControlTime; // 0x8(0x4)
	float ResumeTime; // 0xC(0x4)
	float LastCalcTime; // 0x10(0x4)
	float NoDriverStartTime; // 0x14(0x4)
	float DeltaTime; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct MFNPCAI.AILocationMonitor
// Size: 0x30 (Inherited: 0x0)
struct FAILocationMonitor
{
	struct TWeakObjectPtr<struct APawn> Target; // 0x0(0x8)
	float MonitoringInterval; // 0x8(0x4)
	float MaxTimeAllowOutOfNavmesh; // 0xC(0x4)
	uint8_t Pad_0x10[0x20]; // 0x10(0x20)
};

// Object: ScriptStruct MFNPCAI.AILocationRecord
// Size: 0x14 (Inherited: 0x0)
struct FAILocationRecord
{
	uint8_t Pad_0x0[0x14]; // 0x0(0x14)
};

// Object: ScriptStruct MFNPCAI.AIPathDebugInfo
// Size: 0x18 (Inherited: 0x0)
struct FAIPathDebugInfo
{
	struct TArray<struct FVector> PathPoints; // 0x0(0x10)
	int32_t SegmentStartIndex; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct MFNPCAI.AIDebugLineStruct
// Size: 0x28 (Inherited: 0x0)
struct FAIDebugLineStruct
{
	int32_t ID; // 0x0(0x4)
	struct FVector StartLocation; // 0x4(0xC)
	struct FVector EndLocation; // 0x10(0xC)
	struct FColor Color; // 0x1C(0x4)
	float DurationTime; // 0x20(0x4)
	float endTime; // 0x24(0x4)
};

// Object: ScriptStruct MFNPCAI.AIDebugDrawSphereInfo
// Size: 0x24 (Inherited: 0x0)
struct FAIDebugDrawSphereInfo
{
	struct FVector Loc; // 0x0(0xC)
	float Radius; // 0xC(0x4)
	struct FLinearColor LineColor; // 0x10(0x10)
	float Duration; // 0x20(0x4)
};

// Object: ScriptStruct MFNPCAI.AIDebugDrawLineInfo
// Size: 0x30 (Inherited: 0x0)
struct FAIDebugDrawLineInfo
{
	struct FVector StartLoc; // 0x0(0xC)
	struct FVector EndLoc; // 0xC(0xC)
	struct FLinearColor LineColor; // 0x18(0x10)
	float Duration; // 0x28(0x4)
	float Thickness; // 0x2C(0x4)
};

// Object: ScriptStruct MFNPCAI.AIShotCountStat
// Size: 0x10 (Inherited: 0x0)
struct FAIShotCountStat
{
	int32_t Count; // 0x0(0x4)
	float LastTime; // 0x4(0x4)
	float FirstTime; // 0x8(0x4)
	float IntervalToClear; // 0xC(0x4)
};

// Object: ScriptStruct MFNPCAI.PMCAISpawnInfo_ForSearchPath
// Size: 0x10 (Inherited: 0x0)
struct FPMCAISpawnInfo_ForSearchPath
{
	struct AActor* SourcePoint; // 0x0(0x8)
	float TotalCost; // 0x8(0x4)
	bool Checked; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
};

// Object: ScriptStruct MFNPCAI.CheckCoverPointFinder
// Size: 0x28 (Inherited: 0x0)
struct FCheckCoverPointFinder
{
	struct AActor* AIPawn; // 0x0(0x8)
	float CheckPathLength; // 0x8(0x4)
	int32_t IndexFind; // 0xC(0x4)
	float LastTimestamp; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct TArray<struct FCoverPointOctreeElement> Elements; // 0x18(0x10)
};

// Object: ScriptStruct MFNPCAI.AIBackUpCoverPointFinder
// Size: 0x1C (Inherited: 0x0)
struct FAIBackUpCoverPointFinder
{
	struct FVector AIPosistion; // 0x0(0xC)
	struct FVector EnemyPosition; // 0xC(0xC)
	float LastTime; // 0x18(0x4)
};

// Object: ScriptStruct MFNPCAI.AICoverPointInfo
// Size: 0x48 (Inherited: 0x0)
struct FAICoverPointInfo
{
	int32_t ID; // 0x0(0x4)
	bool IsFree; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
	struct AActor* OwnerActor; // 0x8(0x8)
	struct FVector Location; // 0x10(0xC)
	struct FVector ToWallVector; // 0x1C(0xC)
	EAIPose ProtectedStance; // 0x28(0x1)
	bool IsSafe; // 0x29(0x1)
	uint8_t Pad_0x2A[0x2]; // 0x2A(0x2)
	float LastSpottedTime; // 0x2C(0x4)
	struct FVector FirePosition; // 0x30(0xC)
	EAIPose FireStance; // 0x3C(0x1)
	EAILeanType TiltType; // 0x3D(0x1)
	uint8_t Pad_0x3E[0x2]; // 0x3E(0x2)
	float BaseWeight; // 0x40(0x4)
	uint8_t Pad_0x44[0x4]; // 0x44(0x4)
};

// Object: ScriptStruct MFNPCAI.AICharacterConfig
// Size: 0x8 (Inherited: 0x0)
struct FAICharacterConfig
{
	float FireInterval; // 0x0(0x4)
	float PerBurstReduce; // 0x4(0x4)
};

// Object: ScriptStruct MFNPCAI.AIIDSegInfoData
// Size: 0x10 (Inherited: 0x0)
struct FAIIDSegInfoData
{
	int64_t Div; // 0x0(0x8)
	int64_t Mod; // 0x8(0x8)
};

// Object: ScriptStruct MFNPCAI.AIIDSegInfo
// Size: 0x40 (Inherited: 0x0)
struct FAIIDSegInfo
{
	struct FAIIDSegInfoData MainCategory; // 0x0(0x10)
	struct FAIIDSegInfoData Career; // 0x10(0x10)
	struct FAIIDSegInfoData Tendency; // 0x20(0x10)
	struct FAIIDSegInfoData Difficulty; // 0x30(0x10)
};

// Object: ScriptStruct MFNPCAI.AIStackGunRecord
// Size: 0x44 (Inherited: 0x0)
struct FAIStackGunRecord
{
	bool CanStackGun; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct FVector MyPosition; // 0x4(0xC)
	struct FVector EnemyPosition; // 0x10(0xC)
	EAILeanType AILean; // 0x1C(0x1)
	EAIPose AIPose; // 0x1D(0x1)
	uint8_t Pad_0x1E[0x2]; // 0x1E(0x2)
	struct FVector GunPoint; // 0x20(0xC)
	struct FVector EeyPoint; // 0x2C(0xC)
	struct FVector ShootPoint; // 0x38(0xC)
};

// Object: ScriptStruct MFNPCAI.NPCAIRollDecisionStruct
// Size: 0x18 (Inherited: 0x8)
struct FNPCAIRollDecisionStruct : FTableRowBase
{
	ENPCAIDecision Decision; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	float BaseTendency; // 0xC(0x4)
	float BasePerceive; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct MFNPCAI.NPCAIFireSetting
// Size: 0x40 (Inherited: 0x0)
struct FNPCAIFireSetting
{
	struct FVector Location; // 0x0(0xC)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct AActor* EnemyTarget; // 0x10(0x8)
	bool bCalcSight; // 0x18(0x1)
	bool bCalcShoot; // 0x19(0x1)
	uint8_t Pad_0x1A[0x2]; // 0x1A(0x2)
	float FireInterval; // 0x1C(0x4)
	bool bIgnoreAimingTime; // 0x20(0x1)
	bool bEnabledHitRateControl; // 0x21(0x1)
	bool bEnabledRecoilControl; // 0x22(0x1)
	EAIBodyPartType ShootPartID; // 0x23(0x1)
	EAIBodyPartType LastShootPartID; // 0x24(0x1)
	EAIBodyPartType RealHitPartID; // 0x25(0x1)
	bool bPressureAim; // 0x26(0x1)
	uint8_t Pad_0x27[0x1]; // 0x27(0x1)
	float WaitEndtime; // 0x28(0x4)
	struct FVector LastFireLocation; // 0x2C(0xC)
	struct UNPCAITargetInfo* EnemyInfo; // 0x38(0x8)
};

// Object: ScriptStruct MFNPCAI.NPCAIFireOrder
// Size: 0x18 (Inherited: 0x0)
struct FNPCAIFireOrder
{
	bool bValidOrder; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct FVector FirePoint; // 0x4(0xC)
	EAIBodyPartType HitPart; // 0x10(0x1)
	bool IsUsingPredestined; // 0x11(0x1)
	bool IsHit; // 0x12(0x1)
	bool bShotLimited; // 0x13(0x1)
	bool bFakeShot; // 0x14(0x1)
	uint8_t Pad_0x15[0x3]; // 0x15(0x3)
};

// Object: ScriptStruct MFNPCAI.AIBodyPartVisibilityInfo
// Size: 0x14 (Inherited: 0x0)
struct FAIBodyPartVisibilityInfo
{
	EAIBodyPartType BodyPartType; // 0x0(0x1)
	bool bIsVisible; // 0x1(0x1)
	bool bCanShoot; // 0x2(0x1)
	uint8_t Pad_0x3[0x1]; // 0x3(0x1)
	float LastCanSeeTime; // 0x4(0x4)
	int32_t GrassWeight; // 0x8(0x4)
	int32_t ShootCalculateCount; // 0xC(0x4)
	ENPCAISenseBarrier Barrier; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
};

// Object: ScriptStruct MFNPCAI.AIBodyPartHitInfo
// Size: 0x14 (Inherited: 0x0)
struct FAIBodyPartHitInfo
{
	EAIBodyPartType BodyPartType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float HitDurationStartTime; // 0x4(0x4)
	float HitDurationValues; // 0x8(0x4)
	float FirstHitTime; // 0xC(0x4)
	float LastHitTime; // 0x10(0x4)
};

// Object: ScriptStruct MFNPCAI.AIBodyBulkAimingChoice
// Size: 0x18 (Inherited: 0x0)
struct FAIBodyBulkAimingChoice
{
	EAIBodyBulkType BodyBulk; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float Weight; // 0x4(0x4)
	struct TArray<struct FAIBodyPartAimingChoice> BodyParts; // 0x8(0x10)
};

// Object: ScriptStruct MFNPCAI.AIBodyPartAimingChoice
// Size: 0x8 (Inherited: 0x0)
struct FAIBodyPartAimingChoice
{
	EAIBodyPartType BodyPart; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float Weight; // 0x4(0x4)
};

// Object: ScriptStruct MFNPCAI.AINoiseMakerInfo
// Size: 0x10 (Inherited: 0x0)
struct FAINoiseMakerInfo
{
	float lasttime_footstep; // 0x0(0x4)
	float lasttime_gunfire; // 0x4(0x4)
	float lasttime_bulletfire; // 0x8(0x4)
	float lasttime_bullethit; // 0xC(0x4)
};

// Object: ScriptStruct MFNPCAI.AIVisibleResult
// Size: 0xC (Inherited: 0x0)
struct FAIVisibleResult
{
	bool IsVisible; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t BlockWeight; // 0x4(0x4)
	ENPCAISenseBarrier Barrier; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
};

// Object: ScriptStruct MFNPCAI.AISenseDrone
// Size: 0x20 (Inherited: 0x0)
struct FAISenseDrone
{
	int64_t DroneItemID; // 0x0(0x8)
	float VisionRadius180; // 0x8(0x4)
	float Angle; // 0xC(0x4)
	float VisionRadius; // 0x10(0x4)
	float HearRadius; // 0x14(0x4)
	bool CanHearNoMove; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
	float AngleCos; // 0x1C(0x4)
};

// Object: ScriptStruct MFNPCAI.AISenseSightNormal
// Size: 0x18 (Inherited: 0x0)
struct FAISenseSightNormal
{
	float Angle; // 0x0(0x4)
	float VisionRadius; // 0x4(0x4)
	float LostVisionRadius; // 0x8(0x4)
	float AngleCos; // 0xC(0x4)
	float VisionRadiusSqr; // 0x10(0x4)
	float LostVisionRadiusSqr; // 0x14(0x4)
};

// Object: ScriptStruct MFNPCAI.NPCAIWeaponConfigTableRow
// Size: 0x8 (Inherited: 0x8)
struct FNPCAIWeaponConfigTableRow : FTableRowBase
{
};

// Object: ScriptStruct MFNPCAI.AIAreaWeightQueryInfo
// Size: 0x14 (Inherited: 0x0)
struct FAIAreaWeightQueryInfo
{
	struct FVector Loc; // 0x0(0xC)
	float Weight; // 0xC(0x4)
	bool bIsValid; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
};

// Object: Class MFNPCAI.AIRuntimeMonitor
// Size: 0x88 (Inherited: 0x28)
struct UAIRuntimeMonitor : UObject
{
	DEFINE_UE_CLASS_HELPERS(UAIRuntimeMonitor, "AIRuntimeMonitor")

	struct TMap<struct FString, struct FAIRuntimeMonitorStatInfo> StatMap; // 0x28(0x50)
	uint8_t Pad_0x78[0x10]; // 0x78(0x10)
};

// Object: Class MFNPCAI.AISceneEventMessage
// Size: 0x68 (Inherited: 0x28)
struct UAISceneEventMessage : UObject
{
	DEFINE_UE_CLASS_HELPERS(UAISceneEventMessage, "AISceneEventMessage")

	float ValidTime; // 0x28(0x4)
	float ValidScope; // 0x2C(0x4)
	struct TArray<struct FString> Tags; // 0x30(0x10)
	struct TArray<struct UObject*> ObjectParams; // 0x40(0x10)
	int32_t EvtUniqueId; // 0x50(0x4)
	float startTime; // 0x54(0x4)
	float endTime; // 0x58(0x4)
	struct FVector TriggerLocation; // 0x5C(0xC)

	// Object: Function MFNPCAI.AISceneEventMessage.IsExpired
	// Flags: [Final|Native|Public]
	// Offset: 0x3c4ca68
	// Params: [ Num(2) Size(0x5) ]
	bool IsExpired(float CurrentTimeSec);
};

// Object: Class MFNPCAI.AISceneEvent_SpawnAI
// Size: 0x70 (Inherited: 0x68)
struct UAISceneEvent_SpawnAI : UAISceneEventMessage
{
	DEFINE_UE_CLASS_HELPERS(UAISceneEvent_SpawnAI, "AISceneEvent_SpawnAI")

	EAISpawnSceneEvtType SpawnSceneEvtType; // 0x68(0x1)
	uint8_t Pad_0x69[0x7]; // 0x69(0x7)
};

// Object: Class MFNPCAI.AISceneEventsTriggerManager
// Size: 0x38 (Inherited: 0x28)
struct UAISceneEventsTriggerManager : UObject
{
	DEFINE_UE_CLASS_HELPERS(UAISceneEventsTriggerManager, "AISceneEventsTriggerManager")

	struct TArray<struct UAISceneEventMessage*> SceneEventsList; // 0x28(0x10)

	// Object: Function MFNPCAI.AISceneEventsTriggerManager.TriggerSceneEvent
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c4cfb4
	// Params: [ Num(4) Size(0x1C) ]
	int32_t TriggerSceneEvent(struct UAISceneEventMessage* SceneEvtMessage, const struct FVector& TriggerLocation, float CoverInRange);

	// Object: Function MFNPCAI.AISceneEventsTriggerManager.RemoveSceneEventByUniqueId
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0x3c4cd9c
	// Params: [ Num(1) Size(0x4) ]
	void RemoveSceneEventByUniqueId(int32_t EvtUniqueId);

	// Object: Function MFNPCAI.AISceneEventsTriggerManager.RemoveSceneEvent
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0x3c4ce4c
	// Params: [ Num(1) Size(0x8) ]
	void RemoveSceneEvent(struct UAISceneEventMessage* SceneEvtMessage);

	// Object: Function MFNPCAI.AISceneEventsTriggerManager.OnDSTick
	// Flags: [Native|Public]
	// Offset: 0x3c4d0fc
	// Params: [ Num(0) Size(0x0) ]
	void OnDSTick();

	// Object: Function MFNPCAI.AISceneEventsTriggerManager.GetSceneEventByUniqueId
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0x3c4cefc
	// Params: [ Num(2) Size(0x10) ]
	struct UAISceneEventMessage* GetSceneEventByUniqueId(int32_t EvtUniqueId);

	// Object: Function MFNPCAI.AISceneEventsTriggerManager.FindNearSceneEvents
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c4cbec
	// Params: [ Num(4) Size(0x21) ]
	bool FindNearSceneEvents(struct TArray<struct UAISceneEventMessage*> ActivedEvents, const struct FVector& CenterPos, float Radius);

	// Object: Function MFNPCAI.AISceneEventsTriggerManager.FilterExpiredSceneEvents
	// Flags: [Final|Native|Public]
	// Offset: 0x3c4cbd8
	// Params: [ Num(0) Size(0x0) ]
	void FilterExpiredSceneEvents();

	// Object: Function MFNPCAI.AISceneEventsTriggerManager.ClearExpiredSceneEventOnAI
	// Flags: [Final|Native|Public]
	// Offset: 0x3c4cb30
	// Params: [ Num(1) Size(0x4) ]
	void ClearExpiredSceneEventOnAI(int32_t EvtUniqueId);
};

// Object: Class MFNPCAI.AISGDoorManager
// Size: 0x50 (Inherited: 0x28)
struct UAISGDoorManager : UObject
{
	DEFINE_UE_CLASS_HELPERS(UAISGDoorManager, "AISGDoorManager")

	struct TArray<struct FAISGDoorUsed> AISGDoorUsedList; // 0x28(0x10)
	struct TArray<struct TWeakObjectPtr<struct AActor>> DoorsInWorld; // 0x38(0x10)
	float TimeFindDoorsInWorld; // 0x48(0x4)
	uint8_t Pad_0x4C[0x4]; // 0x4C(0x4)

	// Object: Function MFNPCAI.AISGDoorManager.WantToWaitUsed
	// Flags: [Final|Native|Public]
	// Offset: 0x3c4d2e0
	// Params: [ Num(2) Size(0x10) ]
	void WantToWaitUsed(struct ACharacter* AIPawn, struct AActor* SGDoor);

	// Object: Function MFNPCAI.AISGDoorManager.WantToUsedDoor
	// Flags: [Final|Native|Public]
	// Offset: 0x3c4d46c
	// Params: [ Num(3) Size(0x11) ]
	bool WantToUsedDoor(struct ACharacter* AIPawn, struct AActor* SGDoor);

	// Object: Function MFNPCAI.AISGDoorManager.ReleaseUsedDoor
	// Flags: [Final|Native|Public]
	// Offset: 0x3c4d3c4
	// Params: [ Num(1) Size(0x8) ]
	void ReleaseUsedDoor(struct ACharacter* AIPawn);

	// Object: Function MFNPCAI.AISGDoorManager.InitDoorsInWorld
	// Flags: [Final|Native|Private]
	// Offset: 0x3c4d12c
	// Params: [ Num(1) Size(0x8) ]
	void InitDoorsInWorld(struct UObject* WorldContext);

	// Object: Function MFNPCAI.AISGDoorManager.GetPawnUsedDoor
	// Flags: [Final|Native|Public]
	// Offset: 0x3c4d55c
	// Params: [ Num(2) Size(0x10) ]
	struct AActor* GetPawnUsedDoor(struct AActor* SGDoor);

	// Object: Function MFNPCAI.AISGDoorManager.GetDoor
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0x3c4d1d4
	// Params: [ Num(3) Size(0x20) ]
	struct AActor* GetDoor(struct UObject* WorldContext, const struct FVector& DoorPoint);

	// Object: Function MFNPCAI.AISGDoorManager.DoorIsBusy
	// Flags: [Final|Native|Public]
	// Offset: 0x3c4d60c
	// Params: [ Num(3) Size(0x11) ]
	bool DoorIsBusy(struct AActor* SGDoor, struct ACharacter* AIPawn);

	// Object: Function MFNPCAI.AISGDoorManager.AutoRemoveInValidUsed
	// Flags: [Final|Native|Public]
	// Offset: 0x3c4d2cc
	// Params: [ Num(0) Size(0x0) ]
	void AutoRemoveInValidUsed();
};

// Object: Class MFNPCAI.BehaviorTreeTooler
// Size: 0x28 (Inherited: 0x28)
struct UBehaviorTreeTooler : UBlueprintFunctionLibrary
{
	DEFINE_UE_CLASS_HELPERS(UBehaviorTreeTooler, "BehaviorTreeTooler")

	// Object: Function MFNPCAI.BehaviorTreeTooler.GetGameState
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c4d71c
	// Params: [ Num(2) Size(0x10) ]
	static struct AGameState* GetGameState(struct UObject* World);

	// Object: Function MFNPCAI.BehaviorTreeTooler.GetClientWorld
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c4d7c4
	// Params: [ Num(2) Size(0x10) ]
	static struct UWorld* GetClientWorld(struct UObject* WorldContext);
};

// Object: Class MFNPCAI.NavLinkProxyGenerator
// Size: 0x360 (Inherited: 0x300)
struct ANavLinkProxyGenerator : AInfo
{
	DEFINE_UE_CLASS_HELPERS(ANavLinkProxyGenerator, "NavLinkProxyGenerator")

	struct TSet<int32_t> EnabledMapIDs; // 0x300(0x50)
	struct UNavigationSystemV1* CachedNavSys; // 0x350(0x8)
	struct ARecastNavMesh* CachedNavMeshData; // 0x358(0x8)
};

// Object: Class MFNPCAI.NPCAIActorComponent
// Size: 0xF0 (Inherited: 0xE0)
struct UNPCAIActorComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIActorComponent, "NPCAIActorComponent")

	struct TArray<struct UNPCAIProfileBaseComponent*> PropertyComponents; // 0xE0(0x10)

	// Object: Function MFNPCAI.NPCAIActorComponent.GetAIPropertyByClass
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c4d880
	// Params: [ Num(2) Size(0x10) ]
	struct UNPCAIProfileBaseComponent* GetAIPropertyByClass(struct UNPCAIProfileBaseComponent* InPropertyClass);
};

// Object: Class MFNPCAI.NPCAIAimingInterface
// Size: 0x28 (Inherited: 0x28)
struct INPCAIAimingInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(INPCAIAimingInterface, "NPCAIAimingInterface")

	// Object: Function MFNPCAI.NPCAIAimingInterface.UpdatePredestinedHit
	// Flags: [Native|Public]
	// Offset: 0x3c4dfcc
	// Params: [ Num(0) Size(0x0) ]
	void UpdatePredestinedHit();

	// Object: Function MFNPCAI.NPCAIAimingInterface.TriggerPressedDone
	// Flags: [Native|Public]
	// Offset: 0x3c4e004
	// Params: [ Num(1) Size(0x4) ]
	void TriggerPressedDone(float WeaponRecoilParam);

	// Object: Function MFNPCAI.NPCAIAimingInterface.SetTargetEnemy
	// Flags: [Native|Public]
	// Offset: 0x3c4e2d4
	// Params: [ Num(1) Size(0x8) ]
	void SetTargetEnemy(struct AActor* InEnemyPawn);

	// Object: Function MFNPCAI.NPCAIAimingInterface.SetShootPartID
	// Flags: [Native|Public]
	// Offset: 0x3c4dbc4
	// Params: [ Num(1) Size(0x1) ]
	void SetShootPartID(uint8_t InShootPartID);

	// Object: Function MFNPCAI.NPCAIAimingInterface.SetNextAimingDelay
	// Flags: [Native|Public]
	// Offset: 0x3c4e130
	// Params: [ Num(1) Size(0x4) ]
	void SetNextAimingDelay(float DelayTime);

	// Object: Function MFNPCAI.NPCAIAimingInterface.SetAimingPoint
	// Flags: [Native|Public|HasOutParms|HasDefaults]
	// Offset: 0x3c4e1e0
	// Params: [ Num(1) Size(0xC) ]
	void SetAimingPoint(const struct FVector& InAimingPoint);

	// Object: Function MFNPCAI.NPCAIAimingInterface.NodeUpdate
	// Flags: [Native|Public]
	// Offset: 0x3c4dfe8
	// Params: [ Num(0) Size(0x0) ]
	void NodeUpdate();

	// Object: Function MFNPCAI.NPCAIAimingInterface.NextShotMiss
	// Flags: [Native|Public]
	// Offset: 0x3c4dec0
	// Params: [ Num(0) Size(0x0) ]
	void NextShotMiss();

	// Object: Function MFNPCAI.NPCAIAimingInterface.NextShotHit
	// Flags: [Native|Public]
	// Offset: 0x3c4de48
	// Params: [ Num(0) Size(0x0) ]
	void NextShotHit();

	// Object: Function MFNPCAI.NPCAIAimingInterface.LoseTarget
	// Flags: [Native|Public]
	// Offset: 0x3c4e384
	// Params: [ Num(0) Size(0x0) ]
	void LoseTarget();

	// Object: Function MFNPCAI.NPCAIAimingInterface.IsWaitingStartAiming
	// Flags: [Native|Public]
	// Offset: 0x3c4e0b4
	// Params: [ Num(1) Size(0x1) ]
	bool IsWaitingStartAiming();

	// Object: Function MFNPCAI.NPCAIAimingInterface.IsUsingPredestined
	// Flags: [Native|Public|Const]
	// Offset: 0x3c4ddd0
	// Params: [ Num(1) Size(0x1) ]
	bool IsUsingPredestined();

	// Object: Function MFNPCAI.NPCAIAimingInterface.IsReady
	// Flags: [Native|Public]
	// Offset: 0x3c4e598
	// Params: [ Num(1) Size(0x1) ]
	bool IsReady();

	// Object: Function MFNPCAI.NPCAIAimingInterface.IsNextShotMiss
	// Flags: [Native|Public|Const]
	// Offset: 0x3c4dedc
	// Params: [ Num(1) Size(0x1) ]
	bool IsNextShotMiss();

	// Object: Function MFNPCAI.NPCAIAimingInterface.IsNextShotHit
	// Flags: [Native|Public|Const]
	// Offset: 0x3c4de64
	// Params: [ Num(1) Size(0x1) ]
	bool IsNextShotHit();

	// Object: Function MFNPCAI.NPCAIAimingInterface.IsInPullBolt
	// Flags: [Native|Public]
	// Offset: 0x3c4dcb4
	// Params: [ Num(1) Size(0x1) ]
	bool IsInPullBolt();

	// Object: Function MFNPCAI.NPCAIAimingInterface.IsFacingTargetPoint
	// Flags: [Native|Public|HasOutParms|HasDefaults]
	// Offset: 0x3c4da04
	// Params: [ Num(3) Size(0x11) ]
	bool IsFacingTargetPoint(const struct FVector& TargetPoint, float AngleLimit);

	// Object: Function MFNPCAI.NPCAIAimingInterface.HasAmmo
	// Flags: [Native|Public]
	// Offset: 0x3c4dc74
	// Params: [ Num(1) Size(0x1) ]
	bool HasAmmo();

	// Object: Function MFNPCAI.NPCAIAimingInterface.GetTargetEnemy
	// Flags: [Native|Public]
	// Offset: 0x3c4e298
	// Params: [ Num(1) Size(0x8) ]
	struct AActor* GetTargetEnemy();

	// Object: Function MFNPCAI.NPCAIAimingInterface.GetShootPartID
	// Flags: [Native|Public]
	// Offset: 0x3c4db88
	// Params: [ Num(1) Size(0x1) ]
	uint8_t GetShootPartID();

	// Object: Function MFNPCAI.NPCAIAimingInterface.GetMaxShotCount
	// Flags: [Native|Public|Const]
	// Offset: 0x3c4db10
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetMaxShotCount();

	// Object: Function MFNPCAI.NPCAIAimingInterface.GetLastDist2Target
	// Flags: [Native|Public]
	// Offset: 0x3c4e3a0
	// Params: [ Num(1) Size(0x4) ]
	float GetLastDist2Target();

	// Object: Function MFNPCAI.NPCAIAimingInterface.GetHit
	// Flags: [Native|Public]
	// Offset: 0x3c4df1c
	// Params: [ Num(1) Size(0x4) ]
	void GetHit(int32_t DamageInfo);

	// Object: Function MFNPCAI.NPCAIAimingInterface.GetDimAimingPoint
	// Flags: [Native|Public|HasDefaults]
	// Offset: 0x3c4e3dc
	// Params: [ Num(2) Size(0x10) ]
	struct FVector GetDimAimingPoint(float Scaler);

	// Object: Function MFNPCAI.NPCAIAimingInterface.GetCurrentShotCount
	// Flags: [Native|Public|Const]
	// Offset: 0x3c4db4c
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetCurrentShotCount();

	// Object: Function MFNPCAI.NPCAIAimingInterface.GetAimingPoint
	// Flags: [Native|Public|HasDefaults]
	// Offset: 0x3c4e554
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetAimingPoint();

	// Object: Function MFNPCAI.NPCAIAimingInterface.GetAimingOffset
	// Flags: [Native|Public|HasDefaults]
	// Offset: 0x3c4e498
	// Params: [ Num(2) Size(0x10) ]
	struct FVector GetAimingOffset(float WeakenTime);

	// Object: Function MFNPCAI.NPCAIAimingInterface.GetAimingLeftTime
	// Flags: [Native|Public]
	// Offset: 0x3c4e0f4
	// Params: [ Num(1) Size(0x4) ]
	float GetAimingLeftTime();

	// Object: Function MFNPCAI.NPCAIAimingInterface.ForceCompleteAim
	// Flags: [Native|Public]
	// Offset: 0x3c4dcf4
	// Params: [ Num(0) Size(0x0) ]
	void ForceCompleteAim();

	// Object: Function MFNPCAI.NPCAIAimingInterface.ClearNextShotMiss
	// Flags: [Native|Public]
	// Offset: 0x3c4dea4
	// Params: [ Num(0) Size(0x0) ]
	void ClearNextShotMiss();

	// Object: Function MFNPCAI.NPCAIAimingInterface.ClearNextShotHit
	// Flags: [Native|Public]
	// Offset: 0x3c4de2c
	// Params: [ Num(0) Size(0x0) ]
	void ClearNextShotHit();

	// Object: Function MFNPCAI.NPCAIAimingInterface.ClearNextShotFlags
	// Flags: [Native|Public]
	// Offset: 0x3c4de10
	// Params: [ Num(0) Size(0x0) ]
	void ClearNextShotFlags();

	// Object: Function MFNPCAI.NPCAIAimingInterface.CalculateRequiredAimingTime
	// Flags: [Native|Public|HasOutParms|HasDefaults]
	// Offset: 0x3c4dd10
	// Params: [ Num(2) Size(0x10) ]
	float CalculateRequiredAimingTime(const struct FVector& AimingPos);
};

// Object: Class MFNPCAI.NPCAIAllyControllerCompoentInterface
// Size: 0x28 (Inherited: 0x28)
struct INPCAIAllyControllerCompoentInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(INPCAIAllyControllerCompoentInterface, "NPCAIAllyControllerCompoentInterface")
};

// Object: Class MFNPCAI.NPCAIAntiCamperComponent
// Size: 0xE0 (Inherited: 0xE0)
struct UNPCAIAntiCamperComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIAntiCamperComponent, "NPCAIAntiCamperComponent")
};

// Object: Class MFNPCAI.NPCAIAreaVolumeInterface
// Size: 0x28 (Inherited: 0x28)
struct INPCAIAreaVolumeInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(INPCAIAreaVolumeInterface, "NPCAIAreaVolumeInterface")
};

// Object: Class MFNPCAI.NPCAIAsyncTaskBase
// Size: 0x40 (Inherited: 0x30)
struct UNPCAIAsyncTaskBase : UBlueprintAsyncActionBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIAsyncTaskBase, "NPCAIAsyncTaskBase")

	bool bSimpleTodo; // 0x30(0x1)
	uint8_t Pad_0x31[0x7]; // 0x31(0x7)
	struct AActor* AIPawn; // 0x38(0x8)
};

// Object: Class MFNPCAI.SGBaseAISubsystem
// Size: 0x30 (Inherited: 0x30)
struct USGBaseAISubsystem : UWorldSubsystem
{
	DEFINE_UE_CLASS_HELPERS(USGBaseAISubsystem, "SGBaseAISubsystem")
};

// Object: Class MFNPCAI.NPCAIAsyncTaskSystem
// Size: 0x40 (Inherited: 0x30)
struct UNPCAIAsyncTaskSystem : USGBaseAISubsystem
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIAsyncTaskSystem, "NPCAIAsyncTaskSystem")

	struct TArray<struct FNPCAIAsyncTask> AsyncTasks; // 0x30(0x10)

	// Object: Function MFNPCAI.NPCAIAsyncTaskSystem.OnDSTick
	// Flags: [Final|Native|Public]
	// Offset: 0x3c4e8dc
	// Params: [ Num(0) Size(0x0) ]
	void OnDSTick();

	// Object: Function MFNPCAI.NPCAIAsyncTaskSystem.HasTask
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x3c4e7dc
	// Params: [ Num(3) Size(0xA) ]
	bool HasTask(struct AActor* AIPawn, const ENPCAIAsyncTaskType& InType);

	// Object: Function MFNPCAI.NPCAIAsyncTaskSystem.GetTask
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x3c4e6e0
	// Params: [ Num(3) Size(0x18) ]
	struct UNPCAIAsyncTaskBase* GetTask(struct AActor* AIPawn, const ENPCAIAsyncTaskType& InType);
};

// Object: Class MFNPCAI.NPCAIAttentionPoint
// Size: 0xA0 (Inherited: 0x28)
struct UNPCAIAttentionPoint : UObject
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIAttentionPoint, "NPCAIAttentionPoint")

	bool bIsCome; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
	struct AActor* Creator; // 0x30(0x8)
	uint8_t Pad_0x38[0x1]; // 0x38(0x1)
	bool IsFootSounder; // 0x39(0x1)
	uint8_t Pad_0x3A[0x6]; // 0x3A(0x6)
	struct AActor* FootSounderSpawnCharacter; // 0x40(0x8)
	struct AAIController* CheckingPlayer; // 0x48(0x8)
	bool bReachable; // 0x50(0x1)
	ENPCPlaceForCheckType PointType; // 0x51(0x1)
	uint8_t Pad_0x52[0x2]; // 0x52(0x2)
	float CreatedTime; // 0x54(0x4)
	float DiedTime; // 0x58(0x4)
	uint8_t Pad_0x5C[0x44]; // 0x5C(0x44)

	// Object: Function MFNPCAI.NPCAIAttentionPoint.UpdatePointData
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c4e96c
	// Params: [ Num(2) Size(0x10) ]
	void UpdatePointData(float InNewCreateTime, struct FVector InNewPosition);

	// Object: Function MFNPCAI.NPCAIAttentionPoint.SetIsCome
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c4ec24
	// Params: [ Num(1) Size(0x1) ]
	void SetIsCome(bool InIsCome);

	// Object: Function MFNPCAI.NPCAIAttentionPoint.SetCreator
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c4eb7c
	// Params: [ Num(1) Size(0x8) ]
	void SetCreator(struct AActor* InCreator);

	// Object: Function MFNPCAI.NPCAIAttentionPoint.IsVehicleFatal
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c4ecd4
	// Params: [ Num(1) Size(0x1) ]
	bool IsVehicleFatal();

	// Object: Function MFNPCAI.NPCAIAttentionPoint.IsThisPointClose
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c4ea54
	// Params: [ Num(2) Size(0xD) ]
	bool IsThisPointClose(struct FVector InCheckLoc);

	// Object: Function MFNPCAI.NPCAIAttentionPoint.IsOld
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c4eb44
	// Params: [ Num(1) Size(0x1) ]
	bool IsOld();

	// Object: Function MFNPCAI.NPCAIAttentionPoint.IsGrenadeHolding
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c4ed0c
	// Params: [ Num(1) Size(0x1) ]
	bool IsGrenadeHolding();

	// Object: Function MFNPCAI.NPCAIAttentionPoint.IsGrenadeHit
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c4ed7c
	// Params: [ Num(1) Size(0x1) ]
	bool IsGrenadeHit();

	// Object: Function MFNPCAI.NPCAIAttentionPoint.IsGrenadeComing
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c4ed44
	// Params: [ Num(1) Size(0x1) ]
	bool IsGrenadeComing();

	// Object: Function MFNPCAI.NPCAIAttentionPoint.IsFatal
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c4edb4
	// Params: [ Num(1) Size(0x1) ]
	bool IsFatal();

	// Object: Function MFNPCAI.NPCAIAttentionPoint.IsDanger
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c4edec
	// Params: [ Num(1) Size(0x1) ]
	bool IsDanger();

	// Object: Function MFNPCAI.NPCAIAttentionPoint.GetPosition
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c4eb08
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetPosition();

	// Object: Function MFNPCAI.NPCAIAttentionPoint.CreateNewAttentionPointWithCoverPointID
	// Flags: [Final|Native|Static|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c4ee24
	// Params: [ Num(6) Size(0x30) ]
	static struct UNPCAIAttentionPoint* CreateNewAttentionPointWithCoverPointID(struct UObject* InHolder, int32_t InCoverPointID, struct FVector InBaseLoc, ENPCPlaceForCheckType InType, struct AActor* InCreator);

	// Object: Function MFNPCAI.NPCAIAttentionPoint.CreateNewAttentionPoint
	// Flags: [Final|Native|Static|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c4efcc
	// Params: [ Num(5) Size(0x28) ]
	static struct UNPCAIAttentionPoint* CreateNewAttentionPoint(struct UObject* InHolder, struct FVector InLoc, ENPCPlaceForCheckType InType, struct AActor* InCreator);
};

// Object: Class MFNPCAI.NPCAIBattleVolumeInterface
// Size: 0x28 (Inherited: 0x28)
struct INPCAIBattleVolumeInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(INPCAIBattleVolumeInterface, "NPCAIBattleVolumeInterface")
};

// Object: Class MFNPCAI.NPCAIBehaviorLODInterface
// Size: 0x28 (Inherited: 0x28)
struct INPCAIBehaviorLODInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(INPCAIBehaviorLODInterface, "NPCAIBehaviorLODInterface")
};

// Object: Class MFNPCAI.NPCAICharacterInterface
// Size: 0x28 (Inherited: 0x28)
struct INPCAICharacterInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(INPCAICharacterInterface, "NPCAICharacterInterface")
};

// Object: Class MFNPCAI.NPCAIControllerInterface
// Size: 0x28 (Inherited: 0x28)
struct INPCAIControllerInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(INPCAIControllerInterface, "NPCAIControllerInterface")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryData
// Size: 0x1D0 (Inherited: 0x28)
struct UNPCAICoverEnvQueryData : UObject
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryData, "NPCAICoverEnvQueryData")

	uint8_t Pad_0x28[0xA8]; // 0x28(0xA8)
	struct FVector Generator_Location; // 0xD0(0xC)
	float Generator_Radius; // 0xDC(0x4)
	struct AVolume* Generator_BotZoneVolume; // 0xE0(0x8)
	float IsFree_TreatAsFreeAfterSeconds; // 0xE8(0x4)
	float IsSafe_TreatAsSafeAfterSeconds; // 0xEC(0x4)
	struct FVector IsNear_Location; // 0xF0(0xC)
	float IsNear_Distance; // 0xFC(0x4)
	bool IsNear_Reversed; // 0x100(0x1)
	uint8_t Pad_0x101[0x3]; // 0x101(0x3)
	struct FVector CloserRatio_Location; // 0x104(0xC)
	float CloserRatio_Ratio; // 0x110(0x4)
	struct FVector CanContain_TargetLocation; // 0x114(0xC)
	float CanContain_HorizontalAngle; // 0x120(0x4)
	float CanContain_TopAngle; // 0x124(0x4)
	float CanContain_BottomAngle; // 0x128(0x4)
	struct FVector CanAttackTo_TargetLocation; // 0x12C(0xC)
	struct TArray<struct AActor*> CanAttackTo_IgnoredActors; // 0x138(0x10)
	struct FVector PathLength_StartLocation; // 0x148(0xC)
	float PathLength_MaxPathLength; // 0x154(0x4)
	float PathLength_MaxRatio; // 0x158(0x4)
	float PathLength_CheckPoint; // 0x15C(0x4)
	float DefenceRatio_MinRatio; // 0x160(0x4)
	float DefenceAngle_MinAngle; // 0x164(0x4)
	struct TArray<struct FVector> DistanceToHotPoint_Locations; // 0x168(0x10)
	struct FVector DistanceToAllyCover_Location; // 0x178(0xC)
	float DistanceToAllyCover_MinDistance; // 0x184(0x4)
	struct FVector IsSameSideToTarget_TargetLocation; // 0x188(0xC)
	struct FVector IsSameSideToTarget_TargetDirection; // 0x194(0xC)
	struct FVector IsInCone_Location; // 0x1A0(0xC)
	struct FVector IsInCone_Direction; // 0x1AC(0xC)
	float IsInCone_Radius; // 0x1B8(0x4)
	float IsInCone_Angle; // 0x1BC(0x4)
	struct FVector CoverDist_Location; // 0x1C0(0xC)
	float CoverDist_MaxDistance; // 0x1CC(0x4)

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupPathLength
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c52ae8
	// Params: [ Num(4) Size(0x18) ]
	void SetupPathLength(const struct FVector& Location, float MaxPathLength, float MaxRatio, float CheckPointPathLength);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupIsSameSideToTarget
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c526f0
	// Params: [ Num(2) Size(0x18) ]
	void SetupIsSameSideToTarget(const struct FVector& Location, const struct FVector& Direction);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupIsSafe
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c530f4
	// Params: [ Num(1) Size(0x4) ]
	void SetupIsSafe(float TreatAsSafeAfterSeconds);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupIsIsNear
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c52fbc
	// Params: [ Num(3) Size(0x11) ]
	void SetupIsIsNear(const struct FVector& Location, float Distance, bool bReversed);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupIsInCone
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c52574
	// Params: [ Num(4) Size(0x20) ]
	void SetupIsInCone(const struct FVector& Location, const struct FVector& Direction, float Radius, float Angle);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupIsFree
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5319c
	// Params: [ Num(1) Size(0x4) ]
	void SetupIsFree(float TreatAsFreeAfterSeconds);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupIsCloserRatio
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c52ecc
	// Params: [ Num(2) Size(0x10) ]
	void SetupIsCloserRatio(const struct FVector& Location, float Ratio);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupGenerator
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c53244
	// Params: [ Num(3) Size(0x18) ]
	void SetupGenerator(const struct FVector& Location, float Radius, struct AVolume* BotZoneVolume);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupDistanceToHotPoint
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c528d8
	// Params: [ Num(1) Size(0x10) ]
	void SetupDistanceToHotPoint(const struct TArray<struct FVector>& Locations);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupDistanceToAllyCover
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c527e8
	// Params: [ Num(2) Size(0x10) ]
	void SetupDistanceToAllyCover(const struct FVector& Location, float MinDistance);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupDefenceRatio
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c52a40
	// Params: [ Num(1) Size(0x4) ]
	void SetupDefenceRatio(float MinRatio);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupDefenceAngle
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c52998
	// Params: [ Num(1) Size(0x4) ]
	void SetupDefenceAngle(float MinAngle);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupCoverDist
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c52484
	// Params: [ Num(2) Size(0x10) ]
	void SetupCoverDist(const struct FVector& Location, float MaxDistance);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupCanContain
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c52d60
	// Params: [ Num(4) Size(0x18) ]
	void SetupCanContain(const struct FVector& Location, float HorizontalAngle, float TopAngle, float BottomAngle);

	// Object: Function MFNPCAI.NPCAICoverEnvQueryData.SetupCanAttackTo
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c52c54
	// Params: [ Num(2) Size(0x20) ]
	void SetupCanAttackTo(const struct FVector& Location, const struct TArray<struct AActor*>& IgnoredActors);
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryGenerator
// Size: 0x218 (Inherited: 0x210)
struct UNPCAICoverEnvQueryGenerator : UEnvQueryGenerator_OnCircle
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryGenerator, "NPCAICoverEnvQueryGenerator")

	struct UCoverSystem* CacheCoverSystem; // 0x210(0x8)
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_CanAttackTo
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_CanAttackTo : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_CanAttackTo, "NPCAICoverEnvQueryTest_CanAttackTo")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_CanContain
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_CanContain : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_CanContain, "NPCAICoverEnvQueryTest_CanContain")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_CloserRatio
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_CloserRatio : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_CloserRatio, "NPCAICoverEnvQueryTest_CloserRatio")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_CoverDist
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_CoverDist : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_CoverDist, "NPCAICoverEnvQueryTest_CoverDist")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_DefenceAngle
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_DefenceAngle : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_DefenceAngle, "NPCAICoverEnvQueryTest_DefenceAngle")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_DefenceRatio
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_DefenceRatio : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_DefenceRatio, "NPCAICoverEnvQueryTest_DefenceRatio")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_DistanceToAllyCover
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_DistanceToAllyCover : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_DistanceToAllyCover, "NPCAICoverEnvQueryTest_DistanceToAllyCover")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_DistanceToHotPoint
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_DistanceToHotPoint : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_DistanceToHotPoint, "NPCAICoverEnvQueryTest_DistanceToHotPoint")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_IsFree
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_IsFree : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_IsFree, "NPCAICoverEnvQueryTest_IsFree")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_IsInCone
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_IsInCone : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_IsInCone, "NPCAICoverEnvQueryTest_IsInCone")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_IsNear
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_IsNear : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_IsNear, "NPCAICoverEnvQueryTest_IsNear")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_IsSafe
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_IsSafe : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_IsSafe, "NPCAICoverEnvQueryTest_IsSafe")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_IsSameSideToTarget
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_IsSameSideToTarget : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_IsSameSideToTarget, "NPCAICoverEnvQueryTest_IsSameSideToTarget")
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_PathLength
// Size: 0x1F8 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_PathLength : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_PathLength, "NPCAICoverEnvQueryTest_PathLength")

	bool bEnabledDebug; // 0x1F1(0x1)
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_Protection
// Size: 0x200 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_Protection : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_Protection, "NPCAICoverEnvQueryTest_Protection")

	struct UEnvQueryContext* ProtectionFrom; // 0x1F8(0x8)
};

// Object: Class MFNPCAI.NPCAICoverEnvQueryTest_ShootDistance
// Size: 0x200 (Inherited: 0x1F8)
struct UNPCAICoverEnvQueryTest_ShootDistance : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverEnvQueryTest_ShootDistance, "NPCAICoverEnvQueryTest_ShootDistance")

	struct UEnvQueryContext* ShootDistanceTo; // 0x1F8(0x8)
};

// Object: Class MFNPCAI.NPCAICoverSystemStatics
// Size: 0x28 (Inherited: 0x28)
struct UNPCAICoverSystemStatics : UBlueprintFunctionLibrary
{
	DEFINE_UE_CLASS_HELPERS(UNPCAICoverSystemStatics, "NPCAICoverSystemStatics")

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_IsSafe
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c54640
	// Params: [ Num(5) Size(0x31) ]
	static bool TestCoverPoints_IsSafe(const struct TArray<int32_t>& InPoints, float SecondsAfterLastSpotted, struct TArray<int32_t>& PassPoints, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_IsNear
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c540a4
	// Params: [ Num(7) Size(0x41) ]
	static bool TestCoverPoints_IsNear(const struct TArray<int32_t>& InPoints, const struct FVector& Location, float Distance, bool bReversed, struct TArray<int32_t>& PassPoints, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_IsFree
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c547f0
	// Params: [ Num(6) Size(0x39) ]
	static bool TestCoverPoints_IsFree(const struct TArray<int32_t>& InPoints, struct AActor* InActor, float TreatAsFreeAfterSeconds, struct TArray<int32_t>& PassPoints, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_HasNavPath
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c53c30
	// Params: [ Num(6) Size(0x39) ]
	static bool TestCoverPoints_HasNavPath(const struct TArray<int32_t>& InPoints, const struct FVector& StartLocation, float MaxPathLenght, struct TArray<int32_t>& PassPoints, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_CanProtectPose
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c53a80
	// Params: [ Num(5) Size(0x31) ]
	static bool TestCoverPoints_CanProtectPose(const struct TArray<int32_t>& InPoints, ENPCPoseType PoseType, struct TArray<int32_t>& PassPoints, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_CanContain
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c53e2c
	// Params: [ Num(8) Size(0x41) ]
	static bool TestCoverPoints_CanContain(const struct TArray<int32_t>& InPoints, const struct FVector& Location, float HorizontalAngle, float TopAngle, float BottomAngle, struct TArray<int32_t>& PassPoints, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.TestCoverPoints_CanAttackTo
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c542f0
	// Params: [ Num(6) Size(0x49) ]
	static bool TestCoverPoints_CanAttackTo(const struct TArray<int32_t>& InPoints, const struct FVector& Location, const struct TArray<struct AActor*>& IgnoredActors, struct TArray<int32_t>& PassPoints, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.TestCoverPoint_IsSafe
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c54514
	// Params: [ Num(4) Size(0x11) ]
	static bool TestCoverPoint_IsSafe(int32_t InPointID, float SecondsAfterLastSpotted, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.SetCoverPointSpotted
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c549e0
	// Params: [ Num(3) Size(0x11) ]
	static bool SetCoverPointSpotted(int32_t PointID, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.SetCoverPointOwner
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c54b64
	// Params: [ Num(5) Size(0x21) ]
	static bool SetCoverPointOwner(int32_t PointID, struct AActor* Actor, float Radius, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.RunEQSQuery_FindBackUpCoverPointNearBy
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c5346c
	// Params: [ Num(8) Size(0x40) ]
	static struct UEnvQueryInstanceBlueprintWrapper* RunEQSQuery_FindBackUpCoverPointNearBy(struct UObject* WorldContextObject, struct UEnvQuery* QueryTemplate, struct AActor* Querier, const struct FVector& InEnemyPos, float InRadiusNoCheck, uint8_t RunMode, struct UEnvQueryInstanceBlueprintWrapper* WrapperClass);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.RemoveCoverPointBeTaked
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c54acc
	// Params: [ Num(1) Size(0x8) ]
	static void RemoveCoverPointBeTaked(struct AActor* InAIPawn);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.GetQueryResultsAsCoverIDs
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c53698
	// Params: [ Num(3) Size(0x19) ]
	static bool GetQueryResultsAsCoverIDs(struct UEnvQueryInstanceBlueprintWrapper* QueryInstanceBPWrapper, struct TArray<int32_t>& PassPoints);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.GetCoverSystem
	// Flags: [Final|Native|Static|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c552c8
	// Params: [ Num(2) Size(0x10) ]
	static struct UCoverSystem* GetCoverSystem(struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.GetCoverPointPoseDataArray
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c54cd0
	// Params: [ Num(5) Size(0x31) ]
	static bool GetCoverPointPoseDataArray(int32_t PointID, struct TArray<struct FCoverPoseData>& PoseDataArray, struct FVector& RightDirection, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.GetCoverPointLocationAndDirection
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c54e70
	// Params: [ Num(5) Size(0x29) ]
	static bool GetCoverPointLocationAndDirection(int32_t PointID, struct FVector& Location, struct FVector& Direction, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.GetCoverPointData
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c537a0
	// Params: [ Num(4) Size(0x61) ]
	static bool GetCoverPointData(int32_t PointID, struct FCoverPointOctreeData& Data, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.FindNearestCoverPoint
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c538fc
	// Params: [ Num(5) Size(0x29) ]
	static bool FindNearestCoverPoint(const struct FVector& Location, float EdgeSize, struct FVector& CoverLocation, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.FindCoverPointsInSphere
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c5513c
	// Params: [ Num(5) Size(0x29) ]
	static bool FindCoverPointsInSphere(struct FVector Location, float Radius, struct TArray<int32_t>& Points, struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAICoverSystemStatics.FindCoverPointsInPathLength
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c54ff4
	// Params: [ Num(4) Size(0x21) ]
	static bool FindCoverPointsInPathLength(struct AActor* AIPawn, float PathLength, struct TArray<struct FVector>& PointsPos);
};

// Object: Class MFNPCAI.NPCAIDamageData
// Size: 0x40 (Inherited: 0x28)
struct UNPCAIDamageData : UObject
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIDamageData, "NPCAIDamageData")

	float TimeDamage; // 0x28(0x4)
	struct FVector position; // 0x2C(0xC)
	float CachedMaxActiveTime; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)

	// Object: Function MFNPCAI.NPCAIDamageData.IsActive
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c55450
	// Params: [ Num(1) Size(0x1) ]
	bool IsActive();
};

// Object: Class MFNPCAI.NPCAIDoorInterface
// Size: 0x28 (Inherited: 0x28)
struct INPCAIDoorInterface : ITacticDoorInterface
{
	DEFINE_UE_CLASS_HELPERS(INPCAIDoorInterface, "NPCAIDoorInterface")

	// Object: Function MFNPCAI.NPCAIDoorInterface.IsDoorLocked
	// Flags: [Native|Public]
	// Offset: 0x3c5549c
	// Params: [ Num(1) Size(0x1) ]
	bool IsDoorLocked();

	// Object: Function MFNPCAI.NPCAIDoorInterface.IsDoorClosed
	// Flags: [Native|Public]
	// Offset: 0x3c554dc
	// Params: [ Num(1) Size(0x1) ]
	bool IsDoorClosed();
};

// Object: Class MFNPCAI.NPCAIDoorOpenInterface
// Size: 0x28 (Inherited: 0x28)
struct INPCAIDoorOpenInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(INPCAIDoorOpenInterface, "NPCAIDoorOpenInterface")

	// Object: Function MFNPCAI.NPCAIDoorOpenInterface.IsDoorOpened
	// Flags: [Native|Public]
	// Offset: 0x3c57fcc
	// Params: [ Num(2) Size(0x9) ]
	bool IsDoorOpened(struct AActor* InDoor);
};

// Object: Class MFNPCAI.NPCAIDynamicGroupInfo
// Size: 0x58 (Inherited: 0x28)
struct UNPCAIDynamicGroupInfo : UObject
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIDynamicGroupInfo, "NPCAIDynamicGroupInfo")

	uint8_t Pad_0x28[0x8]; // 0x28(0x8)
	int32_t DyGroupId; // 0x30(0x4)
	float CreateTime; // 0x34(0x4)
	bool CanAutoRelease; // 0x38(0x1)
	uint8_t Pad_0x39[0x7]; // 0x39(0x7)
	struct TArray<struct AActor*> AllyList; // 0x40(0x10)
	struct UWorld* WorldPrivate; // 0x50(0x8)

	// Object: Function MFNPCAI.NPCAIDynamicGroupInfo.GetTimeSeconds
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c580dc
	// Params: [ Num(1) Size(0x4) ]
	float GetTimeSeconds();

	// Object: Function MFNPCAI.NPCAIDynamicGroupInfo.GetAllyList
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c5809c
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<struct AActor*> GetAllyList();
};

// Object: Class MFNPCAI.NPCAITargetInfoBase
// Size: 0x60 (Inherited: 0x28)
struct UNPCAITargetInfoBase : UObject
{
	DEFINE_UE_CLASS_HELPERS(UNPCAITargetInfoBase, "NPCAITargetInfoBase")

	float FirstTimeSeen; // 0x28(0x4)
	float TimeToForgorAboutEnemySec; // 0x2C(0x4)
	struct FAIShotCountStat BeFireCount; // 0x30(0x10)
	struct FAIShotCountStat BeHitCount; // 0x40(0x10)
	float EnemyStartSeenTime; // 0x50(0x4)
	float EnemyLastSeenTime; // 0x54(0x4)
	float EnemyLastKnowTime; // 0x58(0x4)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)

	// Object: Function MFNPCAI.NPCAITargetInfoBase.SetTimeToForgorAboutEnemySec
	// Flags: [Native|Public]
	// Offset: 0x3ccbf38
	// Params: [ Num(1) Size(0x4) ]
	void SetTimeToForgorAboutEnemySec(float Value);

	// Object: Function MFNPCAI.NPCAITargetInfoBase.SetTimeLastSeen
	// Flags: [Native|Public]
	// Offset: 0x3ccc110
	// Params: [ Num(1) Size(0x4) ]
	void SetTimeLastSeen(float InNowTime);

	// Object: Function MFNPCAI.NPCAITargetInfoBase.SetTimeLastKnow
	// Flags: [Native|Public]
	// Offset: 0x3ccc060
	// Params: [ Num(1) Size(0x4) ]
	void SetTimeLastKnow(float InNowTime);

	// Object: Function MFNPCAI.NPCAITargetInfoBase.SetFirstTimeSeen
	// Flags: [Native|Public]
	// Offset: 0x3ccc1fc
	// Params: [ Num(1) Size(0x4) ]
	void SetFirstTimeSeen(float InNowTime);

	// Object: Function MFNPCAI.NPCAITargetInfoBase.SetBeHitTime
	// Flags: [Native|Public]
	// Offset: 0x3ccbc34
	// Params: [ Num(1) Size(0x4) ]
	void SetBeHitTime(float InNowTime);

	// Object: Function MFNPCAI.NPCAITargetInfoBase.SetBeFireTime
	// Flags: [Native|Public]
	// Offset: 0x3ccbce4
	// Params: [ Num(1) Size(0x4) ]
	void SetBeFireTime(float InNowTime);

	// Object: Function MFNPCAI.NPCAITargetInfoBase.GetTimeToForgorAboutEnemySec
	// Flags: [Native|Public]
	// Offset: 0x3ccbefc
	// Params: [ Num(1) Size(0x4) ]
	float GetTimeToForgorAboutEnemySec();

	// Object: Function MFNPCAI.NPCAITargetInfoBase.GetTimeLastSeen
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0x3ccc024
	// Params: [ Num(1) Size(0x4) ]
	float GetTimeLastSeen();

	// Object: Function MFNPCAI.NPCAITargetInfoBase.GetTimeLastKnow
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0x3ccbfe8
	// Params: [ Num(1) Size(0x4) ]
	float GetTimeLastKnow();

	// Object: Function MFNPCAI.NPCAITargetInfoBase.GetLastBeHitTime
	// Flags: [Native|Public]
	// Offset: 0x3ccbe48
	// Params: [ Num(1) Size(0x4) ]
	float GetLastBeHitTime();

	// Object: Function MFNPCAI.NPCAITargetInfoBase.GetLastBeFireTime
	// Flags: [Native|Public]
	// Offset: 0x3ccbec0
	// Params: [ Num(1) Size(0x4) ]
	float GetLastBeFireTime();

	// Object: Function MFNPCAI.NPCAITargetInfoBase.GetFirstTimeSeen
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3ccc1c0
	// Params: [ Num(1) Size(0x4) ]
	float GetFirstTimeSeen();

	// Object: Function MFNPCAI.NPCAITargetInfoBase.GetFirstBeHitTime
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0x3ccbe0c
	// Params: [ Num(1) Size(0x4) ]
	float GetFirstBeHitTime();

	// Object: Function MFNPCAI.NPCAITargetInfoBase.GetFirstBeFireTime
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0x3ccbe84
	// Params: [ Num(1) Size(0x4) ]
	float GetFirstBeFireTime();

	// Object: Function MFNPCAI.NPCAITargetInfoBase.GetBeHitCount
	// Flags: [Native|Public]
	// Offset: 0x3ccbd94
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetBeHitCount();

	// Object: Function MFNPCAI.NPCAITargetInfoBase.GetBeFireCount
	// Flags: [Native|Public]
	// Offset: 0x3ccbdd0
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetBeFireCount();
};

// Object: Class MFNPCAI.NPCAIEnemyGroupSingleInfo
// Size: 0xB0 (Inherited: 0x60)
struct UNPCAIEnemyGroupSingleInfo : UNPCAITargetInfoBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIEnemyGroupSingleInfo, "NPCAIEnemyGroupSingleInfo")

	bool IsTemporaryEnemy; // 0x5C(0x1)
	bool IsTemporaryEnemyFromAlly; // 0x5D(0x1)
	float EndTimeOfTemporaryEnemy; // 0x60(0x4)
	struct FVector EnemyLastSeenPosition; // 0x64(0xC)
	float EndTimeOfSupressed; // 0x70(0x4)
	float LastTimeCreateSuspectedPoint; // 0x74(0x4)
	float PersonInValidTime; // 0x78(0x4)
	uint8_t Pad_0x7E[0x2]; // 0x7E(0x2)
	struct AActor* Person; // 0x80(0x8)
	int32_t HatredValue; // 0x88(0x4)
	float HatredEndtime; // 0x8C(0x4)
	float LastShootGroupAllyTime; // 0x90(0x4)
	int32_t SuspectedPointCreatedNum; // 0x94(0x4)
	float LastIncreaseTimeSuspectedPoint; // 0x98(0x4)
	struct FVector EnemyLastEstimatePosition; // 0x9C(0xC)
	bool bIsRemoved; // 0xA8(0x1)
	uint8_t Pad_0xA9[0x7]; // 0xA9(0x7)

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.SetTemporaryEnemyInfo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c587c4
	// Params: [ Num(3) Size(0x9) ]
	void SetTemporaryEnemyInfo(bool InIsTemporaryEnemy, float InExpiredTime, bool InIsFromAlly);

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.SetSuppressEndTime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c58668
	// Params: [ Num(1) Size(0x4) ]
	void SetSuppressEndTime(float InEndTime);

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.SetLastShootGroupAllyTime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c58428
	// Params: [ Num(1) Size(0x4) ]
	void SetLastShootGroupAllyTime(float InTime);

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.SetIsRemoved
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c58148
	// Params: [ Num(1) Size(0x1) ]
	void SetIsRemoved(bool InValue);

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.SetHatredValue
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c58580
	// Params: [ Num(2) Size(0x8) ]
	void SetHatredValue(int32_t InHatredValue, float InEndTime);

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.SetEnemyLastVisibleInfo
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c58a20
	// Params: [ Num(2) Size(0x10) ]
	void SetEnemyLastVisibleInfo(struct FVector InLastSeenPosition, float InLastSeenTime);

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.SetEnemyLastEstimatePosition
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c58938
	// Params: [ Num(2) Size(0x14) ]
	void SetEnemyLastEstimatePosition(struct AActor* InEnemy, struct FVector InPosition);

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.IsRealValidEnemy
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c58710
	// Params: [ Num(2) Size(0x5) ]
	bool IsRealValidEnemy(float InNowTime);

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.GetSuspectedPointCreatedNum
	// Flags: [Final|Native|Public]
	// Offset: 0x3c58344
	// Params: [ Num(2) Size(0xC) ]
	int32_t GetSuspectedPointCreatedNum(struct AActor* InAIPawn);

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.GetPerson
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c58b08
	// Params: [ Num(1) Size(0x8) ]
	struct AActor* GetPerson();

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.GetLastShootGroupAllyTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c583f4
	// Params: [ Num(1) Size(0x4) ]
	float GetLastShootGroupAllyTime();

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.GetIsRemoved
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c5812c
	// Params: [ Num(1) Size(0x1) ]
	bool GetIsRemoved();

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.GetHatredValue
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c584d0
	// Params: [ Num(2) Size(0x8) ]
	int32_t GetHatredValue(float InNowTime);

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.GetEnemyLastEstimatePosition
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c588fc
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetEnemyLastEstimatePosition();

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.CalculateSuspectedPointCreatedNum
	// Flags: [Final|Native|Public]
	// Offset: 0x3c5829c
	// Params: [ Num(1) Size(0x8) ]
	void CalculateSuspectedPointCreatedNum(struct AActor* InAIPawn);

	// Object: Function MFNPCAI.NPCAIEnemyGroupSingleInfo.AddSuspectedPointCreatedNum
	// Flags: [Final|Native|Public]
	// Offset: 0x3c581f4
	// Params: [ Num(1) Size(0x8) ]
	void AddSuspectedPointCreatedNum(struct AActor* InAIPawn);
};

// Object: Class MFNPCAI.NPCAIEnvQueryGenerator_BlueprintBase
// Size: 0xC0 (Inherited: 0x80)
struct UNPCAIEnvQueryGenerator_BlueprintBase : UEnvQueryGenerator_BlueprintBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIEnvQueryGenerator_BlueprintBase, "NPCAIEnvQueryGenerator_BlueprintBase")

	struct FAIDataProviderIntValue IntParam; // 0x80(0x38)
	uint8_t Pad_0xB8[0x8]; // 0xB8(0x8)

	// Object: Function MFNPCAI.NPCAIEnvQueryGenerator_BlueprintBase.GetQueryIntParam
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c58b8c
	// Params: [ Num(2) Size(0xC) ]
	int32_t GetQueryIntParam(const struct FName& ParamName);
};

// Object: Class MFNPCAI.NPCAIEnvQueryGenerator_OnPolyCenter
// Size: 0x2F8 (Inherited: 0x210)
struct UNPCAIEnvQueryGenerator_OnPolyCenter : UEnvQueryGenerator_OnCircle
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIEnvQueryGenerator_OnPolyCenter, "NPCAIEnvQueryGenerator_OnPolyCenter")

	struct FAIDataProviderBoolValue OnlyCurrentRegion; // 0x210(0x38)
	struct FAIDataProviderBoolValue IncludeNavMeshPolyCenters; // 0x248(0x38)
	struct FAIDataProviderBoolValue IncludeNavMeshInternalEdges; // 0x280(0x38)
	struct FAIDataProviderBoolValue IncludeNavMeshBoundaryEdges; // 0x2B8(0x38)
	float PointZOffset; // 0x2F0(0x4)
	uint8_t Pad_0x2F4[0x4]; // 0x2F4(0x4)
};

// Object: Class MFNPCAI.NPCAIEnvQueryInstanceBlueprintWrapper
// Size: 0x80 (Inherited: 0x78)
struct UNPCAIEnvQueryInstanceBlueprintWrapper : UEnvQueryInstanceBlueprintWrapper
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIEnvQueryInstanceBlueprintWrapper, "NPCAIEnvQueryInstanceBlueprintWrapper")

	float QueryTime; // 0x78(0x4)
	uint8_t Pad_0x7C[0x4]; // 0x7C(0x4)
};

// Object: Class MFNPCAI.NPCAIEnvQueryItemType_CoverPoint
// Size: 0x30 (Inherited: 0x30)
struct UNPCAIEnvQueryItemType_CoverPoint : UEnvQueryItemType_VectorBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIEnvQueryItemType_CoverPoint, "NPCAIEnvQueryItemType_CoverPoint")
};

// Object: Class MFNPCAI.NPCAIEnvQueryManager
// Size: 0x140 (Inherited: 0x140)
struct UNPCAIEnvQueryManager : UEnvQueryManager
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIEnvQueryManager, "NPCAIEnvQueryManager")
};

// Object: Class MFNPCAI.NPCAIEnvQueryTest_BlueprintBase
// Size: 0x218 (Inherited: 0x1F8)
struct UNPCAIEnvQueryTest_BlueprintBase : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIEnvQueryTest_BlueprintBase, "NPCAIEnvQueryTest_BlueprintBase")

	struct UEnvQueryContext* Context; // 0x1F8(0x8)
	struct FText TestDescription; // 0x200(0x18)

	// Object: Function MFNPCAI.NPCAIEnvQueryTest_BlueprintBase.CalcScore
	// Flags: [Event|Public|HasOutParms|BlueprintEvent|Const]
	// Offset: 0x5d8cbc8
	// Params: [ Num(3) Size(0x1C) ]
	float CalcScore(struct AActor* ItemActor, const struct TArray<struct AActor*>& ContextActors);
};

// Object: Class MFNPCAI.NPCAIEnvQueryTest_PathfindingFromQuerier
// Size: 0x230 (Inherited: 0x1F8)
struct UNPCAIEnvQueryTest_PathfindingFromQuerier : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIEnvQueryTest_PathfindingFromQuerier, "NPCAIEnvQueryTest_PathfindingFromQuerier")

	uint8_t TestMode; // 0x1F1(0x1)
	struct FAIDataProviderBoolValue SkipUnreachable; // 0x1F8(0x38)
};

// Object: Class MFNPCAI.NPCAIEnvQueryTest_PointBase
// Size: 0x218 (Inherited: 0x1F8)
struct UNPCAIEnvQueryTest_PointBase : UEnvQueryTest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIEnvQueryTest_PointBase, "NPCAIEnvQueryTest_PointBase")

	struct UEnvQueryContext_BlueprintBase* Context; // 0x1F8(0x8)
	struct FText TestDescription; // 0x200(0x18)

	// Object: Function MFNPCAI.NPCAIEnvQueryTest_PointBase.CalcScore
	// Flags: [Event|Public|HasOutParms|HasDefaults|BlueprintEvent|Const]
	// Offset: 0x5d8cbc8
	// Params: [ Num(4) Size(0x2C) ]
	float CalcScore(const struct FVector& ItemLocation, const struct TArray<struct AActor*>& ContextActors, struct UObject* QueryOwner);
};

// Object: Class MFNPCAI.NPCAIEQSSystemStatics
// Size: 0x28 (Inherited: 0x28)
struct UNPCAIEQSSystemStatics : UBlueprintFunctionLibrary
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIEQSSystemStatics, "NPCAIEQSSystemStatics")

	// Object: Function MFNPCAI.NPCAIEQSSystemStatics.UARunEQSQuery
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c58e40
	// Params: [ Num(7) Size(0x38) ]
	static struct UEnvQueryInstanceBlueprintWrapper* UARunEQSQuery(struct UObject* WorldContextObject, struct UEnvQuery* QueryTemplate, struct AActor* Querier, uint8_t RunMode, struct UEnvQueryInstanceBlueprintWrapper* WrapperClass, uint8_t QueryPriority);
};

// Object: Class MFNPCAI.NPCAISubsystemBase
// Size: 0x30 (Inherited: 0x30)
struct UNPCAISubsystemBase : USGBaseAISubsystem
{
	DEFINE_UE_CLASS_HELPERS(UNPCAISubsystemBase, "NPCAISubsystemBase")

	// Object: Function MFNPCAI.NPCAISubsystemBase.OnPostBeginGameInit
	// Flags: [Native|Protected]
	// Offset: 0x3cb70c0
	// Params: [ Num(0) Size(0x0) ]
	void OnPostBeginGameInit();
};

// Object: Class MFNPCAI.NPCAIEventSubsystem
// Size: 0x40 (Inherited: 0x30)
struct UNPCAIEventSubsystem : UNPCAISubsystemBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIEventSubsystem, "NPCAIEventSubsystem")

	uint8_t Pad_0x30[0x10]; // 0x30(0x10)
};

// Object: Class MFNPCAI.NPCAIFactionComponent
// Size: 0x108 (Inherited: 0xF0)
struct UNPCAIFactionComponent : UNPCAIActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIFactionComponent, "NPCAIFactionComponent")

	uint8_t Pad_0xF0[0x8]; // 0xF0(0x8)
	struct TArray<struct UNPCAIPropertyProfile*> PropertyProfiles; // 0xF8(0x10)
};

// Object: Class MFNPCAI.NPCAIFactionPluginBase
// Size: 0x38 (Inherited: 0x28)
struct UNPCAIFactionPluginBase : UObject
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIFactionPluginBase, "NPCAIFactionPluginBase")

	struct TArray<struct TSoftObjectPtr<UObject>> ObjectRefs; // 0x28(0x10)
};

// Object: Class MFNPCAI.NPCAIFactionPlugin
// Size: 0xB0 (Inherited: 0x38)
struct UNPCAIFactionPlugin : UNPCAIFactionPluginBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIFactionPlugin, "NPCAIFactionPlugin")

	struct TMap<EAIProfileType, struct UNPCAIPropertyProfile*> ProfileTypeMap; // 0x38(0x50)
	struct FNPCAIProfileCover ProfileCover; // 0x88(0x28)

	// Object: Function MFNPCAI.NPCAIFactionPlugin.CoverFaction
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c590d8
	// Params: [ Num(1) Size(0x8) ]
	void CoverFaction(struct AAIController* AIController);
};

// Object: Class MFNPCAI.NPCAIFindAmbushAgainstPointAsyncTask
// Size: 0x78 (Inherited: 0x40)
struct UNPCAIFindAmbushAgainstPointAsyncTask : UNPCAIAsyncTaskBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIFindAmbushAgainstPointAsyncTask, "NPCAIFindAmbushAgainstPointAsyncTask")

	struct FMulticastInlineDelegate OnSuccess; // 0x40(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x50(0x10)
	struct FVector PointStart; // 0x60(0xC)
	struct FVector PointToGo; // 0x6C(0xC)

	// Object: Function MFNPCAI.NPCAIFindAmbushAgainstPointAsyncTask.ExecuteTask
	// Flags: [Native|Public]
	// Offset: 0x3c59194
	// Params: [ Num(0) Size(0x0) ]
	void ExecuteTask();

	// Object: Function MFNPCAI.NPCAIFindAmbushAgainstPointAsyncTask.AIFindAmbushAgainstPoint
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c591b0
	// Params: [ Num(4) Size(0x28) ]
	static struct UNPCAIFindAmbushAgainstPointAsyncTask* AIFindAmbushAgainstPoint(struct AActor* Pawn, const struct FVector& PointStart, const struct FVector& PointToGo);
};

// Object: Class MFNPCAI.NPCAIFindPathByKeyRouteAsyncTask
// Size: 0x128 (Inherited: 0x40)
struct UNPCAIFindPathByKeyRouteAsyncTask : UNPCAIAsyncTaskBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIFindPathByKeyRouteAsyncTask, "NPCAIFindPathByKeyRouteAsyncTask")

	struct FMulticastInlineDelegate OnSuccess; // 0x40(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x50(0x10)
	struct FKeyRoutePointData FromPoint; // 0x60(0x60)
	struct FKeyRoutePointData ToPoint; // 0xC0(0x60)
	EAIKeyRouteQueryType QueryType; // 0x120(0x1)
	uint8_t Pad_0x121[0x7]; // 0x121(0x7)

	// Object: Function MFNPCAI.NPCAIFindPathByKeyRouteAsyncTask.ExecuteTask
	// Flags: [Native|Public]
	// Offset: 0x3c592f0
	// Params: [ Num(0) Size(0x0) ]
	void ExecuteTask();

	// Object: Function MFNPCAI.NPCAIFindPathByKeyRouteAsyncTask.AIFindPathByKeyRoute
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c5930c
	// Params: [ Num(5) Size(0xD8) ]
	static struct UNPCAIFindPathByKeyRouteAsyncTask* AIFindPathByKeyRoute(struct AActor* Pawn, const struct FKeyRoutePointData& FromPoint, const struct FKeyRoutePointData& ToPoint, EAIKeyRouteQueryType QueryType);
};

// Object: Class MFNPCAI.NPCAIGameStateDebugInterface
// Size: 0x28 (Inherited: 0x28)
struct INPCAIGameStateDebugInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(INPCAIGameStateDebugInterface, "NPCAIGameStateDebugInterface")
};

// Object: Class MFNPCAI.NPCAIGlobalManagerInterface
// Size: 0x28 (Inherited: 0x28)
struct INPCAIGlobalManagerInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(INPCAIGlobalManagerInterface, "NPCAIGlobalManagerInterface")

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.NotifySceneEvent
	// Flags: [Native|Public|HasOutParms]
	// Offset: 0x3c59778
	// Params: [ Num(3) Size(0x18) ]
	void NotifySceneEvent(struct UAISceneEventMessage* SceneEvent, const EAISceneEventState& EventState, struct AActor* AIPawn);

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetTacticSystemActor
	// Flags: [Native|Public]
	// Offset: 0x3c59a58
	// Params: [ Num(1) Size(0x8) ]
	struct ATacticSystemActor* GetTacticSystemActor();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetSightExeLimitTime
	// Flags: [Native|Public]
	// Offset: 0x3c595fc
	// Params: [ Num(1) Size(0x4) ]
	float GetSightExeLimitTime();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetSightExeLimitMinCount
	// Flags: [Native|Public]
	// Offset: 0x3c595c0
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetSightExeLimitMinCount();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetPerceptionDynamicActor
	// Flags: [Native|Public]
	// Offset: 0x3c599e0
	// Params: [ Num(1) Size(0x8) ]
	struct ANPCAIPerceptionDynamicActor* GetPerceptionDynamicActor();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetPerceptionAssistActor
	// Flags: [Native|Public]
	// Offset: 0x3c59a1c
	// Params: [ Num(1) Size(0x8) ]
	struct ANPCAIPerceptionAssistActor* GetPerceptionAssistActor();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetHearExeLimitTime
	// Flags: [Native|Public]
	// Offset: 0x3c59584
	// Params: [ Num(1) Size(0x4) ]
	float GetHearExeLimitTime();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetHearExeLimitDivide
	// Flags: [Native|Public]
	// Offset: 0x3c59548
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetHearExeLimitDivide();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetGrenadeMinLifeTime
	// Flags: [Native|Public|Const]
	// Offset: 0x3c59638
	// Params: [ Num(1) Size(0x4) ]
	float GetGrenadeMinLifeTime();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetCurrentFogDensity
	// Flags: [Native|Public]
	// Offset: 0x3c59674
	// Params: [ Num(1) Size(0x4) ]
	float GetCurrentFogDensity();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetCoverSystemActor
	// Flags: [Native|Public]
	// Offset: 0x3c59a94
	// Params: [ Num(1) Size(0x8) ]
	struct ACoverSystemActor* GetCoverSystemActor();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetAISGDoorManager
	// Flags: [Native|Public]
	// Offset: 0x3c59968
	// Params: [ Num(1) Size(0x8) ]
	struct UAISGDoorManager* GetAISGDoorManager();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetAISceneEventsTriggerManager
	// Flags: [Native|Public]
	// Offset: 0x3c599a4
	// Params: [ Num(1) Size(0x8) ]
	struct UAISceneEventsTriggerManager* GetAISceneEventsTriggerManager();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetAISceneEventDataTable
	// Flags: [Native|Public]
	// Offset: 0x3c598f0
	// Params: [ Num(1) Size(0x8) ]
	struct UDataTable* GetAISceneEventDataTable();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetAIRuntimeMonitor
	// Flags: [Native|Public]
	// Offset: 0x3c5992c
	// Params: [ Num(1) Size(0x8) ]
	struct UAIRuntimeMonitor* GetAIRuntimeMonitor();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.GetAIGlobalShareInfo
	// Flags: [Native|Public]
	// Offset: 0x3c598b4
	// Params: [ Num(1) Size(0x8) ]
	struct UNPCAIGlobalSharedInfo* GetAIGlobalShareInfo();

	// Object: Function MFNPCAI.NPCAIGlobalManagerInterface.FindAllSGDoorsInWorld
	// Flags: [Native|Public|HasOutParms]
	// Offset: 0x3c596b0
	// Params: [ Num(1) Size(0x10) ]
	void FindAllSGDoorsInWorld(struct TArray<struct TWeakObjectPtr<struct AActor>>& DoorsInWorld);
};

// Object: Class MFNPCAI.NPCAIGlobalSettings
// Size: 0x40 (Inherited: 0x30)
struct UNPCAIGlobalSettings : UDataAsset
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIGlobalSettings, "NPCAIGlobalSettings")

	float MoveCommandInvokeFrequencyLimit; // 0x30(0x4)
	float MoveCommandDestinationOffsetTolerance; // 0x34(0x4)
	float MoveCommandDestinationOffsetToleranceSq; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)

	// Object: Function MFNPCAI.NPCAIGlobalSettings.Get
	// Flags: [Final|Native|Static|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c59ad8
	// Params: [ Num(1) Size(0x8) ]
	static struct UNPCAIGlobalSettings* Get();
};

// Object: Class MFNPCAI.NPCAIGlobalSharedInfo
// Size: 0x270 (Inherited: 0x28)
struct UNPCAIGlobalSharedInfo : UObject
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIGlobalSharedInfo, "NPCAIGlobalSharedInfo")

	float TimeOfRunEQS_FindBackUpCoverPoint; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
	struct TMap<struct AActor*, struct FAIGlobalCacheActors> CacheActorsInWorld; // 0x30(0x50)
	struct TArray<struct FAIEnemyInfo> AIEnemyInfoList; // 0x80(0x10)
	bool bEnableAIPerceptionLines; // 0x90(0x1)
	uint8_t Pad_0x91[0x3]; // 0x91(0x3)
	float AITrackLOGLastAutoReleaseTime; // 0x94(0x4)
	struct TMap<struct FString, struct UAITrackLOGUnit*> AITrackLOGData; // 0x98(0x50)
	bool bAITrackEnabled; // 0xE8(0x1)
	uint8_t Pad_0xE9[0x7]; // 0xE9(0x7)
	struct TMap<EAITrackLOGType, struct FString> AITrackLOGTemplate; // 0xF0(0x50)
	uint8_t Pad_0x140[0x8]; // 0x140(0x8)
	struct TArray<struct AActor*> DSPoseUpdateWaitList; // 0x148(0x10)
	struct TArray<struct AActor*> DSLeanPoseUpdateWaitList; // 0x158(0x10)
	struct AActor* DSPoseUpdateCharacter; // 0x168(0x8)
	struct TArray<struct AActor*> DSIKUpdateWaitList; // 0x170(0x10)
	struct AActor* DSIKUpdateCharacter; // 0x180(0x8)
	struct TArray<struct FAIProtectTreasureBox> TreasureBoxInfos; // 0x188(0x10)
	struct TMap<struct UObject*, EAIProfileType> AIPropClassTypes; // 0x198(0x50)
	struct TMap<uint64_t, bool> CachedInvIDLimitedAIPickUp; // 0x1E8(0x50)
	struct AActor* LastBetrayPlayer; // 0x238(0x8)
	uint8_t Pad_0x240[0x14]; // 0x240(0x14)
	float EnemyUpdateInterval; // 0x254(0x4)
	float EnemyUpdatePosSize; // 0x258(0x4)
	float EnemyPathQuerySize; // 0x25C(0x4)
	uint8_t Pad_0x260[0x10]; // 0x260(0x10)
};

// Object: Class MFNPCAI.NPCAIGoalTarget
// Size: 0x40 (Inherited: 0x28)
struct UNPCAIGoalTarget : UObject
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIGoalTarget, "NPCAIGoalTarget")

	struct UNPCAIAttentionPoint* AttentionPoint; // 0x28(0x8)
	struct AAIController* AIOwner; // 0x30(0x8)
	uint8_t Pad_0x38[0x8]; // 0x38(0x8)

	// Object: Function MFNPCAI.NPCAIGoalTarget.SetZeroGoal
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5c770
	// Params: [ Num(0) Size(0x0) ]
	void SetZeroGoal();

	// Object: Function MFNPCAI.NPCAIGoalTarget.SetGoalTargetPoint
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5c9c0
	// Params: [ Num(1) Size(0x8) ]
	void SetGoalTargetPoint(struct UNPCAIAttentionPoint* InPoint);

	// Object: Function MFNPCAI.NPCAIGoalTarget.SetAIOwner
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5ca9c
	// Params: [ Num(1) Size(0x8) ]
	void SetAIOwner(struct AAIController* InOwner);

	// Object: Function MFNPCAI.NPCAIGoalTarget.PointLookComplete
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5c8cc
	// Params: [ Num(1) Size(0x4) ]
	void PointLookComplete(int32_t InLookingIndex);

	// Object: Function MFNPCAI.NPCAIGoalTarget.IsDanger
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5c828
	// Params: [ Num(1) Size(0x1) ]
	bool IsDanger();

	// Object: Function MFNPCAI.NPCAIGoalTarget.HaveZeroTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5c784
	// Params: [ Num(1) Size(0x1) ]
	bool HaveZeroTarget();

	// Object: Function MFNPCAI.NPCAIGoalTarget.HavePlaceTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5c7bc
	// Params: [ Num(1) Size(0x1) ]
	bool HavePlaceTarget();

	// Object: Function MFNPCAI.NPCAIGoalTarget.HaveMainTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5c894
	// Params: [ Num(1) Size(0x1) ]
	bool HaveMainTarget();

	// Object: Function MFNPCAI.NPCAIGoalTarget.GetPointType
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5c7f4
	// Params: [ Num(1) Size(0x1) ]
	ENPCPlaceForCheckType GetPointType();

	// Object: Function MFNPCAI.NPCAIGoalTarget.GetGoalTargetPoint
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5ca68
	// Params: [ Num(1) Size(0x8) ]
	struct UNPCAIAttentionPoint* GetGoalTargetPoint();

	// Object: Function MFNPCAI.NPCAIGoalTarget.GetCreatedTime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5c860
	// Params: [ Num(1) Size(0x4) ]
	float GetCreatedTime();

	// Object: Function MFNPCAI.NPCAIGoalTarget.ClearGoalTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5c9ac
	// Params: [ Num(0) Size(0x0) ]
	void ClearGoalTarget();

	// Object: Function MFNPCAI.NPCAIGoalTarget.CanCheckBody
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5c974
	// Params: [ Num(1) Size(0x1) ]
	bool CanCheckBody();
};

// Object: Class MFNPCAI.NPCAIGroupBaseRequest
// Size: 0xA8 (Inherited: 0x28)
struct UNPCAIGroupBaseRequest : UObject
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIGroupBaseRequest, "NPCAIGroupBaseRequest")

	int32_t RequestType; // 0x28(0x4)
	int32_t DynamicGroupId; // 0x2C(0x4)
	bool bOnlyInDynamicGroup; // 0x30(0x1)
	EAIGroupRequestPriority RequestPriority; // 0x31(0x1)
	bool bCanExecuteByMyself; // 0x32(0x1)
	uint8_t Pad_0x33[0x1]; // 0x33(0x1)
	int32_t MaxTakenCount; // 0x34(0x4)
	bool IsNeedAllCompleted; // 0x38(0x1)
	uint8_t Pad_0x39[0x3]; // 0x39(0x3)
	int32_t CurrentTakenCount; // 0x3C(0x4)
	int32_t CurrentCompleteCount; // 0x40(0x4)
	int32_t MaxRequestCount; // 0x44(0x4)
	int32_t RequestTypeNeedCompletedInPast; // 0x48(0x4)
	float StartTimeOfTake; // 0x4C(0x4)
	float EndTimeOfTake; // 0x50(0x4)
	float EndTimeOfExecute; // 0x54(0x4)
	uint8_t Pad_0x58[0x8]; // 0x58(0x8)
	struct AActor* Requester; // 0x60(0x8)
	struct UObject* WorldContext; // 0x68(0x8)
	struct TArray<struct AActor*> ExecuterList; // 0x70(0x10)
	struct TArray<struct AActor*> HistoryExecuterList; // 0x80(0x10)
	struct TArray<struct AActor*> PossibleExecuterList; // 0x90(0x10)
	uint8_t Pad_0xA0[0x8]; // 0xA0(0x8)

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.Take
	// Flags: [Native|Event|Public|BlueprintEvent]
	// Offset: 0x3c5d880
	// Params: [ Num(1) Size(0x8) ]
	void Take(struct AActor* InExecuter);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.SetRequestTypeNeedCompletedInPast
	// Flags: [Native|Event|Public|BlueprintEvent]
	// Offset: 0x3c5d930
	// Params: [ Num(1) Size(0x1) ]
	bool SetRequestTypeNeedCompletedInPast();

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.SetPossibleExecuterList
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c5cf3c
	// Params: [ Num(1) Size(0x10) ]
	void SetPossibleExecuterList(const struct TArray<struct AActor*>& InExecuterList);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.SetEndTimeOnTake
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5d26c
	// Params: [ Num(1) Size(0x4) ]
	void SetEndTimeOnTake(float InEndTime);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.SetEndTimeOnExecute
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5d1c4
	// Params: [ Num(1) Size(0x4) ]
	void SetEndTimeOnExecute(float InEndTime);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.RemoveFromExecuterList
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5ccc0
	// Params: [ Num(1) Size(0x8) ]
	void RemoveFromExecuterList(struct AActor* InExecuter);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.IsPossibleExecuter
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5d000
	// Params: [ Num(2) Size(0x9) ]
	bool IsPossibleExecuter(struct AActor* InExecuter);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.IsInHistoryExecuter
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5cdd4
	// Params: [ Num(2) Size(0x9) ]
	bool IsInHistoryExecuter(struct AActor* InExecuter);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.IsInExecuter
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5ce88
	// Params: [ Num(2) Size(0x9) ]
	bool IsInExecuter(struct AActor* InExecuter);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.IsGroupAsRequester
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5cbd8
	// Params: [ Num(1) Size(0x1) ]
	bool IsGroupAsRequester();

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.InitRequestType
	// Flags: [Native|Event|Public|BlueprintEvent]
	// Offset: 0x3c5d840
	// Params: [ Num(1) Size(0x1) ]
	bool InitRequestType();

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.InitRequestInfo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5d47c
	// Params: [ Num(4) Size(0x18) ]
	void InitRequestInfo(struct AActor* InRequester, int32_t InMaxTakenCount, float InEndOfTakeTime, struct UObject* InWorldContext);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.InitRequestByBluePrint
	// Flags: [Native|Event|Public|BlueprintEvent]
	// Offset: 0x3c5d800
	// Params: [ Num(1) Size(0x1) ]
	bool InitRequestByBluePrint();

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.GetStartTimeOfTake
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5d190
	// Params: [ Num(1) Size(0x4) ]
	float GetStartTimeOfTake();

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.GetRequestName
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5cc10
	// Params: [ Num(1) Size(0x10) ]
	struct FString GetRequestName();

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.GetRequester
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5cda0
	// Params: [ Num(1) Size(0x8) ]
	struct AActor* GetRequester();

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.GetExecuterList
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5cd68
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<struct AActor*> GetExecuterList();

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.GetEndTimeOfTake
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5d15c
	// Params: [ Num(1) Size(0x4) ]
	float GetEndTimeOfTake();

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.Dispose
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5ccac
	// Params: [ Num(0) Size(0x0) ]
	void Dispose();

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.CheckIsEndOfTake
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5d314
	// Params: [ Num(2) Size(0x5) ]
	bool CheckIsEndOfTake(float InCurrentRuntime);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.CheckIsEndOfExecute
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5d3c8
	// Params: [ Num(2) Size(0x5) ]
	bool CheckIsEndOfExecute(float InCurrentRuntime);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.CheckCanTakeRequestForLastRequestLimit
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5d5e4
	// Params: [ Num(2) Size(0x9) ]
	bool CheckCanTakeRequestForLastRequestLimit(struct AActor* InExecuter);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.CheckCanTakeRequestForGroupLimit
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5d698
	// Params: [ Num(2) Size(0x9) ]
	bool CheckCanTakeRequestForGroupLimit(struct AActor* InExecuter);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.CheckCanTakeRequestAllLimit
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5d74c
	// Params: [ Num(2) Size(0x9) ]
	bool CheckCanTakeRequestAllLimit(struct AActor* InExecuter);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.CheckCanTakeRequest
	// Flags: [Native|Event|Public|BlueprintEvent]
	// Offset: 0x3c5da2c
	// Params: [ Num(2) Size(0x9) ]
	bool CheckCanTakeRequest(struct AActor* InExecuter);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.CanRequest
	// Flags: [Native|Event|Public|BlueprintEvent]
	// Offset: 0x3c5dae8
	// Params: [ Num(1) Size(0x1) ]
	bool CanRequest();

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.CanProceed
	// Flags: [Native|Event|Public|BlueprintEvent]
	// Offset: 0x3c5d970
	// Params: [ Num(2) Size(0x9) ]
	bool CanProceed(struct AActor* InExecuter);

	// Object: Function MFNPCAI.NPCAIGroupBaseRequest.AddPossibleExecuter
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5d0b4
	// Params: [ Num(1) Size(0x8) ]
	void AddPossibleExecuter(struct AActor* InExecuter);
};

// Object: Class MFNPCAI.NPCAIGroupCustomRequest
// Size: 0xA8 (Inherited: 0xA8)
struct UNPCAIGroupCustomRequest : UNPCAIGroupBaseRequest
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIGroupCustomRequest, "NPCAIGroupCustomRequest")
};

// Object: Class MFNPCAI.NPCAISubSystemComponent
// Size: 0xF0 (Inherited: 0xE0)
struct UNPCAISubSystemComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAISubSystemComponent, "NPCAISubSystemComponent")

	struct ACharacter* OwnerPawn; // 0xE0(0x8)
	struct AAIController* OwnerController; // 0xE8(0x8)
};

// Object: Class MFNPCAI.NPCAIGroupRequestComponent
// Size: 0x140 (Inherited: 0xF0)
struct UNPCAIGroupRequestComponent : UNPCAISubSystemComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIGroupRequestComponent, "NPCAIGroupRequestComponent")

	bool bIsLogEnabled; // 0xF0(0x1)
	uint8_t Pad_0xF1[0x3]; // 0xF1(0x3)
	int32_t LastCompletedRequestType; // 0xF4(0x4)
	struct FMulticastInlineDelegate OnRequestCompleted; // 0xF8(0x10)
	struct FMulticastInlineDelegate OnRequestGiveUp; // 0x108(0x10)
	float NextSearchRequestTime; // 0x118(0x4)
	uint8_t Pad_0x11C[0x4]; // 0x11C(0x4)
	struct UNPCAIGroupBaseRequest* CurrentRequest; // 0x120(0x8)
	struct TArray<int32_t> CompletedRequestTypeList; // 0x128(0x10)
	struct UNPCAIGroupRequestController* GpRequestController; // 0x138(0x8)

	// Object: Function MFNPCAI.NPCAIGroupRequestComponent.Update
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5e088
	// Params: [ Num(0) Size(0x0) ]
	void Update();

	// Object: Function MFNPCAI.NPCAIGroupRequestComponent.TryToFindRequest
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5e09c
	// Params: [ Num(1) Size(0x1) ]
	bool TryToFindRequest();

	// Object: Function MFNPCAI.NPCAIGroupRequestComponent.TryGiveUpCurrentRequest
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5e060
	// Params: [ Num(0) Size(0x0) ]
	void TryGiveUpCurrentRequest();

	// Object: Function MFNPCAI.NPCAIGroupRequestComponent.TickCheckCurrentRequestIsValid
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5e04c
	// Params: [ Num(0) Size(0x0) ]
	void TickCheckCurrentRequestIsValid();

	// Object: Function MFNPCAI.NPCAIGroupRequestComponent.SetCurrentRequestCompleted
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5e074
	// Params: [ Num(0) Size(0x0) ]
	void SetCurrentRequestCompleted();

	// Object: Function MFNPCAI.NPCAIGroupRequestComponent.SetCurrentRequest
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5e23c
	// Params: [ Num(1) Size(0x8) ]
	void SetCurrentRequest(struct UNPCAIGroupBaseRequest* InRequest);

	// Object: Function MFNPCAI.NPCAIGroupRequestComponent.HasCompletedRequestInPast
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5df64
	// Params: [ Num(2) Size(0x5) ]
	bool HasCompletedRequestInPast(int32_t InRequestType);

	// Object: Function MFNPCAI.NPCAIGroupRequestComponent.GetGroupRequestController
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5e018
	// Params: [ Num(1) Size(0x8) ]
	struct UNPCAIGroupRequestController* GetGroupRequestController();

	// Object: Function MFNPCAI.NPCAIGroupRequestComponent.CheckCanReplaceHighPriorityRequest
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5e0d4
	// Params: [ Num(2) Size(0x9) ]
	bool CheckCanReplaceHighPriorityRequest(struct UNPCAIGroupBaseRequest* InNewRequest);

	// Object: Function MFNPCAI.NPCAIGroupRequestComponent.AcceptRequest
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5e188
	// Params: [ Num(2) Size(0x9) ]
	bool AcceptRequest(struct UNPCAIGroupBaseRequest* InRequest);
};

// Object: Class MFNPCAI.NPCAIGroupRequestController
// Size: 0x40 (Inherited: 0x28)
struct UNPCAIGroupRequestController : UObject
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIGroupRequestController, "NPCAIGroupRequestController")

	struct TArray<struct UNPCAIGroupBaseRequest*> GroupRequestsList; // 0x28(0x10)
	float LastTimeAutoFiltRequests; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)

	// Object: Function MFNPCAI.NPCAIGroupRequestController.TryAddRequest
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5ee54
	// Params: [ Num(2) Size(0x9) ]
	bool TryAddRequest(struct UNPCAIGroupBaseRequest* InRequest);

	// Object: Function MFNPCAI.NPCAIGroupRequestController.TryActivateRequestByGroup
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c5e534
	// Params: [ Num(8) Size(0x30) ]
	struct UNPCAIGroupBaseRequest* TryActivateRequestByGroup(struct UObject* InWorldContextObject, struct UNPCAIGroupBaseRequest* InRequestClass, int32_t InMaxExecuterCount, bool InIsNeedAllCompleted, bool InOnlyInDynamicGroup, bool InCanExecuteByMyself, const struct TArray<struct AActor*>& InPossibleExecuterList);

	// Object: Function MFNPCAI.NPCAIGroupRequestController.TryActivateRequestByClass
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c5e7a4
	// Params: [ Num(7) Size(0x30) ]
	struct UNPCAIGroupBaseRequest* TryActivateRequestByClass(struct AActor* InRequester, struct UNPCAIGroupBaseRequest* InRequestClass, int32_t InMaxExecuterCount, bool InIsNeedAllCompleted, bool InCanExecuteByMyself, const struct TArray<struct AActor*>& InPossibleExecuterList);

	// Object: Function MFNPCAI.NPCAIGroupRequestController.TryActivateRequest
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c5e9c4
	// Params: [ Num(7) Size(0x30) ]
	struct UNPCAIGroupBaseRequest* TryActivateRequest(struct AActor* InRequester, struct UNPCAIGroupBaseRequest* InRequestInstance, int32_t InMaxExecuterCount, bool InIsNeedAllCompleted, bool InCanExecuteByMyself, const struct TArray<struct AActor*>& InPossibleExecuterList);

	// Object: Function MFNPCAI.NPCAIGroupRequestController.TryActivateCustomRequest
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5e328
	// Params: [ Num(7) Size(0x28) ]
	struct UNPCAIGroupBaseRequest* TryActivateCustomRequest(struct AActor* InRequester, struct UNPCAIGroupCustomRequest* InRequest, struct AActor* PossibleExecuter, bool bResetSearchTime, bool InIsNeedAllCompleted, bool bCleanPendingRequest);

	// Object: Function MFNPCAI.NPCAIGroupRequestController.RequestGiveUpToDo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5ec8c
	// Params: [ Num(2) Size(0x10) ]
	void RequestGiveUpToDo(struct UNPCAIGroupBaseRequest* InRequest, struct AActor* InExecuter);

	// Object: Function MFNPCAI.NPCAIGroupRequestController.RequestCompletedToDo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5ed70
	// Params: [ Num(2) Size(0x10) ]
	void RequestCompletedToDo(struct UNPCAIGroupBaseRequest* InRequest, struct AActor* InExecuter);

	// Object: Function MFNPCAI.NPCAIGroupRequestController.RemoveRequestInList
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5efb0
	// Params: [ Num(1) Size(0x8) ]
	void RemoveRequestInList(struct UNPCAIGroupBaseRequest* InRequest);

	// Object: Function MFNPCAI.NPCAIGroupRequestController.RemoveAllByRequester
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5ef08
	// Params: [ Num(1) Size(0x8) ]
	void RemoveAllByRequester(struct AActor* InRequester);

	// Object: Function MFNPCAI.NPCAIGroupRequestController.GetGroupRequestsList
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5f108
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<struct UNPCAIGroupBaseRequest*> GetGroupRequestsList();

	// Object: Function MFNPCAI.NPCAIGroupRequestController.GetGroupRequestListByType
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c5f18c
	// Params: [ Num(3) Size(0x1C) ]
	int32_t GetGroupRequestListByType(int32_t InRequestType, struct TArray<struct UNPCAIGroupBaseRequest*>& OutRequestsList);

	// Object: Function MFNPCAI.NPCAIGroupRequestController.GetGroupRequestCountByType
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5f348
	// Params: [ Num(2) Size(0x8) ]
	int32_t GetGroupRequestCountByType(int32_t InRequestType);

	// Object: Function MFNPCAI.NPCAIGroupRequestController.GetGroupRequestCount
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5f3f8
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetGroupRequestCount();

	// Object: Function MFNPCAI.NPCAIGroupRequestController.GetGroupRequestByType
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5f298
	// Params: [ Num(2) Size(0x10) ]
	struct UNPCAIGroupBaseRequest* GetGroupRequestByType(int32_t InRequestType);

	// Object: Function MFNPCAI.NPCAIGroupRequestController.FindForMe
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5f058
	// Params: [ Num(2) Size(0x10) ]
	struct UNPCAIGroupBaseRequest* FindForMe(struct AActor* InExecuter);

	// Object: Function MFNPCAI.NPCAIGroupRequestController.FilterInValidRequest
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c5ebe4
	// Params: [ Num(1) Size(0x8) ]
	void FilterInValidRequest(struct UObject* WorldContext);
};

// Object: Class MFNPCAI.NPCAIHNavActor
// Size: 0x490 (Inherited: 0x300)
struct ANPCAIHNavActor : AActor
{
	DEFINE_UE_CLASS_HELPERS(ANPCAIHNavActor, "NPCAIHNavActor")

	struct FHNavSettings Settings; // 0x300(0x3C)
	uint8_t Pad_0x33C[0x4]; // 0x33C(0x4)
	struct TArray<struct FHNavGraph> Graphs; // 0x340(0x10)
	int32_t MinimumPartitionCount; // 0x350(0x4)
	uint8_t Pad_0x354[0x4]; // 0x354(0x4)
	struct TArray<uint8_t> PortalNodeFlags; // 0x358(0x10)
	uint8_t Pad_0x368[0xC0]; // 0x368(0xC0)
	struct FHNavSearchInfo SearchedInfo; // 0x428(0x60)
	uint8_t Pad_0x488[0x4]; // 0x488(0x4)
	bool bUseDefaultPathfinding; // 0x48C(0x1)
	bool bNewMaxPortalAdjacency; // 0x48D(0x1)
	uint8_t Pad_0x48E[0x2]; // 0x48E(0x2)
};

// Object: Class MFNPCAI.NPCAILaunchPad
// Size: 0x338 (Inherited: 0x300)
struct ANPCAILaunchPad : AActor
{
	DEFINE_UE_CLASS_HELPERS(ANPCAILaunchPad, "NPCAILaunchPad")

	struct USceneComponent* Root; // 0x300(0x8)
	struct UStaticMeshComponent* Launchpad; // 0x308(0x8)
	struct USphereComponent* TriggerVolume; // 0x310(0x8)
	struct UNavLinkComponent* NavLink; // 0x318(0x8)
	struct FVector Target; // 0x320(0xC)
	uint8_t Pad_0x32C[0x4]; // 0x32C(0x4)
	struct ACharacter* LaunchedCharacter; // 0x330(0x8)

	// Object: Function MFNPCAI.NPCAILaunchPad.OnTriggerBeginOverlap
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x3c61ef0
	// Params: [ Num(6) Size(0xB8) ]
	void OnTriggerBeginOverlap(struct UPrimitiveComponent* OverlappedComp, struct AActor* Other, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

	// Object: Function MFNPCAI.NPCAILaunchPad.CanTriggerLaunch
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x5d8cbc8
	// Params: [ Num(2) Size(0x9) ]
	bool CanTriggerLaunch(struct ACharacter* Other);

	// Object: Function MFNPCAI.NPCAILaunchPad.CalculateLaunchVelocity
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c620fc
	// Params: [ Num(2) Size(0x14) ]
	struct FVector CalculateLaunchVelocity(struct AActor* LaunchedActor);

	// Object: Function MFNPCAI.NPCAILaunchPad.BP_LaunchCharacter
	// Flags: [Event|Protected|BlueprintEvent]
	// Offset: 0x5d8cbc8
	// Params: [ Num(1) Size(0x8) ]
	void BP_LaunchCharacter(struct ACharacter* Character);
};

// Object: Class MFNPCAI.NPCAITestingRenderingComponent
// Size: 0x680 (Inherited: 0x680)
struct UNPCAITestingRenderingComponent : UPrimitiveComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAITestingRenderingComponent, "NPCAITestingRenderingComponent")
};

// Object: Class MFNPCAI.NPCAILocalNavigationRenderingComponent
// Size: 0x680 (Inherited: 0x680)
struct UNPCAILocalNavigationRenderingComponent : UNPCAITestingRenderingComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAILocalNavigationRenderingComponent, "NPCAILocalNavigationRenderingComponent")
};

// Object: Class MFNPCAI.NPCAINavSubsystemBase
// Size: 0x30 (Inherited: 0x30)
struct UNPCAINavSubsystemBase : UNPCAISubsystemBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavSubsystemBase, "NPCAINavSubsystemBase")

	// Object: Function MFNPCAI.NPCAINavSubsystemBase.IsNavTileDataPrepared
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c859e4
	// Params: [ Num(2) Size(0x9) ]
	static bool IsNavTileDataPrepared(struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAINavSubsystemBase.GetNavLinkById
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c85a90
	// Params: [ Num(3) Size(0x18) ]
	static struct ANPCAINavLinkProxy* GetNavLinkById(struct UObject* WorldContextObject, int32_t LinkId);
};

// Object: Class MFNPCAI.NPCAILocalNavigationSubsystem
// Size: 0xC8 (Inherited: 0x30)
struct UNPCAILocalNavigationSubsystem : UNPCAINavSubsystemBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAILocalNavigationSubsystem, "NPCAILocalNavigationSubsystem")

	float GridCellSize; // 0x30(0x4)
	uint8_t Pad_0x34[0x34]; // 0x34(0x34)
	struct TMap<struct TWeakObjectPtr<struct UObject>, int32_t> CauserToGridId; // 0x68(0x50)
	struct FMulticastInlineDelegate OnNavigationGridUpdated; // 0xB8(0x10)

	// Object: Function MFNPCAI.NPCAILocalNavigationSubsystem.SetCellSize
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c62bf4
	// Params: [ Num(2) Size(0x5) ]
	bool SetCellSize(float CellSize);

	// Object: Function MFNPCAI.NPCAILocalNavigationSubsystem.RemoveGridById
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c623d8
	// Params: [ Num(3) Size(0xC) ]
	int32_t RemoveGridById(int32_t GridId, bool bUpdate);

	// Object: Function MFNPCAI.NPCAILocalNavigationSubsystem.RemoveGridByCauser
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c622e0
	// Params: [ Num(3) Size(0x10) ]
	int32_t RemoveGridByCauser(struct UObject* Causer, bool bUpdate);

	// Object: Function MFNPCAI.NPCAILocalNavigationSubsystem.RemoveAllGrids
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c622cc
	// Params: [ Num(0) Size(0x0) ]
	void RemoveAllGrids();

	// Object: DelegateFunction MFNPCAI.NPCAILocalNavigationSubsystem.OnNavigationGridUpdated__DelegateSignature
	// Flags: [MulticastDelegate|Public|Delegate]
	// Offset: 0x5d8cbc8
	// Params: [ Num(0) Size(0x0) ]
	void OnNavigationGridUpdated__DelegateSignature();

	// Object: Function MFNPCAI.NPCAILocalNavigationSubsystem.CreateGridForPoints
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c629d8
	// Params: [ Num(7) Size(0x30) ]
	int32_t CreateGridForPoints(struct UObject* Causer, ENPCAICellGridValue CellGridValue, const struct TArray<struct FVector>& Locations, float Padding2D, float Height, bool bRebuildGrids);

	// Object: Function MFNPCAI.NPCAILocalNavigationSubsystem.CreateGridForCapsule
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c624cc
	// Params: [ Num(9) Size(0x30) ]
	int32_t CreateGridForCapsule(struct UObject* Causer, ENPCAICellGridValue CellGridValue, const struct FVector& Location, float CapsuleRadius, float CapsuleHalfHeight, float Padding2D, float Height, bool bRebuildGrids);

	// Object: Function MFNPCAI.NPCAILocalNavigationSubsystem.CreateGridForBox
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6274c
	// Params: [ Num(9) Size(0x40) ]
	int32_t CreateGridForBox(struct UObject* Causer, ENPCAICellGridValue CellGridValue, const struct FVector& Location, const struct FVector& Extent, struct FRotator Rotation, float Padding2D, float Height, bool bRebuildGrids);
};

// Object: Class MFNPCAI.NPCAITestingActor
// Size: 0x340 (Inherited: 0x300)
struct ANPCAITestingActor : AActor
{
	DEFINE_UE_CLASS_HELPERS(ANPCAITestingActor, "NPCAITestingActor")

	struct UCapsuleComponent* CapsuleComponent; // 0x300(0x8)
	struct FNavAgentProperties NavAgentProps; // 0x308(0x30)
	bool bEnableDrawing; // 0x338(0x1)
	uint8_t Pad_0x339[0x3]; // 0x339(0x3)
	float DrawDistanceLimit; // 0x33C(0x4)
};

// Object: Class MFNPCAI.NPCAILocalNavigationTestingActor
// Size: 0x3A0 (Inherited: 0x340)
struct ANPCAILocalNavigationTestingActor : ANPCAITestingActor
{
	DEFINE_UE_CLASS_HELPERS(ANPCAILocalNavigationTestingActor, "NPCAILocalNavigationTestingActor")

	struct FColor EmptyCellColor; // 0x340(0x4)
	struct FColor BlockedCellColor; // 0x344(0x4)
	struct FVector CellTextOffset; // 0x348(0xC)
	bool bDrawNavGrids; // 0x354(0x1)
	bool bDrawCellId; // 0x355(0x1)
	bool bDrawCellCoords; // 0x356(0x1)
	bool bDrawCellZ; // 0x357(0x1)
	struct AActor* Destination; // 0x358(0x8)
	struct TArray<struct FVector> PathPoints; // 0x360(0x10)
	int32_t SelfCombinedGridId; // 0x370(0x4)
	uint8_t Pad_0x374[0x4]; // 0x374(0x4)
	struct TArray<int32_t> SelfSourceGridIds; // 0x378(0x10)
	struct FIntVector SelfGridSize; // 0x388(0xC)
	struct FIntVector SelfCoords; // 0x394(0xC)

	// Object: Function MFNPCAI.NPCAILocalNavigationTestingActor.OnNavigationGridUpdated
	// Flags: [Final|Native|Protected]
	// Offset: 0x3c62cf8
	// Params: [ Num(0) Size(0x0) ]
	void OnNavigationGridUpdated();
};

// Object: Class MFNPCAI.NPCAIMemorySystemComponent
// Size: 0x318 (Inherited: 0xF0)
struct UNPCAIMemorySystemComponent : UNPCAISubSystemComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIMemorySystemComponent, "NPCAIMemorySystemComponent")

	struct AAIController* AIOwner; // 0xF0(0x8)
	bool IsLockingGoalEnemy; // 0xF8(0x1)
	uint8_t Pad_0xF9[0x7]; // 0xF9(0x7)
	struct FMulticastInlineDelegate GoalEnemyChangedEvent; // 0x100(0x10)
	struct FMulticastInlineDelegate GoalProtectedPersonChangedEvent; // 0x110(0x10)
	struct UNPCAITargetInfo* GoalEnemy; // 0x120(0x8)
	struct UNPCAITargetInfo* LastEnemy; // 0x128(0x8)
	struct TWeakObjectPtr<struct ACharacter> GoalProtectedPerson; // 0x130(0x8)
	struct TWeakObjectPtr<struct ACharacter> LastGoalProtectedPerson; // 0x138(0x8)
	bool bAttentBeSeenByPlayer; // 0x140(0x1)
	bool bIsBeSeenByPlayer; // 0x141(0x1)
	uint8_t Pad_0x142[0x2]; // 0x142(0x2)
	float LastBeSeenTimeByPlayer; // 0x144(0x4)
	struct UNPCAIGoalTarget* GoalTarget; // 0x148(0x8)
	struct FVector CheckCoverPointPosition; // 0x150(0xC)
	int32_t CurrentCoverPointID; // 0x15C(0x4)
	struct FAIBackUpCoverPointFinder BackUpCoverPointFinder; // 0x160(0x1C)
	int32_t PeekCount; // 0x17C(0x4)
	uint8_t CallUpReason; // 0x180(0x1)
	uint8_t CallUpResult; // 0x181(0x1)
	uint8_t Pad_0x182[0x2]; // 0x182(0x2)
	int32_t ThrowSmokeNum; // 0x184(0x4)
	int32_t InSection; // 0x188(0x4)
	float LastMolotovHurttime; // 0x18C(0x4)
	float SightWeakenEndTime; // 0x190(0x4)
	bool bIsInTryLeanShoot; // 0x194(0x1)
	uint8_t Pad_0x195[0x3]; // 0x195(0x3)
	float PauseBehaviorEndTime; // 0x198(0x4)
	struct FAIStackGunRecord StackGunRecord; // 0x19C(0x44)
	struct TArray<int32_t> AcceptedSceneEvtUniqueIds; // 0x1E0(0x10)
	struct FAIRoundPathFindingNodes RoundPathNodes; // 0x1F0(0x80)
	struct AActor* TreasureBoxWantProtect; // 0x270(0x8)
	struct FVector Cache_AmbushAgainstStartPoint; // 0x278(0xC)
	struct FVector Cache_AmbushAgainstEndPoint; // 0x284(0xC)
	struct FVector Cache_AmbushAgainstResultPoint; // 0x290(0xC)
	struct FNPCAIQueryRoundEnvironmentResult Cache_QREResult; // 0x29C(0x5C)
	struct UActorComponent* AIStaticComponent; // 0x2F8(0x8)
	struct UAISceneEventsTriggerManager* AISceneEventsTriggerManager; // 0x300(0x8)
	struct UNPCAIPerceptionComponent* CachedPerceptionComponent; // 0x308(0x8)
	struct UNPCAIMoverSystemComponent* MoverSystemComponent; // 0x310(0x8)

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.UpdateRoundPathNodes
	// Flags: [Final|Native|Public]
	// Offset: 0x3c63148
	// Params: [ Num(0) Size(0x0) ]
	void UpdateRoundPathNodes();

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.SetStackGunRecord
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0x3c632b8
	// Params: [ Num(4) Size(0x1A) ]
	void SetStackGunRecord(const struct FVector& InMyPos, const struct FVector& InEnemyPos, const EAIPose& InPose, const EAILeanType& InLean);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.SetSightWeakenTime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c63680
	// Params: [ Num(1) Size(0x4) ]
	void SetSightWeakenTime(float WeakenTime);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.SetPauseBehaviorTime
	// Flags: [Final|Native|Public]
	// Offset: 0x3c63484
	// Params: [ Num(1) Size(0x4) ]
	void SetPauseBehaviorTime(float Time);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.SetLastCalculateBackUpCoverPointNearBy
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0x3c63914
	// Params: [ Num(1) Size(0xC) ]
	void SetLastCalculateBackUpCoverPointNearBy(const struct FVector& InEnemyPos);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.SetIsMolotovHurted
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c63728
	// Params: [ Num(1) Size(0x1) ]
	void SetIsMolotovHurted(bool bInHurted);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.SetIsInTryLeanShoot
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c63564
	// Params: [ Num(1) Size(0x1) ]
	void SetIsInTryLeanShoot(bool bTryLean);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.SetIsAttentBeSeenByPlayer
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c63cf0
	// Params: [ Num(1) Size(0x1) ]
	void SetIsAttentBeSeenByPlayer(bool bValue);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.SetGoalTarget
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c63e44
	// Params: [ Num(2) Size(0x10) ]
	static void SetGoalTarget(struct AActor* InOwner, struct UNPCAIAttentionPoint* InPoint);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.SetGoalEnemy
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c640ac
	// Params: [ Num(2) Size(0x10) ]
	static void SetGoalEnemy(struct AActor* InOwner, struct UNPCAITargetInfo* InEnemy);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.SetCurrentCoverPoint
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c63adc
	// Params: [ Num(2) Size(0xC) ]
	static void SetCurrentCoverPoint(struct AActor* InOwner, int32_t InCoverPointID);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.SetBeSeenByPlayer
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c63c24
	// Params: [ Num(1) Size(0x1) ]
	void SetBeSeenByPlayer(bool bValue);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.RemoveSceneEvent
	// Flags: [Final|Native|Public]
	// Offset: 0x3c6315c
	// Params: [ Num(1) Size(0x4) ]
	void RemoveSceneEvent(int32_t EventUniqueId);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.QueryPathLengthToPoint
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0x3c62ff4
	// Params: [ Num(4) Size(0x20) ]
	float QueryPathLengthToPoint(const struct FVector& ToPoint, const int64_t& PointPolyRef, bool bTryUpdatePathNodes);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.QueryNavPathPoints
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0x3c62d78
	// Params: [ Num(3) Size(0x21) ]
	bool QueryNavPathPoints(const struct FVector& ToPoint, struct TArray<struct FVector>& Paths);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.PointIsAroundAI
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0x3c62e9c
	// Params: [ Num(4) Size(0x1A) ]
	bool PointIsAroundAI(const struct FVector& ToPoint, const int64_t& PointPolyRef, bool bTryUpdatePathNodes);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.IsSightWeaken
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c63614
	// Params: [ Num(1) Size(0x1) ]
	bool IsSightWeaken();

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.IsInCover
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c63bb4
	// Params: [ Num(1) Size(0x1) ]
	bool IsInCover();

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.IsGoalEnemyThreaten
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c63f18
	// Params: [ Num(2) Size(0x5) ]
	bool IsGoalEnemyThreaten(float ThreatenDistance);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.IsBeSeenByPlayer
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c63bec
	// Params: [ Num(1) Size(0x1) ]
	bool IsBeSeenByPlayer();

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.IsAttentBeSeenByPlayer
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c63cd4
	// Params: [ Num(1) Size(0x1) ]
	bool IsAttentBeSeenByPlayer();

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.HasGoldEnemyOrTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c63fcc
	// Params: [ Num(1) Size(0x1) ]
	bool HasGoldEnemyOrTarget();

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.GetSightWeakenEndTime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6364c
	// Params: [ Num(1) Size(0x4) ]
	float GetSightWeakenEndTime();

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.GetPauseBehaviorEndTime
	// Flags: [Final|Native|Public]
	// Offset: 0x3c63450
	// Params: [ Num(1) Size(0x4) ]
	float GetPauseBehaviorEndTime();

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.GetLastBeSeenTimeByPlayer
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c63c08
	// Params: [ Num(1) Size(0x4) ]
	float GetLastBeSeenTimeByPlayer();

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.GetIsMolotovHurted
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c637d8
	// Params: [ Num(1) Size(0x1) ]
	bool GetIsMolotovHurted();

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.GetIsInTryLeanShoot
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6352c
	// Params: [ Num(1) Size(0x1) ]
	bool GetIsInTryLeanShoot();

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.GetGoalTarget
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c63d9c
	// Params: [ Num(2) Size(0x10) ]
	static struct UNPCAIGoalTarget* GetGoalTarget(struct AActor* InOwner);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.GetGoalEnemy
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c64004
	// Params: [ Num(2) Size(0x10) ]
	static struct UNPCAITargetInfo* GetGoalEnemy(struct AActor* InOwner);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.GetCurrentCoverPoint
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c639c4
	// Params: [ Num(3) Size(0x59) ]
	static bool GetCurrentCoverPoint(struct AActor* InOwner, struct FCoverPointOctreeData& Out_CoverPoint);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.GetCachedPerceptionComponent
	// Flags: [Final|Native|Protected]
	// Offset: 0x3c62d44
	// Params: [ Num(1) Size(0x8) ]
	struct UNPCAIPerceptionComponent* GetCachedPerceptionComponent();

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.CanCalculateBackUpCoverPointNearBy
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults]
	// Offset: 0x3c63810
	// Params: [ Num(3) Size(0x11) ]
	bool CanCalculateBackUpCoverPointNearBy(const struct FVector& InEnemyPos, float InRadiusNoCheck);

	// Object: Function MFNPCAI.NPCAIMemorySystemComponent.AcceptSceneEvent
	// Flags: [Final|Native|Public]
	// Offset: 0x3c63204
	// Params: [ Num(2) Size(0x5) ]
	bool AcceptSceneEvent(int32_t EventUniqueId);
};

// Object: Class MFNPCAI.NPCAIPropertyProfileBase
// Size: 0x38 (Inherited: 0x28)
struct UNPCAIPropertyProfileBase : UObject
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIPropertyProfileBase, "NPCAIPropertyProfileBase")

	struct UNPCAIProfileBaseComponent* PropertyComponentClass; // 0x28(0x8)
	EAIProfileType AIProfileType; // 0x30(0x1)
	uint8_t Pad_0x31[0x7]; // 0x31(0x7)
};

// Object: Class MFNPCAI.NPCAIModifierProfile
// Size: 0x38 (Inherited: 0x38)
struct UNPCAIModifierProfile : UNPCAIPropertyProfileBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIModifierProfile, "NPCAIModifierProfile")
};

// Object: Class MFNPCAI.AIModifierAIDataProfile
// Size: 0x38 (Inherited: 0x38)
struct UAIModifierAIDataProfile : UNPCAIModifierProfile
{
	DEFINE_UE_CLASS_HELPERS(UAIModifierAIDataProfile, "AIModifierAIDataProfile")

	float DamageScale; // 0x34(0x4)
};

// Object: Class MFNPCAI.NPCAIProfileBaseComponent
// Size: 0x38 (Inherited: 0x28)
struct UNPCAIProfileBaseComponent : UObject
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIProfileBaseComponent, "NPCAIProfileBaseComponent")

	struct UNPCAIPropertyProfileBase* PropertyProfile; // 0x28(0x8)
	struct AActor* Owner; // 0x30(0x8)

	// Object: Function MFNPCAI.NPCAIProfileBaseComponent.SetProfile
	// Flags: [Native|Public]
	// Offset: 0x3c8e000
	// Params: [ Num(1) Size(0x8) ]
	void SetProfile(struct UNPCAIPropertyProfileBase* InPropertyProfile);

	// Object: Function MFNPCAI.NPCAIProfileBaseComponent.GetTimeSeconds
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c8e0b0
	// Params: [ Num(1) Size(0x4) ]
	float GetTimeSeconds();

	// Object: Function MFNPCAI.NPCAIProfileBaseComponent.GetOwner
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c8e0e4
	// Params: [ Num(1) Size(0x8) ]
	struct AActor* GetOwner();
};

// Object: Class MFNPCAI.NPCAIModifierComponent
// Size: 0x38 (Inherited: 0x38)
struct UNPCAIModifierComponent : UNPCAIProfileBaseComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIModifierComponent, "NPCAIModifierComponent")
};

// Object: Class MFNPCAI.NPCAIModifierComponent_AIData
// Size: 0x38 (Inherited: 0x38)
struct UNPCAIModifierComponent_AIData : UNPCAIModifierComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIModifierComponent_AIData, "NPCAIModifierComponent_AIData")

	// Object: Function MFNPCAI.NPCAIModifierComponent_AIData.SetDamageScale
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c67620
	// Params: [ Num(1) Size(0x4) ]
	void SetDamageScale(float InDamageScale);

	// Object: Function MFNPCAI.NPCAIModifierComponent_AIData.GetDamageScale
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c675ec
	// Params: [ Num(1) Size(0x4) ]
	float GetDamageScale();
};

// Object: Class MFNPCAI.AIModifierAITypeProfile
// Size: 0x38 (Inherited: 0x38)
struct UAIModifierAITypeProfile : UNPCAIModifierProfile
{
	DEFINE_UE_CLASS_HELPERS(UAIModifierAITypeProfile, "AIModifierAITypeProfile")

	EAIMainType AIMainType; // 0x31(0x1)
};

// Object: Class MFNPCAI.NPCAIModifierComponent_AIType
// Size: 0x38 (Inherited: 0x38)
struct UNPCAIModifierComponent_AIType : UNPCAIModifierComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIModifierComponent_AIType, "NPCAIModifierComponent_AIType")
};

// Object: Class MFNPCAI.AIModifierArmorProfile
// Size: 0x38 (Inherited: 0x38)
struct UAIModifierArmorProfile : UNPCAIModifierProfile
{
	DEFINE_UE_CLASS_HELPERS(UAIModifierArmorProfile, "AIModifierArmorProfile")
};

// Object: Class MFNPCAI.NPCAIModifierComponent_Armor
// Size: 0x38 (Inherited: 0x38)
struct UNPCAIModifierComponent_Armor : UNPCAIModifierComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIModifierComponent_Armor, "NPCAIModifierComponent_Armor")
};

// Object: Class MFNPCAI.AIModifierDamageProfile
// Size: 0x38 (Inherited: 0x38)
struct UAIModifierDamageProfile : UNPCAIModifierProfile
{
	DEFINE_UE_CLASS_HELPERS(UAIModifierDamageProfile, "AIModifierDamageProfile")
};

// Object: Class MFNPCAI.NPCAIModifierComponent_Damage
// Size: 0x38 (Inherited: 0x38)
struct UNPCAIModifierComponent_Damage : UNPCAIModifierComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIModifierComponent_Damage, "NPCAIModifierComponent_Damage")
};

// Object: Class MFNPCAI.NPCAIMoverSystemComponent
// Size: 0x310 (Inherited: 0xF0)
struct UNPCAIMoverSystemComponent : UNPCAISubSystemComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIMoverSystemComponent, "NPCAIMoverSystemComponent")

	bool bAllowStrafe; // 0xF0(0x1)
	bool bAllowPartialPath; // 0xF1(0x1)
	uint8_t Pad_0xF2[0x2]; // 0xF2(0x2)
	float AcceptableRadius; // 0xF4(0x4)
	float OffsetFromCornersDistance; // 0xF8(0x4)
	float DisposableOffsetFromCornersDistance; // 0xFC(0x4)
	uint8_t Pad_0x100[0x4]; // 0x100(0x4)
	bool bReachTestIncludesAgentRadius; // 0x104(0x1)
	bool bReachTestIncludesGoalRadius; // 0x105(0x1)
	bool bProjectGoalLocation; // 0x106(0x1)
	uint8_t Pad_0x107[0x1]; // 0x107(0x1)
	bool bHandleLandedDelegate; // 0x108(0x1)
	bool bEnableMoverSystem; // 0x109(0x1)
	ENPCAIMovementKind MovementKind; // 0x10A(0x1)
	bool bCanGotoCloseOtherAI; // 0x10B(0x1)
	bool bMarkImportantIfPassDoor; // 0x10C(0x1)
	uint8_t Pad_0x10D[0x13]; // 0x10D(0x13)
	struct TArray<struct AVolume*> AvoidVolumes; // 0x120(0x10)
	uint8_t Pad_0x130[0x44]; // 0x130(0x44)
	struct FVector DirCurPoint; // 0x174(0xC)
	ENPCAIMoveResult LastMoveResult; // 0x180(0x1)
	uint8_t Pad_0x181[0x2B]; // 0x181(0x2B)
	float CurrentSprintEngery; // 0x1AC(0x4)
	struct UNPCAIPropertyComponent_Move* MoveProperty; // 0x1B0(0x8)
	struct UNPCAIGlobalSharedInfo* SharedInfo; // 0x1B8(0x8)
	struct FAILocationMonitor LocationMonitor; // 0x1C0(0x30)
	uint8_t Pad_0x1F0[0x24]; // 0x1F0(0x24)
	struct TWeakObjectPtr<struct AActor> CaredActorWhenMoving; // 0x214(0x8)
	float CaredActorEffectRadius; // 0x21C(0x4)
	struct FVector BlendingVelocity; // 0x220(0xC)
	int32_t CheckPointCountOnPath; // 0x22C(0x4)
	struct FMulticastInlineDelegate OnAIPathChecked; // 0x230(0x10)
	struct FMulticastInlineDelegate OnAIGoDirectlyFinished; // 0x240(0x10)
	struct FMulticastInlineDelegate OnOutOfNavmesh; // 0x250(0x10)
	uint8_t Pad_0x260[0x10]; // 0x260(0x10)
	bool bUseFlanking; // 0x270(0x1)
	uint8_t Pad_0x271[0x3]; // 0x271(0x3)
	struct FVector DangerPoint; // 0x274(0xC)
	struct FVector DangerPointDirection; // 0x280(0xC)
	float DangerPointEffectRadius; // 0x28C(0x4)
	uint8_t Pad_0x290[0x4]; // 0x290(0x4)
	float MaxTurnDistance; // 0x294(0x4)
	float MinTurnDistance; // 0x298(0x4)
	float DistanceCheck; // 0x29C(0x4)
	float SwayWidthCheck; // 0x2A0(0x4)
	float SwayWidth; // 0x2A4(0x4)
	float RandSwayWidthRate; // 0x2A8(0x4)
	float PathOffset; // 0x2AC(0x4)
	int32_t SampleTimes; // 0x2B0(0x4)
	int32_t RegionWhereNavLinksNeedDisable; // 0x2B4(0x4)
	struct UActorComponent* AIDoorOpenerComponent; // 0x2B8(0x8)
	struct UActorComponent* AIPoseComponent; // 0x2C0(0x8)
	int32_t Blending_Count; // 0x2C8(0x4)
	float Blending_Time; // 0x2CC(0x4)
	uint8_t Pad_0x2D0[0x40]; // 0x2D0(0x40)

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.SetupRegionWhereNavLinksNeedDisable
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c67a68
	// Params: [ Num(1) Size(0x4) ]
	void SetupRegionWhereNavLinksNeedDisable(int32_t RegionIndex);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.SetupFlanking
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c67b10
	// Params: [ Num(3) Size(0x1C) ]
	void SetupFlanking(const struct FVector& InDangerPoint, const struct FVector& InDangerPointDirection, float InDangerPointEffectRadius);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.SetIgnoreGotoPoint
	// Flags: [Final|Native|Public]
	// Offset: 0x3c68240
	// Params: [ Num(1) Size(0x4) ]
	void SetIgnoreGotoPoint(float IgnoreTime);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.SetDisposableOffsetFromCornersDistance
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c67c50
	// Params: [ Num(1) Size(0x4) ]
	void SetDisposableOffsetFromCornersDistance(float OffsetDistance);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.SetDestination
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c686b8
	// Params: [ Num(1) Size(0xC) ]
	void SetDestination(struct FVector InPosition);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.SetCurrentMoveType
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c687d0
	// Params: [ Num(1) Size(0x1) ]
	void SetCurrentMoveType(EAIMoveType InMoveType);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.SetAvoidVolumes
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6846c
	// Params: [ Num(1) Size(0x10) ]
	void SetAvoidVolumes(struct TArray<struct AVolume*> Volumes);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.PauseMovement
	// Flags: [Final|Native|Public]
	// Offset: 0x3c68320
	// Params: [ Num(1) Size(0x4) ]
	void PauseMovement(float PauseTime);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.OnMovementModeChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0x3c67fe8
	// Params: [ Num(3) Size(0xA) ]
	void OnMovementModeChanged(struct ACharacter* MovedCharacter, uint8_t PrevMovementMode, uint8_t PreviousCustomMode);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.OnMoveCompleted
	// Flags: [Final|Native|Protected]
	// Offset: 0x3c67efc
	// Params: [ Num(2) Size(0x5) ]
	void OnMoveCompleted(struct FAIRequestID RequestID, uint8_t MovementResult);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.OnLanded
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x3c67e34
	// Params: [ Num(1) Size(0x98) ]
	void OnLanded(const struct FHitResult& Hit);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.IsSprintEnergyEnough
	// Flags: [Final|Native|Protected|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c67d40
	// Params: [ Num(2) Size(0x2) ]
	bool IsSprintEnergyEnough(bool bSprinting);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.IsPauseMovement
	// Flags: [Final|Native|Public]
	// Offset: 0x3c682e8
	// Params: [ Num(1) Size(0x1) ]
	bool IsPauseMovement();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.IsMovingMayBlocking
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c683c8
	// Params: [ Num(1) Size(0x1) ]
	bool IsMovingMayBlocking();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.IsLastPathPassDoor
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c68208
	// Params: [ Num(1) Size(0x1) ]
	bool IsLastPathPassDoor();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.IsLastMoveSuccess
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c68400
	// Params: [ Num(1) Size(0x1) ]
	bool IsLastMoveSuccess();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.IsInIgnoreGotoPoint
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c68110
	// Params: [ Num(1) Size(0x1) ]
	bool IsInIgnoreGotoPoint();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.IsGoalPositionReached
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c68934
	// Params: [ Num(1) Size(0x1) ]
	bool IsGoalPositionReached();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.IsComeTo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c68878
	// Params: [ Num(2) Size(0x2) ]
	bool IsComeTo(bool OnCover);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.IsCloseToDestination
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c68604
	// Params: [ Num(2) Size(0x5) ]
	bool IsCloseToDestination(float InRadius);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.IsAnyLegBroken
	// Flags: [Final|Native|Protected|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c67dfc
	// Params: [ Num(1) Size(0x1) ]
	bool IsAnyLegBroken();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.GoDirectly
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c67930
	// Params: [ Num(3) Size(0x1C) ]
	void GoDirectly(const struct FVector& Direction, float Seconds, const struct FVector& InBlendingVelocity);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.GoAccordingToWayPoints
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c677f0
	// Params: [ Num(2) Size(0x39) ]
	void GoAccordingToWayPoints(const struct FNavSkeletonGraphFindResult& PathResult, const struct FNavSkeletonMoveSettings& Settings);

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.GetNearestDoorState
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c681bc
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetNearestDoorState();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.GetNearestDoorLocation
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c6817c
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetNearestDoorLocation();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.GetMoveType
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6879c
	// Params: [ Num(1) Size(0x1) ]
	EAIMoveType GetMoveType();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.GetMoveProperty
	// Flags: [Final|Native|Protected|Const]
	// Offset: 0x3c67cf8
	// Params: [ Num(1) Size(0x8) ]
	struct UNPCAIPropertyComponent_Move* GetMoveProperty();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.GetMovementKind
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c68148
	// Params: [ Num(1) Size(0x1) ]
	ENPCAIMovementKind GetMovementKind();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.GetLastMoveResult
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c68438
	// Params: [ Num(1) Size(0x1) ]
	ENPCAIMoveResult GetLastMoveResult();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.GetFromPosition
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c685c8
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetFromPosition();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.GetDirCurPoint
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c68570
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetDirCurPoint();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.GetDestinationUpdateTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c685ac
	// Params: [ Num(1) Size(0x4) ]
	float GetDestinationUpdateTime();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.GetDestination
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c68760
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetDestination();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.ClearMovement
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0x3c67d2c
	// Params: [ Num(0) Size(0x0) ]
	void ClearMovement();

	// Object: Function MFNPCAI.NPCAIMoverSystemComponent.ClearLastPathPassDoorFlag
	// Flags: [Final|Native|Public]
	// Offset: 0x3c681f0
	// Params: [ Num(0) Size(0x0) ]
	void ClearLastPathPassDoorFlag();
};

// Object: Class MFNPCAI.NPCAIMultiTargetSystemComponent
// Size: 0x1B0 (Inherited: 0xF0)
struct UNPCAIMultiTargetSystemComponent : UNPCAISubSystemComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIMultiTargetSystemComponent, "NPCAIMultiTargetSystemComponent")

	bool bDebugSuspectedPoint; // 0xF0(0x1)
	bool bDebugShootOffsetScope; // 0xF1(0x1)
	uint8_t Pad_0xF2[0x2]; // 0xF2(0x2)
	float TimeOfShootOffsetScopeDraw; // 0xF4(0x4)
	bool bDebugShootScopeTestPoints; // 0xF8(0x1)
	bool bWantCalculateGoalTargetPoint; // 0xF9(0x1)
	bool bWantCalculateGoalEnemy; // 0xFA(0x1)
	uint8_t Pad_0xFB[0x5]; // 0xFB(0x5)
	struct UNPCAIZoneGroupInfo* ZoneGroupInfo; // 0x100(0x8)
	int32_t DynamicGroupId; // 0x108(0x4)
	uint8_t Pad_0x10C[0x4]; // 0x10C(0x4)
	struct TArray<struct UNPCAITargetInfo*> AllTargetInfoList; // 0x110(0x10)
	float LastChangeEnemyTime; // 0x120(0x4)
	float LastWantCalcEnemyTime; // 0x124(0x4)
	struct TWeakObjectPtr<struct ACharacter> WarningScavPlayerPtr; // 0x128(0x8)
	struct TArray<struct FAICaredVehicleInfo> AICaredVehicles; // 0x130(0x10)
	uint8_t Pad_0x140[0x10]; // 0x140(0x10)
	struct UNPCAIMemorySystemComponent* MemoryComponent; // 0x150(0x8)
	struct UNPCAIPerceptionComponent* PerceptionComponent; // 0x158(0x8)
	struct UActorComponent* AIStaticComponent; // 0x160(0x8)
	struct UNPCAIGlobalSharedInfo* SharedInfo; // 0x168(0x8)
	struct UNPCAIPropertyComponent_Mind* MindProps; // 0x170(0x8)
	struct UNPCAIPropertyComponent_Hearing* HearProps; // 0x178(0x8)
	struct UNPCAIPropertyComponent_Aiming* AimingProps; // 0x180(0x8)
	struct UNPCAIPropertyComponent_Health* HealthProps; // 0x188(0x8)
	struct UNPCAIPropertyComponent_Grenade* GrenadeProps; // 0x190(0x8)
	struct UNPCAIPropertyComponent_Damage* DamageProps; // 0x198(0x8)
	float CD_CHANGE_GOALENEMY_IF_BOTH_NOT_SEE; // 0x1A0(0x4)
	float CD_CHECK_CARED_VEHICLE; // 0x1A4(0x4)
	float TeamEnemyAsGoalEnemyRange; // 0x1A8(0x4)
	uint8_t Pad_0x1AC[0x4]; // 0x1AC(0x4)

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.WantToCalculateGoalEnemy
	// Flags: [Final|Native|Public]
	// Offset: 0x3c6a714
	// Params: [ Num(0) Size(0x0) ]
	void WantToCalculateGoalEnemy();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.UpdateGroupEnemyVisibleInfo
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6af94
	// Params: [ Num(3) Size(0x18) ]
	void UpdateGroupEnemyVisibleInfo(struct AActor* InEnemy, struct FVector InLastSeenPosition, float SeenTime);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.SwitchToTemporaryEnemy
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6a8c8
	// Params: [ Num(3) Size(0xD) ]
	bool SwitchToTemporaryEnemy(struct AActor* InNeutral, float InEndTime);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.SwitchEnemyToNeutral
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6aa70
	// Params: [ Num(2) Size(0x9) ]
	bool SwitchEnemyToNeutral(struct AActor* InEnemy);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.SwitchEnemyToAlly
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6a9bc
	// Params: [ Num(2) Size(0x9) ]
	bool SwitchEnemyToAlly(struct AActor* InEnemy);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.SetZoneGroupInfo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6b460
	// Params: [ Num(1) Size(0x8) ]
	void SetZoneGroupInfo(struct UNPCAIZoneGroupInfo* InGroupInfo);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.SetScavPlayerTeamAsGroupEnemy
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0x3c6a728
	// Params: [ Num(1) Size(0x8) ]
	void SetScavPlayerTeamAsGroupEnemy(struct AActor* InScavPlayer);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.SetKnowEnemySeenTimeAndPosition
	// Flags: [Final|Native|Public]
	// Offset: 0x3c6a7d8
	// Params: [ Num(2) Size(0x9) ]
	void SetKnowEnemySeenTimeAndPosition(struct AActor* InTargetPawn, bool bCanSeenSoon);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.SearchDangerPoint
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6a33c
	// Params: [ Num(1) Size(0x8) ]
	struct UNPCAIAttentionPoint* SearchDangerPoint();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.SearchDangerEnemy
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6a370
	// Params: [ Num(1) Size(0x8) ]
	struct UNPCAITargetInfo* SearchDangerEnemy();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.RemoveSuspectedPointByType
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c69e64
	// Params: [ Num(2) Size(0x10) ]
	void RemoveSuspectedPointByType(ENPCPlaceForCheckType InPlaceType, struct AActor* InCreator);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.RemoveSuspectedPoint
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c69f4c
	// Params: [ Num(2) Size(0x9) ]
	void RemoveSuspectedPoint(struct UNPCAIAttentionPoint* InAttentionPoint, bool bRemoveNearCanSee);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.RemoveNeutral
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6ac0c
	// Params: [ Num(1) Size(0x8) ]
	void RemoveNeutral(struct AActor* InNeutral);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.RemoveEnemy
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6b254
	// Params: [ Num(1) Size(0x8) ]
	void RemoveEnemy(struct AActor* InEnemy);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.RemoveAlly
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6ae44
	// Params: [ Num(1) Size(0x8) ]
	void RemoveAlly(struct AActor* InAlly);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.QuitToDynamicGroup
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6a414
	// Params: [ Num(0) Size(0x0) ]
	void QuitToDynamicGroup();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.JoinToDynamicGroup
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6a428
	// Params: [ Num(2) Size(0x5) ]
	bool JoinToDynamicGroup(int32_t DyGroupId);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.IsPointInVShootScope
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c696f4
	// Params: [ Num(7) Size(0x31) ]
	bool IsPointInVShootScope(const struct FVector& GunPoint, const struct FVector& ShootPoint, float HRadin, float VTopRadin, float VLowRadin, const struct FVector& InPoint);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.IsPointInHShootScope
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c69904
	// Params: [ Num(7) Size(0x31) ]
	bool IsPointInHShootScope(const struct FVector& GunPoint, const struct FVector& ShootPoint, float HRadin, float VTopRadin, float VLowRadin, const struct FVector& InPoint);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.IsNeutral
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6ab58
	// Params: [ Num(2) Size(0x9) ]
	bool IsNeutral(struct AActor* InNeutral);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.IsInSameZoneGroup
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6b3ac
	// Params: [ Num(2) Size(0x9) ]
	bool IsInSameZoneGroup(struct AActor* InTarget);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.IsGroupEnemy
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6b1a0
	// Params: [ Num(2) Size(0x9) ]
	bool IsGroupEnemy(struct AActor* InEnemy);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.IsAlly
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6ad90
	// Params: [ Num(2) Size(0x9) ]
	bool IsAlly(struct AActor* InAlly);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.HasOthersAllyInShootScope
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c696bc
	// Params: [ Num(1) Size(0x1) ]
	bool HasOthersAllyInShootScope();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.GetZoneGroupInfo
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c6b508
	// Params: [ Num(1) Size(0x8) ]
	struct UNPCAIZoneGroupInfo* GetZoneGroupInfo();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.GetYoungestSuspectedPoint
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6a204
	// Params: [ Num(4) Size(0x18) ]
	struct UNPCAIAttentionPoint* GetYoungestSuspectedPoint(struct AActor* InCharacter, float InRadius, bool InPriorityDanger);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.GetWarningScavPlayer
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6966c
	// Params: [ Num(1) Size(0x8) ]
	struct ACharacter* GetWarningScavPlayer();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.GetNeutralsNum
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6ab24
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetNeutralsNum();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.GetEnemyNum
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6b16c
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetEnemyNum();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.GetEnemyGroupInfo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6b0bc
	// Params: [ Num(2) Size(0x10) ]
	struct UNPCAIEnemyGroupSingleInfo* GetEnemyGroupInfo(struct AActor* InTarget);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.GetDynamicGroupId
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c6a3e0
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetDynamicGroupId();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.GetBulletFireDangerPower
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6b53c
	// Params: [ Num(5) Size(0x24) ]
	int32_t GetBulletFireDangerPower(bool IsHitNoise, struct FVector InNoisePosition, float InNoiseDistance, struct FVector InBulletVelocity);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.GetAllyNum
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6ad5c
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetAllyNum();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.GetAllTargetInfoList
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6b7e8
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<struct UNPCAITargetInfo*> GetAllTargetInfoList();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.GetAllInSightEnemys
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x3c6a58c
	// Params: [ Num(1) Size(0x10) ]
	void GetAllInSightEnemys(struct TArray<struct AActor*>& OutEnemys);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.GetAllHadSeenEnemys
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x3c6a650
	// Params: [ Num(1) Size(0x10) ]
	void GetAllHadSeenEnemys(struct TArray<struct AActor*>& OutEnemys);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.FilterNotValidEnemyOrPoints
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c69e50
	// Params: [ Num(0) Size(0x0) ]
	void FilterNotValidEnemyOrPoints();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.CheckNearScavPlayerBehavior
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c69e3c
	// Params: [ Num(0) Size(0x0) ]
	void CheckNearScavPlayerBehavior();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.CanHeardNoise
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c6b6b8
	// Params: [ Num(4) Size(0xD) ]
	bool CanHeardNoise(float InNoiseDistance, float InNoisePower, float InNoiseAttractScale);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.CalculateShootScope
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c69b14
	// Params: [ Num(10) Size(0x55) ]
	bool CalculateShootScope(struct FVector& GunPoint, struct FVector& ShootPoint, float& HRadian, float& VTopRadian, float& VLowRadian, struct FVector& HMaxPoint1, struct FVector& HMaxPoint2, struct FVector& VTopPoint, struct FVector& VLowPoint);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.CalculateGoalPointForBot
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6a3a4
	// Params: [ Num(0) Size(0x0) ]
	void CalculateGoalPointForBot();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.CalculateGoalForBot
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6a3cc
	// Params: [ Num(0) Size(0x0) ]
	void CalculateGoalForBot();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.CalculateGoalEnemyForBot
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6a3b8
	// Params: [ Num(0) Size(0x0) ]
	void CalculateGoalEnemyForBot();

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.AddSuspectedPointToSearch
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6a03c
	// Params: [ Num(6) Size(0x28) ]
	struct UNPCAIAttentionPoint* AddSuspectedPointToSearch(struct FVector InPoint, ENPCPlaceForCheckType InPlaceType, struct AActor* InCreator, bool bIsAutoReCalculate, bool bIsAddSuspectedNum);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.AddNeutral
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6acb4
	// Params: [ Num(1) Size(0x8) ]
	void AddNeutral(struct AActor* InNeutral);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.AddEnemy
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6b2fc
	// Params: [ Num(2) Size(0x10) ]
	struct UNPCAIEnemyGroupSingleInfo* AddEnemy(struct AActor* InEnemy);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.AddAllyGoalEnemyIfNotTarget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6a4dc
	// Params: [ Num(2) Size(0x10) ]
	struct UNPCAITargetInfo* AddAllyGoalEnemyIfNotTarget(float InRange);

	// Object: Function MFNPCAI.NPCAIMultiTargetSystemComponent.AddAlly
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6aeec
	// Params: [ Num(1) Size(0x8) ]
	void AddAlly(struct AActor* InAlly);
};

// Object: Class MFNPCAI.NPCAIMultiTargetSelectorComponent
// Size: 0x350 (Inherited: 0x1B0)
struct UNPCAIMultiTargetSelectorComponent : UNPCAIMultiTargetSystemComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIMultiTargetSelectorComponent, "NPCAIMultiTargetSelectorComponent")

	struct FString PerceptionTag1; // 0x1B0(0x10)
	struct FString PerceptionTag2; // 0x1C0(0x10)
	struct FString PerceptionTag3; // 0x1D0(0x10)
	float DistanceToPercActor; // 0x1E0(0x4)
	float DistanceToPercLoc; // 0x1E4(0x4)
	struct AActor* PerceptionActor; // 0x1E8(0x8)
	struct FAIStimulus PerceptionStimulus; // 0x1F0(0x3C)
	bool bIsTeamEnemy; // 0x22C(0x1)
	bool bIsTeamFriendly; // 0x22D(0x1)
	bool bIsGroupEnemy; // 0x22E(0x1)
	bool bIsGroupAlly; // 0x22F(0x1)
	bool bIsSounder; // 0x230(0x1)
	uint8_t Pad_0x231[0x7]; // 0x231(0x7)
	struct AActor* SounderThrower; // 0x238(0x8)
	bool bIsCheatGhost; // 0x240(0x1)
	uint8_t Pad_0x241[0x3]; // 0x241(0x3)
	float LastCalculateWarnPlayerTime; // 0x244(0x4)
	float LastCalculateGoalEnemyTime; // 0x248(0x4)
	float LastCalculateGoalPointTime; // 0x24C(0x4)
	float NextLeanAutoRelaxTime; // 0x250(0x4)
	float LastTodoHearingTime; // 0x254(0x4)
	struct TMap<uint32_t, float> NoiseAttractMap; // 0x258(0x50)
	uint8_t Pad_0x2A8[0x8]; // 0x2A8(0x8)
	struct AActor* LastFireToMePerson; // 0x2B0(0x8)
	float LastFireToMeTime; // 0x2B8(0x4)
	uint8_t Pad_0x2BC[0x4]; // 0x2BC(0x4)
	struct AActor* LastShootMePerson; // 0x2C0(0x8)
	struct FVector LastShootMePersonLocation; // 0x2C8(0xC)
	struct FVector LastShootMeSelfLocation; // 0x2D4(0xC)
	float LastShootMeDamageValue; // 0x2E0(0x4)
	float LastBeenShootTime; // 0x2E4(0x4)
	struct FAIShotCountStat BeHitCount; // 0x2E8(0x10)
	float TEMPORARY_ENEMY_DURATION_TIME; // 0x2F8(0x4)
	uint8_t Pad_0x2FC[0x54]; // 0x2FC(0x54)

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.SetBeHitDetail
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c68c44
	// Params: [ Num(3) Size(0x10) ]
	void SetBeHitDetail(struct AActor* DamageCauser, float DamageValue, float InTimeSec);

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.SeparateMultiTags
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6921c
	// Params: [ Num(1) Size(0x8) ]
	void SeparateMultiTags(struct FName InTotalTag);

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.OnSmokeExplosionToDo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6942c
	// Params: [ Num(0) Size(0x0) ]
	void OnSmokeExplosionToDo();

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.OnSightToDo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c69468
	// Params: [ Num(0) Size(0x0) ]
	void OnSightToDo();

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.OnPerceptionUpdated
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c6947c
	// Params: [ Num(2) Size(0x44) ]
	void OnPerceptionUpdated(struct AActor* InTarget, struct FAIStimulus InAIStimulus);

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.OnHearingToDo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c69454
	// Params: [ Num(0) Size(0x0) ]
	void OnHearingToDo();

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.OnDamageToDo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c69440
	// Params: [ Num(0) Size(0x0) ]
	void OnDamageToDo();

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.OnBulletFireToDo
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c692c4
	// Params: [ Num(4) Size(0x28) ]
	void OnBulletFireToDo(struct AActor* InInstigator, struct FVector InBulletLocation, struct FVector InBulletVelocity, struct FName InNoiseType);

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.MakeEnemyKnowImpl
	// Flags: [Final|Native|Public]
	// Offset: 0x3c68a7c
	// Params: [ Num(5) Size(0x13) ]
	void MakeEnemyKnowImpl(struct ACharacter* AIPawn, struct ACharacter* EnemyPawn, bool IsGroupEnemy, bool IsTeamFriendly, bool bAsRealSee);

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.IsGunNoise
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c69108
	// Params: [ Num(2) Size(0x11) ]
	bool IsGunNoise(struct FString InTag);

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.IsBeingFireHited
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c68e04
	// Params: [ Num(3) Size(0x11) ]
	bool IsBeingFireHited(float InTime, struct AActor*& OutWhoFire);

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.GetLastBeHitTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c68d9c
	// Params: [ Num(1) Size(0x4) ]
	float GetLastBeHitTime();

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.GetFuzzyPointCoef
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c68f04
	// Params: [ Num(2) Size(0x14) ]
	float GetFuzzyPointCoef(struct FString InHearTag);

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.GetFirstBeHitTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c68dd0
	// Params: [ Num(1) Size(0x4) ]
	float GetFirstBeHitTime();

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.GetBeHitCount
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c68d68
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetBeHitCount();

	// Object: Function MFNPCAI.NPCAIMultiTargetSelectorComponent.CreateFuzzyPoint
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c69010
	// Params: [ Num(3) Size(0x1C) ]
	struct FVector CreateFuzzyPoint(struct FVector InCenterPoint, float InFuzzyRadius);
};

// Object: Class MFNPCAI.NPCAINavConnectivitySystem
// Size: 0x30 (Inherited: 0x30)
struct UNPCAINavConnectivitySystem : UNPCAINavSubsystemBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavConnectivitySystem, "NPCAINavConnectivitySystem")

	// Object: Function MFNPCAI.NPCAINavConnectivitySystem.GetNavLinkCylinderLocation
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c6ddf0
	// Params: [ Num(4) Size(0x19) ]
	bool GetNavLinkCylinderLocation(struct ANPCAINavLinkProxy* NavLink, int32_t RegionIndex, struct FVector& OutLocation);

	// Object: Function MFNPCAI.NPCAINavConnectivitySystem.GetLinkUsageCount
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c6e13c
	// Params: [ Num(8) Size(0x30) ]
	int32_t GetLinkUsageCount(const struct FVector& SourceLocation, const struct FVector& TargetLocation, int32_t& OutSourceRegionIndex, int32_t& OutTargetRegionIndex, int32_t& OutSourceRegionSize, int32_t& OutTargetRegionSize, EGetLinkUsageCountStatus& OutStatus);

	// Object: Function MFNPCAI.NPCAINavConnectivitySystem.GetDoorNavLinksInRegion
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c6e054
	// Params: [ Num(2) Size(0x18) ]
	struct TArray<struct ANPCAINavLinkProxy*> GetDoorNavLinksInRegion(int32_t RegionIndex);

	// Object: Function MFNPCAI.NPCAINavConnectivitySystem.GetDoorNavLinksBetweenAdjacentRegions
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c6df2c
	// Params: [ Num(3) Size(0x18) ]
	struct TArray<struct ANPCAINavLinkProxy*> GetDoorNavLinksBetweenAdjacentRegions(int32_t SourceRegionIndex, int32_t TargetRegionIndex);
};

// Object: Class MFNPCAI.NPCAINavCostSubsystem
// Size: 0x30 (Inherited: 0x30)
struct UNPCAINavCostSubsystem : UNPCAINavSubsystemBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavCostSubsystem, "NPCAINavCostSubsystem")

	// Object: Function MFNPCAI.NPCAINavCostSubsystem.GetInstance
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c6e3e4
	// Params: [ Num(2) Size(0x10) ]
	static struct UNPCAINavCostSubsystem* GetInstance(struct UObject* WorldContextObject);
};

// Object: Class MFNPCAI.NPCAINavDebugSystem
// Size: 0x30 (Inherited: 0x30)
struct UNPCAINavDebugSystem : UNPCAINavSubsystemBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavDebugSystem, "NPCAINavDebugSystem")

	// Object: Function MFNPCAI.NPCAINavDebugSystem.TestDoorPath
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c6e660
	// Params: [ Num(3) Size(0x11) ]
	static bool TestDoorPath(struct UObject* WorldContextObject, struct ANPCAINavLinkProxy* NavLinkProxy);

	// Object: Function MFNPCAI.NPCAINavDebugSystem.ProjectPointToNavMesh
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6e748
	// Params: [ Num(6) Size(0x31) ]
	static bool ProjectPointToNavMesh(struct UObject* WorldContextObject, const struct FVector& Location, const struct FVector& QueryExtent, int32_t& OutPolyIndex, struct FVector& OutProjectedLocation);

	// Object: Function MFNPCAI.NPCAINavDebugSystem.PrintNavMeshPolygonSlope
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6ebfc
	// Params: [ Num(2) Size(0x14) ]
	static void PrintNavMeshPolygonSlope(struct UObject* WorldContextObject, const struct FVector& Location);

	// Object: Function MFNPCAI.NPCAINavDebugSystem.PlaceActorsOnNodes
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c6e9b8
	// Params: [ Num(4) Size(0x30) ]
	static void PlaceActorsOnNodes(struct UObject* WorldContextObject, struct FString NodeIndicesString, bool bUseNodeIndexAsPolyRef, struct TArray<struct AActor*>& OutActors);

	// Object: Function MFNPCAI.NPCAINavDebugSystem.IsLocationOnNavLinkDebug
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6ecdc
	// Params: [ Num(2) Size(0x14) ]
	static void IsLocationOnNavLinkDebug(struct UObject* WorldContextObject, const struct FVector& Location);

	// Object: Function MFNPCAI.NPCAINavDebugSystem.GetLinkUsageCountDebug
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6edbc
	// Params: [ Num(3) Size(0x20) ]
	static void GetLinkUsageCountDebug(struct UObject* WorldContextObject, const struct FVector& SourceLocation, const struct FVector& TargetLocation);

	// Object: Function MFNPCAI.NPCAINavDebugSystem.GetDoorNavLinksInRegionDebug
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6eeec
	// Params: [ Num(2) Size(0x14) ]
	static void GetDoorNavLinksInRegionDebug(struct UObject* WorldContextObject, const struct FVector& SourceLocation);

	// Object: Function MFNPCAI.NPCAINavDebugSystem.DrawPathPoints
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c6e494
	// Params: [ Num(5) Size(0x1E) ]
	static void DrawPathPoints(struct UObject* WorldContextObject, const struct TArray<struct FVector>& PathPoints, int32_t StartIndex, bool bFlushBeforeDrawing, bool bColorfulDrawing);

	// Object: Function MFNPCAI.NPCAINavDebugSystem.DestroyPlacedActors
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c6eb48
	// Params: [ Num(1) Size(0x10) ]
	static void DestroyPlacedActors(struct TArray<struct AActor*>& OutActors);

	// Object: Function MFNPCAI.NPCAINavDebugSystem.CalculateBoundaryEdgeLength
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c6e920
	// Params: [ Num(1) Size(0x8) ]
	static void CalculateBoundaryEdgeLength(struct UObject* WorldContextObject);
};

// Object: Class MFNPCAI.NPCAINavExperimentSystem
// Size: 0x30 (Inherited: 0x30)
struct UNPCAINavExperimentSystem : UNPCAINavSubsystemBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavExperimentSystem, "NPCAINavExperimentSystem")

	// Object: Function MFNPCAI.NPCAINavExperimentSystem.TestRaycastToNavSkeletonPoints
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6f17c
	// Params: [ Num(4) Size(0x38) ]
	static struct TArray<bool> TestRaycastToNavSkeletonPoints(struct UObject* WorldContextObject, const struct FVector& StartLocation, const struct TArray<int32_t>& PointIDs);

	// Object: Function MFNPCAI.NPCAINavExperimentSystem.TestNavSkeletonFloodFrom
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6f010
	// Params: [ Num(4) Size(0x28) ]
	static struct TArray<bool> TestNavSkeletonFloodFrom(struct UObject* WorldContextObject, const struct FVector& StartLocation, float MaxPathLength);

	// Object: Function MFNPCAI.NPCAINavExperimentSystem.TestNavRaycast
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c6f430
	// Params: [ Num(1) Size(0x8) ]
	static void TestNavRaycast(struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAINavExperimentSystem.TestMoveDirectly
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c6f560
	// Params: [ Num(1) Size(0x8) ]
	static void TestMoveDirectly(struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAINavExperimentSystem.TestMoveAlongSurface
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c6f5f8
	// Params: [ Num(1) Size(0x8) ]
	static void TestMoveAlongSurface(struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAINavExperimentSystem.TestLimitMoveInRegion
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c6f300
	// Params: [ Num(1) Size(0x8) ]
	static void TestLimitMoveInRegion(struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAINavExperimentSystem.TestArrangeStandPositions
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c6f398
	// Params: [ Num(1) Size(0x8) ]
	static void TestArrangeStandPositions(struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAINavExperimentSystem.TestAIMoveDirectly
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c6f4c8
	// Params: [ Num(1) Size(0x8) ]
	static void TestAIMoveDirectly(struct UObject* WorldContextObject);
};

// Object: Class MFNPCAI.NPCAINavigationStatics
// Size: 0x28 (Inherited: 0x28)
struct UNPCAINavigationStatics : UBlueprintFunctionLibrary
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavigationStatics, "NPCAINavigationStatics")

	// Object: Function MFNPCAI.NPCAINavigationStatics.PointIsInNavigation
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6fd04
	// Params: [ Num(4) Size(0x21) ]
	static bool PointIsInNavigation(struct UObject* WorldContext, const struct FVector& InCheckPoint, const struct FVector& InExtent);

	// Object: Function MFNPCAI.NPCAINavigationStatics.PathNodesToNeighborPathNodes
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c70400
	// Params: [ Num(4) Size(0x30) ]
	static void PathNodesToNeighborPathNodes(struct UObject* WorldContext, const struct TArray<int32_t>& TargetPathNodes, int32_t Step, struct TArray<int32_t>& Result);

	// Object: Function MFNPCAI.NPCAINavigationStatics.PathNodesToDistAndNeighborPathNodes
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c701b8
	// Params: [ Num(6) Size(0x41) ]
	static void PathNodesToDistAndNeighborPathNodes(struct UObject* WorldContext, const struct TArray<int32_t>& TargetPathNodes, float PathLength, struct TArray<int32_t>& NodesInPathLength, struct TArray<int32_t>& NodesNeighbor, bool& IsTimeOut);

	// Object: Function MFNPCAI.NPCAINavigationStatics.IsNavigationPlanarFloor
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6fe40
	// Params: [ Num(5) Size(0x25) ]
	static bool IsNavigationPlanarFloor(struct UObject* WorldContext, const struct FVector& StartPoint, const struct FVector& Direction, float Distance);

	// Object: Function MFNPCAI.NPCAINavigationStatics.GetRandomReachablePoint
	// Flags: [Final|Native|Static|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6faa0
	// Params: [ Num(4) Size(0x24) ]
	static struct FVector GetRandomReachablePoint(struct UObject* WorldContext, struct FVector InCenter, float InRadius);

	// Object: Function MFNPCAI.NPCAINavigationStatics.GetRandomNavigationPoint
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6fbd0
	// Params: [ Num(4) Size(0x24) ]
	static struct FVector GetRandomNavigationPoint(struct UObject* WorldContext, const struct FVector& InCenter, float InRadius);

	// Object: Function MFNPCAI.NPCAINavigationStatics.GetRandomNavigationAndNearPoint
	// Flags: [Final|Native|Static|Public|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6f834
	// Params: [ Num(4) Size(0x24) ]
	static struct FVector GetRandomNavigationAndNearPoint(struct UObject* WorldContext, struct FVector InCenter, float InRadius);

	// Object: Function MFNPCAI.NPCAINavigationStatics.GetPointToNavigationLocation
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6f964
	// Params: [ Num(4) Size(0x2C) ]
	static struct FVector GetPointToNavigationLocation(struct UObject* WorldContext, const struct FVector& InCenter, const struct FVector& InExtent);

	// Object: Function MFNPCAI.NPCAINavigationStatics.FindPointIsAboveGround
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6f698
	// Params: [ Num(5) Size(0x38) ]
	static struct FVector FindPointIsAboveGround(struct UObject* WorldContext, const struct FVector& InPosition, const struct TArray<struct AActor*>& InIgnoreActors, float TraceLength);

	// Object: Function MFNPCAI.NPCAINavigationStatics.FindCloserToMePoints
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c6ffc4
	// Params: [ Num(5) Size(0x40) ]
	static void FindCloserToMePoints(struct UObject* WorldContext, const struct TArray<int32_t>& PathNodeIds, const struct FVector& MyLocation, const struct FVector& EnemyLocation, struct TArray<int32_t>& Result);
};

// Object: Class MFNPCAI.NPCAINavigationSystem
// Size: 0x18A0 (Inherited: 0x15F8)
struct UNPCAINavigationSystem : UNavigationSystemV1
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavigationSystem, "NPCAINavigationSystem")

	uint8_t Pad_0x15F8[0x2A8]; // 0x15F8(0x2A8)

	// Object: Function MFNPCAI.NPCAINavigationSystem.GetNPCAINavigationSystem
	// Flags: [Final|Native|Static|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c705c0
	// Params: [ Num(2) Size(0x10) ]
	static struct UNPCAINavigationSystem* GetNPCAINavigationSystem(struct UObject* WorldContextObject);
};

// Object: Class MFNPCAI.NPCAINavigationSystemConfig
// Size: 0x68 (Inherited: 0x50)
struct UNPCAINavigationSystemConfig : UNavigationSystemModuleConfig
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavigationSystemConfig, "NPCAINavigationSystemConfig")

	struct FSoftClassPath NavigationSystemClassName; // 0x50(0x18)
};

// Object: Class MFNPCAI.NPCAINavigationTestingActor
// Size: 0x400 (Inherited: 0x3F0)
struct ANPCAINavigationTestingActor : ANavigationTestingActor
{
	DEFINE_UE_CLASS_HELPERS(ANPCAINavigationTestingActor, "NPCAINavigationTestingActor")

	bool bShowDiversity; // 0x3F0(0x1)
	uint8_t Pad_0x3F1[0x3]; // 0x3F1(0x3)
	float PreferTanProduct; // 0x3F4(0x4)
	int32_t SampleNumPerAxis; // 0x3F8(0x4)
	bool bPreferClockwise; // 0x3FC(0x1)
	uint8_t Pad_0x3FD[0x3]; // 0x3FD(0x3)
};

// Object: Class MFNPCAI.NPCAINavLinkProxyInterface
// Size: 0x28 (Inherited: 0x28)
struct INPCAINavLinkProxyInterface : IInterface
{
	DEFINE_UE_CLASS_HELPERS(INPCAINavLinkProxyInterface, "NPCAINavLinkProxyInterface")
};

// Object: Class MFNPCAI.NPCAINavLinkProxy
// Size: 0x368 (Inherited: 0x350)
struct ANPCAINavLinkProxy : ANavLinkProxy
{
	DEFINE_UE_CLASS_HELPERS(ANPCAINavLinkProxy, "NPCAINavLinkProxy")

	ENavLinkType LinkType; // 0x350(0x1)
	uint8_t Pad_0x351[0x7]; // 0x351(0x7)
	uint64_t PolyRef; // 0x358(0x8)
	int32_t NodeIndex; // 0x360(0x4)
	uint8_t Pad_0x364[0x4]; // 0x364(0x4)

	// Object: Function MFNPCAI.NPCAINavLinkProxy.OnSmartLinkReachedEvent
	// Flags: [Native|Event|Protected|HasOutParms|HasDefaults|BlueprintEvent]
	// Offset: 0x3c706f0
	// Params: [ Num(2) Size(0x14) ]
	void OnSmartLinkReachedEvent(struct AActor* Agent, const struct FVector& Destination);

	// Object: Function MFNPCAI.NPCAINavLinkProxy.GetSmartLinkRightLocation
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c707e8
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetSmartLinkRightLocation();

	// Object: Function MFNPCAI.NPCAINavLinkProxy.GetSmartLinkLeftLocation
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c70824
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetSmartLinkLeftLocation();

	// Object: Function MFNPCAI.NPCAINavLinkProxy.GetSmartLinkComponent
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c70860
	// Params: [ Num(1) Size(0x8) ]
	struct UNavLinkCustomComponent* GetSmartLinkComponent();
};

// Object: Class MFNPCAI.NPCAINavMeshManager
// Size: 0x720 (Inherited: 0x300)
struct ANPCAINavMeshManager : AActor
{
	DEFINE_UE_CLASS_HELPERS(ANPCAINavMeshManager, "NPCAINavMeshManager")

	uint8_t Pad_0x300[0x198]; // 0x300(0x198)
	struct FNavSkeletonBuildSettings SkeletonBuildSettings; // 0x498(0x8C)
	uint8_t Pad_0x524[0x4]; // 0x524(0x4)
	struct TArray<struct FNavSkeletonPoint> NavSkeletonPoints; // 0x528(0x10)
	struct FNavSkeletonData NavSkeletonData; // 0x538(0x60)
	uint8_t Pad_0x598[0x8]; // 0x598(0x8)
	struct TArray<struct ANPCAINavLinkProxy*> CachedNavLinkProxies; // 0x5A0(0x10)
	struct TSet<struct FVector> SkeletonForcePoints; // 0x5B0(0x50)
	bool bEnableFixNavOctree; // 0x600(0x1)
	uint8_t Pad_0x601[0x3]; // 0x601(0x3)
	float FixNavOctree_TolerateExtent; // 0x604(0x4)
	struct TMap<int32_t, struct FNPCAINavPlatformBuildTemplate> PlatformBuildTemplates; // 0x608(0x50)
	struct TMap<int32_t, struct FNPCAINavPlatformBuildData> PlatformBuildDatas; // 0x658(0x50)
	struct TMap<int32_t, struct FNPCAINavPlatformLinkLine> LinkLines; // 0x6A8(0x50)
	struct FVector PlatformOctreeOrigin; // 0x6F8(0xC)
	float PlatformOctreeExtent; // 0x704(0x4)
	float PlatformMinimumUpdateInterval; // 0x708(0x4)
	uint8_t Pad_0x70C[0x4]; // 0x70C(0x4)
	struct TArray<struct TSoftClassPtr<struct ANavLinkProxyGenerator*>> NavLinkProxyGeneratorClassesForEditor; // 0x710(0x10)

	// Object: Function MFNPCAI.NPCAINavMeshManager.SetupNavSkeleton
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c7097c
	// Params: [ Num(0) Size(0x0) ]
	void SetupNavSkeleton();

	// Object: Function MFNPCAI.NPCAINavMeshManager.PrintSkeletonPointRadiusStat
	// Flags: [Final|Native|Public]
	// Offset: 0x3c70918
	// Params: [ Num(0) Size(0x0) ]
	void PrintSkeletonPointRadiusStat();

	// Object: Function MFNPCAI.NPCAINavMeshManager.PrintSkeletonPointDegreeStat
	// Flags: [Final|Native|Public]
	// Offset: 0x3c7092c
	// Params: [ Num(0) Size(0x0) ]
	void PrintSkeletonPointDegreeStat();

	// Object: Function MFNPCAI.NPCAINavMeshManager.PrintSkeletonMemoryUsage
	// Flags: [Final|Native|Public]
	// Offset: 0x3c70954
	// Params: [ Num(0) Size(0x0) ]
	void PrintSkeletonMemoryUsage();

	// Object: Function MFNPCAI.NPCAINavMeshManager.PrintSkeletonInfo
	// Flags: [Final|Native|Public]
	// Offset: 0x3c70968
	// Params: [ Num(0) Size(0x0) ]
	void PrintSkeletonInfo();

	// Object: Function MFNPCAI.NPCAINavMeshManager.PrintSkeletonEdgeLengthStat
	// Flags: [Final|Native|Public]
	// Offset: 0x3c70940
	// Params: [ Num(0) Size(0x0) ]
	void PrintSkeletonEdgeLengthStat();

	// Object: Function MFNPCAI.NPCAINavMeshManager.OnPostBeginGameInit
	// Flags: [Final|Native|Protected]
	// Offset: 0x3c70990
	// Params: [ Num(0) Size(0x0) ]
	void OnPostBeginGameInit();
};

// Object: Class MFNPCAI.NPCAINavMeshRenderingComponent
// Size: 0x680 (Inherited: 0x680)
struct UNPCAINavMeshRenderingComponent : UNPCAITestingRenderingComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavMeshRenderingComponent, "NPCAINavMeshRenderingComponent")
};

// Object: Class MFNPCAI.NPCAINavMeshTestingActor
// Size: 0x760 (Inherited: 0x340)
struct ANPCAINavMeshTestingActor : ANPCAITestingActor
{
	DEFINE_UE_CLASS_HELPERS(ANPCAINavMeshTestingActor, "NPCAINavMeshTestingActor")

	float ToWallCylinderHeight; // 0x340(0x4)
	float RadiusMultiplier; // 0x344(0x4)
	float DistanceHeightMultiplier; // 0x348(0x4)
	float DistanceLineThickness; // 0x34C(0x4)
	float ShowGradientThreshold; // 0x350(0x4)
	float GradientZOffset; // 0x354(0x4)
	float UpdateGradientFlowAnimInterval; // 0x358(0x4)
	uint8_t Pad_0x35C[0x4]; // 0x35C(0x4)
	float ShowDivergenceThreshold; // 0x360(0x4)
	float DivergenceHeightMultiplier; // 0x364(0x4)
	float DivergenceLineThickness; // 0x368(0x4)
	float ConnectionLineThickness; // 0x36C(0x4)
	float SimlifiedConnectionZOffset; // 0x370(0x4)
	int32_t ShowCoverageLevel; // 0x374(0x4)
	int32_t ShowWallLevel; // 0x378(0x4)
	uint8_t bEnableRefreshData : 1; // 0x37C(0x1), Mask(0x1)
	uint8_t bDrawSamplePoints : 1; // 0x37C(0x1), Mask(0x2)
	uint8_t bDrawWallCountMap : 1; // 0x37C(0x1), Mask(0x4)
	uint8_t bDrawDistanceMap : 1; // 0x37C(0x1), Mask(0x8)
	uint8_t bDrawGradient : 1; // 0x37C(0x1), Mask(0x10)
	uint8_t bShowAllGradient : 1; // 0x37C(0x1), Mask(0x20)
	uint8_t bDrawGradientFlowAnim : 1; // 0x37C(0x1), Mask(0x40)
	uint8_t bDrawCoverage : 1; // 0x37C(0x1), Mask(0x80)
	uint8_t bAlwaysShowMainCoverage : 1; // 0x37D(0x1), Mask(0x1)
	uint8_t bDrawOriginalConnection : 1; // 0x37D(0x1), Mask(0x2)
	uint8_t bDrawSimplifiedConnection : 1; // 0x37D(0x1), Mask(0x4)
	uint8_t bOnlyDrawMainSimplifiedConnection : 1; // 0x37D(0x1), Mask(0x8)
	uint8_t BitPad_0x37D_4 : 4; // 0x37D(0x1)
	uint8_t Pad_0x37E[0x2]; // 0x37E(0x2)
	int32_t NearestMainCoverageSampleIndex; // 0x380(0x4)
	int32_t PolyMeshCount; // 0x384(0x4)
	int32_t PolylineCount; // 0x388(0x4)
	int32_t CurrentTileIndex; // 0x38C(0x4)
	struct FVector ClosestPointOnWall; // 0x390(0xC)
	uint8_t Pad_0x39C[0x14]; // 0x39C(0x14)
	int32_t NeighbourWallEdgeCount; // 0x3B0(0x4)
	float DistanceToWall; // 0x3B4(0x4)
	uint8_t Pad_0x3B8[0x8]; // 0x3B8(0x8)
	struct FVector4 SamplePointCountStat; // 0x3C0(0x10)
	struct FVector4 WallStat; // 0x3D0(0x10)
	struct FVector4 DistanceStat; // 0x3E0(0x10)
	struct FVector4 DivergenceStat; // 0x3F0(0x10)
	struct FVector4 FilteredDistanceStat; // 0x400(0x10)
	struct FVector4 FilteredDivergenceStat; // 0x410(0x10)
	int32_t CoverageStats[0x5]; // 0x420(0x14)
	int32_t ConnectionStats[0xD]; // 0x434(0x34)
	float MaxPathLength; // 0x468(0x4)
	struct FNavSkeletonBuildSettings BuildSettings; // 0x46C(0x8C)
	uint8_t bDrawPersistent : 1; // 0x4F8(0x1), Mask(0x1)
	uint8_t bDrawForcePoint : 1; // 0x4F8(0x1), Mask(0x2)
	uint8_t bDrawTextInfo : 1; // 0x4F8(0x1), Mask(0x4)
	uint8_t bDrawProtection : 1; // 0x4F8(0x1), Mask(0x8)
	uint8_t bDrawNearestPoint : 1; // 0x4F8(0x1), Mask(0x10)
	uint8_t bDrawPointNeighbours : 1; // 0x4F8(0x1), Mask(0x20)
	uint8_t bDrawFindResultPoints : 1; // 0x4F8(0x1), Mask(0x40)
	uint8_t bDrawOutDoorsPoints : 1; // 0x4F8(0x1), Mask(0x80)
	uint8_t Pad_0x4F9[0x7]; // 0x4F9(0x7)
	struct FNavSkeletonPoint NavSkeletonPoint; // 0x500(0xA0)
	struct FNavSkeletonPoint TargetNavSkeletonPoint; // 0x5A0(0xA0)
	struct TArray<int32_t> FoundPointIDs; // 0x640(0x10)
	float CostLimit; // 0x650(0x4)
	float HalfAngleOfView; // 0x654(0x4)
	struct AActor* TargetDebugActor; // 0x658(0x8)
	uint8_t Pad_0x660[0x100]; // 0x660(0x100)

	// Object: Function MFNPCAI.NPCAINavMeshTestingActor.UpdateDrawing
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c709d0
	// Params: [ Num(0) Size(0x0) ]
	void UpdateDrawing();
};

// Object: Class MFNPCAI.NPCAINavModifierVolume
// Size: 0x370 (Inherited: 0x350)
struct ANPCAINavModifierVolume : ANavModifierVolume
{
	DEFINE_UE_CLASS_HELPERS(ANPCAINavModifierVolume, "NPCAINavModifierVolume")

	struct TArray<int64_t> AffectedPolygons; // 0x350(0x10)
	struct TArray<struct ANPCAINavLinkProxy*> AffectedNavLinks; // 0x360(0x10)

	// Object: Function MFNPCAI.NPCAINavModifierVolume.SetupNavNodesAreaID
	// Flags: [Final|Native|Protected]
	// Offset: 0x3c73aa4
	// Params: [ Num(0) Size(0x0) ]
	void SetupNavNodesAreaID();

	// Object: Function MFNPCAI.NPCAINavModifierVolume.OnNavDataRegisteredCallback
	// Flags: [Final|Native|Protected]
	// Offset: 0x3c739fc
	// Params: [ Num(1) Size(0x8) ]
	void OnNavDataRegisteredCallback(struct ANavigationData* NavData);

	// Object: Function MFNPCAI.NPCAINavModifierVolume.CollectAffectedNavNodes
	// Flags: [Native|Protected]
	// Offset: 0x3c739e0
	// Params: [ Num(0) Size(0x0) ]
	void CollectAffectedNavNodes();
};

// Object: Class MFNPCAI.NPCAINavPlatformComponent
// Size: 0x110 (Inherited: 0xE0)
struct UNPCAINavPlatformComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavPlatformComponent, "NPCAINavPlatformComponent")

	int64_t PID; // 0xE0(0x8)
	int32_t TemplateID; // 0xE8(0x4)
	float AffectedBottomHeight; // 0xEC(0x4)
	struct FVector OriginLoc; // 0xF0(0xC)
	struct FRotator OriginRot; // 0xFC(0xC)
	bool bDebugDraw; // 0x108(0x1)
	bool bDebugDrawBaseInfo; // 0x109(0x1)
	bool bDebugDrawLinkLines; // 0x10A(0x1)
	bool bDebugDrawPlatformArea; // 0x10B(0x1)
	bool bDebugDrawPolys; // 0x10C(0x1)
	uint8_t Pad_0x10D[0x3]; // 0x10D(0x3)

	// Object: Function MFNPCAI.NPCAINavPlatformComponent.WorldLocToRelativeLoc
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c741a0
	// Params: [ Num(2) Size(0x18) ]
	struct FVector WorldLocToRelativeLoc(const struct FVector& WorldLoc);

	// Object: Function MFNPCAI.NPCAINavPlatformComponent.WorldLocToNavLoc
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c73e98
	// Params: [ Num(2) Size(0x18) ]
	struct FVector WorldLocToNavLoc(const struct FVector& WorldLoc);

	// Object: Function MFNPCAI.NPCAINavPlatformComponent.RelativeLocToWorldLoc
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c740e4
	// Params: [ Num(2) Size(0x18) ]
	struct FVector RelativeLocToWorldLoc(const struct FVector& RelativeLoc);

	// Object: Function MFNPCAI.NPCAINavPlatformComponent.RelativeLocToNavLoc
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c74028
	// Params: [ Num(2) Size(0x18) ]
	struct FVector RelativeLocToNavLoc(const struct FVector& RelativeLoc);

	// Object: Function MFNPCAI.NPCAINavPlatformComponent.ProjectWorldLocOnPlatform
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c73acc
	// Params: [ Num(4) Size(0x25) ]
	bool ProjectWorldLocOnPlatform(const struct FVector& WorldLoc, int64_t& PolyRef, const struct FVector& Extent);

	// Object: Function MFNPCAI.NPCAINavPlatformComponent.OnMapOpened
	// Flags: [Final|Native|Private]
	// Offset: 0x3c74390
	// Params: [ Num(2) Size(0x11) ]
	void OnMapOpened(struct FString Filename, bool bAsTemplate);

	// Object: Function MFNPCAI.NPCAINavPlatformComponent.NavLocToWorldLoc
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c73dc4
	// Params: [ Num(2) Size(0x18) ]
	struct FVector NavLocToWorldLoc(const struct FVector& NavLoc);

	// Object: Function MFNPCAI.NPCAINavPlatformComponent.NavLocToRelativeLoc
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c73f6c
	// Params: [ Num(2) Size(0x18) ]
	struct FVector NavLocToRelativeLoc(const struct FVector& NavLoc);

	// Object: Function MFNPCAI.NPCAINavPlatformComponent.IsWorldLocOnPlatform
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c73c24
	// Params: [ Num(2) Size(0xD) ]
	bool IsWorldLocOnPlatform(const struct FVector& WorldLoc);

	// Object: Function MFNPCAI.NPCAINavPlatformComponent.IsNavLocOnPlatform
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c73d08
	// Params: [ Num(2) Size(0xD) ]
	bool IsNavLocOnPlatform(const struct FVector& NavLoc);

	// Object: Function MFNPCAI.NPCAINavPlatformComponent.GetOwnerWorldLoc
	// Flags: [Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7425c
	// Params: [ Num(1) Size(0xC) ]
	struct FVector GetOwnerWorldLoc();

	// Object: Function MFNPCAI.NPCAINavPlatformComponent.GetBuildData
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c74338
	// Params: [ Num(1) Size(0x48) ]
	struct FNPCAINavPlatformBuildData GetBuildData();

	// Object: Function MFNPCAI.NPCAINavPlatformComponent.GetBuildConfig
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c74298
	// Params: [ Num(1) Size(0x48) ]
	struct FNPCAINavPlatformBuildConfig GetBuildConfig();
};

// Object: Class MFNPCAI.NPCAINavMovablePlatformComponent
// Size: 0x118 (Inherited: 0x110)
struct UNPCAINavMovablePlatformComponent : UNPCAINavPlatformComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavMovablePlatformComponent, "NPCAINavMovablePlatformComponent")

	float MinUpdateDist; // 0x110(0x4)
	uint8_t Pad_0x114[0x4]; // 0x114(0x4)
};

// Object: Class MFNPCAI.NPCAINavPlatformSystem
// Size: 0x470 (Inherited: 0x30)
struct UNPCAINavPlatformSystem : UNPCAINavSubsystemBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavPlatformSystem, "NPCAINavPlatformSystem")

	uint8_t Pad_0x30[0x8]; // 0x30(0x8)
	struct FNavPlatformGraphWrapper AStarGraphWrapper; // 0x38(0xE0)
	uint8_t Pad_0x118[0x178]; // 0x118(0x178)
	struct TMap<struct AActor*, int64_t> Platforms; // 0x290(0x50)
	uint8_t Pad_0x2E0[0xD0]; // 0x2E0(0xD0)
	struct TMap<struct UNPCAINavPlatformComponent*, int64_t> PlatformComponents; // 0x3B0(0x50)
	struct TMap<int64_t, struct UNPCAINavPlatformComponent*> PlatformComponentInfos; // 0x400(0x50)
	uint8_t Pad_0x450[0x20]; // 0x450(0x20)

	// Object: Function MFNPCAI.NPCAINavPlatformSystem.OnNavigationGenerationFinished
	// Flags: [Final|Native|Private]
	// Offset: 0x3c74500
	// Params: [ Num(1) Size(0x8) ]
	void OnNavigationGenerationFinished(struct ANavigationData* NavData);

	// Object: Function MFNPCAI.NPCAINavPlatformSystem.OnNavigationGenerationBegin
	// Flags: [Final|Native|Private]
	// Offset: 0x3c745a8
	// Params: [ Num(0) Size(0x0) ]
	void OnNavigationGenerationBegin();

	// Object: Function MFNPCAI.NPCAINavPlatformSystem.OnNavDataRegistered
	// Flags: [Final|Native|Private]
	// Offset: 0x3c7497c
	// Params: [ Num(1) Size(0x8) ]
	void OnNavDataRegistered(struct ANavigationData* NavData);

	// Object: Function MFNPCAI.NPCAINavPlatformSystem.GetNavPlatformSystem
	// Flags: [Final|Native|Static|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c74a24
	// Params: [ Num(2) Size(0x10) ]
	static struct UNPCAINavPlatformSystem* GetNavPlatformSystem(struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAINavPlatformSystem.GetBuildDatas
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7471c
	// Params: [ Num(1) Size(0x50) ]
	struct TMap<int32_t, struct FNPCAINavPlatformBuildData> GetBuildDatas();

	// Object: Function MFNPCAI.NPCAINavPlatformSystem.GetBuildDataByTemplateID
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c748a8
	// Params: [ Num(2) Size(0x50) ]
	struct FNPCAINavPlatformBuildData GetBuildDataByTemplateID(int32_t TemplateID);

	// Object: Function MFNPCAI.NPCAINavPlatformSystem.GetBuildConfigByTemplateID
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7479c
	// Params: [ Num(2) Size(0x50) ]
	struct FNPCAINavPlatformBuildConfig GetBuildConfigByTemplateID(int32_t TemplateID);

	// Object: Function MFNPCAI.NPCAINavPlatformSystem.FindPlatformComponent
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c7466c
	// Params: [ Num(2) Size(0x10) ]
	struct UNPCAINavPlatformComponent* FindPlatformComponent(int64_t PID);

	// Object: Function MFNPCAI.NPCAINavPlatformSystem.FindPID
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c745bc
	// Params: [ Num(2) Size(0x10) ]
	int64_t FindPID(struct UNPCAINavPlatformComponent* PlatformComponent);
};

// Object: Class MFNPCAI.NPCAINavRuntimeSystem
// Size: 0x3B8 (Inherited: 0x30)
struct UNPCAINavRuntimeSystem : UNPCAINavSubsystemBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavRuntimeSystem, "NPCAINavRuntimeSystem")

	uint8_t Pad_0x30[0x48]; // 0x30(0x48)
	struct TMap<int32_t, ENPCAIPerceptibleTile> AreaIDToPerceptibleTile; // 0x78(0x50)
	struct TMap<ENPCAIPerceptibleTile, struct FNavCostDescriptor> PerceptibleTileToNavCostDescriptor; // 0xC8(0x50)
	struct TMap<struct UObject*, struct FNavPolyRefArray> BurningPolyRefs; // 0x118(0x50)
	struct TMap<struct UObject*, struct FNavPolyRefArray> TearGasPolyRefs; // 0x168(0x50)
	struct TMap<struct UObject*, struct FNavPolyRefArray> TripMinePolyRefs; // 0x1B8(0x50)
	struct TMap<struct UObject*, struct FNavPolyRefArray> ClaymorePolyRefs; // 0x208(0x50)
	struct TMap<struct UObject*, struct FNavPolyRefArray> ParadropPolyRefs; // 0x258(0x50)
	struct TMap<struct UObject*, struct ANPCAINavModifierVolume*> ObjectToNavModifierVolume; // 0x2A8(0x50)
	struct TMap<struct TWeakObjectPtr<struct UObject>, struct FNavCostModifierSharedPointer> ObjectToNavCostModifier; // 0x2F8(0x50)
	struct TArray<struct TWeakObjectPtr<struct UObject>> InvalidNavCostModifiers; // 0x348(0x10)
	struct TMap<struct AVolume*, struct FNavPolyRefArray> AvoidPolyRefs; // 0x358(0x50)
	struct UCoverSystem* CachedCoverSystem; // 0x3A8(0x8)
	struct ANPCAINavMeshManager* CachedNavMeshManager; // 0x3B0(0x8)

	// Object: Function MFNPCAI.NPCAINavRuntimeSystem.SetupTripMineAreas
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c75004
	// Params: [ Num(4) Size(0x21) ]
	void SetupTripMineAreas(struct UObject* Object, const struct FVector& StartPoint, const struct FVector& EndPoint, bool bEnabled);

	// Object: Function MFNPCAI.NPCAINavRuntimeSystem.SetupTearGasAreas
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c7518c
	// Params: [ Num(4) Size(0x21) ]
	void SetupTearGasAreas(struct UObject* TearGasObject, const struct FVector& CenterPos, const struct FVector& EffectExtent, bool bActiving);

	// Object: Function MFNPCAI.NPCAINavRuntimeSystem.SetupRegionWhereNavLinksNeedDisable
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c74ad4
	// Params: [ Num(3) Size(0xD) ]
	static bool SetupRegionWhereNavLinksNeedDisable(struct AActor* AIPawnOrController, int32_t RegionIndex);

	// Object: Function MFNPCAI.NPCAINavRuntimeSystem.SetupBurningAreas
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c75314
	// Params: [ Num(4) Size(0x1D) ]
	void SetupBurningAreas(struct UObject* Object, const struct TArray<struct FVector>& Centers, float Radius, bool bEnable);

	// Object: Function MFNPCAI.NPCAINavRuntimeSystem.SetupAvoidAreas
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c74eb8
	// Params: [ Num(3) Size(0x19) ]
	void SetupAvoidAreas(struct AAIController* AIController, const struct TArray<struct AVolume*>& Volumes, bool bAvoid);

	// Object: Function MFNPCAI.NPCAINavRuntimeSystem.MapAreaIDToPerceptibleTile
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c754a0
	// Params: [ Num(2) Size(0x5) ]
	ENPCAIPerceptibleTile MapAreaIDToPerceptibleTile(int32_t AreaID);

	// Object: Function MFNPCAI.NPCAINavRuntimeSystem.IsAreaBombing
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c74d68
	// Params: [ Num(4) Size(0x14) ]
	int32_t IsAreaBombing(const struct FVector& Location, bool bCheckMolotov, bool bCheckTearGas);

	// Object: Function MFNPCAI.NPCAINavRuntimeSystem.ArrangeStandPositions
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c74bc0
	// Params: [ Num(5) Size(0x30) ]
	static struct TArray<struct FAICandidateStandPosition> ArrangeStandPositions(struct UObject* WorldContextObject, const struct FVector& Location, float MaxRange, float MinGap);
};

// Object: Class MFNPCAI.NPCAINavSkeletonForcePoint
// Size: 0x308 (Inherited: 0x300)
struct ANPCAINavSkeletonForcePoint : AActor
{
	DEFINE_UE_CLASS_HELPERS(ANPCAINavSkeletonForcePoint, "NPCAINavSkeletonForcePoint")

	struct USceneComponent* SceneComponent; // 0x300(0x8)
};

// Object: Class MFNPCAI.NPCAINavSkeletonSystem
// Size: 0x200 (Inherited: 0x30)
struct UNPCAINavSkeletonSystem : UNPCAINavSubsystemBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavSkeletonSystem, "NPCAINavSkeletonSystem")

	uint8_t Pad_0x30[0x1D0]; // 0x30(0x1D0)

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.SetupTryBestToIncludePointIDs
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c7f790
	// Params: [ Num(3) Size(0x1A0) ]
	struct FNavSkeletonGraphAStarFilter SetupTryBestToIncludePointIDs(struct FNavSkeletonGraphAStarFilter& Filter, const struct TArray<int32_t>& PointIDs);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.QueryVisiblePointIDsFromMultiTargets
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7e6bc
	// Params: [ Num(5) Size(0x38) ]
	void QueryVisiblePointIDsFromMultiTargets(struct TArray<struct AActor*> Targets, struct TArray<float> HalfAngles, struct TArray<int32_t>& Result, float MaxDistance, float AroundRadius);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.QueryVisiblePointIDs
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7e91c
	// Params: [ Num(5) Size(0x30) ]
	struct TArray<int32_t> QueryVisiblePointIDs(const struct FVector& Location, const struct FVector& Direction, float HalfAngle, float MaxDistance);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.QueryThrowablePointIDs
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7e5d4
	// Params: [ Num(2) Size(0x18) ]
	struct TArray<int32_t> QueryThrowablePointIDs(int32_t TargetPointID);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.QueryProtectablePointIDs
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7ee20
	// Params: [ Num(4) Size(0x28) ]
	struct TArray<int32_t> QueryProtectablePointIDs(const struct FVector& Location, float MaxPathLength, int32_t KeepTopK);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.QueryPointIDsInSphericalCone
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7eae0
	// Params: [ Num(5) Size(0x30) ]
	struct TArray<int32_t> QueryPointIDsInSphericalCone(const struct FVector& Location, const struct FVector& Direction, float HalfAngle, float MaxDistance);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.QueryPointIDs
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7f568
	// Params: [ Num(3) Size(0x20) ]
	struct TArray<int32_t> QueryPointIDs(const struct FVector& Location, float QueryLength);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.QueryOutdoorsPointIDs
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7f424
	// Params: [ Num(3) Size(0x28) ]
	struct TArray<int32_t> QueryOutdoorsPointIDs(const struct FVector& Location, const struct FVector& Extent);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.QueryNearestPointIDsSorted
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7ef9c
	// Params: [ Num(3) Size(0x28) ]
	struct TArray<int32_t> QueryNearestPointIDsSorted(const struct TArray<struct FVector>& Locations, float MaxPathLength);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.QueryNearestPointIDs
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7f0e8
	// Params: [ Num(3) Size(0x20) ]
	struct TArray<int32_t> QueryNearestPointIDs(const struct FVector& Location, float MaxPathLength);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.QueryNearestPointID
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7f324
	// Params: [ Num(3) Size(0x14) ]
	int32_t QueryNearestPointID(const struct FVector& Location, float MaxPathLength);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.QueryNearestDoorPointID
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7f224
	// Params: [ Num(3) Size(0x14) ]
	int32_t QueryNearestDoorPointID(const struct FVector& Location, float MaxPathLength);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.QueryBranchyPointIDs
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7eca4
	// Params: [ Num(4) Size(0x28) ]
	struct TArray<int32_t> QueryBranchyPointIDs(const struct FVector& Location, float MaxPathLength, int32_t KeepTopK);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.OptimizePathResult
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c7d638
	// Params: [ Num(2) Size(0x70) ]
	struct FNavSkeletonGraphFindResult OptimizePathResult(const struct FNavSkeletonGraphFindResult& PathResult);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.IsPointInMaxConnectivitySubGraph
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7fd48
	// Params: [ Num(2) Size(0x5) ]
	bool IsPointInMaxConnectivitySubGraph(int32_t PointID);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.GetTotalPointCount
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c7f75c
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetTotalPointCount();

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.GetPointData
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7f6a4
	// Params: [ Num(2) Size(0xA8) ]
	struct FNavSkeletonPoint GetPointData(int32_t PointID);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.GetNavSkeletonSystem
	// Flags: [Final|Native|Static|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c7ff00
	// Params: [ Num(2) Size(0x10) ]
	static struct UNPCAINavSkeletonSystem* GetNavSkeletonSystem(struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.GetFindPathStatus
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c7d75c
	// Params: [ Num(2) Size(0x9) ]
	EMFGraphAStarResult GetFindPathStatus(struct UObject* Querier);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.FloodFromPointIDs
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|Const]
	// Offset: 0x3c7db38
	// Params: [ Num(4) Size(0xF0) ]
	struct TArray<int32_t> FloodFromPointIDs(struct TArray<int32_t> PointIDs, const struct FNavSkeletonGraphAStarFilter& Filter, bool bCanEndInUnreachablePoint);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.FloodFromPointID
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|Const]
	// Offset: 0x3c7dd60
	// Params: [ Num(4) Size(0xE8) ]
	struct TArray<int32_t> FloodFromPointID(int32_t PointID, const struct FNavSkeletonGraphAStarFilter& Filter, bool bCanEndInUnreachablePoint);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.FindStepBackPointIDs
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c7df1c
	// Params: [ Num(4) Size(0x118) ]
	struct FNavSkeletonGraphFindResult FindStepBackPointIDs(int32_t PointID, const struct TArray<int32_t>& CandidatePointIDs, struct FNavSkeletonGraphAStarFilter& Filter);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.FindPathAsync
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c7d8c0
	// Params: [ Num(7) Size(0xF9) ]
	bool FindPathAsync(int32_t StartPointID, int32_t EndPointID, const struct FNavSkeletonGraphAStarFilter& Filter, const struct FMFGraphAStarPolicy& Policy, struct FDelegate Callback, struct UObject* Caller);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.FindPath
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7e0e4
	// Params: [ Num(5) Size(0x110) ]
	struct FNavSkeletonGraphFindResult FindPath(int32_t StartPointID, int32_t EndPointID, const struct FNavSkeletonGraphAStarFilter& Filter, struct UObject* Caller);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.FindOutsidePointIDs
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7e2d0
	// Params: [ Num(3) Size(0x108) ]
	struct FNavSkeletonGraphFindResult FindOutsidePointIDs(int32_t PointID, const struct FNavSkeletonGraphAStarFilter& Filter);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.ClearUnreachablePointIDs
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c7fc1c
	// Params: [ Num(2) Size(0x190) ]
	struct FNavSkeletonGraphAStarFilter ClearUnreachablePointIDs(struct FNavSkeletonGraphAStarFilter& Filter);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.CalculatePathLengthToEachPoint
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c7e43c
	// Params: [ Num(4) Size(0x30) ]
	struct TArray<struct FNavSkeletonGraphResultNode> CalculatePathLengthToEachPoint(const struct TArray<int32_t>& PointIDs, const struct FVector& Location, float MaxPathLength);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.BuildSkeleton
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c7fe68
	// Params: [ Num(1) Size(0x8) ]
	static void BuildSkeleton(struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.AddUnreachablePointIDs
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c7f918
	// Params: [ Num(3) Size(0x1A0) ]
	struct FNavSkeletonGraphAStarFilter AddUnreachablePointIDs(struct FNavSkeletonGraphAStarFilter& Filter, const struct TArray<int32_t>& PointIDs);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.AddUnreachablePointID
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c7faa0
	// Params: [ Num(3) Size(0x198) ]
	struct FNavSkeletonGraphAStarFilter AddUnreachablePointID(struct FNavSkeletonGraphAStarFilter& Filter, int32_t PointID);

	// Object: Function MFNPCAI.NPCAINavSkeletonSystem.AbortFindPathRequest
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c7d80c
	// Params: [ Num(2) Size(0x9) ]
	bool AbortFindPathRequest(struct UObject* Querier);
};

// Object: Class MFNPCAI.NPCAINavSteepZoneSystem
// Size: 0x30 (Inherited: 0x30)
struct UNPCAINavSteepZoneSystem : UNPCAINavSubsystemBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavSteepZoneSystem, "NPCAINavSteepZoneSystem")

	// Object: Function MFNPCAI.NPCAINavSteepZoneSystem.RunDeleter
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x3c85924
	// Params: [ Num(1) Size(0x34) ]
	void RunDeleter(const struct FSteepZoneDeleteSettings& Settings);
};

// Object: Class MFNPCAI.NavArea_Burning
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_Burning : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_Burning, "NavArea_Burning")
};

// Object: Class MFNPCAI.NavArea_TearGas
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_TearGas : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_TearGas, "NavArea_TearGas")
};

// Object: Class MFNPCAI.NavArea_TripMine
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_TripMine : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_TripMine, "NavArea_TripMine")
};

// Object: Class MFNPCAI.NavArea_Claymore
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_Claymore : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_Claymore, "NavArea_Claymore")
};

// Object: Class MFNPCAI.NavArea_Paradrop
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_Paradrop : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_Paradrop, "NavArea_Paradrop")
};

// Object: Class MFNPCAI.NavArea_Vehicle
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_Vehicle : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_Vehicle, "NavArea_Vehicle")
};

// Object: Class MFNPCAI.NavArea_UnderPlatform
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_UnderPlatform : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_UnderPlatform, "NavArea_UnderPlatform")
};

// Object: Class MFNPCAI.NavArea_Avoid
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_Avoid : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_Avoid, "NavArea_Avoid")
};

// Object: Class MFNPCAI.NavArea_Color0
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_Color0 : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_Color0, "NavArea_Color0")
};

// Object: Class MFNPCAI.NavArea_Color1
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_Color1 : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_Color1, "NavArea_Color1")
};

// Object: Class MFNPCAI.NavArea_Color2
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_Color2 : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_Color2, "NavArea_Color2")
};

// Object: Class MFNPCAI.NavArea_Color3
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_Color3 : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_Color3, "NavArea_Color3")
};

// Object: Class MFNPCAI.NavArea_Color4
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_Color4 : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_Color4, "NavArea_Color4")
};

// Object: Class MFNPCAI.NavArea_Color5
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_Color5 : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_Color5, "NavArea_Color5")
};

// Object: Class MFNPCAI.NavArea_Color6
// Size: 0x48 (Inherited: 0x48)
struct UNavArea_Color6 : UNavArea
{
	DEFINE_UE_CLASS_HELPERS(UNavArea_Color6, "NavArea_Color6")
};

// Object: Class MFNPCAI.FloodSeedCollection
// Size: 0xA8 (Inherited: 0x28)
struct UFloodSeedCollection : UObject
{
	DEFINE_UE_CLASS_HELPERS(UFloodSeedCollection, "FloodSeedCollection")

	struct TArray<struct AActor*> PlayerStarts; // 0x28(0x10)
	struct TArray<struct AActor*> AISpawnPoints; // 0x38(0x10)
	struct TArray<struct AActor*> DoorNavLinks; // 0x48(0x10)
	struct TSet<int64_t> PlatformPolys; // 0x58(0x50)
};

// Object: Class MFNPCAI.NavPathPointActor
// Size: 0x330 (Inherited: 0x300)
struct ANavPathPointActor : ANote
{
	DEFINE_UE_CLASS_HELPERS(ANavPathPointActor, "NavPathPointActor")

	int32_t NodeIndex; // 0x300(0x4)
	uint8_t Pad_0x304[0x4]; // 0x304(0x4)
	uint64_t NodeRef; // 0x308(0x8)
	struct FVector NodeLocation; // 0x310(0xC)
	uint8_t Pad_0x31C[0x4]; // 0x31C(0x4)
	struct TArray<struct ANavPathPointActor*> NextPathPointArray; // 0x320(0x10)
};

// Object: Class MFNPCAI.NavigationQueryFilter_DontVault
// Size: 0x98 (Inherited: 0x48)
struct UNavigationQueryFilter_DontVault : UNavigationQueryFilter
{
	DEFINE_UE_CLASS_HELPERS(UNavigationQueryFilter_DontVault, "NavigationQueryFilter_DontVault")

	struct TSet<ENavLinkType> IgnoredLinkTypes; // 0x48(0x50)
};

// Object: Class MFNPCAI.NavigationQueryFilter_Diversity
// Size: 0x50 (Inherited: 0x48)
struct UNavigationQueryFilter_Diversity : UNavigationQueryFilter
{
	DEFINE_UE_CLASS_HELPERS(UNavigationQueryFilter_Diversity, "NavigationQueryFilter_Diversity")

	float threshold; // 0x44(0x4)
	float LowValue; // 0x48(0x4)
	float HighValue; // 0x4C(0x4)
};

// Object: Class MFNPCAI.AINavGenerationSettings
// Size: 0x1D8 (Inherited: 0x38)
struct UAINavGenerationSettings : UDeveloperSettings
{
	DEFINE_UE_CLASS_HELPERS(UAINavGenerationSettings, "AINavGenerationSettings")

	struct TArray<struct TSoftClassPtr<struct ANavLinkProxyGenerator*>> NavLinkProxyGeneratorClasses; // 0x38(0x10)
	struct FNPCAINavPlatformBuildConfig DefaultPlatformBuildConfig; // 0x48(0x48)
	struct TMap<int32_t, struct FNPCAINavPlatformBuildConfig> PlatformBuildConfigs; // 0x90(0x50)
	struct FNPCAINavPlatformBuildData DefaultPlatformBuildData; // 0xE0(0x48)
	struct TArray<struct FNavLinkAcceptanceRadiusEntry> NavLinkAdditionAcceptanceRadius; // 0x128(0x10)
	struct TSet<struct UNavArea*> StopPathExtendAreas; // 0x138(0x50)
	struct TSet<ENavLinkType> StopPathTurningLinkTypes; // 0x188(0x50)
};

// Object: Class MFNPCAI.NPCAINavUtilitySystem
// Size: 0x30 (Inherited: 0x30)
struct UNPCAINavUtilitySystem : UNPCAINavSubsystemBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAINavUtilitySystem, "NPCAINavUtilitySystem")

	// Object: Function MFNPCAI.NPCAINavUtilitySystem.ValidateTacticPointLocations
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c86350
	// Params: [ Num(1) Size(0x8) ]
	static void ValidateTacticPointLocations(struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAINavUtilitySystem.RemoveUnreachableNavMeshes
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c865b8
	// Params: [ Num(1) Size(0x8) ]
	static void RemoveUnreachableNavMeshes(struct UObject* WorldContextObject);

	// Object: Function MFNPCAI.NPCAINavUtilitySystem.NavigationRaycast
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c86814
	// Params: [ Num(7) Size(0x3A) ]
	static bool NavigationRaycast(struct UObject* WorldContextObject, const struct FVector& RayStart, const struct FVector& RayEnd, struct FVector& HitLocation, struct FVector& OriginalHitLocation, bool& bIsRaycastEndInCorridor);

	// Object: Function MFNPCAI.NPCAINavUtilitySystem.IsDefaultNavArea
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c86a3c
	// Params: [ Num(5) Size(0x17) ]
	static bool IsDefaultNavArea(struct UObject* WorldContextObject, struct FVector Location, bool& bOnNavMesh, ENPCAIPerceptibleTile& NavMeshType);

	// Object: Function MFNPCAI.NPCAINavUtilitySystem.GetNavPolyCentersInVolume
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c8611c
	// Params: [ Num(7) Size(0x30) ]
	static struct TArray<struct FVector> GetNavPolyCentersInVolume(struct UObject* WorldContextObject, struct AVolume* Volume, bool bIncludeHighCost, bool bShuffleCandidates, float KeepAwayDistance, int32_t MaxCount);

	// Object: Function MFNPCAI.NPCAINavUtilitySystem.FindDistanceToWall
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c863e8
	// Params: [ Num(6) Size(0x29) ]
	static bool FindDistanceToWall(struct UObject* WorldContextObject, const struct FVector& Location, float SearchRadius, struct FVector& OutClosestPointOnWall, float& OutDistanceToWall);

	// Object: Function MFNPCAI.NPCAINavUtilitySystem.EstimateLocationAfterSeconds
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c85f9c
	// Params: [ Num(5) Size(0x1D) ]
	static bool EstimateLocationAfterSeconds(struct AActor* PawnOrController, float ExpectedSeconds, struct FVector& OutLocation, float& OutActualSeconds);

	// Object: Function MFNPCAI.NPCAINavUtilitySystem.DoesPathExist
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c86650
	// Params: [ Num(6) Size(0x26) ]
	static bool DoesPathExist(struct UObject* WorldContextObject, const struct FVector& Start, const struct FVector& End, float CostLimit, EPathExistenceTestMode TestMode);

	// Object: Function MFNPCAI.NPCAINavUtilitySystem.CalculatePathLengthToEachCoverPoint
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c86bc0
	// Params: [ Num(4) Size(0x28) ]
	static struct TArray<struct FCoverPointPathLengthResult> CalculatePathLengthToEachCoverPoint(struct UObject* WorldContextObject, const struct FVector& Location, float MaxPathLength);
};

// Object: Class MFNPCAI.NPCAIPathFollowingComponent
// Size: 0x380 (Inherited: 0x280)
struct UNPCAIPathFollowingComponent : UPathFollowingComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIPathFollowingComponent, "NPCAIPathFollowingComponent")

	bool bEnableMoveSmooth; // 0x280(0x1)
	uint8_t Pad_0x281[0x3]; // 0x281(0x3)
	float AdjustAngleMaxDist; // 0x284(0x4)
	uint8_t Pad_0x288[0xF8]; // 0x288(0xF8)

	// Object: Function MFNPCAI.NPCAIPathFollowingComponent.ResumePathFollowing
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c8d620
	// Params: [ Num(2) Size(0x9) ]
	static void ResumePathFollowing(struct AActor* Actor, ENPCAIPausePathFollowReason reason);

	// Object: Function MFNPCAI.NPCAIPathFollowingComponent.PausePathFollowing
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c8d6f8
	// Params: [ Num(2) Size(0x9) ]
	static void PausePathFollowing(struct AActor* Actor, ENPCAIPausePathFollowReason reason);

	// Object: Function MFNPCAI.NPCAIPathFollowingComponent.EnableFocus
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c8d470
	// Params: [ Num(2) Size(0x9) ]
	static void EnableFocus(struct AActor* Actor, ENPCAIDisableFocusReason reason);

	// Object: Function MFNPCAI.NPCAIPathFollowingComponent.EnableCheckPathSafety
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c8d390
	// Params: [ Num(2) Size(0x9) ]
	static void EnableCheckPathSafety(struct AActor* Actor, bool bEnable);

	// Object: Function MFNPCAI.NPCAIPathFollowingComponent.DisableFocus
	// Flags: [Final|Native|Static|Public|BlueprintCallable]
	// Offset: 0x3c8d548
	// Params: [ Num(2) Size(0x9) ]
	static void DisableFocus(struct AActor* Actor, ENPCAIDisableFocusReason reason);
};

// Object: Class MFNPCAI.NPCAIPeekPointAsyncTask
// Size: 0x90 (Inherited: 0x40)
struct UNPCAIPeekPointAsyncTask : UNPCAIAsyncTaskBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIPeekPointAsyncTask, "NPCAIPeekPointAsyncTask")

	struct FMulticastInlineDelegate OnSuccess; // 0x40(0x10)
	struct FMulticastInlineDelegate OnFail; // 0x50(0x10)
	struct FVector TargetPoint; // 0x60(0xC)
	struct FVector DangerPoint; // 0x6C(0xC)
	float PeekLength; // 0x78(0x4)
	struct FVector PeekPoint; // 0x7C(0xC)
	bool bWillExpose; // 0x88(0x1)
	uint8_t Pad_0x89[0x7]; // 0x89(0x7)

	// Object: Function MFNPCAI.NPCAIPeekPointAsyncTask.GetNavPath
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x3c8d7fc
	// Params: [ Num(2) Size(0x14) ]
	void GetNavPath(struct TArray<struct FVector>& OutPath, int32_t& StartIndex);

	// Object: Function MFNPCAI.NPCAIPeekPointAsyncTask.ExecuteTask
	// Flags: [Native|Public]
	// Offset: 0x3c8d90c
	// Params: [ Num(0) Size(0x0) ]
	void ExecuteTask();

	// Object: Function MFNPCAI.NPCAIPeekPointAsyncTask.AIPeekPoint
	// Flags: [Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x3c8d928
	// Params: [ Num(5) Size(0x30) ]
	static struct UNPCAIPeekPointAsyncTask* AIPeekPoint(struct AActor* Pawn, const struct FVector& TargetPoint, const struct FVector& DangerPoint, float PeekLength);
};

// Object: Class MFNPCAI.NPCAIPerceptionAssistActor
// Size: 0x3C8 (Inherited: 0x300)
struct ANPCAIPerceptionAssistActor : AActor
{
	DEFINE_UE_CLASS_HELPERS(ANPCAIPerceptionAssistActor, "NPCAIPerceptionAssistActor")

	struct FAIGrassMapInfo MapInfo; // 0x300(0x80)
	struct TArray<struct FAIFoliageGrassBlock> FoliageGrassBlockList; // 0x380(0x10)
	struct TArray<struct FAILandscapeGrassBlock> LandscapeGrassBlockList; // 0x390(0x10)
	struct TArray<struct FAIGrassBlock> GrassBlockAssets; // 0x3A0(0x10)
	bool bIsDebugAIGrass; // 0x3B0(0x1)
	EnumAIGrassDebugBox DebugAIGrassBox; // 0x3B1(0x1)
	uint8_t Pad_0x3B2[0x16]; // 0x3B2(0x16)

	// Object: Function MFNPCAI.NPCAIPerceptionAssistActor.DebugShowAIGrassCluster
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c8dabc
	// Params: [ Num(1) Size(0x1) ]
	void DebugShowAIGrassCluster(EnumAIGrassDebugBox Type);
};

// Object: Class MFNPCAI.NPCAIPerceptionComponent
// Size: 0x2C0 (Inherited: 0x1C0)
struct UNPCAIPerceptionComponent : UAIPerceptionComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIPerceptionComponent, "NPCAIPerceptionComponent")

	bool EnabledRecedeSightWhileRotate; // 0x1C0(0x1)
	bool bEnableEnvironmentForSight; // 0x1C1(0x1)
	uint8_t Pad_0x1C2[0x2]; // 0x1C2(0x2)
	float RateDrawLine; // 0x1C4(0x4)
	bool bIsDebugSightRadius; // 0x1C8(0x1)
	bool bIsLogShootPart; // 0x1C9(0x1)
	bool bIsDebugFogRange; // 0x1CA(0x1)
	bool bEnabledDebugCanSeePoint; // 0x1CB(0x1)
	uint8_t Pad_0x1CC[0x4]; // 0x1CC(0x4)
	float LastTimeCheckFlashBlocks; // 0x1D0(0x4)
	struct FVector FlashLightPos; // 0x1D4(0xC)
	float CheckAutoLeanInterval; // 0x1E0(0x4)
	float SightAngleScaleValue; // 0x1E4(0x4)
	float SightRadiusScaleValue; // 0x1E8(0x4)
	float HearRadiusScaleValue; // 0x1EC(0x4)
	float HearSenseRangeSq; // 0x1F0(0x4)
	uint8_t Pad_0x1F4[0x8]; // 0x1F4(0x8)
	bool IsDelayRegisterAtBeginPlay; // 0x1FC(0x1)
	bool bCheckSmokeEnabled; // 0x1FD(0x1)
	bool bCheckFoliageEnabled; // 0x1FE(0x1)
	uint8_t Pad_0x1FF[0x1]; // 0x1FF(0x1)
	struct ACharacter* AIOwnerPawn; // 0x200(0x8)
	ENPCAISenseChannel WeaponChannel; // 0x208(0x1)
	ENPCAISenseChannel AISightChannel; // 0x209(0x1)
	uint8_t Pad_0x20A[0x6]; // 0x20A(0x6)
	struct ANPCAIPerceptionAssistActor* PerceptionAssistActor; // 0x210(0x8)
	struct ANPCAIPerceptionDynamicActor* PerceptionDynamicActor; // 0x218(0x8)
	struct UNPCAIMoverSystemComponent* OwnerMoverComponent; // 0x220(0x8)
	struct UNPCAIMemorySystemComponent* OwnerMemoryComponent; // 0x228(0x8)
	struct UNPCAIMultiTargetSystemComponent* OwnerMultiTargetComponent; // 0x230(0x8)
	struct UNPCAIPropertyComponent_Shoot* ShootProps; // 0x238(0x8)
	struct UNPCAIPropertyComponent_Look* LookProps; // 0x240(0x8)
	struct UActorComponent* AIFireComponent; // 0x248(0x8)
	struct UActorComponent* AIStaticsComponent; // 0x250(0x8)
	struct UActorComponent* AIPoseComponent; // 0x258(0x8)
	struct UActorComponent* IKComponent; // 0x260(0x8)
	struct UActorComponent* AISenseAbilityComponent; // 0x268(0x8)
	struct UNPCAIGlobalSharedInfo* AISharedInfo; // 0x270(0x8)
	struct UActorComponent* AITurnComponent; // 0x278(0x8)
	float NextCheckLeanCanShootTime; // 0x280(0x4)
	float SelfIKFootOffsets; // 0x284(0x4)
	float TargetIKFootOffsets; // 0x288(0x4)
	float TurnSightWeakenScale; // 0x28C(0x4)
	float LastTimeRecoverSight; // 0x290(0x4)
	bool IsAIHasEnableMovableArmors; // 0x294(0x1)
	EAILeanType AutoLeanType; // 0x295(0x1)
	EAIPose AIPoseType; // 0x296(0x1)
	EAIPose TargetPoseType; // 0x297(0x1)
	EAILeanType AILeanType; // 0x298(0x1)
	bool bInitAIGrassElements; // 0x299(0x1)
	uint8_t Pad_0x29A[0x6]; // 0x29A(0x6)
	struct TArray<struct FAIGrassOctreeElement> AIGrassElements; // 0x2A0(0x10)
	uint8_t Pad_0x2B0[0x10]; // 0x2B0(0x10)
};

// Object: Class MFNPCAI.NPCAIPerceptionDynamicActor
// Size: 0x328 (Inherited: 0x300)
struct ANPCAIPerceptionDynamicActor : AActor
{
	DEFINE_UE_CLASS_HELPERS(ANPCAIPerceptionDynamicActor, "NPCAIPerceptionDynamicActor")

	struct TArray<struct FAIBlockArea> DynamicAreaList; // 0x300(0x10)
	struct TArray<struct FAISenseFlashBlock> SenseFlashBlockList; // 0x310(0x10)
	int32_t IndexOfUpdateFlashBlock; // 0x320(0x4)
	int32_t IndexOfCheckEnemyFlashBlock; // 0x324(0x4)
};

// Object: Class MFNPCAI.NPCAIPerceptionSystem
// Size: 0x148 (Inherited: 0x130)
struct UNPCAIPerceptionSystem : UAIPerceptionSystem
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIPerceptionSystem, "NPCAIPerceptionSystem")

	uint8_t Pad_0x130[0x4]; // 0x130(0x4)
	bool bNoiseSpreadEnabled; // 0x134(0x1)
	uint8_t Pad_0x135[0x3]; // 0x135(0x3)
	struct FMulticastInlineDelegate AISenseNoiseSpreadEvt; // 0x138(0x10)

	// Object: Function MFNPCAI.NPCAIPerceptionSystem.SetNoiseSpreadEnabled
	// Flags: [Final|Native|Public]
	// Offset: 0x3c8dd78
	// Params: [ Num(1) Size(0x1) ]
	void SetNoiseSpreadEnabled(bool InValue);

	// Object: Function MFNPCAI.NPCAIPerceptionSystem.OnSourceActorEndPlay
	// Flags: [Native|Public]
	// Offset: 0x993495c
	// Params: [ Num(2) Size(0x9) ]
	void OnSourceActorEndPlay(struct AActor* InActor, uint8_t InEndPlayReason);

	// Object: Function MFNPCAI.NPCAIPerceptionSystem.ModifySenseRangeInRuntime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c8de28
	// Params: [ Num(5) Size(0x12) ]
	bool ModifySenseRangeInRuntime(struct AActor* InAIController, float InCatchRadiusScale, float InLossRadiusScale, EAISenseType InSenseType);

	// Object: Function MFNPCAI.NPCAIPerceptionSystem.IsNoiseSpreadEnabled
	// Flags: [Final|Native|Public]
	// Offset: 0x3c8dd5c
	// Params: [ Num(1) Size(0x1) ]
	bool IsNoiseSpreadEnabled();
};

// Object: Class MFNPCAI.NPCAIProfile
// Size: 0x38 (Inherited: 0x28)
struct UNPCAIProfile : UObject
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIProfile, "NPCAIProfile")

	struct UNPCAIActorComponent* FactionClass; // 0x28(0x8)
	struct UNPCAIActorComponent* RoleClass; // 0x30(0x8)
};

// Object: Class MFNPCAI.NPCAIPropertyProfile
// Size: 0x38 (Inherited: 0x38)
struct UNPCAIPropertyProfile : UNPCAIPropertyProfileBase
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIPropertyProfile, "NPCAIPropertyProfile")
};

// Object: Class MFNPCAI.NPCAIPropertyComponent
// Size: 0x38 (Inherited: 0x38)
struct UNPCAIPropertyComponent : UNPCAIProfileBaseComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIPropertyComponent, "NPCAIPropertyComponent")
};

// Object: Class MFNPCAI.AIPropertyAimingProfile
// Size: 0x148 (Inherited: 0x38)
struct UAIPropertyAimingProfile : UNPCAIPropertyProfile
{
	DEFINE_UE_CLASS_HELPERS(UAIPropertyAimingProfile, "AIPropertyAimingProfile")

	float AimTimeDelayByDamageProb; // 0x34(0x4)
	float AimTimeDelayByDamageMin; // 0x38(0x4)
	float AimTimeDelayByDamageMax; // 0x3C(0x4)
	float AimTimeDelayByFirstShoot; // 0x40(0x4)
	float AimTimeDelayByFirstShootProb; // 0x44(0x4)
	float AimTimeDelayByMove; // 0x48(0x4)
	float UA_QUICK_AIM_OFFSET_DIS_RATE; // 0x4C(0x4)
	float UA_QUICK_AIM_UNDER_SEEN_TIME; // 0x50(0x4)
	float UA_QUICK_AIM_TIME_CALC_COEF; // 0x54(0x4)
	struct UCurveFloat* UA_AIM_TIME_TO_DIST_MULTIPLIER_CURVE; // 0x58(0x8)
	struct UCurveFloat* UA_SCATTERING_DIST_CURVE; // 0x60(0x8)
	struct UCurveFloat* UA_FAKE_RANDOM_HIT_RATE_CURVE; // 0x68(0x8)
	struct TArray<float> UA_SHOOT_HIT_RATES; // 0x70(0x10)
	struct TArray<float> UA_SHOOT_HIT_RATES_AI; // 0x80(0x10)
	struct UCurveFloat* UA_SHOOT_HIT_RATE_DISTANCE_TO_PLAYER_CURVE; // 0x90(0x8)
	struct UCurveFloat* UA_SHOOT_HIT_RATE_DISTANCE_TO_AI_CURVE; // 0x98(0x8)
	struct UCurveFloat* UA_SHOOT_HIT_RATE_DISTANCE_NOT_ADS; // 0xA0(0x8)
	float UA_ADD_AIMING_TICK_WHEN_ANGLE_SMALLER_THAN; // 0xA8(0x4)
	float UA_ADD_AIMING_TICK_WHEN_ANGLE_SMALLER_THAN_COS; // 0xAC(0x4)
	bool IS_USE_PREDESTINED_FAKE_RANDOM; // 0xB0(0x1)
	float UA_SHOOT_HIT_RATE_IF_AIMOVE; // 0xB4(0x4)
	float UA_SHOOT_HIT_RATE_IF_ENEMY_MOVE_SPEED; // 0xB8(0x4)
	float UA_SHOOT_HIT_RATE_IF_ENEMY_MOVE; // 0xBC(0x4)
	float UA_SHOOT_HIT_RATE_IF_ARM_BROKEN; // 0xC0(0x4)
	float UA_SHOOT_HIT_RATE_IF_INCOVER_SAFE; // 0xC4(0x4)
	float UA_SHOOT_HIT_RATE_IF_BE_HITED; // 0xC8(0x4)
	uint8_t Pad_0xCD[0x3]; // 0xCD(0x3)
	struct UCurveFloat* UA_SHOOT_HIT_RATE_IF_BATTLE_DURATION_CURVE; // 0xD0(0x8)
	struct UCurveFloat* UA_SHOOT_HIT_RATE_IF_WEAPON_ADSMOA_BIAS_CURVE; // 0xD8(0x8)
	float UA_SHOOT_HIT_RATE_IF_SHOOT_HEAD; // 0xE0(0x4)
	float UA_SHOOT_HIT_RATE_IF_UNDER_FLASH_LIGHT; // 0xE4(0x4)
	struct UCurveFloat* UA_SHOOT_HIT_RATE_IF_VEHICLE_SPEEDKPH_CURVE; // 0xE8(0x8)
	float UA_SHOOT_HEAD_FACE_RATE_IF_USE_PREDESTINED; // 0xF0(0x4)
	float UA_SHOOT_HIT_LIMITED_TIME; // 0xF4(0x4)
	float MinAimDuration; // 0xF8(0x4)
	float MaxAimDuration; // 0xFC(0x4)
	float ShootPartRandInterval; // 0x100(0x4)
	float ShootSpecifiedPartTime; // 0x104(0x4)
	struct TArray<struct FAIBodyBulkAimingChoice> AIMING_BULK_FOR_PLAYER; // 0x108(0x10)
	struct TArray<struct FAIBodyBulkAimingChoice> AIMING_BULK_FOR_AI; // 0x118(0x10)
	bool IS_FILTER_NOT_SEEN_PART_TO_AIMING; // 0x128(0x1)
	EAIAimingBodyPartTrend AIMING_BODYPART_TREND; // 0x129(0x1)
	uint8_t Pad_0x12A[0x2]; // 0x12A(0x2)
	int32_t FireCountMin; // 0x12C(0x4)
	int32_t FireCountMax; // 0x130(0x4)
	EAimingType AimingType; // 0x134(0x1)
	uint8_t Pad_0x135[0x3]; // 0x135(0x3)
	float ReAimThreshold_Z; // 0x138(0x4)
	float ReAimThreshold_XY; // 0x13C(0x4)
	float ReAimThreshold_XY_Sqr; // 0x140(0x4)
	uint8_t Pad_0x144[0x4]; // 0x144(0x4)
};

// Object: Class MFNPCAI.NPCAIPropertyComponent_Aiming
// Size: 0x50 (Inherited: 0x38)
struct UNPCAIPropertyComponent_Aiming : UNPCAIPropertyComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIPropertyComponent_Aiming, "NPCAIPropertyComponent_Aiming")

	uint8_t Pad_0x38[0x10]; // 0x38(0x10)
	float MaxAimDurationModifier; // 0x48(0x4)
	EAIAimingBodyPartTrend AimingBodyPartTrendModifier; // 0x4C(0x1)
	bool AimingBodyPartTrendModifierIsChanged; // 0x4D(0x1)
	uint8_t Pad_0x4E[0x2]; // 0x4E(0x2)

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.SetMaxAimTime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c925c0
	// Params: [ Num(2) Size(0x8) ]
	float SetMaxAimTime(float Value);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.SetAimingBodyPartWeightInRuntime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c92a64
	// Params: [ Num(3) Size(0x9) ]
	void SetAimingBodyPartWeightInRuntime(EAIBodyPartType InBodyPart, float InWeight, bool bIsForPlayer);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.SetAimingBodyPartTrend
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c92948
	// Params: [ Num(2) Size(0x2) ]
	EAIAimingBodyPartTrend SetAimingBodyPartTrend(EAIAimingBodyPartTrend AimingTrend);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.RemoveAimingTypeInRuntime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c92c8c
	// Params: [ Num(2) Size(0x2) ]
	void RemoveAimingTypeInRuntime(EAIBodyBulkType InBulkType, bool bIsForPlayer);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.IsUsePerdestinedFakeRandom
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c9324c
	// Params: [ Num(1) Size(0x1) ]
	bool IsUsePerdestinedFakeRandom();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.IsAimingChoicesContains
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c92eac
	// Params: [ Num(3) Size(0x3) ]
	bool IsAimingChoicesContains(EAIBodyPartType InBodyPartType, bool bIsForPlayer);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUaSpreadOffsetXYClamp
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93148
	// Params: [ Num(1) Size(0x4) ]
	float GetUaSpreadOffsetXYClamp();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUaSpreadOffsetMinZClamp
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93114
	// Params: [ Num(1) Size(0x4) ]
	float GetUaSpreadOffsetMinZClamp();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUaSpreadOffsetMaxZClamp
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c930e0
	// Params: [ Num(1) Size(0x4) ]
	float GetUaSpreadOffsetMaxZClamp();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUaShootHitRatesAI
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93844
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<float> GetUaShootHitRatesAI();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUaShootHitRates
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c938c8
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<float> GetUaShootHitRates();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateIfWeaponAdsMoaBias
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c9339c
	// Params: [ Num(2) Size(0x8) ]
	float GetUAShootHitRateIfWeaponAdsMoaBias(float AdsMoaBias);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateIfVehicleSpeedKPH
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93284
	// Params: [ Num(2) Size(0x8) ]
	float GetUAShootHitRateIfVehicleSpeedKPH(float VehicleSpeedKPH);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateIfUnderFlashLight
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93334
	// Params: [ Num(1) Size(0x4) ]
	float GetUAShootHitRateIfUnderFlashLight();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateIfShootHead
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93368
	// Params: [ Num(1) Size(0x4) ]
	float GetUAShootHitRateIfShootHead();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateIfInCoverSafe
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93530
	// Params: [ Num(1) Size(0x4) ]
	float GetUAShootHitRateIfInCoverSafe();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateIfEnemyMoveSpeed
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c935cc
	// Params: [ Num(1) Size(0x4) ]
	float GetUAShootHitRateIfEnemyMoveSpeed();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateIfEnemyMove
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93598
	// Params: [ Num(1) Size(0x4) ]
	float GetUAShootHitRateIfEnemyMove();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateIfBeHited
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c934fc
	// Params: [ Num(1) Size(0x4) ]
	float GetUAShootHitRateIfBeHited();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateIfBattleDuration
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c9344c
	// Params: [ Num(2) Size(0x8) ]
	float GetUAShootHitRateIfBattleDuration(float BattleDurationTime);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateIfArmBroken
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93564
	// Params: [ Num(1) Size(0x4) ]
	float GetUAShootHitRateIfArmBroken();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateIfAIMove
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93600
	// Params: [ Num(1) Size(0x4) ]
	float GetUAShootHitRateIfAIMove();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateForDistanceToPlayer
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93794
	// Params: [ Num(2) Size(0x8) ]
	float GetUAShootHitRateForDistanceToPlayer(float InDistance);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateForDistanceToAI
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c936e4
	// Params: [ Num(2) Size(0x8) ]
	float GetUAShootHitRateForDistanceToAI(float InDistance);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitRateForDistanceIfNotADS
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93634
	// Params: [ Num(2) Size(0x8) ]
	float GetUAShootHitRateForDistanceIfNotADS(float InDistance);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHitLimitedTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c931b0
	// Params: [ Num(1) Size(0x4) ]
	float GetUAShootHitLimitedTime();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUAShootHeadFaceRateIfUsedPredstined
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93218
	// Params: [ Num(1) Size(0x4) ]
	float GetUAShootHeadFaceRateIfUsedPredstined();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUaScatteringByDist
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93a98
	// Params: [ Num(2) Size(0x8) ]
	float GetUaScatteringByDist(float Distance);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUaQuickAimUnderSeenTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93980
	// Params: [ Num(1) Size(0x4) ]
	float GetUaQuickAimUnderSeenTime();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUaQuickAimTimeCalcCoef
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c9394c
	// Params: [ Num(1) Size(0x4) ]
	float GetUaQuickAimTimeCalcCoef();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUaQuickAimOffsetDisRate
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c939b4
	// Params: [ Num(1) Size(0x4) ]
	float GetUaQuickAimOffsetDisRate();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUaMinAimTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c9317c
	// Params: [ Num(1) Size(0x4) ]
	float GetUaMinAimTime();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUaFakeRandomHitRate
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c939e8
	// Params: [ Num(2) Size(0x8) ]
	float GetUaFakeRandomHitRate(float HitRate);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUaAimTime2DistMultiplierCurve
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93b48
	// Params: [ Num(1) Size(0x8) ]
	struct UCurveFloat* GetUaAimTime2DistMultiplierCurve();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetUaAddAimingTickWhenAngleSmallerThan_Cos
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c931e4
	// Params: [ Num(1) Size(0x4) ]
	float GetUaAddAimingTickWhenAngleSmallerThan_Cos();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetShootSpecifiedPartTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c928e0
	// Params: [ Num(1) Size(0x4) ]
	float GetShootSpecifiedPartTime();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetShootPartRandInterval
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c92914
	// Params: [ Num(1) Size(0x4) ]
	float GetShootPartRandInterval();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetReAimThreshold_Z
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c928ac
	// Params: [ Num(1) Size(0x4) ]
	float GetReAimThreshold_Z();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetReAimThreshold_XY_Sqr
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c92844
	// Params: [ Num(1) Size(0x4) ]
	float GetReAimThreshold_XY_Sqr();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetReAimThreshold_XY
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c92878
	// Params: [ Num(1) Size(0x4) ]
	float GetReAimThreshold_XY();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetMaxAimTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c92670
	// Params: [ Num(1) Size(0x4) ]
	float GetMaxAimTime();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetIsFilterNotSeenPartToAiming
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c92a2c
	// Params: [ Num(1) Size(0x1) ]
	bool GetIsFilterNotSeenPartToAiming();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetFireCountMin
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c92810
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetFireCountMin();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetFireCountMax
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c927dc
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetFireCountMax();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetAIProfileType
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c93b7c
	// Params: [ Num(1) Size(0x1) ]
	EAIProfileType GetAIProfileType();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetAimTimeDelayByMove
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c926a4
	// Params: [ Num(1) Size(0x4) ]
	float GetAimTimeDelayByMove();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetAimTimeDelayByFirstShootProb
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c926d8
	// Params: [ Num(1) Size(0x4) ]
	float GetAimTimeDelayByFirstShootProb();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetAimTimeDelayByFirstShoot
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c9270c
	// Params: [ Num(1) Size(0x4) ]
	float GetAimTimeDelayByFirstShoot();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetAimTimeDelayByDamageProb
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c927a8
	// Params: [ Num(1) Size(0x4) ]
	float GetAimTimeDelayByDamageProb();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetAimTimeDelayByDamageMin
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c92774
	// Params: [ Num(1) Size(0x4) ]
	float GetAimTimeDelayByDamageMin();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetAimTimeDelayByDamageMax
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c92740
	// Params: [ Num(1) Size(0x4) ]
	float GetAimTimeDelayByDamageMax();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetAimingTypeWeightInRuntime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c92b94
	// Params: [ Num(3) Size(0x8) ]
	float GetAimingTypeWeightInRuntime(EAIBodyBulkType InBulkType, bool bIsForPlayer);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetAimingType
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c9258c
	// Params: [ Num(1) Size(0x1) ]
	EAimingType GetAimingType();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetAimingBulks
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c92fa8
	// Params: [ Num(2) Size(0x18) ]
	struct TArray<struct FAIBodyBulkAimingChoice> GetAimingBulks(bool bIsForPlayer);

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.GetAimingBodyPartTrend
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c929f8
	// Params: [ Num(1) Size(0x1) ]
	EAIAimingBodyPartTrend GetAimingBodyPartTrend();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Aiming.AddAimingTypeInRuntime
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x3c92d7c
	// Params: [ Num(3) Size(0x9) ]
	void AddAimingTypeInRuntime(EAIBodyBulkType InBulkType, float InWeight, bool bIsForPlayer);
};

// Object: Class MFNPCAI.AIPropertyAITypeProfile
// Size: 0x38 (Inherited: 0x38)
struct UAIPropertyAITypeProfile : UNPCAIPropertyProfile
{
	DEFINE_UE_CLASS_HELPERS(UAIPropertyAITypeProfile, "AIPropertyAITypeProfile")

	ENPCAIJobType AIJobType; // 0x31(0x1)
};

// Object: Class MFNPCAI.NPCAIPropertyComponent_AIType
// Size: 0x40 (Inherited: 0x38)
struct UNPCAIPropertyComponent_AIType : UNPCAIPropertyComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIPropertyComponent_AIType, "NPCAIPropertyComponent_AIType")

	struct UNPCAIModifierComponent_AIType* Modifier_AIType; // 0x38(0x8)

	// Object: Function MFNPCAI.NPCAIPropertyComponent_AIType.InitModifierComponents
	// Flags: [Final|Native|Public]
	// Offset: 0x3c93cac
	// Params: [ Num(1) Size(0x1) ]
	bool InitModifierComponents();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_AIType.GetAIProfileType
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c93ce4
	// Params: [ Num(1) Size(0x1) ]
	EAIProfileType GetAIProfileType();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_AIType.GetAIMainType
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c93c78
	// Params: [ Num(1) Size(0x1) ]
	EAIMainType GetAIMainType();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_AIType.GetAIJobType
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93c44
	// Params: [ Num(1) Size(0x1) ]
	ENPCAIJobType GetAIJobType();
};

// Object: Class MFNPCAI.AIPropertyBlockProfile
// Size: 0x38 (Inherited: 0x38)
struct UAIPropertyBlockProfile : UNPCAIPropertyProfile
{
	DEFINE_UE_CLASS_HELPERS(UAIPropertyBlockProfile, "AIPropertyBlockProfile")
};

// Object: Class MFNPCAI.NPCAIPropertyComponent_Block
// Size: 0x38 (Inherited: 0x38)
struct UNPCAIPropertyComponent_Block : UNPCAIPropertyComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIPropertyComponent_Block, "NPCAIPropertyComponent_Block")

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Block.GetAIProfileType
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c93d40
	// Params: [ Num(1) Size(0x1) ]
	EAIProfileType GetAIProfileType();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Block.GetAimTimeAfterTurn
	// Flags: [Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure]
	// Offset: 0x5d8cbc8
	// Params: [ Num(2) Size(0x8) ]
	float GetAimTimeAfterTurn(float Angle);
};

// Object: Class MFNPCAI.AIPropertyBossProfile
// Size: 0x48 (Inherited: 0x38)
struct UAIPropertyBossProfile : UNPCAIPropertyProfile
{
	DEFINE_UE_CLASS_HELPERS(UAIPropertyBossProfile, "AIPropertyBossProfile")

	bool ThreatenShootEnable; // 0x31(0x1)
	float ThreatenShootCloseDist; // 0x34(0x4)
	float ThreatenShootEndDist; // 0x38(0x4)
	float ThreatenShootDist; // 0x3C(0x4)
	float ThreatenShootTime; // 0x40(0x4)
};

// Object: Class MFNPCAI.NPCAIPropertyComponent_Boss
// Size: 0x38 (Inherited: 0x38)
struct UNPCAIPropertyComponent_Boss : UNPCAIPropertyComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIPropertyComponent_Boss, "NPCAIPropertyComponent_Boss")

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Boss.IsThreatenShootEnable
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93ee0
	// Params: [ Num(1) Size(0x1) ]
	bool IsThreatenShootEnable();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Boss.GetThreatenShootTime
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93e78
	// Params: [ Num(1) Size(0x4) ]
	float GetThreatenShootTime();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Boss.GetThreatenShootEndDist
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93e10
	// Params: [ Num(1) Size(0x4) ]
	float GetThreatenShootEndDist();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Boss.GetThreatenShootDist
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93eac
	// Params: [ Num(1) Size(0x4) ]
	float GetThreatenShootDist();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Boss.GetThreatenShootCloseDist
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c93e44
	// Params: [ Num(1) Size(0x4) ]
	float GetThreatenShootCloseDist();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Boss.GetAIProfileType
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c93f18
	// Params: [ Num(1) Size(0x1) ]
	EAIProfileType GetAIProfileType();
};

// Object: Class MFNPCAI.AIPropertyCoreProfile
// Size: 0x40 (Inherited: 0x38)
struct UAIPropertyCoreProfile : UNPCAIPropertyProfile
{
	DEFINE_UE_CLASS_HELPERS(UAIPropertyCoreProfile, "AIPropertyCoreProfile")

	EAimingType AimingType; // 0x31(0x1)
	float AccuratySpeed; // 0x34(0x4)
	EAILODActionPlan LODPlan; // 0x38(0x1)
	uint8_t Pad_0x3E[0x2]; // 0x3E(0x2)
};

// Object: Class MFNPCAI.NPCAIPropertyComponent_Core
// Size: 0x38 (Inherited: 0x38)
struct UNPCAIPropertyComponent_Core : UNPCAIPropertyComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIPropertyComponent_Core, "NPCAIPropertyComponent_Core")

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Core.GetUseLODPlan
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c96434
	// Params: [ Num(1) Size(0x1) ]
	EAILODActionPlan GetUseLODPlan();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Core.GetAIProfileType
	// Flags: [Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x3c964d0
	// Params: [ Num(1) Size(0x1) ]
	EAIProfileType GetAIProfileType();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Core.GetAimingType
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c9649c
	// Params: [ Num(1) Size(0x1) ]
	EAimingType GetAimingType();

	// Object: Function MFNPCAI.NPCAIPropertyComponent_Core.GetAccuratySpeed
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x3c96468
	// Params: [ Num(1) Size(0x4) ]
	float GetAccuratySpeed();
};

// Object: Class MFNPCAI.AIPropertyCurveProfile
// Size: 0x48 (Inherited: 0x38)
struct UAIPropertyCurveProfile : UNPCAIPropertyProfile
{
	DEFINE_UE_CLASS_HELPERS(UAIPropertyCurveProfile, "AIPropertyCurveProfile")

	struct UCurveFloat* SightCurveDaytime; // 0x38(0x8)
	struct UCurveFloat* SightCureOutLight; // 0x40(0x8)
};

// Object: Class MFNPCAI.NPCAIPropertyComponent_Curve
// Size: 0x38 (Inherited: 0x38)
struct UNPCAIPropertyComponent_Curve : UNPCAIPropertyComponent
{
	DEFINE_UE_CLASS_HELPERS(UNPCAIPropertyComponent_Curve, "NPCAIPropertyComponent_Curve")

