#pragma once

#include "../CoreUObject_classes.hpp"
#include "Engine.hpp"
#include "Foliage.hpp"
#include "GameplayAbilities.hpp"
#include "GameplayTags.hpp"
#include "MFBenchmark.hpp"
#include "MFClimateRuntime.hpp"
#include "MFDataVisualizer.hpp"
#include "MFGlobalEventParameterTags.hpp"
#include "MFGridLevelsRuntime.hpp"
#include "MFMission.hpp"
#include "MFMobileJoystick.hpp"
#include "MFPropsDestruction.hpp"
#include "MFQuestSystem.hpp"
#include "ReplicationGraph.hpp"
#include "SGFramework.hpp"
#include "SlateCore.hpp"
#include "StructUtils.hpp"
#include "UACommon.hpp"
#include "UADataTableModule.hpp"
#include "UMG.hpp"

namespace SDK
{

// Package: UAGame
// Enums: 167
// Structs: 406
// Classes: 1057

struct AAIController;
struct AActor;
struct AAkAcousticPortal;
struct ACharacter;
struct AController;
struct AGameModeBase;
struct AGameState;
struct AGameStateBase;
struct ALevelSequenceActor;
struct AMFQuestBase;
struct AMFQuestDistributerBase;
struct APawn;
struct APlayerController;
struct APlayerStart;
struct APlayerState;
struct ASGAICharacter;
struct ASGAIController;
struct ASGAIPathNode;
struct ASGAISpawnPoint;
struct ASGAITriggerVolume;
struct ASGCharacter;
struct ASGCharacterProxy;
struct ASGDoorBase;
struct ASGFaction;
struct ASGGameState;
struct ASGGashapon;
struct ASGInventory;
struct ASGInventoryMonitorVolume;
struct ASGLevelSequenceActor;
struct ASGLootSubAreaVolume;
struct ASGNetRelevantConfigurableActor;
struct ASGParadropBase;
struct ASGPickUpGroup;

struct UUATraceDispatcher_DirectionalBar;
struct UUATraceSubSystem;
struct AUATrader;
struct UUATreasureDetectorComponent;
struct AUATutorialHelper;
struct UUATutorialMissionAction_CheckPoint;
struct UUATutorialMissionAction_FireInputEnable;
struct UUATutorialMissionAction_FollowBar;
struct UUATutorialMissionAction_FullHudScreenCloseEnable;
struct UUATutorialMissionAction_GiveItem;
struct UUATutorialMissionAction_GuideActivate;
struct UUATutorialMissionAction_HUDMask;
struct UUATutorialMissionAction_HudMessage;
struct UUATutorialMissionAction_HudTips;
struct UUATutorialMissionAction_ItemBreathe;
struct UUATutorialMissionAction_LockItemIDs;
struct UUATutorialMissionAction_MapSign;
struct UUATutorialMissionAction_MoveVolumeArrow;
struct UUATutorialMissionAction_PadHighEffect;
struct UUATutorialMissionAction_PadVisibility;
struct UUATutorialMissionAction_QuestTraceHighEffect;
struct UUATutorialMissionAction_Report;
struct UUATutorialMissionAction_TutorialCAddLootCount;
struct UUATutorialMissionAction_TutorialCGuidance;
struct UUATutorialMissionAction_TutorialCMapSign;
struct UUATutorialMissionAction_WidgetEffect_T;
struct UUATutorialMissionCondition_HasItem;
struct UUATutorialMissionCondition_IsWeaponUse;
struct UUATutorialMissionCondition_ItemIsInspected;
struct UUATutorialMissionCondition_PushBullet;
struct UUATutorialMissionObjective;
struct UUATutorialMissionObjective_ActorTransform;
struct UUATutorialMissionObjective_AddMapSign;
struct UUATutorialMissionObjective_Bag;
struct UUATutorialMissionObjective_BagTabClick;
struct UUATutorialMissionObjective_BigMapDetailBoardShow;
struct UUATutorialMissionObjective_ClickItem;
struct UUATutorialMissionObjective_InspectItem;
struct UUATutorialMissionObjective_MoveItem;
struct UUATutorialMissionObjective_MoveTo;
struct UUATutorialMissionObjective_OpenItemDetail;
struct UUATutorialMissionObjective_OpenPPT;
struct UUATutorialMissionObjective_PadButtonClick;
struct UUATutorialMissionObjective_PoseChange;
struct UUATutorialMissionObjective_SetMaterialParams;
struct UUATutorialMissionObjective_TestKillTarget;
struct UUATutorialMissionObjective_WeaponADS;
struct UUATutorialMissionObjective_WeaponAssemble;
struct UUATutorialMissionObjective_WeaponCheck;
struct UUATutorialMissionObjective_WeaponFire;
struct UUATutorialMissionObjective_WeaponUse;
struct UUATutorialStatics;
struct UUAUserWidget_AdviseInv;
struct UUAUserWidget_QuickUseItem;
struct UUAUserWidget_SelectGrenade;
struct UUAUserWidget_UrgentQuestDangerBtn;
struct UUAUserWidget_UrgentQuestDangerInfo;
struct UUAVehicleCommonComponent;
struct UUAVehicleTypes;
struct AUAVerticalDropParadrop;
struct UUAVolumeInteractComponent;
struct UUAVolumeSpawnInventoryComponent;
struct UUAVolumeStatisComponent;
struct IUAVolumeTraceLocationRedirectInterface;
struct UUAWetnessComponent;
struct UUAWorldSettingsNavigationMeshInfoComponent;
struct UHyperlinkRichTextBlockDecorator;
struct UUUAGameplayAbility_InterrogatePassive;
struct UUUAMissionObjective_PlayerFinishGame;

// Object: Enum UAGame.EAnnounceType
enum class EAnnounceType : uint8_t
{
	InstantMessage = 0,
	CountDown = 1,
	EAnnounceType_MAX = 2
};

// Object: Enum UAGame.EAnnounceSlot
enum class EAnnounceSlot : uint8_t
{
	Top = 0,
	Bottom = 1,
	Right = 2,
	Center = 3,
	RightBottom = 4,
	Left = 5,
	FillScreen = 6,
	LeftUp = 7,
	RightUp = 8,
	ContactOfficer = 9,
	EAnnounceSlot_MAX = 10
};

// Object: Enum UAGame.ETutorialFlowBarType
enum class ETutorialFlowBarType : uint8_t
{
	TutorialFlowBarType_Text = 0,
	TutorialFlowBarType_DynamicImage = 1,
	TutorialFlowBarType_Teammate = 2,
	TutorialFlowBarType_Arrow = 3,
	TutorialFlowBarType_PVETeam = 4,
	TutorialFlowBarType_MAX = 5
};

// Object: Enum UAGame.ETutorialBagType
enum class ETutorialBagType : uint8_t
{
	TutorialBagType_None = 0,
	TutorialBagType_Self = 1,
	TutorialBagType_Loot = 2,
	TutorialBagType_Corpse = 3,
	TutorialBagType_MAX = 4
};

// Object: Enum UAGame.ETutorialBagWidgetType
enum class ETutorialBagWidgetType : uint8_t
{
	Undefined = 0,
	PickupsNearby = 1,
	MyBag = 2,
	MyBagIcon = 3,
	VestBag = 4,
	VestBagIcon = 5,
	PickBag = 6,
	Character = 7,
	Inventory = 8,
	Adapter = 9,
	FirstMainWeapon = 10,
	SecondMainWeapon = 11,
	AssistWeapon = 12,
	MeleeWeapon = 13,
	ThrowWeapon = 14,
	Armor_Helmet = 15,
	Armor_Vest = 16,
	Pocket = 17,
	SafeBox = 18,
	SafeBoxIcon = 19,
	Headset = 20,
	FaceCover = 21,
	EyeWear = 22,
	ArmBand = 23,
	DogTag = 24,
	SplitItemWindow = 25,
	RotateItemWindow = 26,
	MAX = 27
};

// Object: Enum UAGame.ETutorialToggleFXType
enum class ETutorialToggleFXType : uint8_t
{
	None = 0,
	Open = 1,
	Close = 2,
	ETutorialToggleFXType_MAX = 3
};

// Object: Enum UAGame.ETutorialFXType
enum class ETutorialFXType : uint8_t
{
	None = 0,
	BPFX_ArticuloMortis = 1,
	BPFX_Eye = 2,
	BPFX_Eye_Anim2 = 3,
	BP_Eye_AnimLoop = 4,
	BP_Eye_Eye = 5,
	BPFX_Eye_Anim2_Open = 6,
	ETutorialFXType_MAX = 7
};

// Object: Enum UAGame.EUARoundState
enum class EUARoundState : uint8_t
{
	EUARoundState_NONE = 0,
	EUARoundState_ChooseHero = 1,
	EUARoundState_Prepare = 2,
	EUARoundState_CountDown = 3,
	EUARoundState_Gaming = 4,
	EUARoundState_ExplosionCountDown = 5,
	EUARoundState_EndGame = 6,
	EUARoundState_MAX = 7
};

// Object: Enum UAGame.ENLPMentorResponseType
enum class ENLPMentorResponseType : uint8_t
{
	None_Response = 0,
	Ammo_Insufficient_Low = 1,
	Ammo_Insufficient_Medium = 2,
	Ammo_Insufficient_High = 3,
	Ammo_Sufficient_LowLow = 4,
	Armor_Related_Low = 5,
	Armor_Related_LowLow = 6,
	Overweight_Abnormal_Low = 7,
	Overweight_Abnormal_High = 8,
	Environment_Area_LowLow = 9,
	Energy_Insufficient_Low = 10,
	Energy_Insufficient_High = 11,
	Health_Status_Low = 12,
	Health_Status_LowLow = 13,
	Health_Status_Medium = 14,
	Health_Status_High = 15,
	Time_Related_Medium = 16,
	Time_Related_High = 17,
	Reward_Related_Low = 18,
	Reward_Related_Medium = 19,
	Hydration_Insufficient_Medium = 20,
	Normal_Status_Active_Trigger = 21,
	ENLPMentorResponseType_MAX = 22
};

// Object: Enum UAGame.ENLPMentorButtonHighlight
enum class ENLPMentorButtonHighlight : uint8_t
{
	UNSPECIFIED = 0,
	RELOAD = 1,
	HEAL = 2,
	CHANGE_MAG = 3,
	ENLPMentorButtonHighlight_MAX = 4
};

// Object: Enum UAGame.EBirdAlertAreaState
enum class EBirdAlertAreaState : uint8_t
{
	Idle = 0,
	TakingOff = 1,
	Hover = 2,
	Landing = 3,
	EBirdAlertAreaState_MAX = 4
};

// Object: Enum UAGame.EUAEscapeSubmitType
enum class EUAEscapeSubmitType : uint8_t
{
	CoinConversion = 0,
	ItemConversion = 1,
	DirectSubmission = 2,
	EUAEscapeSubmitType_MAX = 3
};

// Object: Enum UAGame.EEvacuateFromInteraction
enum class EEvacuateFromInteraction : uint8_t
{
	Interaction = 0,
	DebrisSubmission = 1,
	ItemSubmission = 2,
	MAX = 3
};

// Object: Enum UAGame.EInteractionEscapeMode
enum class EInteractionEscapeMode : uint8_t
{
	World = 0,
	Team = 1,
	Personal = 2,
	EInteractionEscapeMode_MAX = 3
};

// Object: Enum UAGame.ENewMapInterfaceType
enum class ENewMapInterfaceType : uint8_t
{
	None = 0,
	SizeChange = 1,
	OffsetChange = 2,
	ScaleChange = 4,
	AreaChange = 8,
	All = 15,
	ENewMapInterfaceType_MAX = 16
};

// Object: Enum UAGame.ESubWidgetDisplayMode
enum class ESubWidgetDisplayMode : uint8_t
{
	NormalDisplay = 0,
	ConstrainToEdge = 1,
	HideWhenOutOfRange = 2,
	ESubWidgetDisplayMode_MAX = 3
};

// Object: Enum UAGame.EPlayerMinimapBehavior
enum class EPlayerMinimapBehavior : uint8_t
{
	None = 0,
	SilentWalk = 1,
	Sprinting = 2,
	EPlayerMinimapBehavior_MAX = 3
};

// Object: Enum UAGame.InventoryDestroyedEffectType
enum class EInventoryDestroyedEffectType : uint8_t
{
	QuestFailed = 0,
	InventoryDestroyedEffectType_MAX = 1
};

// Object: Enum UAGame.ETutorialCharacterStateCheckType
enum class ETutorialCharacterStateCheckType : uint8_t
{
	TutorialCharacterStateCheckType_None = 0,
	TutorialCharacterStateCheckType_OnceInState = 1,
	TutorialCharacterStateCheckType_AddProgressInState = 2,
	TutorialCharacterStateCheckType_MAX = 3
};

// Object: Enum UAGame.EQuestConditionCharacterType
enum class EQuestConditionCharacterType : uint8_t
{
	ECharacterType_AI = 0,
	ECharacterType_TEAMMATE = 1,
	ECharacterType_MAX = 2
};

// Object: Enum UAGame.EQuestConditionCharacterStatus
enum class EQuestConditionCharacterStatus : uint8_t
{
	ECharacterType_ALIVE_HAS = 0,
	ECharacterType_ALIVE_ALL = 1,
	ECharacterType_DIED_HAS = 2,
	ECharacterType_DIED_ALL = 3,
	ECharacterType_MAX = 4
};

// Object: Enum UAGame.EQuestCheckCustomAttribute
enum class EQuestCheckCustomAttribute : uint8_t
{
	TotalEndurance = 0,
	EQuestCheckCustomAttribute_MAX = 1
};

// Object: Enum UAGame.ECheckItemType
enum class ECheckItemType : uint8_t
{
	Weapon = 0,
	Helmet = 1,
	Vest = 2,
	Headset = 3,
	FaceCover = 4,
	EyeWear = 5,
	VestBag = 6,
	Bag = 7,
	ECheckItemType_MAX = 8
};

// Object: Enum UAGame.EGameplayTagCheckType
enum class EGameplayTagCheckType : uint8_t
{
	AnyMatching = 0,
	AllMatching = 1,
	EGameplayTagCheckType_MAX = 2
};

// Object: Enum UAGame.EQuestTakeLimitLogicType
enum class EQuestTakeLimitLogicType : uint8_t
{
	Enum_And = 0,
	Enum_Or = 1,
	Enum_MAX = 2
};

// Object: Enum UAGame.ETeamInfoCheckType
enum class ETeamInfoCheckType : uint8_t
{
	MaxCount = 0,
	AliveCount = 1,
	EscapeCount = 2,
	DiedCount = 3,
	ETeamInfoCheckType_MAX = 4
};

// Object: Enum UAGame.ETimeLimitType
enum class ETimeLimitType : uint8_t
{
	EnterGame = 0,
	TimeRecord = 1,
	ETimeLimitType_MAX = 2
};

// Object: Enum UAGame.ETutorialBagState
enum class ETutorialBagState : uint8_t
{
	BigMapState_None = 0,
	BigMapState_Open = 1,
	BigMapState_Close = 2,
	BigMapState_MAX = 3
};

// Object: Enum UAGame.EBigMapState
enum class EBigMapState : uint8_t
{
	BigMapState_None = 0,
	BigMapState_Open = 1,
	BigMapState_Close = 2,
	BigMapState_MAX = 3
};

// Object: Enum UAGame.ETutorialDoorState
enum class ETutorialDoorState : uint8_t
{
	TutorialDoorState_None = 0,
	TutorialDoorState_Open = 1,
	TutorialDoorState_Close = 2,
	TutorialDoorState_MAX = 3
};

// Object: Enum UAGame.EFacePanelState
enum class EFacePanelState : uint8_t
{
	FacePanelState_None = 0,
	FacePanelState_Open = 1,
	FacePanelState_Close = 2,
	FacePanelState_MAX = 3
};

// Object: Enum UAGame.ETutorialSettingState
enum class ETutorialSettingState : uint8_t
{
	SettingPannalState_None = 0,
	SettingPannalState_Open = 1,
	SettingPannalState_Close = 2,
	SettingPannalState_MAX = 3
};

// Object: Enum UAGame.ETutorialDamageType
enum class ETutorialDamageType : uint8_t
{
	ETutorialDamageType_None = 0,
	ETutorialDamageType_Bullet = 1,
	ETutorialDamageType_Grenade = 2,
	ETutorialDamageType_MAX = 3
};

// Object: Enum UAGame.EQuestInteractEnableType
enum class EQuestInteractEnableType : uint8_t
{
	Self = 0,
	Teammate = 1,
	Anyone = 2,
	EQuestInteractEnableType_MAX = 3
};

// Object: Enum UAGame.EQuestTraceMarkType
enum class EQuestTraceMarkType : uint8_t
{
	QuestInventory = 0,
	InteractItem = 1,
	Area = 2,
	EscapePoint = 3,
	EQuestTraceMarkType_MAX = 4
};

// Object: Enum UAGame.EAutoCollectActorType
enum class EAutoCollectActorType : uint8_t
{
	CollectActor_Manual = 0,
	CollectActor_Distance = 1,
	CollectActor_All = 2,
	CollectActor_MAX = 3
};

// Object: Enum UAGame.EScrollMode
enum class EScrollMode : uint8_t
{
	Marquee = 0,
	PingPong = 1,
	EScrollMode_MAX = 2
};

// Object: Enum UAGame.ERichTextScrollDirection
enum class ERichTextScrollDirection : uint8_t
{
	Horizontal = 0,
	Vertical = 1,
	ERichTextScrollDirection_MAX = 2
};

// Object: Enum UAGame.ESoundDirType
enum class ESoundDirType : uint8_t
{
	None = 0,
	LeftUp = 1,
	LEFT = 2,
	LeftDown = 3,
	CENTER = 4,
	RightUp = 5,
	RIGHT = 6,
	RightDown = 7,
	ESoundDirType_MAX = 8
};

// Object: Enum UAGame.ESplineDrawType
enum class ESplineDrawType : uint8_t
{
	Consecutive = 0,
	Discrete = 1,
	Consecutive_SL = 2,
	Discrete_SL = 3,
	ESplineDrawType_MAX = 4
};

// Object: Enum UAGame.EActivityDataCenterType
enum class EActivityDataCenterType : uint8_t
{
	E_None = 0,
	E_GameState = 1,
	E_TeamInfo = 2,
	E_PlayerState = 3,
	E_MAX = 4
};

// Object: Enum UAGame.ELootRandomItemType
enum class ELootRandomItemType : uint8_t
{
	MainSetting = 0,
	NormalItem = 1,
	SubItemTable = 2,
	AssembledItem = 3,
	ELootRandomItemType_MAX = 4
};

// Object: Enum UAGame.ESGLootRandomItemOperation
enum class ESGLootRandomItemOperation : uint8_t
{
	And = 0,
	Or = 1,
	ESGLootRandomItemOperation_MAX = 2
};

// Object: Enum UAGame.EUAActorMeshPerformanceState
enum class EUAActorMeshPerformanceState : uint8_t
{
	None = 0,
	Playing = 1,
	Waiting = 2,
	Complete = 3,
	EUAActorMeshPerformanceState_MAX = 4
};

// Object: Enum UAGame.EUASceneEventListeningRule
enum class EUASceneEventListeningRule : uint8_t
{
	And = 0,
	Or = 1,
	EUASceneEventListeningRule_MAX = 2
};

// Object: Enum UAGame.EVehicleLootType
enum class EVehicleLootType : uint8_t
{
	Normal = 0,
	PossessByAI = 1,
	EVehicleLootType_MAX = 2
};

// Object: Enum UAGame.EAIAllyHeadBarType
enum class EAIAllyHeadBarType : uint8_t
{
	None = 0,
	FactionNormal = 1,
	EAIAllyHeadBarType_MAX = 2
};

// Object: Enum UAGame.EPMCAI2_PlanState
enum class EPMCAI2_PlanState : uint8_t
{
	EPreParing = 0,
	EWaitForRep = 1,
	EWaitForActivating = 2,
	EUsed = 3,
	EPMCAI2_MAX = 4
};

// Object: Enum UAGame.EVectorAISpawnLocType
enum class EVectorAISpawnLocType : uint8_t
{
	VectorAround = 0,
	RandomPlayerSpawnPoint = 1,
	RandomAISpawnPoint = 2,
	EVectorAISpawnLocType_MAX = 3
};

// Object: Enum UAGame.EAnnounceManagerActiveQueueResult
enum class EAnnounceManagerActiveQueueResult : uint8_t
{
	ActiveSuccess = 0,
	SlotPlayingNow = 1,
	QueueBeEmpty = 2,
	WaitAnotherQueue = 3,
	EAnnounceManagerActiveQueueResult_MAX = 4
};

// Object: Enum UAGame.EAnnounceWidgetRuntimeState
enum class EAnnounceWidgetRuntimeState : uint8_t
{
	RestInPool = 0,
	WaitRequestAsyncLoad = 1,
	ReadyToShow = 2,
	ShowNow = 3,
	WaitHideAnimatePlay = 4,
	HideNow = 5,
	WaitEndAnimatePlay = 6,
	Hibernate = 7,
	WaitSwitchAnimationEnd = 8,
	EAnnounceWidgetRuntimeState_MAX = 9
};

// Object: Enum UAGame.EAnnounceOrderType
enum class EAnnounceOrderType : uint8_t
{
	DefaultUnderBag = 0,
	OverTheBag = 1,
	ContactOfficer = 2,
	EAnnounceOrderType_MAX = 3
};

// Object: Enum UAGame.EAnnounceTemplateType
enum class EAnnounceTemplateType : uint8_t
{
	TopInfoTips = 0,
	CountDownBr = 1,
	ChangeTextColor = 2,
	OtherType = 99,
	EAnnounceTemplateType_MAX = 100
};

// Object: Enum UAGame.EAnnounceReliable
enum class EAnnounceReliable : uint8_t
{
	Reliable = 0,
	UnResend = 1,
	EAnnounceReliable_MAX = 2
};

// Object: Enum UAGame.EUATutorialArrowTipType
enum class EUATutorialArrowTipType : uint8_t
{
	Container = 0,
	FillAmmo = 1,
	EUATutorialArrowTipType_MAX = 2
};

// Object: Enum UAGame.EUATutorialHighlightEffectType
enum class EUATutorialHighlightEffectType : uint8_t
{
	None = 0,
	Search = 1,
	Inspect = 2,
	GamePad = 3,
	SelectMenu = 4,
	SelectMenu_NotMine = 5,
	EscapePointIcon = 6,
	SelectMenu_ItemPopup = 7,
	InspectHighEffect = 8,
	ItemHighEffect_NotMine = 9,
	EUATutorialHighlightEffectType_MAX = 10
};

// Object: Enum UAGame.EUATutorialGuideType
enum class EUATutorialGuideType : uint8_t
{
	None = 0,
	GamePadHighLight = 1,
	MapSignHighLight = 2,
	MapLootBoxOpen = 3,
	EUATutorialGuideType_MAX = 4
};

// Object: Enum UAGame.EUATakeOutValueComputeMode
enum class EUATakeOutValueComputeMode : uint8_t
{
	Normal = 0,
	SafeArea = 1,
	EUATakeOutValueComputeMode_MAX = 2
};

// Object: Enum UAGame.EUAMarkedType
enum class EUAMarkedType : uint8_t
{
	EUAMarkedType_None = 0,
	EUAMarkedType_TitleInfo = 1,
	EUAMarkedType_MAX = 2
};

// Object: Enum UAGame.EEscapeInteractVolumeState
enum class EEscapeInteractVolumeState : uint8_t
{
	EEscapeInteractVolumeState_None = 0,
	EEscapeInteractVolumeState_Unactivate = 1,
	EEscapeInteractVolumeState_Activate = 2,
	EEscapeInteractVolumeState_Interacted = 3,
	EEscapeInteractVolumeState_MAX = 4
};

// Object: Enum UAGame.EUAEscapeTimeType
enum class EUAEscapeTimeType : uint8_t
{
	Locality = 0,
	Global = 1,
	EUAEscapeTimeType_MAX = 2
};

// Object: Enum UAGame.EUATimeType
enum class EUATimeType : uint8_t
{
	None = 0,
	Open = 1,
	Close = 2,
	EUATimeType_MAX = 3
};

// Object: Enum UAGame.EEscapeArmedState
enum class EEscapeArmedState : uint8_t
{
	Default = 0,
	Armed = 1,
	UnArmed = 2,
	EEscapeArmedState_MAX = 3
};

// Object: Enum UAGame.EEscapePerformanceType
enum class EEscapePerformanceType : uint8_t
{
	EEscapePerformanceType_None = 0,
	EEscapePerformanceType_SinglePerson = 1,
	EEscapePerformanceType_Team = 2,
	EEscapePerformanceType_MAX = 3
};

// Object: Enum UAGame.EEscapeState
enum class EEscapeState : uint8_t
{
	EEscapeState_None = 0,
	EEscapeState_CanEscape = 1,
	EEscapeState_Close = 2,
	EEscapeState_Open = 3,
	EEscapeState_NotOpen = 4,
	EEscapeState_MAX = 5
};

// Object: Enum UAGame.EEscapeVolumeStyle
enum class EEscapeVolumeStyle : uint8_t
{
	Normal = 0,
	ThemeActivity = 1,
	EEscapeVolumeStyle_MAX = 2
};

// Object: Enum UAGame.EEscapeVolumeType
enum class EEscapeVolumeType : uint8_t
{
	Locality = 0,
	Global = 1,
	EEscapeVolumeType_MAX = 2
};

// Object: Enum UAGame.EChatacterVisibleState
enum class EChatacterVisibleState : uint8_t
{
	EChatacterVisibleState_None = 0,
	EChatacterVisibleState_Invisible = 1,
	EChatacterVisibleState_Visible = 2,
	EChatacterVisibleState_MAX = 3
};

// Object: Enum UAGame.EUAFSMCompareType
enum class EUAFSMCompareType : uint8_t
{
	UAFSMCompareType_None = 0,
	UAFSMCompareType_Less = 1,
	UAFSMCompareType_LessEqual = 2,
	UAFSMCompareType_Equals = 3,
	UAFSMCompareType_GreaterEqual = 4,
	UAFSMCompareType_Greater = 5,
	UAFSMCompareType_NotEqual = 6,
	UAFSMCompareType_Between = 7,
	UAFSMCompareType_MAX = 8
};

// Object: Enum UAGame.EUAFSMRelative
enum class EUAFSMRelative : uint8_t
{
	UAFSMRelative_None = 0,
	UAFSMRelative_And = 1,
	UAFSMRelative_Or = 2,
	UAFSMRelative_MAX = 3
};

// Object: Enum UAGame.EGameMapId
enum class EGameMapId : uint8_t
{
	None = 0,
	Erangel = 1,
	Desert = 2,
	ErangelOrigin = 3,
	Savage = 4,
	Max = 5
};

// Object: Enum UAGame.ESubGameModeType
enum class ESubGameModeType : uint16_t
{
	None = 0,
	Main = 100,
	DeathPoisonFog = 200,
	Compact = 201,
	RandomMap = 300,
	Fog = 301,
	CustomItemSniper = 400,
	CustomItemColdArms = 401,
	CustomItem3xRich = 402,
	CustomItemPistol = 403,
	CustomItemShotgun = 404,
	CustomItemDrug = 405,
	HardCore = 500,
	FPP = 501,
	BattleOfFiveArmies = 502,
	BattleOfThreeTeams = 503,
	MAX = 504
};

// Object: Enum UAGame.EMainGameModeType
enum class EMainGameModeType : uint8_t
{
	None = 0,
	ClassicPVP = 1,
	LeisurePVP = 2,
	MAX = 3
};

// Object: Enum UAGame.EGameTeamType
enum class EGameTeamType : uint8_t
{
	None = 0,
	OnePlayer = 1,
	TwoPlayers = 2,
	FourPlayers = 3,
	ThreeTeams = 4,
	FiveTeams = 5,
	Max = 6
};

// Object: Enum UAGame.EGameMatchType
enum class EGameMatchType : uint8_t
{
	None = 0,
	Normal = 1,
	Rank = 2,
	Custom = 3,
	Max = 4
};

// Object: Enum UAGame.EUARoleID
enum class EUARoleID : uint8_t
{
	Sledge = 0,
	Ash = 1,
	Bandit = 2,
	Castle = 3,
	Glaz = 4,
	Jager = 5,
	Kapkan = 6,
	Rook = 7,
	Tharcher = 8,
	Thermite = 9,
	EUARoleID_MAX = 10
};

// Object: Enum UAGame.EBattleRoyalContentionAreaType
enum class EBattleRoyalContentionAreaType : uint8_t
{
	Escape = 0,
	Paradrop = 1,
	BattleRoyal = 2,
	EBattleRoyalContentionAreaType_MAX = 3
};

// Object: Enum UAGame.EBattleRoyalParadropType
enum class EBattleRoyalParadropType : uint8_t
{
	None = 0,
	InsideBRVolume = 1,
	ArroundEscape = 2,
	EBattleRoyalParadropType_MAX = 3
};

// Object: Enum UAGame.EBattleRoyalEscapePointType
enum class EBattleRoyalEscapePointType : uint8_t
{
	None = 0,
	InsideBRVolume = 1,
	OutsideBRVolume = 2,
	EBattleRoyalEscapePointType_MAX = 3
};

// Object: Enum UAGame.EBattleRoyalVolumeType
enum class EBattleRoyalVolumeType : uint8_t
{
	None = 0,
	InsideLastBRVolume = 1,
	EBattleRoyalVolumeType_MAX = 2
};

// Object: Enum UAGame.EUATutorialDefaultInventory
enum class EUATutorialDefaultInventory : uint8_t
{
	None = 0,
	TutorialAKM = 1,
	TutorialHK416 = 2,
	EUATutorialDefaultInventory_MAX = 3
};

// Object: Enum UAGame.EMarketItemType
enum class EMarketItemType : uint8_t
{
	None = 0,
	MainWeapon = 1,
	Pistol = 2,
	Equip = 3,
	Prop = 4,
	RepairEquip = 5,
	EMarketItemType_MAX = 6
};

// Object: Enum UAGame.ERankMode
enum class ERankMode : uint8_t
{
	Normal = 0,
	Hack = 1,
	ERankMode_MAX = 2
};

// Object: Enum UAGame.EUARadioEnv
enum class EUARadioEnv : uint8_t
{
	Outdoor = 0,
	Indoor = 1,
	EUARadioEnv_MAX = 2
};

// Object: Enum UAGame.EUARadioEmitterType
enum class EUARadioEmitterType : uint8_t
{
	Trumpet = 0,
	Pager = 1,
	EUARadioEmitterType_MAX = 2
};

// Object: Enum UAGame.EUARadioType
enum class EUARadioType : uint8_t
{
	None = 0,
	Fire_Default = 10,
	Fire_Wander = 11,
	Fire_PatrolTeam = 12,
	Fire_Sniper = 13,
	Death_Default = 20,
	Death_Renor = 21,
	Death_Ajax = 22,
	Death_Doss = 23,
	Loot_Default = 30,
	Loot_SafeBox = 31,
	Loot_AirDrop = 32,
	Open_Default = 40,
	Open_SluiceGate = 41,
	Open_RoomDoor = 42,
	Open_BlackDoor = 43,
	Enter_Default = 50,
	Escape_Default = 60,
	Reborn_Default = 70,
	EUARadioType_MAX = 71
};

// Object: Enum UAGame.EHeatMapEvent
enum class EHeatMapEvent : uint8_t
{
	E_HEAT_MAP_NONE = 0,
	E_HEAT_MAP_KILL = 1,
	E_HEAT_MAP_BE_KILL = 2,
	E_HEAT_MAP_LOCATION_REPORT = 3,
	E_HEAT_MAP_SPAWN = 4,
	E_HEAT_MAP_ESCAPE = 5,
	E_HEAT_MAP_LOOT = 6,
	E_HEAT_MAP_MOVE = 7,
	E_HEAT_MAP_STATIONARY = 8,
	E_HEAT_MAP_MAX = 9
};

// Object: Enum UAGame.ELoadingTipsType
enum class ELoadingTipsType : uint8_t
{
	Default = 0,
	TVStationWinGold = 1,
	SeasonalChallenges = 2,
	FileCollection = 3,
	ELoadingTipsType_MAX = 4
};

// Object: Enum UAGame.ETutorialLevelType
enum class ETutorialLevelType : uint8_t
{
	None = 0,
	CStory = 1,
	GreenHand = 2,
	ETutorialLevelType_MAX = 3
};

// Object: Enum UAGame.ETutorialBagTabType
enum class ETutorialBagTabType : uint8_t
{
	TutorialTabType_None = 0,
	TutorialTabType_Equipment = 1,
	TutorialTabType_VestBag = 2,
	TutorialTabType_Pockage = 3,
	TutorialTabType_Bag = 4,
	TutorialTabType_SafeBox = 5,
	TutorialTabType_Character = 100,
	TutorialTabType_Health = 101,
	TutorialTabType_Quest = 102,
	TutorialTabType_Map = 103,
	TutorialTabType_Season = 104,
	TutorialTabType_MAX = 105
};

// Object: Enum UAGame.ETutorialCharacterState
enum class ETutorialCharacterState : uint8_t
{
	TutorialCharacterState_None = 0,
	TutorialCharacterState_Stand = 1,
	TutorialCharacterState_Jump = 2,
	TutorialCharacterState_Crouch = 3,
	TutorialCharacterState_Prone = 4,
	TutorialCharacterState_Zooming = 5,
	TutorialCharacterState_LoseEndurance = 6,
	TutorialCharacterState_Sprint = 7,
	TutorialCharacterState_SilentWalk = 8,
	TutorialCharacterState_HoldingBreath = 9,
	TutorialCharacterState_ChangeClip = 10,
	TutorialCharacterState_MAX = 11
};

// Object: Enum UAGame.EBigMapTouchResponseType
enum class EBigMapTouchResponseType : uint8_t
{
	None = 0,
	Global = 1,
	Locality = 2,
	EBigMapTouchResponseType_MAX = 3
};

// Object: Enum UAGame.ECharacterBoxDisplayType
enum class ECharacterBoxDisplayType : uint8_t
{
	TelescopeAiming = 0,
	ManualMark = 1,
	ECharacterBoxDisplayType_MAX = 2
};

// Object: Enum UAGame.ENewMapDisplayModel
enum class ENewMapDisplayModel : uint8_t
{
	Free = 0,
	FollowViewCharacter = 1,
	ENewMapDisplayModel_MAX = 2
};

// Object: Enum UAGame.ENewMapTouchResponseType
enum class ENewMapTouchResponseType : uint8_t
{
	None = 0,
	Global = 1,
	Locality = 2,
	ENewMapTouchResponseType_MAX = 3
};

// Object: Enum UAGame.EHUDWeaponSlotType
enum class EHUDWeaponSlotType : uint8_t
{
	FirstMainWeapon = 0,
	SecondMainWeapon = 1,
	AssistantWeapon = 2,
	MeleeWeapon = 3,
	EHUDWeaponSlotType_MAX = 4
};

// Object: Enum UAGame.EWidgetTopParentActorType
enum class EWidgetTopParentActorType : uint8_t
{
	CharaterSelf = 0,
	LootBox = 1,
	CorpseBox = 2,
	BagBox = 3,
	EWidgetTopParentActorType_MAX = 4
};

// Object: Enum UAGame.EUAHUDNewBagWidgetIdentification
enum class EUAHUDNewBagWidgetIdentification : uint8_t
{
	Undefined = 0,
	PickupsNearby = 1,
	MyBag = 2,
	MyBagIcon = 3,
	VestBag = 4,
	VestBagIcon = 5,
	PickBag = 6,
	Character = 7,
	Inventory = 8,
	Adapter = 9,
	FirstMainWeapon = 10,
	SecondMainWeapon = 11,
	AssistWeapon = 12,
	MeleeWeapon = 13,
	ThrowWeapon = 14,
	Armor_Helmet = 15,
	Armor_Vest = 16,
	Pocket = 17,
	SafeBox = 18,
	SafeBoxIcon = 19,
	Headset = 20,
	FaceCover = 21,
	EyeWear = 22,
	ArmBand = 23,
	DogTag = 24,
	SplitItemWindow = 25,
	RotateItemWindow = 26,
	PickBagIcon = 27,
	KeyBagIcon = 28,
	KeyBag = 29,
	VehicleKey = 30,
	SpecialItem = 31,
	StagingContaienr = 32,
	MAX = 33
};

// Object: Enum UAGame.EUAHUDBagWidgetIdentification
enum class EUAHUDBagWidgetIdentification : uint8_t
{
	Undefined = 0,
	PickupsNearby = 1,
	MyBag = 2,
	Weapons = 3,
	Apparel = 4,
	Inventory = 5,
	Adapter = 6,
	FirstMainWeapon = 7,
	SecondMainWeapon = 8,
	AssistWeapon = 9,
	MeleeWeapon = 10,
	ThrowWeapon = 11,
	Helmet = 12,
	FlatJacket = 13,
	Apparel_Hat = 14,
	Apparel_Glasses = 15,
	Apparel_UpShirt = 16,
	Apparel_Pants = 17,
	Apparel_Shoes = 18,
	Apparel_Ghillie = 19,
	MAX = 20
};

// Object: Enum UAGame.EItemAction
enum class EItemAction : uint8_t
{
	ActionNone = 0,
	ActionPickup = 1,
	ActionUse = 2,
	ActionAttach = 3,
	ActionReload = 4,
	ActionExchange = 5,
	ActionDetach = 6,
	ActionDiscard = 7,
	ActionPickupPart = 8,
	ActionDiscardPart = 9,
	ActionRevertSkin = 10,
	ActionPutonSkin = 11,
	EItemAction_MAX = 12
};

// Object: Enum UAGame.EBRPlayerState
enum class EBRPlayerState : uint8_t
{
	PlayerState_NONE = 0,
	PlayerState_Normal = 1,
	PlayerState_Airplane = 2,
	PlayerState_Air = 3,
	PlayerState_Drive = 4,
	PlayerState_Weak = 5,
	PlayerState_OffLine = 6,
	PlayerState_Dead = 7,
	PlayerState_Spectating = 8,
	PlayerState_MAX = 9
};

// Object: Enum UAGame.EHostedInteractDoAction
enum class EHostedInteractDoAction : uint8_t
{
	EHostedInteractAction_None = 0,
	EHostedInteractCompleteAction_LootInventory = 1,
	EHostedInteractCompleteAction_FastLootInventory = 2,
	EHostedInteractDoAction_MAX = 3
};

// Object: Enum UAGame.ELandmarkVolumeEffect
enum class ELandmarkVolumeEffect : uint8_t
{
	Default = 0,
	Mist = 1,
	ELandmarkVolumeEffect_MAX = 2
};

// Object: Enum UAGame.ELatentMissionFlow_Exec
enum class ELatentMissionFlow_Exec : uint8_t
{
	Success = 0,
	Failed = 1,
	ProgressUpdate = 2,
	ELatentMissionFlow_MAX = 3
};

// Object: Enum UAGame.EPlaceObject_Exec
enum class EPlaceObject_Exec : uint8_t
{
	OnPutDownCompleted = 0,
	OnPlaceObjectCompleted = 1,
	OnTakeupCompleted = 2,
	OnInterrupted = 3,
	EPlaceObject_MAX = 4
};

// Object: Enum UAGame.EPlayCGAnimation_Exec
enum class EPlayCGAnimation_Exec : uint8_t
{
	OnLoadLevelCompleted = 0,
	OnStartPlayAnimation = 1,
	OnAnimationCompleted = 2,
	OnInterrupted = 3,
	EPlayCGAnimation_MAX = 4
};

// Object: Enum UAGame.EPlayMontageWithEnd_Exec
enum class EPlayMontageWithEnd_Exec : uint8_t
{
	OnAnimationCompleted = 0,
	EPlayMontageWithEnd_MAX = 1
};

// Object: Enum UAGame.ELockLootContainerConditionType
enum class ELockLootContainerConditionType : uint8_t
{
	None = 0,
	CostInventory = 1,
	CheckMissionStatues = 2,
	ELockLootContainerConditionType_MAX = 3
};

// Object: Enum UAGame.EChangeDoorDataType
enum class EChangeDoorDataType : uint8_t
{
	ChangeDoorOpenType = 0,
	SetGateLockCountDown = 1,
	EChangeDoorDataType_MAX = 2
};

// Object: Enum UAGame.ELimitAreaStateType
enum class ELimitAreaStateType : uint8_t
{
	StartLimitArea = 0,
	ClearupLimitArea = 1,
	ELimitAreaStateType_MAX = 2
};

// Object: Enum UAGame.EEscapeConditionsChangeType
enum class EEscapeConditionsChangeType : uint8_t
{
	EEscapeConditionsType_Add = 0,
	EEscapeConditionsType_Remove = 1,
	EEscapeConditionsType_MAX = 2
};

// Object: Enum UAGame.EEscapeConditionsType
enum class EEscapeConditionsType : uint8_t
{
	EEscapeConditionsType_CanEscape = 0,
	EEscapeConditionsType_Close = 1,
	EEscapeConditionsType_Person = 2,
	EEscapeConditionsType_MAX = 3
};

// Object: Enum UAGame.ETargetEscapeState
enum class ETargetEscapeState : uint8_t
{
	ETargetEscapeState_None = 0,
	ETargetEscapeState_CanEscape = 1,
	ETargetEscapeState_Close = 2,
	ETargetEscapeState_Open = 3,
	ETargetEscapeState_NotOpen = 4,
	ETargetEscapeState_MAX = 5
};

// Object: Enum UAGame.EMissionConditionMemberCountType
enum class EMissionConditionMemberCountType : uint8_t
{
	E_Alive = 0,
	E_InGame = 1,
	E_MAX = 2
};

// Object: Enum UAGame.EUAMissionWeatherCheckType
enum class EUAMissionWeatherCheckType : uint8_t
{
	CurrentEqual = 0,
	WeatherChange = 1,
	EUAMissionWeatherCheckType_MAX = 2
};

// Object: Enum UAGame.EFPSCCheckType
enum class EFPSCCheckType : uint8_t
{
	EFPSCCheckType_All = 0,
	EFPSCCheckType_Farthest = 1,
	EFPSCCheckType_Nearest = 2,
	EFPSCCheckType_DistanceRange = 3,
	EFPSCCheckType_MAX = 4
};

// Object: Enum UAGame.EAISceneEventType
enum class EAISceneEventType : uint8_t
{
	SceneEventTrigger = 0,
	SceneEventExpired = 1,
	SceneEventRemoved = 2,
	SceneEventCompleted = 3,
	EAISceneEventType_MAX = 4
};

// Object: Enum UAGame.EHitTargetType
enum class EHitTargetType : uint8_t
{
	Character = 0,
	Animal = 1,
	All = 2,
	EHitTargetType_MAX = 3
};

// Object: Enum UAGame.EDamageStatisType
enum class EDamageStatisType : uint8_t
{
	CauseDamage = 0,
	TakeDamage = 1,
	EDamageStatisType_MAX = 2
};

// Object: Enum UAGame.ListenConditionMode
enum class EListenConditionMode : uint8_t
{
	Or = 0,
	And = 1,
	ListenConditionMode_MAX = 2
};

// Object: Enum UAGame.EPlayerFlowState
enum class EPlayerFlowState : uint8_t
{
	None = 0,
	PreProcess = 1,
	Load = 2,
	Wait = 3,
	CountDown = 4,
	Game = 5,
	ExitGame = 6,
	WatchGame = 7,
	Preparations = 8,
	Transition = 9,
	EPlayerFlowState_MAX = 10
};

// Object: Enum UAGame.EMissionObjective_RandTimerType
enum class EMissionObjective_RandTimerType : uint8_t
{
	GameBegin = 0,
	ObjectiveActivated = 1,
	EMissionObjective_MAX = 2
};

// Object: Enum UAGame.ESpawnActorMode
enum class ESpawnActorMode : uint8_t
{
	NetRelevantActor = 0,
	ActorSpawnPointInVolume = 1,
	ActorSpawnPoint = 2,
	ESpawnActorMode_MAX = 3
};

// Object: Enum UAGame.EStartInvDetectingMode
enum class EStartInvDetectingMode : uint8_t
{
	Nearest = 0,
	GlobalMap = 1,
	EStartInvDetectingMode_MAX = 2
};

// Object: Enum UAGame.EMissionObjectiveWriteBattleLineOperateType_AISpawnAreaNames
enum class EMissionObjectiveWriteBattleLineOperateType_AISpawnAreaNames : uint8_t
{
	AddUnique = 0,
	Add = 1,
	RemoveAll = 2,
	RemoveSingle = 3,
	Clear = 4,
	EMissionObjectiveWriteBattleLineOperateType_MAX = 5
};

// Object: Enum UAGame.EMissionObjectiveWriteBattleLineOperateType_StageId
enum class EMissionObjectiveWriteBattleLineOperateType_StageId : uint8_t
{
	Set = 0,
	Addition = 1,
	CopyBy = 2,
	ExChange = 3,
	EMissionObjectiveWriteBattleLineOperateType_MAX = 4
};

// Object: Enum UAGame.EMissionConditionTeamInfoType
enum class EMissionConditionTeamInfoType : uint8_t
{
	MaxCount = 0,
	AliveCount = 1,
	EscapeCount = 2,
	DiedCount = 3,
	EMissionConditionTeamInfoType_MAX = 4
};

// Object: Enum UAGame.EMissionConditionCharacterType
enum class EMissionConditionCharacterType : uint8_t
{
	ECharacterType_AI = 0,
	ECharacterType_TEAMMATE = 1,
	ECharacterType_MAX = 2
};

// Object: Enum UAGame.EMissionConditionCharacterStatus
enum class EMissionConditionCharacterStatus : uint8_t
{
	ECharacterType_ALIVE_HAS = 0,
	ECharacterType_ALIVE_ALL = 1,
	ECharacterType_DIED_HAS = 2,
	ECharacterType_DIED_ALL = 3,
	ECharacterType_MAX = 4
};

// Object: Enum UAGame.EMissionConditionGameplayTagCheckType
enum class EMissionConditionGameplayTagCheckType : uint8_t
{
	AnyMatching = 0,
	AllMatching = 1,
	EMissionConditionGameplayTagCheckType_MAX = 2
};

// Object: Enum UAGame.EMissionConditionNumberType
enum class EMissionConditionNumberType : uint8_t
{
	Int32 = 0,
	Int64 = 1,
	EMissionConditionNumberType_MAX = 2
};

// Object: Enum UAGame.EMissionConditionItemType
enum class EMissionConditionItemType : uint8_t
{
	Weapon = 0,
	Helmet = 1,
	Vest = 2,
	Headset = 3,
	FaceCover = 4,
	EyeWear = 5,
	VestBag = 6,
	Bag = 7,
	EMissionConditionItemType_MAX = 8
};

// Object: Enum UAGame.EMissionConditionCustomAttribute
enum class EMissionConditionCustomAttribute : uint8_t
{
	TotalEndurance = 0,
	EMissionConditionCustomAttribute_MAX = 1
};

// Object: Enum UAGame.ESGInventoryOwnerMarkableType
enum class ESGInventoryOwnerMarkableType : uint8_t
{
	None = 0,
	AnyCharacter = 1,
	NoCharacter = 2,
	SelfOnly = 3,
	OtherNoSelf = 4,
	ESGInventoryOwnerMarkableType_MAX = 5
};

// Object: Enum UAGame.EMissionSubType
enum class EMissionSubType : uint8_t
{
	E_MISSION_SUB_TYPE_NONE = 0,
	E_MISSION_SUB_TYPE_RANDOM_TASK = 1,
	E_MISSION_SUB_TYPE_DUEL_TASK = 2,
	E_MISSION_SUB_TYPE_GLOBAL_TASK = 3,
	E_MISSION_SUB_TYPE_ACTIVITY_TASK = 4,
	E_MISSION_SUB_TYPE_RANDOM_EVENT = 5,
	E_MISSION_SUB_TYPE_RESIDENT_EVENT = 6,
	E_MISSION_SUB_TYPE_ACTIVITY_EVENT = 7,
	E_MISSION_SUB_TYPE_MAX = 8
};

// Object: Enum UAGame.EDistributeMissionType
enum class EDistributeMissionType : uint8_t
{
	UrgentTask = 0,
	DynamicEvent = 1,
	ActivityEvent = 2,
	WorldEvent = 3,
	EDistributeMissionType_MAX = 4
};

// Object: Enum UAGame.EParadropPointType
enum class EParadropPointType : uint8_t
{
	None = 0,
	Individual = 1,
	Sub = 2,
	EParadropPointType_MAX = 3
};

// Object: Enum UAGame.EUAParadropSupplyFrameMeshHideType
enum class EUAParadropSupplyFrameMeshHideType : uint8_t
{
	Never = 0,
	AfterLanding = 1,
	Always = 2,
	EUAParadropSupplyFrameMeshHideType_MAX = 3
};

// Object: Enum UAGame.ENLPMentorTriggerType
enum class ENLPMentorTriggerType : uint8_t
{
	None = 0,
	FireFail = 1,
	FillFail = 2,
	TakeDamage = 3,
	ENLPMentorTriggerType_MAX = 4
};

// Object: Enum UAGame.ENLPMentorRequestType
enum class ENLPMentorRequestType : uint8_t
{
	SystemTriggered = 0,
	PlayerTriggered = 1,
	EventTriggered = 2,
	ENLPMentorRequestType_MAX = 3
};

// Object: Enum UAGame.ERebornTagState
enum class ERebornTagState : uint8_t
{
	None = 0,
	Add = 1,
	Remove = 2,
	ERebornTagState_MAX = 3
};

// Object: Enum UAGame.EUAPlayerRoundReulst
enum class EUAPlayerRoundReulst : uint8_t
{
	EUAPlayerRoundReulst_NONE = 0,
	EUAPlayerRoundReulst_Win = 1,
	EUAPlayerRoundReulst_Loss = 2,
	EUAPlayerRoundReulst_Draw = 3,
	EUAPlayerRoundReulst_MAX = 4
};

// Object: Enum UAGame.ESGInventoryGMFlags
enum class ESGInventoryGMFlags : uint8_t
{
	None = 0,
	CanNotSell = 1,
	BlackLoot = 2,
	DarkZoneItem = 4,
	SeasonSupply = 8,
	SpecialSeasonSupply = 16,
	SingleOfficeInv = 32,
	ESGInventoryGMFlags_MAX = 33
};

// Object: Enum UAGame.EPlayerActiveSettlementType
enum class EPlayerActiveSettlementType : uint8_t
{
	EPlayerActiveSettlementType_None = 0,
	EPlayerActiveSettlementType_BRGame = 1,
	EPlayerActiveSettlementType_MAX = 2
};

// Object: Enum UAGame.EReportState
enum class EReportState : uint8_t
{
	None = 0,
	Inventories = 1,
	Health = 2,
	Body = 3,
	Buff = 4,
	Weapon = 5,
	Movement = 6,
	Env = 7,
	Cached = 8,
	EReportState_MAX = 9
};

// Object: Enum UAGame.ECollectReason
enum class ECollectReason : uint8_t
{
	None = 0,
	Begin = 1,
	Timer = 2,
	End = 3,
	ECollectReason_MAX = 4
};

// Object: Enum UAGame.ECloudEmissiveType
enum class ECloudEmissiveType : uint8_t
{
	SecondStageGeneralSky = 0,
	FirstStageInsideVolume = 1,
	SecondStageInsideVolume = 2,
	ECloudEmissiveType_MAX = 3
};

// Object: Enum UAGame.EPVEGameControlType
enum class EPVEGameControlType : uint8_t
{
	E_None = 0,
	E_STOPGAME = 1,
	E_MAX = 2
};

// Object: Enum UAGame.EPVEModifyStatisDataType
enum class EPVEModifyStatisDataType : uint8_t
{
	E_None = 0,
	E_Set = 1,
	E_Add = 2,
	E_AddProgress = 3,
	E_MAX = 4
};

// Object: Enum UAGame.ETraceBindMode
enum class ETraceBindMode : uint8_t
{
	Sequential = 0,
	SinglePoint = 1,
	ETraceBindMode_MAX = 2
};

// Object: Enum UAGame.EEmergencyTaskType
enum class EEmergencyTaskType : uint8_t
{
	Normal = 0,
	Activity = 1,
	EEmergencyTaskType_MAX = 2
};

// Object: Enum UAGame.EQuestUnLockType
enum class EQuestUnLockType : uint8_t
{
	QuestUnLock_None = 0,
	QuestUnLock_TimeToMeet = 1,
	QuestUnLock_ProgressChange = 2,
	QuestUnLock_MAX = 3
};

// Object: Enum UAGame.EQuestCharacterType
enum class EQuestCharacterType : uint8_t
{
	QuestCharacterType_None = 0,
	QuestCharacterType_PMC = 1,
	QuestCharacterType_SCAV = 2,
	QuestCharacterType_AI_SCAV = 3,
	QuestCharacterType_MAX = 4
};

// Object: Enum UAGame.EDummyGrid2DFailedType
enum class EDummyGrid2DFailedType : uint8_t
{
	Grid2D_SUCCESS = 0,
	Grid2D_Invalid = 1,
	Grid2D_ItemDisable = 2,
	Grid2D_Config = 3,
	Grid2D_NotInit = 4,
	Grid2D_NetStartup = 5,
	Grid2D_Hidden = 6,
	Grid2D_NoMeshComp = 7,
	Grid2D_HasAttachParent = 8,
	Grid2D_HasChildren = 9,
	Gird2D_HasNotDefaultSkin = 10,
	EDummyGrid2DFailedType_MAX = 11
};

// Object: Enum UAGame.EClassRepNodeMapping
enum class EClassRepNodeMapping : uint8_t
{
	NotRouted = 0,
	RelevantAllConnections = 1,
	Spatialize_Static = 2,
	Spatialize_Dynamic = 3,
	Spatialize_Dormancy = 4,
	Spatialize_Static_Dormancy = 5,
	RelevantTeam = 6,
	RelevantFollowOwner = 7,
	RelevantOwnerConnection = 8,
	RelevantConnectionsGroup = 9,
	DynamicPolicy = 10,
	RelvantAI = 11,
	RelevantFaction = 12,
	RelevantForFactionWhenNoOwner = 13,
	SimpleDistanceRelevancy = 14,
	EClassRepNodeMapping_MAX = 15
};

// Object: Enum UAGame.ERoundGlobalDataType
enum class ERoundGlobalDataType : uint8_t
{
	None = 0,
	Faction = 1,
	PersonaArena = 2,
	ERoundGlobalDataType_MAX = 3
};

// Object: Enum UAGame.EBakeSourceMesh
enum class EBakeSourceMesh : uint8_t
{
	OriginalProceduralMesh = 0,
	GroundTracedMesh = 1,
	EBakeSourceMesh_MAX = 2
};

// Object: Enum UAGame.ESplineMeshDisplayMode
enum class ESplineMeshDisplayMode : uint8_t
{
	OriginalProceduralMesh = 0,
	GroundTracedMesh = 1,
	StaticMesh = 2,
	ESplineMeshDisplayMode_MAX = 3
};

// Object: Enum UAGame.EEscapeExploreState
enum class EEscapeExploreState : uint8_t
{
	EEscapeExploreState_None = 0,
	EEscapeExploreState_AlwaysOpen = 1,
	EEscapeExploreState_Open = 2,
	EEscapeExploreState_Close = 3,
	EEscapeExploreState_Unknown = 4,
	EEscapeExploreState_MAX = 5
};

// Object: Enum UAGame.ESignType
enum class ESignType : uint8_t
{
	EscapeSign = 0,
	QuestSign = 1,
	PlayerSign = 2,
	None = 3,
	ESignType_MAX = 4
};

// Object: Enum UAGame.EUACheckPointOprationType
enum class EUACheckPointOprationType : uint8_t
{
	E_None = 0,
	E_SetCheckPoint = 1,
	E_ReportRookieStep = 2,
	E_MAX = 3
};

// Object: Enum UAGame.EDetailBoardType
enum class EDetailBoardType : uint8_t
{
	TaskIcon = 0,
	EscapeIcon = 1,
	ChaseTargetIcon = 2,
	EDetailBoardType_MAX = 3
};

// Object: Enum UAGame.EMoveCheckStyle
enum class EMoveCheckStyle : uint8_t
{
	OnlyMove = 0,
	OnlyAdd = 1,
	EMoveCheckStyle_MAX = 2
};

// Object: Enum UAGame.ETreasureDetectResult
enum class ETreasureDetectResult : uint8_t
{
	NoFound = 0,
	NormalValue = 1,
	HighValue = 2,
	ETreasureDetectResult_MAX = 3
};

// Object: Enum UAGame.EBattleIntensityExpectation
enum class EBattleIntensityExpectation : uint8_t
{
	None = 0,
	Low = 1,
	Normal = 2,
	High = 3,
	VeryHigh = 4,
	EBattleIntensityExpectation_MAX = 5
};

// Object: Enum UAGame.ETraceMarkOperatorType
enum class ETraceMarkOperatorType : uint8_t
{
	None = 0,
	Trace = 1,
	Mark = 2,
	All = 3,
	InfomationTrace = 4,
	ETraceMarkOperatorType_MAX = 5
};

// Object: Enum UAGame.ETraceableMarkType
enum class ETraceableMarkType : uint8_t
{
	None = 0,
	QuestPoint = 1,
	QuestArea = 2,
	ChaseActivity = 3,
	Inventory = 4,
	InteractItem = 5,
	Area = 6,
	EscapePoint = 7,
	Character = 8,
	AISpawnArea = 9,
	SecretQuest = 10,
	Point = 11,
	DossEscapePoint = 12,
	All = 13,
	ETraceableMarkType_MAX = 14
};

// Object: ScriptStruct UAGame.AnnounceTaskInfo
// Size: 0xB0 (Inherited: 0x0)
struct FAnnounceTaskInfo
{
	int32_t TaskId; // 0x0(0x4)
	int32_t AnnouncementID; // 0x4(0x4)
	float TaskBeginTime; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TArray<int32_t> ExternParams; // 0x10(0x10)
	struct TArray<struct FString> ExternStrings; // 0x20(0x10)
	struct TArray<struct FText> ExternTexts; // 0x30(0x10)
	struct FInvokeAnnounceSettingCover AnnounceSetting; // 0x40(0x50)
	struct FString OptionalString; // 0x90(0x10)
	struct TArray<struct FText> CustomContentTexts; // 0xA0(0x10)
};

// Object: ScriptStruct UAGame.AnnounceHUDTaskInfo
// Size: 0x118 (Inherited: 0x0)
struct FAnnounceHUDTaskInfo
{
	struct FAnnounceTaskInfo TaskInfo; // 0x0(0xB0)
	struct TSet<EAnnounceSlot> SlotTypes; // 0xB0(0x50)
	EAnnounceType AnnounceType; // 0x100(0x1)
	uint8_t Pad_0x101[0x17]; // 0x101(0x17)
};

// Object: ScriptStruct UAGame.AttackerDefenderFactionInfo
// Size: 0x2 (Inherited: 0x0)
struct FAttackerDefenderFactionInfo
{
	EFactionType AttackerFactionType; // 0x0(0x1)
	EFactionType DefenderFactionType; // 0x1(0x1)
};

// Object: ScriptStruct UAGame.GSRoundFlowStateInfo
// Size: 0x10 (Inherited: 0x0)
struct FGSRoundFlowStateInfo
{
	EUARoundState CurGSRoundState; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t CurrRound; // 0x4(0x4)
	EFactionType LastWinnerFaction; // 0x8(0x1)
	bool bSwitchSides; // 0x9(0x1)
	EFactionType GameWinnerFaction; // 0xA(0x1)
	struct FAttackerDefenderFactionInfo AttackerDefenderFactionInfo; // 0xB(0x2)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
};

// Object: ScriptStruct UAGame.AreaDataInfo
// Size: 0x30 (Inherited: 0x0)
struct FAreaDataInfo
{
	int32_t Triggertype; // 0x0(0x4)
	int32_t AreaID; // 0x4(0x4)
	struct FName AreaName; // 0x8(0x8)
	int64_t EnterTimeStamp; // 0x10(0x8)
	float EnterInventoryValue; // 0x18(0x4)
	int32_t EnterMainWeaponValue; // 0x1C(0x4)
	int32_t EnterSecondWeaponValue; // 0x20(0x4)
	int32_t EnterSafeBoxValue; // 0x24(0x4)
	int32_t EnterArmorValue; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct UAGame.NLPMentorResponse
// Size: 0x28 (Inherited: 0x0)
struct FNLPMentorResponse
{
	struct FString Text; // 0x0(0x10)
	struct FString AudioName; // 0x10(0x10)
	ENLPMentorButtonHighlight HighlightId; // 0x20(0x1)
	ENLPMentorResponseType EventType; // 0x21(0x1)
	uint8_t Pad_0x22[0x2]; // 0x22(0x2)
	int32_t SequenceID; // 0x24(0x4)
};

// Object: ScriptStruct UAGame.CanBeDestroyedActorDamageInfo
// Size: 0xC8 (Inherited: 0x0)
struct FCanBeDestroyedActorDamageInfo
{
	struct AController* EventInstigator; // 0x0(0x8)
	float ActuralDamage; // 0x8(0x4)
	float PreHealth; // 0xC(0x4)
	float NewHealth; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct AActor* DamageCauser; // 0x18(0x8)
	struct FDamageEvent DamageEvent; // 0x20(0x10)
	struct FHitResult HitResult; // 0x30(0x98)
};

// Object: ScriptStruct UAGame.NewTraceableActorInfo
// Size: 0xB0 (Inherited: 0x0)
struct FNewTraceableActorInfo
{
	uint8_t Pad_0x0[0x18]; // 0x0(0x18)
	struct TArray<ENewTraceDisplayPlatform> NeedDisplayPlatforms; // 0x18(0x10)
	struct TWeakObjectPtr<struct AActor> TraceActor; // 0x28(0x8)
	struct TWeakObjectPtr<struct AActor> TraceActorOwner; // 0x30(0x8)
	bool bActorDestroyed; // 0x38(0x1)
	uint8_t Pad_0x39[0x3]; // 0x39(0x3)
	struct FVector WorldLocation; // 0x3C(0xC)
	int32_t Handle; // 0x48(0x4)
	int32_t ConfigID; // 0x4C(0x4)
	int64_t CreateTimeStamp; // 0x50(0x8)
	float AddTraceGameTime; // 0x58(0x4)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
	struct FTraceActorReplicatedInfo TraceActorInfo; // 0x60(0x28)
	int32_t TaskId; // 0x88(0x4)
	int32_t TargetId; // 0x8C(0x4)
	struct FVector Extend; // 0x90(0xC)
	int32_t ConditionEscapeId; // 0x9C(0x4)
	int64_t ExtraIntParam1; // 0xA0(0x8)
	int64_t ExtraIntParam2; // 0xA8(0x8)
};

// Object: ScriptStruct UAGame.MapTextureGroup
// Size: 0x60 (Inherited: 0x0)
struct FMapTextureGroup
{
	struct TSoftObjectPtr<UTexture2D> MapTextureSoftPtr; // 0x0(0x28)
	struct FVector2D MapOffset; // 0x28(0x8)
	struct TSoftObjectPtr<UTexture2D> SubMapTextureSoftPtr; // 0x30(0x28)
	struct FVector2D SubMapOffset; // 0x58(0x8)
};

// Object: ScriptStruct UAGame.BigMapAreaTextureInfo
// Size: 0xD0 (Inherited: 0x0)
struct FBigMapAreaTextureInfo
{
	int32_t AreaID; // 0x0(0x4)
	bool IsolationArea; // 0x4(0x1)
	bool MapSignDisable; // 0x5(0x1)
	uint8_t Pad_0x6[0x2]; // 0x6(0x2)
	struct TSoftObjectPtr<UTexture2D> MapTextureSoftPtr; // 0x8(0x28)
	struct FMapTextureGroup MapTextureGroup; // 0x30(0x60)
	struct FText AreaName; // 0x90(0x18)
	bool bSpecialDraw; // 0xA8(0x1)
	uint8_t Pad_0xA9[0x3]; // 0xA9(0x3)
	struct FVector AreaWorldCenter; // 0xAC(0xC)
	struct FVector AreaMapTopLeftLocation; // 0xB8(0xC)
	struct FVector2D MiniMapFixedOffset; // 0xC4(0x8)
	uint8_t Pad_0xCC[0x4]; // 0xCC(0x4)
};

// Object: ScriptStruct UAGame.BirdEffect
// Size: 0x28 (Inherited: 0x0)
struct FBirdEffect
{
	struct UParticleSystem* Particle; // 0x0(0x8)
	struct UAkAudioEvent* Audio; // 0x8(0x8)
	float AudioLoopInterval; // 0x10(0x4)
	ESoundSourceType SoundSourceType; // 0x14(0x1)
	uint8_t Pad_0x15[0x3]; // 0x15(0x3)
	float ShowSoundSourceInterval; // 0x18(0x4)
	struct FVector SoundSourceLocationOffset; // 0x1C(0xC)
};

// Object: ScriptStruct UAGame.SpecialItem
// Size: 0x4 (Inherited: 0x0)
struct FSpecialItem
{
	int32_t ExchangeRate; // 0x0(0x4)
};

// Object: ScriptStruct UAGame.UAEscapeSubmitTableRow
// Size: 0xC8 (Inherited: 0x8)
struct FUAEscapeSubmitTableRow : FTableRowBase
{
	int32_t ID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct FString Description; // 0x10(0x10)
	struct FText TitleText; // 0x20(0x18)
	struct FText SubmitTipText; // 0x38(0x18)
	EUAEscapeSubmitType Type; // 0x50(0x1)
	uint8_t Pad_0x51[0x3]; // 0x51(0x3)
	uint32_t ConvertItemID; // 0x54(0x4)
	struct TArray<struct FString> AllowedItemPrefixes; // 0x58(0x10)
	struct TMap<int32_t, struct FSpecialItem> SpecialItems; // 0x68(0x50)
	uint32_t TotalConsumption; // 0xB8(0x4)
	int32_t SubmittedAmountExceedTotalPercentage; // 0xBC(0x4)
	bool bShowOutOfGameItems; // 0xC0(0x1)
	bool bExceedMaxProgressCannotSelect; // 0xC1(0x1)
	bool bIsDarkZoneItemOnly; // 0xC2(0x1)
	uint8_t Pad_0xC3[0x5]; // 0xC3(0x5)
};

// Object: ScriptStruct UAGame.allenLeavesConfiguration
// Size: 0x10 (Inherited: 0x0)
struct FallenLeavesConfiguration
{
	struct UParticleSystem* FallenLeavesEffect; // 0x0(0x8)
	float FallenLeavesHeight; // 0x8(0x4)
	float FallenLeavesRadius; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.allenLeavesEffectStruct
// Size: 0x50 (Inherited: 0x0)
struct FallenLeavesEffectStruct
{
	struct TMap<struct UStaticMesh*, struct FallenLeavesConfiguration> FallenLeavesEffectMap; // 0x0(0x50)
};

// Object: ScriptStruct UAGame.SubWidgetBaseData
// Size: 0xC (Inherited: 0x0)
struct FSubWidgetBaseData
{
	uint8_t Pad_0x0[0xC]; // 0x0(0xC)
};

// Object: ScriptStruct UAGame.SubWidgetConfig
// Size: 0x80 (Inherited: 0x0)
struct FSubWidgetConfig
{
	float RenderScale; // 0x0(0x4)
	float ViewRadius; // 0x4(0x4)
	float EdgeOffsetDistance; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct UCurveFloat* OpacityFadeCurve; // 0x10(0x8)
	struct UCurveFloat* ScaleFadeCurve; // 0x18(0x8)
	float RefreshDistThreshold; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct UMaterialInterface* ClipMaterial; // 0x28(0x8)
	struct TMap<EPlayerMinimapBehavior, float> BehaviorDisplayRadiusRateMap; // 0x30(0x50)
};

// Object: ScriptStruct UAGame.MFMissionVariableRead_ActorReference
// Size: 0x40 (Inherited: 0x28)
struct FMFMissionVariableRead_ActorReference : FMFMissionVariableReadBase
{
	struct FMissionActorReference ConfigValue; // 0x28(0x18)
};

// Object: ScriptStruct UAGame.MiniMapDisplay
// Size: 0x28 (Inherited: 0x0)
struct FMiniMapDisplay
{
	float BaseRadius; // 0x0(0x4)
	float RadiusRate; // 0x4(0x4)
	float DefaultRadius; // 0x8(0x4)
	uint8_t Pad_0xC[0x14]; // 0xC(0x14)
	struct UUAHUDWidget_NewMapPanel* NewMapPanelInstance; // 0x20(0x8)
};

// Object: ScriptStruct UAGame.QuestActionSpawnInventoryInfo
// Size: 0x28 (Inherited: 0x0)
struct FQuestActionSpawnInventoryInfo
{
	int64_t SpawnPointID; // 0x0(0x8)
	int64_t itemID; // 0x8(0x8)
	int32_t Weight; // 0x10(0x4)
	int32_t ItemStackCount; // 0x14(0x4)
	bool bCheckPlacement; // 0x18(0x1)
	ETraceMarkOperatorType OperatorType; // 0x19(0x1)
	ETraceableMarkType MarkType; // 0x1A(0x1)
	uint8_t Pad_0x1B[0x1]; // 0x1B(0x1)
	float ScanningInterval; // 0x1C(0x4)
	int32_t ConfigID; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
};

// Object: ScriptStruct UAGame.TimeOfDay
// Size: 0xC (Inherited: 0x0)
struct FTimeOfDay
{
	int32_t Hour; // 0x0(0x4)
	int32_t Minute; // 0x4(0x4)
	int32_t Second; // 0x8(0x4)
};

// Object: ScriptStruct UAGame.ActivateLootPointConfigs
// Size: 0x20 (Inherited: 0x0)
struct FActivateLootPointConfigs
{
	struct TArray<int32_t> ForceActivateLootPoints; // 0x0(0x10)
	struct TArray<struct FActivateLootPointConfig> ActivateConfigs; // 0x10(0x10)
};

// Object: ScriptStruct UAGame.ActivateLootPointConfig
// Size: 0xC (Inherited: 0x0)
struct FActivateLootPointConfig
{
	int32_t LootPointType; // 0x0(0x4)
	int32_t ActivateMinCount; // 0x4(0x4)
	int32_t ActivateMaxCount; // 0x8(0x4)
};

// Object: ScriptStruct UAGame.RandomQuestTableRow
// Size: 0x18 (Inherited: 0x8)
struct FRandomQuestTableRow : FTableRowBase
{
	int32_t TaskId; // 0x8(0x4)
	int32_t Weight; // 0xC(0x4)
	int32_t MinLevel; // 0x10(0x4)
	int32_t MaxLevel; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.GiveItemInfo
// Size: 0x18 (Inherited: 0x0)
struct FGiveItemInfo
{
	int32_t itemID; // 0x0(0x4)
	int32_t MinStackCount; // 0x4(0x4)
	int32_t MaxStackCount; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct ASGInventory* InventoryClass; // 0x10(0x8)
};

// Object: ScriptStruct UAGame.RandomEscapePoint
// Size: 0x8 (Inherited: 0x0)
struct FRandomEscapePoint
{
	int32_t EscapePointID; // 0x0(0x4)
	int32_t Weight; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.VolumeMarkableInfo
// Size: 0x8 (Inherited: 0x0)
struct FVolumeMarkableInfo
{
	int32_t VolumeID; // 0x0(0x4)
	int32_t ConfigID; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.InventoryMarkableInfo
// Size: 0x8 (Inherited: 0x0)
struct FInventoryMarkableInfo
{
	int32_t itemID; // 0x0(0x4)
	int32_t ConfigID; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.AICharacterMarkableInfo
// Size: 0x10 (Inherited: 0x0)
struct FAICharacterMarkableInfo
{
	int64_t AIID; // 0x0(0x8)
	ESpawnReason SpawnReason; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	int32_t ConfigID; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.PylonIDMapTableRow
// Size: 0x18 (Inherited: 0x8)
struct FPylonIDMapTableRow : FTableRowBase
{
	int64_t Key; // 0x8(0x8)
	int32_t PylonID; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.TriggerSpawnByEventConfig
// Size: 0x18 (Inherited: 0x0)
struct FTriggerSpawnByEventConfig
{
	int32_t SpawnNum; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FTriggerSpawnByEventParams> EventParams; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.TriggerSpawnByEventParams
// Size: 0x18 (Inherited: 0x0)
struct FTriggerSpawnByEventParams
{
	struct TArray<struct FString> EventStrs; // 0x0(0x10)
	int32_t Weight; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.TriggerSpawnByVolumeConfig
// Size: 0x18 (Inherited: 0x0)
struct FTriggerSpawnByVolumeConfig
{
	int32_t SpawnNum; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FTriggerSpawnByVolumeParams> VolumeParams; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.TriggerSpawnByVolumeParams
// Size: 0x18 (Inherited: 0x0)
struct FTriggerSpawnByVolumeParams
{
	struct TArray<int32_t> VolumeIDs; // 0x0(0x10)
	int32_t Weight; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.TriggerSpawnByAreaConfig
// Size: 0x18 (Inherited: 0x0)
struct FTriggerSpawnByAreaConfig
{
	int32_t SpawnNum; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FTriggerSpawnByAreaParams> AreaParams; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.TriggerSpawnByAreaParams
// Size: 0x20 (Inherited: 0x0)
struct FTriggerSpawnByAreaParams
{
	int32_t SquadID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FString> SpawnAreas; // 0x8(0x10)
	int32_t Weight; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct UAGame.QuestEffectSpawnInteractItemInfo
// Size: 0x30 (Inherited: 0x0)
struct FQuestEffectSpawnInteractItemInfo
{
	int64_t SpawnPointID; // 0x0(0x8)
	struct ASGNetRelevantConfigurableActor* InteractItemClass; // 0x8(0x8)
	int32_t Weight; // 0x10(0x4)
	bool bQuestActionRelevantToActors; // 0x14(0x1)
	uint8_t Pad_0x15[0x3]; // 0x15(0x3)
	struct UMFQuestContextSourceBase* TargetContextSource; // 0x18(0x8)
	struct TArray<ERelatedTargetType> RelatedTargetTypes; // 0x20(0x10)
};

// Object: ScriptStruct UAGame.QuestEffectSpawnInventoryInfo
// Size: 0x40 (Inherited: 0x0)
struct FQuestEffectSpawnInventoryInfo
{
	int64_t SpawnPointID; // 0x0(0x8)
	struct ASGInventory* ContainerClass; // 0x8(0x8)
	struct TArray<int64_t> itemIds; // 0x10(0x10)
	int32_t Weight; // 0x20(0x4)
	int32_t ConfigID; // 0x24(0x4)
	struct UMFQuestContextSourceBase* TargetContextSource; // 0x28(0x8)
	struct TArray<ERelatedTargetType> RelatedTargetTypes; // 0x30(0x10)
};

// Object: ScriptStruct UAGame.QuestEffectSpawnPickupInfo
// Size: 0x30 (Inherited: 0x0)
struct FQuestEffectSpawnPickupInfo
{
	int64_t SpawnPointID; // 0x0(0x8)
	struct ASGPickup* PickupClass; // 0x8(0x8)
	int32_t Weight; // 0x10(0x4)
	int32_t ConfigID; // 0x14(0x4)
	struct UMFQuestContextSourceBase* TargetContextSource; // 0x18(0x8)
	struct TArray<ERelatedTargetType> RelatedTargetTypes; // 0x20(0x10)
};

// Object: ScriptStruct UAGame.QuestInventory
// Size: 0x30 (Inherited: 0x0)
struct FQuestInventory
{
	int32_t TaskId; // 0x0(0x4)
	int32_t TargetId; // 0x4(0x4)
	struct TArray<int64_t> itemIds; // 0x8(0x10)
	int32_t BigType; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	int64_t MidType; // 0x20(0x8)
	int64_t SubType; // 0x28(0x8)
};

// Object: ScriptStruct UAGame.ActQuestTargetTemplateTableRow
// Size: 0x38 (Inherited: 0x8)
struct FActQuestTargetTemplateTableRow : FTableRowBase
{
	int32_t TargetTypeID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TSoftClassPtr<struct AMFQuestBase*> QuestClass; // 0x10(0x28)
};

// Object: ScriptStruct UAGame.QuestIDTableRow
// Size: 0x38 (Inherited: 0x8)
struct FQuestIDTableRow : FTableRowBase
{
	int32_t QuestID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TSoftClassPtr<struct AMFQuestBase*> QuestClass; // 0x10(0x28)
};

// Object: ScriptStruct UAGame.TaskCreateData
// Size: 0x30 (Inherited: 0x0)
struct FTaskCreateData
{
	int32_t TaskId; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FQuestCreateData> QuestArr; // 0x8(0x10)
	bool CompleteInOneBattle; // 0x18(0x1)
	uint8_t Pad_0x19[0xB]; // 0x19(0xB)
	int32_t PrevType; // 0x24(0x4)
	bool IsAct; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
};

// Object: ScriptStruct UAGame.QuestCreateData
// Size: 0x40 (Inherited: 0x0)
struct FQuestCreateData
{
	int32_t TargetId; // 0x0(0x4)
	int32_t CurrProgress; // 0x4(0x4)
	int32_t MaxProgress; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TArray<int32_t> PreviewTargets; // 0x10(0x10)
	int32_t nodeType; // 0x20(0x4)
	int32_t PrevType; // 0x24(0x4)
	int32_t FailWhenNextFail; // 0x28(0x4)
	bool IsAct; // 0x2C(0x1)
	uint8_t Pad_0x2D[0x3]; // 0x2D(0x3)
	struct TArray<int32_t> ActQuestTemplateParams; // 0x30(0x10)
};

// Object: ScriptStruct UAGame.QuestTraceInfo
// Size: 0x40 (Inherited: 0x0)
struct FQuestTraceInfo
{
	struct TWeakObjectPtr<struct AActor> TraceActor; // 0x0(0x8)
	EQuestTraceMarkType TraceMarkType; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	int32_t Handle; // 0xC(0x4)
	struct FVector WorldLocation; // 0x10(0xC)
	struct FVector Extend; // 0x1C(0xC)
	bool bIsActorDestroyed; // 0x28(0x1)
	bool bHasOwner; // 0x29(0x1)
	bool bNeedTrace; // 0x2A(0x1)
	uint8_t Pad_0x2B[0x1]; // 0x2B(0x1)
	struct TWeakObjectPtr<struct AQuestBase> OwnerQuest; // 0x2C(0x8)
	int32_t TaskId; // 0x34(0x4)
	int32_t TargetId; // 0x38(0x4)
	int32_t EscapeId; // 0x3C(0x4)
};

// Object: ScriptStruct UAGame.CollectWaitActiveActorConfig
// Size: 0x10 (Inherited: 0x0)
struct FCollectWaitActiveActorConfig
{
	struct AActor* WaitCollectActorClass; // 0x0(0x8)
	EAutoCollectActorType CollectType; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	float CollectDistance; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.SoundWaveColor
// Size: 0x14 (Inherited: 0x0)
struct FSoundWaveColor
{
	struct FLinearColor Color; // 0x0(0x10)
	int32_t Priority; // 0x10(0x4)
};

// Object: ScriptStruct UAGame.SoundWaveCacheMaterialInfo
// Size: 0x10 (Inherited: 0x0)
struct FSoundWaveCacheMaterialInfo
{
	struct UMaterialInstanceDynamic* Mid; // 0x0(0x8)
	struct UMaterialInterface* MI; // 0x8(0x8)
};

// Object: ScriptStruct UAGame.ConsumptionData
// Size: 0x10 (Inherited: 0x0)
struct FConsumptionData
{
	uint64_t gid; // 0x0(0x8)
	int32_t TeamIndex; // 0x8(0x4)
	int32_t Consumption; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.LootPointInfoStruct
// Size: 0x28 (Inherited: 0x0)
struct FLootPointInfoStruct
{
	int32_t LootPointID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FString PickUpName; // 0x8(0x10)
	struct FString LevelName; // 0x18(0x10)
};

// Object: ScriptStruct UAGame.SGInventorySpawnInfo
// Size: 0x78 (Inherited: 0x0)
struct FSGInventorySpawnInfo
{
	struct TSoftClassPtr<struct ASGInventory*> InventoryClass; // 0x0(0x28)
	bool bIsFullWeapon; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
	uint64_t LootDropID; // 0x30(0x8)
	uint64_t LootDropTableItemID; // 0x38(0x8)
	uint64_t ReallyLootDropTableItemID; // 0x40(0x8)
	uint32_t Count; // 0x48(0x4)
	uint32_t SkinID; // 0x4C(0x4)
	uint32_t ParentItemID; // 0x50(0x4)
	int32_t SlotIndex; // 0x54(0x4)
	uint64_t ParentLootDropID; // 0x58(0x8)
	uint8_t Pad_0x60[0x10]; // 0x60(0x10)
	uint32_t FormActivityID; // 0x70(0x4)
	uint32_t FormActivityPoolID; // 0x74(0x4)
};

// Object: ScriptStruct UAGame.SGLootRandomItemTableRow
// Size: 0x50 (Inherited: 0x8)
struct FSGLootRandomItemTableRow : FTableRowBase
{
	ELootRandomItemType ItemType; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
	uint64_t itemID; // 0x10(0x8)
	uint8_t ItemNum; // 0x18(0x1)
	uint8_t Pad_0x19[0x7]; // 0x19(0x7)
	struct UDataTable* SubItemTable; // 0x20(0x8)
	int32_t Weight; // 0x28(0x4)
	float Percent; // 0x2C(0x4)
	int32_t RandTimes; // 0x30(0x4)
	ESGLootRandomItemOperation OperationType; // 0x34(0x1)
	bool IsPermanent; // 0x35(0x1)
	uint8_t Pad_0x36[0x2]; // 0x36(0x2)
	struct FText Describe; // 0x38(0x18)
};

// Object: ScriptStruct UAGame.UAActorMeshPerformanceTransformData
// Size: 0x24 (Inherited: 0x0)
struct FUAActorMeshPerformanceTransformData
{
	struct FVector Location; // 0x0(0xC)
	struct FRotator Rotation; // 0xC(0xC)
	struct FVector Scale; // 0x18(0xC)
};

// Object: ScriptStruct UAGame.UAActorMeshPerformanceConfig
// Size: 0x30 (Inherited: 0x0)
struct FUAActorMeshPerformanceConfig
{
	float PlayingTime; // 0x0(0x4)
	struct FUAActorMeshPerformanceTransformData TargetRelativeTransformData; // 0x4(0x24)
	int32_t LoopCount; // 0x28(0x4)
	float LoopEndWaitingTime; // 0x2C(0x4)
};

// Object: ScriptStruct UAGame.UAActorMeshPerformanceSyncData
// Size: 0x54 (Inherited: 0x0)
struct FUAActorMeshPerformanceSyncData
{
	int32_t PerformanceConfigID; // 0x0(0x4)
	int32_t LoopIndex; // 0x4(0x4)
	EUAActorMeshPerformanceState PerformanceState; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	struct FUAActorMeshPerformanceTransformData StartWorldTransform; // 0xC(0x24)
	struct FUAActorMeshPerformanceTransformData EndWorldTransform; // 0x30(0x24)
};

// Object: ScriptStruct UAGame.AreaIDListStruct
// Size: 0x10 (Inherited: 0x0)
struct FAreaIDListStruct
{
	struct TArray<int32_t> AreaIDList; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.VehicleTransformInfo
// Size: 0x1C (Inherited: 0x0)
struct FVehicleTransformInfo
{
	struct FVector Location; // 0x0(0xC)
	struct FRotator Rotator; // 0xC(0xC)
	int32_t RandomWeight; // 0x18(0x4)
};

// Object: ScriptStruct UAGame.UAActorListWrapper
// Size: 0x10 (Inherited: 0x0)
struct FUAActorListWrapper
{
	struct TArray<struct AActor*> ActorList; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.AntiCamperToPlayerRelation
// Size: 0x18 (Inherited: 0x0)
struct FAntiCamperToPlayerRelation
{
	struct ACharacter* PlayerCharacter; // 0x0(0x8)
	struct ACharacter* AICharacter; // 0x8(0x8)
	float NextSpawnTime; // 0x10(0x4)
	EAILiveState State; // 0x14(0x1)
	uint8_t Pad_0x15[0x3]; // 0x15(0x3)
};

// Object: ScriptStruct UAGame.AIFillupSpawnRuleInfo
// Size: 0x20 (Inherited: 0x0)
struct FAIFillupSpawnRuleInfo
{
	EAIFillupSpawnRule FillRule; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float CheckTimeInterval; // 0x4(0x4)
	struct FString PlanName; // 0x8(0x10)
	int32_t SpawnUnderCharNum; // 0x18(0x4)
	bool SpawnDeathEnabled; // 0x1C(0x1)
	uint8_t Pad_0x1D[0x3]; // 0x1D(0x3)
};

// Object: ScriptStruct UAGame.TeamFakerInfo
// Size: 0x8 (Inherited: 0x0)
struct FTeamFakerInfo
{
	float LastSpawnTime; // 0x0(0x4)
	int32_t SpawnFakerCount; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.FakerImitateInfo
// Size: 0x70 (Inherited: 0x0)
struct FFakerImitateInfo
{
	struct TArray<int64_t> EquipmentList; // 0x0(0x10)
	struct FSGAvatarWrappedInfo AvatarInfo; // 0x10(0x40)
	ECharacterSex Sex; // 0x50(0x1)
	uint8_t Pad_0x51[0x7]; // 0x51(0x7)
	struct TArray<struct USGPlayerItemInfoBase*> WeaponList; // 0x58(0x10)
	struct ASGCharacter* Character; // 0x68(0x8)
};

// Object: ScriptStruct UAGame.FakerInfo
// Size: 0x18 (Inherited: 0x0)
struct FFakerInfo
{
	int64_t PlayerGID; // 0x0(0x8)
	int64_t FakerAIUID; // 0x8(0x8)
	int64_t ImitatePlayerGID; // 0x10(0x8)
};

// Object: ScriptStruct UAGame.FakerSpawnInfo
// Size: 0x88 (Inherited: 0x0)
struct FFakerSpawnInfo
{
	struct FFakerInfo PlayerRelation; // 0x0(0x18)
	struct FFakerImitateInfo ImitationInfo; // 0x18(0x70)
};

// Object: ScriptStruct UAGame.AnimalGroup
// Size: 0x28 (Inherited: 0x0)
struct FAnimalGroup
{
	struct AVolume* Volume; // 0x0(0x8)
	bool DieTogether; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
	struct ALevelSequenceActor* LevelSequenceActor; // 0x10(0x8)
	struct TArray<struct AActor*> Animals; // 0x18(0x10)
};

// Object: ScriptStruct UAGame.SpawnAreaBase
// Size: 0x20 (Inherited: 0x0)
struct FSpawnAreaBase
{
	struct TArray<struct AActor*> SpawnPoints; // 0x0(0x10)
	struct TArray<struct USpawnPointInfo*> SpawnPointInfos; // 0x10(0x10)
};

// Object: ScriptStruct UAGame.SpawnArea
// Size: 0x118 (Inherited: 0x20)
struct FSpawnArea : FSpawnAreaBase
{
	struct TArray<struct ASGAIPathNode*> PathNodes; // 0x20(0x10)
	struct TArray<struct AActor*> VehicleSpawnPoints; // 0x30(0x10)
	struct TArray<struct AActor*> GuardPoints; // 0x40(0x10)
	struct AVolume* BattleVolume; // 0x50(0x8)
	struct TArray<struct FString> ExclusiveAreas; // 0x58(0x10)
	struct AActor* MapEffectMarkActor; // 0x68(0x8)
	struct ASGAITriggerVolume* PlayTriggerVolume; // 0x70(0x8)
	struct TArray<struct AActor*> BattleTestStartPoints; // 0x78(0x10)
	struct TArray<struct AVolume*> PatrolNoEntryVolume; // 0x88(0x10)
	bool bEnableTestData; // 0x98(0x1)
	uint8_t Pad_0x99[0x7]; // 0x99(0x7)
	struct FAISpawnAreaInfoTableRow AreaData; // 0xA0(0x68)
	uint8_t Pad_0x108[0x10]; // 0x108(0x10)
};

// Object: ScriptStruct UAGame.AISpawnRuleSet
// Size: 0x4 (Inherited: 0x0)
struct FAISpawnRuleSet
{
	bool bUseTeamActive; // 0x0(0x1)
	EAISpawnPointOption SpawnPointOpt; // 0x1(0x1)
	bool bAutoChangeSpawnPoint; // 0x2(0x1)
	bool bAutoSync; // 0x3(0x1)
};

// Object: ScriptStruct UAGame.SpawnVolume
// Size: 0x20 (Inherited: 0x20)
struct FSpawnVolume : FSpawnAreaBase
{
};

// Object: ScriptStruct UAGame.AnimalSpawnVolume
// Size: 0x20 (Inherited: 0x0)
struct FAnimalSpawnVolume
{
	int32_t VolumeID; // 0x0(0x4)
	bool CanTrigger; // 0x4(0x1)
	bool CanAutoTrigger; // 0x5(0x1)
	bool CanContinueCheck; // 0x6(0x1)
	bool CheckVolumeBounds; // 0x7(0x1)
	bool SpawnAllDetail; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
	struct TArray<struct FAnimalSpawnDetail> AnimalSpawnDetail; // 0x10(0x10)
};

// Object: ScriptStruct UAGame.AnimalSpawnDetail
// Size: 0x38 (Inherited: 0x0)
struct FAnimalSpawnDetail
{
	struct FName SpawnAnimalConfigID; // 0x0(0x8)
	int32_t SpawnNum; // 0x8(0x4)
	bool CheckTypeLimit; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	struct ALevelSequenceActor* AnimalTrack; // 0x10(0x8)
	bool DieTogether; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
	int32_t RandomMinNum; // 0x1C(0x4)
	int32_t RandomMaxNum; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct TArray<struct AActor*> RandomSpawnPoint; // 0x28(0x10)
};

// Object: ScriptStruct UAGame.PathNodeGroupInfo
// Size: 0x28 (Inherited: 0x0)
struct FPathNodeGroupInfo
{
	struct AVolume* BattleVolumes; // 0x0(0x8)
	struct TArray<struct ASGAIPathNode*> PathNodes; // 0x8(0x10)
	struct TArray<struct AActor*> ScavSpawnPoints; // 0x18(0x10)
};

// Object: ScriptStruct UAGame.ScavInfoForPathNodeGroup
// Size: 0x20 (Inherited: 0x0)
struct FScavInfoForPathNodeGroup
{
	struct ACharacter* ScavPawn; // 0x0(0x8)
	struct FString AreaName; // 0x8(0x10)
	struct ASGAIPathNode* CurrentPathNode; // 0x18(0x8)
};

// Object: ScriptStruct UAGame.PathArray
// Size: 0x10 (Inherited: 0x0)
struct FPathArray
{
	struct TArray<struct ASGAIPathNode*> PathNodes; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.AreaRuntimeDataInSpawnGroup
// Size: 0x28 (Inherited: 0x0)
struct FAreaRuntimeDataInSpawnGroup
{
	struct FAreaInfo AreaInfo; // 0x0(0x18)
	uint8_t Pad_0x18[0x10]; // 0x18(0x10)
};

// Object: ScriptStruct UAGame.AISpawnPool
// Size: 0xC (Inherited: 0x0)
struct FAISpawnPool
{
	struct FName ToSpawnAIID; // 0x0(0x8)
	int32_t EquipmentPoolID; // 0x8(0x4)
};

// Object: ScriptStruct UAGame.AnnounceTaskWaitAssetLoaded
// Size: 0xD8 (Inherited: 0x0)
struct FAnnounceTaskWaitAssetLoaded
{
	struct FAnnounceTaskInfo TaskWaitWidgetAssetLoad; // 0x0(0xB0)
	struct TSoftClassPtr<struct UUAAnnounceWidgetBase*> WidgetClassPtr; // 0xB0(0x28)
};

// Object: ScriptStruct UAGame.SlotAnnounceTaskQueueControl
// Size: 0x20 (Inherited: 0x0)
struct FSlotAnnounceTaskQueueControl
{
	struct TArray<struct FAnnounceHUDTaskInfo> AnnounceTaskQueue; // 0x0(0x10)
	struct TWeakObjectPtr<struct UUAAnnounceWidgetBase> SlotPlayingAnnounceNowPtr; // 0x10(0x8)
	struct TWeakObjectPtr<struct UUAAnnounceWidgetBase> CountDownHoldTheSlotPtr; // 0x18(0x8)
};

// Object: ScriptStruct UAGame.UAAnnounceOptBehavior
// Size: 0x8 (Inherited: 0x0)
struct FUAAnnounceOptBehavior
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.UAAnnounceOptBehavior_LimitedArea
// Size: 0x18 (Inherited: 0x8)
struct FUAAnnounceOptBehavior_LimitedArea : FUAAnnounceOptBehavior
{
	struct FString LimitedAreaName; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.AnnounceRepArray
// Size: 0x18 (Inherited: 0x0)
struct FAnnounceRepArray
{
	int32_t ServerArrayEndIndex; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FAnnounceTaskInfo> AnnounceTaskRingArray; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.AnnounceInvokeConfig
// Size: 0x40 (Inherited: 0x0)
struct FAnnounceInvokeConfig
{
	int32_t OptionalAnnouncementID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FText OptionalText; // 0x8(0x18)
	struct TArray<int32_t> ExternParams; // 0x20(0x10)
	struct TArray<struct FText> ExternTexts; // 0x30(0x10)
};

// Object: ScriptStruct UAGame.AnnounceMissionConfig
// Size: 0x28 (Inherited: 0x0)
struct FAnnounceMissionConfig
{
	struct ASGPlayerState* Instigator; // 0x0(0x8)
	struct TArray<EMissionRelatedTargetType> RelatedTargetTypes; // 0x8(0x10)
	struct TArray<EFactionType> RelatedFactionTypes; // 0x18(0x10)
};

// Object: ScriptStruct UAGame.AnnounceMissionInvokePak
// Size: 0x70 (Inherited: 0x0)
struct FAnnounceMissionInvokePak
{
	struct FAnnounceInvokeConfig AnnounceConfig; // 0x0(0x40)
	struct FAnnounceMissionConfig MissionConfig; // 0x40(0x28)
	float InvokeTime; // 0x68(0x4)
	uint8_t Pad_0x6C[0x4]; // 0x6C(0x4)
};

// Object: ScriptStruct UAGame.AnnounceUniqueWidgetKey
// Size: 0x30 (Inherited: 0x0)
struct FAnnounceUniqueWidgetKey
{
	struct TSoftClassPtr<struct UUAAnnounceWidgetBase*> AnnounceWidgetClass; // 0x0(0x28)
	EAnnounceOrderType WidgetOrder; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
};

// Object: ScriptStruct UAGame.AnnounceConfigTableRow
// Size: 0x1E8 (Inherited: 0x8)
struct FAnnounceConfigTableRow : FTableRowBase
{
	int32_t AnnouncementID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TSoftClassPtr<struct UUAAnnounceWidgetBase*> TemplateUMG; // 0x10(0x28)
	struct FString Comment; // 0x38(0x10)
	struct FText TitleText; // 0x48(0x18)
	struct FText NameText; // 0x60(0x18)
	struct FText ContentText; // 0x78(0x18)
	struct FName StyleTableKey; // 0x90(0x8)
	struct TSoftObjectPtr<UObject> MainImage; // 0x98(0x28)
	struct TSoftObjectPtr<UObject> ICON; // 0xC0(0x28)
	EAnnounceReliable ReliableType; // 0xE8(0x1)
	uint8_t Pad_0xE9[0x3]; // 0xE9(0x3)
	float BroadcastDuration; // 0xEC(0x4)
	int32_t LifeDurationSec; // 0xF0(0x4)
	uint8_t Pad_0xF4[0x4]; // 0xF4(0x4)
	struct TSoftObjectPtr<UAkAudioEvent> PlayAudio; // 0xF8(0x28)
	struct FString PlayVoice; // 0x120(0x10)
	struct TSoftObjectPtr<UAkAudioEvent> PlayVoiceAssert; // 0x130(0x28)
	bool bOpenVoiceAutoChangeText; // 0x158(0x1)
	bool bOpenDynamicFormatAnnounce; // 0x159(0x1)
	uint8_t Pad_0x15A[0x6]; // 0x15A(0x6)
	struct FMissionActorReference VoicePlayer; // 0x160(0x18)
	bool bBanRepeat; // 0x178(0x1)
	EAnnounceOrderType OrderType; // 0x179(0x1)
	uint8_t Pad_0x17A[0x2]; // 0x17A(0x2)
	int32_t QuePriority; // 0x17C(0x4)
	float ExpirationTime; // 0x180(0x4)
	uint8_t Pad_0x184[0x4]; // 0x184(0x4)
	struct TMap<struct FString, struct FString> ExtraParams; // 0x188(0x50)
	struct FInstancedStruct OptionalBehavior; // 0x1D8(0x10)
};

// Object: ScriptStruct UAGame.AnnounceTemplateChangeTextColor
// Size: 0x28 (Inherited: 0x0)
struct FAnnounceTemplateChangeTextColor
{
	struct FSlateColor ContentTextColor; // 0x0(0x28)
};

// Object: ScriptStruct UAGame.AnnounceTemplateCountDownBR
// Size: 0x50 (Inherited: 0x0)
struct FAnnounceTemplateCountDownBR
{
	struct FSlateColor BackgroundColor; // 0x0(0x28)
	struct FSlateColor TimeTextColor; // 0x28(0x28)
};

// Object: ScriptStruct UAGame.AnnounceTemplateTopInfoTips
// Size: 0xD0 (Inherited: 0x0)
struct FAnnounceTemplateTopInfoTips
{
	struct FSlateColor SubImgColor; // 0x0(0x28)
	struct TSoftObjectPtr<UObject> TipsIconImg; // 0x28(0x28)
	struct FSlateColor IconGlowEffectColor; // 0x50(0x28)
	struct FSlateColor ContentTextColor; // 0x78(0x28)
	struct FSlateColor TitleTextColor; // 0xA0(0x28)
	int32_t AnimaToPlay; // 0xC8(0x4)
	uint8_t Pad_0xCC[0x4]; // 0xCC(0x4)
};

// Object: ScriptStruct UAGame.AnnounceTemplates
// Size: 0x150 (Inherited: 0x0)
struct FAnnounceTemplates
{
	EAnnounceTemplateType TemplateType; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct FAnnounceTemplateCountDownBR CountDown; // 0x8(0x50)
	struct FAnnounceTemplateTopInfoTips TopInfoTips; // 0x58(0xD0)
	struct FAnnounceTemplateChangeTextColor ChangeTextColor; // 0x128(0x28)
};

// Object: ScriptStruct UAGame.AnnounceStyleTable
// Size: 0x1E0 (Inherited: 0x8)
struct FAnnounceStyleTable : FTableRowBase
{
	struct FString Comment; // 0x8(0x10)
	struct TSoftClassPtr<struct UUAAnnounceWidgetBase*> TemplateUMG; // 0x18(0x28)
	struct TSoftObjectPtr<UObject> MainImage; // 0x40(0x28)
	struct FSlateColor MainImgColor; // 0x68(0x28)
	struct FAnnounceTemplates TemplateConfig; // 0x90(0x150)
};

// Object: ScriptStruct UAGame.AnnounceInvokeParams
// Size: 0xB8 (Inherited: 0x0)
struct FAnnounceInvokeParams
{
	int32_t AnnouncementID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<int32_t> ExternParams; // 0x8(0x10)
	struct TArray<float> ExternFloatParams; // 0x18(0x10)
	struct TArray<struct FString> ExternStrings; // 0x28(0x10)
	struct TArray<struct FText> ExternTexts; // 0x38(0x10)
	struct FInvokeAnnounceSettingCover AnnounceSetting; // 0x48(0x50)
	struct FString OptionalString; // 0x98(0x10)
	struct TArray<struct FText> CustomContentTexts; // 0xA8(0x10)
};

// Object: ScriptStruct UAGame.BulletDampingParam
// Size: 0x10 (Inherited: 0x0)
struct FBulletDampingParam
{
	float VelSub; // 0x0(0x4)
	float DamageSub; // 0x4(0x4)
	float PenetrationSub; // 0x8(0x4)
	float Density; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.BulletDampingBind
// Size: 0x18 (Inherited: 0x0)
struct FBulletDampingBind
{
	struct UPhysicalMaterial* PhysicalMaterial; // 0x0(0x8)
	struct FBulletDampingParam DampingParam; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.UABenchmarkDataTableData
// Size: 0x60 (Inherited: 0x8)
struct FUABenchmarkDataTableData : FTableRowBase
{
	struct FString Marker; // 0x8(0x10)
	struct FString Type; // 0x18(0x10)
	struct FString Unit; // 0x28(0x10)
	struct FString Value; // 0x38(0x10)
	float PosX; // 0x48(0x4)
	float PosY; // 0x4C(0x4)
	float PosZ; // 0x50(0x4)
	float RotX; // 0x54(0x4)
	float RotY; // 0x58(0x4)
	float RotZ; // 0x5C(0x4)
};

// Object: ScriptStruct UAGame.BloodstoneAnimInstanceProxy
// Size: 0x8E0 (Inherited: 0x8D0)
struct FBloodstoneAnimInstanceProxy : FAnimInstanceProxy
{
	float Angle; // 0x8C8(0x4)
	struct UBloodstoneAnimInstance* SGAnimInstance; // 0x8D0(0x8)
	struct AUABloodstoneBase* BloodstoneActor; // 0x8D8(0x8)
};

// Object: ScriptStruct UAGame.CapturePointFactionInfo
// Size: 0x18 (Inherited: 0x0)
struct FCapturePointFactionInfo
{
	EFactionType BelongFactionType; // 0x0(0x1)
	EFactionType BiasFactionType; // 0x1(0x1)
	EFactionType CurFactionType; // 0x2(0x1)
	uint8_t Pad_0x3[0x5]; // 0x3(0x5)
	struct FDateTime CurDateTime; // 0x8(0x8)
	float CurProgress; // 0x10(0x4)
	float CurRate; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.CapturePointFactionConfig
// Size: 0x30 (Inherited: 0x0)
struct FCapturePointFactionConfig
{
	float PositiveRate; // 0x0(0x4)
	float InverseRate; // 0x4(0x4)
	float DecayRate; // 0x8(0x4)
	float PositiveCoefficient; // 0xC(0x4)
	float InverseCoefficient; // 0x10(0x4)
	float AdditionCoefficient; // 0x14(0x4)
	float MaxPositiveCoefficient; // 0x18(0x4)
	float MaxInverseCoefficient; // 0x1C(0x4)
	float MaxAdditionCoefficient; // 0x20(0x4)
	struct FVector CapturePointVecColor; // 0x24(0xC)
};

// Object: ScriptStruct UAGame.UATutorialGuideSwitchInfo
// Size: 0x18 (Inherited: 0x0)
struct FUATutorialGuideSwitchInfo
{
	EUATutorialGuideType GuideType; // 0x0(0x1)
	bool GuideEnabled; // 0x1(0x1)
	uint8_t ModifyFlag; // 0x2(0x1)
	uint8_t Pad_0x3[0x5]; // 0x3(0x5)
	struct TArray<struct FString> GuideParams; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.UATutorialInitInfo
// Size: 0x1 (Inherited: 0x0)
struct FUATutorialInitInfo
{
	bool bUseNLPMentor; // 0x0(0x1)
};

// Object: ScriptStruct UAGame.UATutorialEventInfo
// Size: 0x38 (Inherited: 0x0)
struct FUATutorialEventInfo
{
	int32_t ID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FString EventName; // 0x8(0x10)
	int32_t MaxTimesInGame; // 0x18(0x4)
	int32_t MaxTimesInCareer; // 0x1C(0x4)
	int32_t NotTriggerTimesInCareer; // 0x20(0x4)
	int32_t CD; // 0x24(0x4)
	int32_t Para1; // 0x28(0x4)
	int32_t Para2; // 0x2C(0x4)
	int32_t Para3; // 0x30(0x4)
	bool bSupportNLPMentor; // 0x34(0x1)
	uint8_t Pad_0x35[0x3]; // 0x35(0x3)
};

// Object: ScriptStruct UAGame.UAMarkedData
// Size: 0x8 (Inherited: 0x0)
struct FUAMarkedData
{
	EUAMarkedType MarkedType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float MarkedContinueTime; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.DynamicEventMissionTrackingData
// Size: 0x20 (Inherited: 0x0)
struct FDynamicEventMissionTrackingData
{
	struct FString MachineObjectName; // 0x0(0x10)
	int32_t MissionFlowID; // 0x10(0x4)
	int32_t InitialTeamMemberCount; // 0x14(0x4)
	bool bMissionSuccess; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
	int32_t TeamMemberReduction; // 0x1C(0x4)
};

// Object: ScriptStruct UAGame.DynamicEventDistributeMachineGroupsInfo
// Size: 0x20 (Inherited: 0x0)
struct FDynamicEventDistributeMachineGroupsInfo
{
	bool bEnableOnlyDynamicEvent; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct TArray<struct FDynamicEventDistributeMachineInfo> DynamicEventDistributeMachineList; // 0x8(0x10)
	int32_t SpawnCount; // 0x18(0x4)
	int32_t UseDynamicEventPoolID; // 0x1C(0x4)
};

// Object: ScriptStruct UAGame.DynamicEvent
// Size: 0x30 (Inherited: 0x0)
struct FDynamicEvent
{
	struct TSoftObjectPtr<UMFMissionFlow> DynamicEventTaskAsset; // 0x0(0x28)
	int32_t LimitDistributeTime; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct UAGame.DynamicEventDistributeMachineInfo
// Size: 0x50 (Inherited: 0x0)
struct FDynamicEventDistributeMachineInfo
{
	struct AUAActorSpawnPoint* DynamicEventDistributeMachineSpawnPoint; // 0x0(0x8)
	int32_t Weight; // 0x8(0x4)
	bool bRandomInDynamicEventPool; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	struct FDynamicEvent CustomDynamicEvent; // 0x10(0x30)
	struct FString MachineObjectName; // 0x40(0x10)
};

// Object: ScriptStruct UAGame.DynamicEventPoolInfo
// Size: 0x10 (Inherited: 0x0)
struct FDynamicEventPoolInfo
{
	struct TArray<struct FDynamicEventInfo> DynamicEventPool; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.DynamicEventInfo
// Size: 0x38 (Inherited: 0x0)
struct FDynamicEventInfo
{
	struct FDynamicEvent DynamicEventParams; // 0x0(0x30)
	int32_t Weight; // 0x30(0x4)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
};

// Object: ScriptStruct UAGame.DistributeMissionHistory
// Size: 0x18 (Inherited: 0x0)
struct FDistributeMissionHistory
{
	struct UMFMissionFlow* MissionFlow; // 0x0(0x8)
	ECharacterType TriggerCharacterType; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	int32_t TriggerCharacterLevel; // 0xC(0x4)
	int32_t MisionFlowID; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.UAFSMInfo
// Size: 0x30 (Inherited: 0x0)
struct FUAFSMInfo
{
	struct FString FSMState; // 0x0(0x10)
	struct FString OldFSMState; // 0x10(0x10)
	struct UObject* TargetObject; // 0x20(0x8)
	bool OnlyReplicateToTarget; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
};

// Object: ScriptStruct UAGame.UAFSMAdvanceParam
// Size: 0x1 (Inherited: 0x0)
struct FUAFSMAdvanceParam
{
	bool OnlyReplicateToTarget; // 0x0(0x1)
};

// Object: ScriptStruct UAGame.AreaIDToVolumeConfig
// Size: 0x10 (Inherited: 0x0)
struct FAreaIDToVolumeConfig
{
	int32_t AreaID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct ASGLootSubAreaVolume* VolumeInstance; // 0x8(0x8)
};

// Object: ScriptStruct UAGame.AreaIDToLocationIDTableRow
// Size: 0x10 (Inherited: 0x8)
struct FAreaIDToLocationIDTableRow : FTableRowBase
{
	int32_t AreaID; // 0x8(0x4)
	bool bShouldBroadcast; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
};

// Object: ScriptStruct UAGame.GameAreaStatisDateInfo
// Size: 0x10 (Inherited: 0x0)
struct FGameAreaStatisDateInfo
{
	struct TArray<struct FAreaDataInfo> AreaIDArrays; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.GameHUDReportInfo
// Size: 0x1 (Inherited: 0x0)
struct FGameHUDReportInfo
{
	uint8_t Pad_0x0[0x1]; // 0x0(0x1)
};

// Object: ScriptStruct UAGame.ActivityRequireDistributers
// Size: 0x10 (Inherited: 0x0)
struct FActivityRequireDistributers
{
	struct TArray<struct TSoftClassPtr<struct AMFQuestDistributerBase*>> DistributerClasses; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.UAModePickupLevelConfigsMappingTableRow
// Size: 0x20 (Inherited: 0x8)
struct FUAModePickupLevelConfigsMappingTableRow : FTableRowBase
{
	int32_t ModeID; // 0x8(0x4)
	int32_t MapID; // 0xC(0x4)
	int32_t MatchID; // 0x10(0x4)
	int32_t TeamID; // 0x14(0x4)
	struct UDataTable* PickupLevelConfigsTable; // 0x18(0x8)
};

// Object: ScriptStruct UAGame.PlayerStartGroupInfo
// Size: 0x18 (Inherited: 0x0)
struct FPlayerStartGroupInfo
{
	int32_t GroupIndex; // 0x0(0x4)
	EPlayerTeamType TeamType; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
	struct TArray<struct APlayerStart*> PlayerStarts; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.FactionPlayerStart
// Size: 0x40 (Inherited: 0x0)
struct FFactionPlayerStart
{
	EFactionType FactionType; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct TArray<int32_t> DomainPlayerStart; // 0x8(0x10)
	bool bOccupyDomainPlayerStart; // 0x18(0x1)
	uint8_t Pad_0x19[0x7]; // 0x19(0x7)
	struct TArray<int32_t> PlayerStartResult; // 0x20(0x10)
	struct TArray<int32_t> PlayerStartResultUsed; // 0x30(0x10)
};

// Object: ScriptStruct UAGame.SGInterrogateParameters
// Size: 0xC (Inherited: 0x0)
struct FSGInterrogateParameters
{
	float MarkDuration; // 0x0(0x4)
	float MaxDistanceOfTeammate; // 0x4(0x4)
	int32_t MaxNumOfMark; // 0x8(0x4)
};

// Object: ScriptStruct UAGame.PerkTraceTimerData
// Size: 0x10 (Inherited: 0x0)
struct FPerkTraceTimerData
{
	struct FTimerHandle TimerHandle; // 0x0(0x8)
	int32_t HandleID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.PerkTraceParams
// Size: 0xC (Inherited: 0x0)
struct FPerkTraceParams
{
	float TraceDuration; // 0x0(0x4)
	int32_t MaxTraceCount; // 0x4(0x4)
	int32_t TraceConfigID; // 0x8(0x4)
};

// Object: ScriptStruct UAGame.BattleRoyalContentionAreaDataInfo
// Size: 0x28 (Inherited: 0x0)
struct FBattleRoyalContentionAreaDataInfo
{
	int32_t AreaType; // 0x0(0x4)
	int32_t AreaID; // 0x4(0x4)
	int32_t AreaIndex; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	int64_t EnterTimeStamp; // 0x10(0x8)
	int32_t EnterMainWeaponValue; // 0x18(0x4)
	int32_t EnterEquipmentValue; // 0x1C(0x4)
	float EnterInventoryValue; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
};

// Object: ScriptStruct UAGame.BattleRoyalContentionAreaInfo
// Size: 0x20 (Inherited: 0x0)
struct FBattleRoyalContentionAreaInfo
{
	int32_t AreaID; // 0x0(0x4)
	struct FVector AreaPosistion; // 0x4(0xC)
	struct TArray<struct ASGCharacter*> EnteredCharacters; // 0x10(0x10)
};

// Object: ScriptStruct UAGame.BattleRoyalVolumeConfig
// Size: 0x20 (Inherited: 0x0)
struct FBattleRoyalVolumeConfig
{
	EBattleRoyalVolumeType VolumeType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t VolumeTraceID; // 0x4(0x4)
	float VolumeTraceTime; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TArray<int32_t> VolumeIDs; // 0x10(0x10)
};

// Object: ScriptStruct UAGame.BattleRoyalStageConfig
// Size: 0x50 (Inherited: 0x0)
struct FBattleRoyalStageConfig
{
	struct FBattleRoyalVolumeConfig BRVolumeConfig; // 0x0(0x20)
	int32_t EscapePointNum; // 0x20(0x4)
	EBattleRoyalEscapePointType BREscapePointType; // 0x24(0x1)
	uint8_t Pad_0x25[0x3]; // 0x25(0x3)
	int32_t EscapeLimitNum; // 0x28(0x4)
	EEscapeState NewTargetState; // 0x2C(0x1)
	uint8_t Pad_0x2D[0x3]; // 0x2D(0x3)
	struct TArray<struct FBattleRoyalStageEscapeCondition> EscapeConditions; // 0x30(0x10)
	struct TArray<struct FBattleRoyalStageParadropWave> ParadropWaves; // 0x40(0x10)
};

// Object: ScriptStruct UAGame.BattleRoyalStageParadropWave
// Size: 0xC (Inherited: 0x0)
struct FBattleRoyalStageParadropWave
{
	EBattleRoyalParadropType ParadropType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct FName ConfigRowName; // 0x4(0x8)
};

// Object: ScriptStruct UAGame.BattleRoyalStageEscapeCondition
// Size: 0x18 (Inherited: 0x0)
struct FBattleRoyalStageEscapeCondition
{
	EEscapeConditionsType EscapeConditionsType; // 0x0(0x1)
	EEscapeConditionsChangeType EscapeConditionsChangeType; // 0x1(0x1)
	uint8_t Pad_0x2[0x6]; // 0x2(0x6)
	struct TArray<struct UUAFSMCheckObject*> CheckObjects; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.BattleRoyalParadropInfo
// Size: 0x40 (Inherited: 0x0)
struct FBattleRoyalParadropInfo
{
	int32_t StageIndex; // 0x0(0x4)
	int32_t WaveIndex; // 0x4(0x4)
	float RequiredFallingChannelRadius; // 0x8(0x4)
	float RequiredFlatGroundRadius; // 0xC(0x4)
	float ParadropTime; // 0x10(0x4)
	struct FVector LandingLocation; // 0x14(0xC)
	struct ASGVolume* InsideBRVolume; // 0x20(0x8)
	struct TArray<struct AUAEscapeVolume*> ArroundEscapePoints; // 0x28(0x10)
	uint8_t Pad_0x38[0x8]; // 0x38(0x8)
};

// Object: ScriptStruct UAGame.BattleRoyalEscapeInfo
// Size: 0x40 (Inherited: 0x0)
struct FBattleRoyalEscapeInfo
{
	int32_t StageIndex; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct AUAEscapeVolume*> EscapePoints; // 0x8(0x10)
	struct ASGVolume* InsideBRVolume; // 0x18(0x8)
	struct TArray<struct AUAEscapeVolume*> InsideBRVolumeEscapePoints; // 0x20(0x10)
	struct TArray<struct AUAEscapeVolume*> OutsideBRVolumeEscapePoints; // 0x30(0x10)
};

// Object: ScriptStruct UAGame.BattleRoyalVolumeInfo
// Size: 0x28 (Inherited: 0x0)
struct FBattleRoyalVolumeInfo
{
	int32_t StageIndex; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct AUABattleRoyalAreaVolume* BattleRoyalVolume; // 0x8(0x8)
	struct TArray<struct AUABattleRoyalAreaVolume*> AllBattleRoyalVolumes; // 0x10(0x10)
	uint8_t Pad_0x20[0x8]; // 0x20(0x8)
};

// Object: ScriptStruct UAGame.ActivityLuckyBoxAIInfo
// Size: 0x10 (Inherited: 0x0)
struct FActivityLuckyBoxAIInfo
{
	int32_t AIID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct UAkAudioEvent* DropoutSound; // 0x8(0x8)
};

// Object: ScriptStruct UAGame.NPCLuckyBoxRecord
// Size: 0x8 (Inherited: 0x0)
struct FNPCLuckyBoxRecord
{
	int32_t DropoutNum; // 0x0(0x4)
	float DropoutTime; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.BRSelectPointInfo
// Size: 0x8 (Inherited: 0x0)
struct FBRSelectPointInfo
{
	int32_t SelectPointID; // 0x0(0x4)
	int32_t StartGroupIndex; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.TeamRankInfo
// Size: 0x58 (Inherited: 0x0)
struct FTeamRankInfo
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct TMap<uint64_t, struct FBRSelectPointInfo> JoinedGIDs; // 0x8(0x50)
};

// Object: ScriptStruct UAGame.UARadioEmitterCompListData
// Size: 0x10 (Inherited: 0x0)
struct FUARadioEmitterCompListData
{
	struct TArray<struct UUAActorRadioEmitterComponent*> RadioEmitterCompList; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.UARadioTriggerInfoInBattle
// Size: 0x8 (Inherited: 0x0)
struct FUARadioTriggerInfoInBattle
{
	float LastTriggerTimestamp; // 0x0(0x4)
	int32_t TriggerCount; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.UARadioTextAudioTable
// Size: 0x38 (Inherited: 0x8)
struct FUARadioTextAudioTable : FTableRowBase
{
	uint64_t RadioID; // 0x8(0x8)
	struct FText RadioText; // 0x10(0x18)
	struct FString RadioAudioName; // 0x28(0x10)
};

// Object: ScriptStruct UAGame.UARadioConfigTable
// Size: 0x30 (Inherited: 0x8)
struct FUARadioConfigTable : FTableRowBase
{
	EUARadioType RadioType; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	float MaxDistance; // 0xC(0x4)
	int32_t MaxTimesToTrigger; // 0x10(0x4)
	int32_t RadioTypeMaxTimesToTrigger; // 0x14(0x4)
	float CoolDownTime; // 0x18(0x4)
	float RadioTypeCoolDownTime; // 0x1C(0x4)
	float LifeTime; // 0x20(0x4)
	int32_t Priority; // 0x24(0x4)
	int32_t NumOfTemplates; // 0x28(0x4)
	int32_t NumOfVoiceTemplates; // 0x2C(0x4)
};

// Object: ScriptStruct UAGame.UAModeRadioConfigTable
// Size: 0x70 (Inherited: 0x20)
struct FUAModeRadioConfigTable : FModeTableRowBase
{
	int32_t NumOfRadioEmitters; // 0x1C(0x4)
	struct TMap<EUARadioType, struct FUARadioConfigTable> UARadioConfigTableMap; // 0x20(0x50)
};

// Object: ScriptStruct UAGame.TodFreezedInfo
// Size: 0x8 (Inherited: 0x0)
struct FTodFreezedInfo
{
	bool bFreeze; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t FreezedTodSeconds; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.CustomBlendingWeatherInfo
// Size: 0x8 (Inherited: 0x0)
struct FCustomBlendingWeatherInfo
{
	EWeatherType TargetWeatherType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float CustomBlendingTime; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.WeatherBlend
// Size: 0x2 (Inherited: 0x0)
struct FWeatherBlend
{
	EWeatherType PrevWeather; // 0x0(0x1)
	EWeatherType CurrentWeather; // 0x1(0x1)
};

// Object: ScriptStruct UAGame.WeatherAudioStateTimeSet
// Size: 0x8 (Inherited: 0x0)
struct FWeatherAudioStateTimeSet
{
	EWeatherType PreWeatherType; // 0x0(0x1)
	EWeatherType NextWeatherType; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	float Weight; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.WeatherInMap
// Size: 0x20 (Inherited: 0x0)
struct FWeatherInMap
{
	struct FString MapName; // 0x0(0x10)
	struct TArray<EWeatherType> WeatherList; // 0x10(0x10)
};

// Object: ScriptStruct UAGame.TraceableActorList
// Size: 0x10 (Inherited: 0x0)
struct FTraceableActorList
{
	struct TArray<struct FTraceableActorInfo> TraceableActorInfos; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.TraceableActorInfo
// Size: 0x58 (Inherited: 0x0)
struct FTraceableActorInfo
{
	struct TWeakObjectPtr<struct AActor> Actor; // 0x0(0x8)
	struct TWeakObjectPtr<struct AActor> ActorOuter; // 0x8(0x8)
	bool bActorDestroyed; // 0x10(0x1)
	bool bOwnerAlive; // 0x11(0x1)
	bool bHasOwner; // 0x12(0x1)
	uint8_t Pad_0x13[0x1]; // 0x13(0x1)
	struct FVector WorldLocation; // 0x14(0xC)
	int32_t Handle; // 0x20(0x4)
	ETraceMarkOperatorType OperatorType; // 0x24(0x1)
	ETraceableMarkType MarkType; // 0x25(0x1)
	uint8_t Pad_0x26[0x2]; // 0x26(0x2)
	int32_t ConfigID; // 0x28(0x4)
	float ScanningInterval; // 0x2C(0x4)
	float LastUpdateServerTime; // 0x30(0x4)
	struct TWeakObjectPtr<struct AQuestBase> OwnerQuest; // 0x34(0x8)
	int32_t TaskId; // 0x3C(0x4)
	int32_t TargetId; // 0x40(0x4)
	bool bNeedTrace; // 0x44(0x1)
	uint8_t Pad_0x45[0x3]; // 0x45(0x3)
	struct FVector Extend; // 0x48(0xC)
	int32_t EscapeId; // 0x54(0x4)
};

// Object: ScriptStruct UAGame.TrackPlayerInfo
// Size: 0x20 (Inherited: 0x0)
struct FTrackPlayerInfo
{
	struct UUAPlayerStateTraceComponent* PlayerStateTraceComponent; // 0x0(0x8)
	struct UUAPlayerStateChaseActivityComp* ChaseActivityComp; // 0x8(0x8)
	struct FChaseActivityAvatarInfo ChaseActivityAvatarInfo; // 0x10(0x10)
};

// Object: ScriptStruct UAGame.TakeOutLimitAdditionalStruct
// Size: 0x30 (Inherited: 0x0)
struct FTakeOutLimitAdditionalStruct
{
	int64_t SelfGID; // 0x0(0x8)
	struct TArray<int64_t> TeammateGIDs; // 0x8(0x10)
	struct TArray<int64_t> FactionGIDs; // 0x18(0x10)
	ETakeOutLimitType LimitType; // 0x28(0x1)
	ESGTakeInSourceType OrderTakeInSourceType; // 0x29(0x1)
	uint8_t Pad_0x2A[0x6]; // 0x2A(0x6)
};

// Object: ScriptStruct UAGame.MemberInfo
// Size: 0x110 (Inherited: 0x0)
struct FMemberInfo
{
	int64_t gid; // 0x0(0x8)
	int32_t Level; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct FString HeadIconFileName; // 0x10(0x10)
	struct UObject* HeadIconTexture; // 0x20(0x8)
	struct FString HeadboxPath; // 0x28(0x10)
	struct FString PrivilegeIconPath; // 0x38(0x10)
	struct FString PlayerName; // 0x48(0x10)
	struct FString TitleName; // 0x58(0x10)
	struct FString TitleIconPath; // 0x68(0x10)
	struct FString TitleBackgroundPath; // 0x78(0x10)
	int32_t TitleShowNum; // 0x88(0x4)
	int32_t Type; // 0x8C(0x4)
	struct FString NameCardPath; // 0x90(0x10)
	struct FString NationalFlagPath; // 0xA0(0x10)
	struct FString RankingIconPath; // 0xB0(0x10)
	struct FString SmallRankingIconPath; // 0xC0(0x10)
	struct FString RankingLevelPath; // 0xD0(0x10)
	bool bShowStarNum; // 0xE0(0x1)
	uint8_t Pad_0xE1[0x3]; // 0xE1(0x3)
	int32_t StarNum; // 0xE4(0x4)
	struct UObject* AvatarMaterialObject; // 0xE8(0x8)
	struct UObject* PlayerBGImage; // 0xF0(0x8)
	struct UObject* PlayerBorderImage; // 0xF8(0x8)
	ELoadingTipsType LoadingTipsType; // 0x100(0x1)
	uint8_t Pad_0x101[0x3]; // 0x101(0x3)
	int32_t Ranking; // 0x104(0x4)
	bool bSkinShareable; // 0x108(0x1)
	uint8_t Pad_0x109[0x7]; // 0x109(0x7)
};

// Object: ScriptStruct UAGame.TeamEscapeSubmitPerkInfo
// Size: 0x18 (Inherited: 0x0)
struct FTeamEscapeSubmitPerkInfo
{
	int32_t TeamIndex; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FPersonEscapeSubmitPerkInfo> PersonEscapeSubmitInfos; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.PersonEscapeSubmitPerkInfo
// Size: 0x18 (Inherited: 0x0)
struct FPersonEscapeSubmitPerkInfo
{
	uint64_t gid; // 0x0(0x8)
	struct TArray<struct FEscapeSubmitPerkData> EscapeSubmitPerkData; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.EscapeSubmitPerkData
// Size: 0x18 (Inherited: 0x0)
struct FEscapeSubmitPerkData
{
	int32_t PerkId; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	int64_t ItemIDPrefix; // 0x8(0x8)
	int32_t ChangeAmount; // 0x10(0x4)
	int32_t InitialDelaySeconds; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.ModifyEscapeInfoList
// Size: 0x10 (Inherited: 0x0)
struct FModifyEscapeInfoList
{
	struct TArray<struct FModifyEscapeInfo> ModifyEscapeInfos; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.ModifyEscapeInfo
// Size: 0x8 (Inherited: 0x0)
struct FModifyEscapeInfo
{
	int32_t EscapePointID; // 0x0(0x4)
	bool bAddEscapePoint; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
};

// Object: ScriptStruct UAGame.TeamEscapeInfo
// Size: 0x78 (Inherited: 0x0)
struct FTeamEscapeInfo
{
	struct ASGTeamInfo* TeamInfo; // 0x0(0x8)
	struct TArray<int32_t> EscapePointIDs; // 0x8(0x10)
	bool FinishDistribute; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
	int32_t PresetIndex; // 0x1C(0x4)
	uint8_t Pad_0x20[0x58]; // 0x20(0x58)
};

// Object: ScriptStruct UAGame.UAHeroSelectionTeamData
// Size: 0x28 (Inherited: 0x0)
struct FUAHeroSelectionTeamData
{
	int32_t TeamIndex; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<int32_t> HeroTemplateIDs; // 0x8(0x10)
	struct TArray<struct FUAHeroSelectionTeammateChoice> TeammateChoices; // 0x18(0x10)
};

// Object: ScriptStruct UAGame.UAHeroSelectionTeammateChoice
// Size: 0x10 (Inherited: 0x0)
struct FUAHeroSelectionTeammateChoice
{
	uint64_t PlayerGID; // 0x0(0x8)
	int32_t HeroTemplateID; // 0x8(0x4)
	bool bHasGiveEquip; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
};

// Object: ScriptStruct UAGame.UAHeroSelectionWatchData
// Size: 0xC (Inherited: 0x0)
struct FUAHeroSelectionWatchData
{
	int32_t CurrRound; // 0x0(0x4)
	float ChooseHeroBeginTime; // 0x4(0x4)
	float ChooseHeroMaxTime; // 0x8(0x4)
};

// Object: ScriptStruct UAGame.RebornAnnounceData
// Size: 0x8 (Inherited: 0x0)
struct FRebornAnnounceData
{
	int32_t Time; // 0x0(0x4)
	int32_t AnnounceID; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.KeyRelatedDoorInfo
// Size: 0x28 (Inherited: 0x0)
struct FKeyRelatedDoorInfo
{
	int32_t KeyID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct ASGDoorBase*> RelatedDoor; // 0x8(0x10)
	struct TArray<struct FTransform> RelatedDoorTrans; // 0x18(0x10)
};

// Object: ScriptStruct UAGame.SGSceneMoveActorRaw
// Size: 0x28 (Inherited: 0x0)
struct FSGSceneMoveActorRaw
{
	struct FMissionActorReference ActorReference; // 0x0(0x18)
	struct FVector MoveLocation; // 0x18(0xC)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
};

// Object: ScriptStruct UAGame.UAGSTeamEarningsRankingData
// Size: 0x48 (Inherited: 0x0)
struct FUAGSTeamEarningsRankingData
{
	int32_t TeamIndex; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FString TeamName; // 0x8(0x10)
	int32_t TeamLogo; // 0x18(0x4)
	int32_t Ranking; // 0x1C(0x4)
	uint64_t TotalEarnings; // 0x20(0x8)
	int32_t MaxRanking; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
	uint64_t MaxTotalEarnings; // 0x30(0x8)
	struct TArray<struct FUAGSPlayerEarningsRankingData> PlayerEarnings; // 0x38(0x10)
};

// Object: ScriptStruct UAGame.UAGSPlayerEarningsRankingData
// Size: 0x18 (Inherited: 0x0)
struct FUAGSPlayerEarningsRankingData
{
	uint64_t gid; // 0x0(0x8)
	int32_t AllExtendInventoriesValue; // 0x8(0x4)
	int32_t Earnings; // 0xC(0x4)
	int32_t MaxEarnings; // 0x10(0x4)
	bool bDead; // 0x14(0x1)
	uint8_t Pad_0x15[0x3]; // 0x15(0x3)
};

// Object: ScriptStruct UAGame.UATutorialGamePadHudTipsTable
// Size: 0x48 (Inherited: 0x8)
struct FUATutorialGamePadHudTipsTable : FTableRowBase
{
	EUAGamePadTable GamePadId; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	int32_t UMGEffectID; // 0xC(0x4)
	struct FVector2D PosOffSet; // 0x10(0x8)
	int32_t UIStyle; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	struct FText ShowText; // 0x20(0x18)
	int32_t AnnounceID; // 0x38(0x4)
	float ShowDuration; // 0x3C(0x4)
	int32_t HighEffectType; // 0x40(0x4)
	bool bShowHighLine; // 0x44(0x1)
	uint8_t Pad_0x45[0x3]; // 0x45(0x3)
};

// Object: ScriptStruct UAGame.OutsideVolumeTeamInfo
// Size: 0xC (Inherited: 0x0)
struct FOutsideVolumeTeamInfo
{
	struct TWeakObjectPtr<struct ASGTeamInfo> Team; // 0x0(0x8)
	float FailureTime; // 0x8(0x4)
};

// Object: ScriptStruct UAGame.ChaseActivityInvMarkScaleInfo
// Size: 0x8 (Inherited: 0x0)
struct FChaseActivityInvMarkScaleInfo
{
	float Distance; // 0x0(0x4)
	float Scale; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.MapRefreshHandler
// Size: 0x1C (Inherited: 0x0)
struct FMapRefreshHandler
{
	uint8_t Pad_0x0[0x4]; // 0x0(0x4)
	bool bEnabled; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
	int32_t FrameInterval; // 0x8(0x4)
	struct FDelegate RefreshFunc; // 0xC(0x10)
};

// Object: ScriptStruct UAGame.UAWeaponAttributes
// Size: 0x1C (Inherited: 0x0)
struct FUAWeaponAttributes
{
	float BulletZeroFlyDistanceForWeaponAction; // 0x0(0x4)
	float ZeroDropDistance; // 0x4(0x4)
	float Accuracy; // 0x8(0x4)
	float MoaX; // 0xC(0x4)
	float MoaY; // 0x10(0x4)
	float VerticalRecoil; // 0x14(0x4)
	float HorizontalRecoil; // 0x18(0x4)
};

// Object: ScriptStruct UAGame.SoundPlayParam
// Size: 0xC (Inherited: 0x0)
struct FSoundPlayParam
{
	ESoundSourceType SoundType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float Duration; // 0x4(0x4)
	float MaxDistance; // 0x8(0x4)
};

// Object: ScriptStruct UAGame.UADetectorAppearanceParams
// Size: 0x80 (Inherited: 0x0)
struct FUADetectorAppearanceParams
{
	struct FName RotationParamKey; // 0x0(0x8)
	struct FVector RotationParamForwards; // 0x8(0xC)
	struct FVector RotationParamLeft; // 0x14(0xC)
	struct FVector RotationParamRight; // 0x20(0xC)
	struct FVector RotationParamBack; // 0x2C(0xC)
	struct FName PowerLengthParamKey; // 0x38(0x8)
	struct FVector PowerLengthParam; // 0x40(0xC)
	struct FName PowerColorParamKey; // 0x4C(0x8)
	float PowerColorThreshold; // 0x54(0x4)
	struct FVector PowerColorSmallParam; // 0x58(0xC)
	struct FVector PowerColorBigParam; // 0x64(0xC)
	struct FName OpenXHParamKey; // 0x70(0x8)
	float OpenXHSmallParam; // 0x78(0x4)
	float OpenXHBigParam; // 0x7C(0x4)
};

// Object: ScriptStruct UAGame.LandmarkVolumeData
// Size: 0xC (Inherited: 0x0)
struct FLandmarkVolumeData
{
	int32_t LandmarkID; // 0x0(0x4)
	int32_t VolumeID; // 0x4(0x4)
	ELandmarkVolumeEffect Effect; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
};

// Object: ScriptStruct UAGame.UALootBoxNameTool
// Size: 0xC0 (Inherited: 0x0)
struct FUALootBoxNameTool
{
	struct FText TextForFindTableID; // 0x0(0x18)
	uint8_t Pad_0x18[0xA8]; // 0x18(0xA8)
};

// Object: ScriptStruct UAGame.CombinPickupData
// Size: 0x48 (Inherited: 0x0)
struct FCombinPickupData
{
	struct TSoftClassPtr<struct AUAPickup*> PickupClass; // 0x0(0x28)
	struct FVector LocationOffset; // 0x28(0xC)
	struct FRotator RotatorOffset; // 0x34(0xC)
	struct AUAPickup* SpawnPickup; // 0x40(0x8)
};

// Object: ScriptStruct UAGame.InventoryContainer
// Size: 0x10 (Inherited: 0x0)
struct FInventoryContainer
{
	struct TArray<struct FInventoryHandle> InventoryArray; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.PreSetChangeLevelVolumeStateInfo
// Size: 0x8 (Inherited: 0x0)
struct FPreSetChangeLevelVolumeStateInfo
{
	int32_t ChangeLevelVolumeID; // 0x0(0x4)
	int32_t Weight; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.AnnounceActorInfoExtraction
// Size: 0x10 (Inherited: 0x0)
struct FAnnounceActorInfoExtraction
{
	struct FMFGlobalEventParameterTag InputActorTag; // 0x0(0x8)
	struct UUAAnnounceServerLogicBase* ExtractAction; // 0x8(0x8)
};

// Object: ScriptStruct UAGame.CacheModifyData
// Size: 0x10 (Inherited: 0x0)
struct FCacheModifyData
{
	struct TArray<struct ACharacter*> Characters; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.MissionActionRelevantToAICharacters
// Size: 0x10 (Inherited: 0x0)
struct FMissionActionRelevantToAICharacters
{
	struct TArray<struct TWeakObjectPtr<struct ASGAICharacter>> AICharacters; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.MissionActionRelevantToInventories
// Size: 0x10 (Inherited: 0x0)
struct FMissionActionRelevantToInventories
{
	struct TArray<struct TWeakObjectPtr<struct ASGInventory>> Inventories; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.MissionActionRelevantToInteractActors
// Size: 0x10 (Inherited: 0x0)
struct FMissionActionRelevantToInteractActors
{
	struct TArray<struct TWeakObjectPtr<struct AActor>> InteractActors; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.MissionActionSpawnedInventories
// Size: 0x10 (Inherited: 0x0)
struct FMissionActionSpawnedInventories
{
	struct TArray<struct TWeakObjectPtr<struct ASGInventory>> Inventories; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.RandomCacheStruct
// Size: 0x10 (Inherited: 0x0)
struct FRandomCacheStruct
{
	struct TArray<int32_t> EscapePoints; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_DistributeFactionDomain
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_DistributeFactionDomain
{
	struct AGameState* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_DistributeMissionN
// Size: 0x10 (Inherited: 0x0)
struct FGlobalEventMessage_DistributeMissionN
{
	struct ACharacter* Instigator; // 0x0(0x8)
	int32_t IntCount; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_DoorState
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_DoorState
{
	struct AGameState* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.FactionPlayerStartConfigRow
// Size: 0x50 (Inherited: 0x0)
struct FFactionPlayerStartConfigRow
{
	EFactionType FactionType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t ChooseNum; // 0x4(0x4)
	EFPSCCheckType CheckType; // 0x8(0x1)
	EPlayerTeamType PlayerStartTeamType; // 0x9(0x1)
	uint8_t Pad_0xA[0x2]; // 0xA(0x2)
	int32_t ParamOne; // 0xC(0x4)
	int32_t ParamTwo; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct FMFMissionVariableRead_Vector NewReferenceVector; // 0x18(0x38)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_FactionPlayerStart
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_FactionPlayerStart
{
	struct AGameState* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.MissionParadropRow
// Size: 0x48 (Inherited: 0x0)
struct FMissionParadropRow
{
	struct FMFMissionVariableRead_ActorReference NewPlacementActor; // 0x0(0x40)
	struct FName ConfigRowName; // 0x40(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_Paradrop
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_Paradrop
{
	struct AGameState* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.MissionVariableWriteRow
// Size: 0x10 (Inherited: 0x0)
struct FMissionVariableWriteRow
{
	struct TArray<struct UMFMissionVariableWriteBase*> Variables; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_RdmBlackboard
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_RdmBlackboard
{
	struct AGameState* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_RdmPlayerStart
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_RdmPlayerStart
{
	struct AGameState* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_Scene
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_Scene
{
	struct AGameState* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_ActivateLootPoint
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_ActivateLootPoint
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.MissionObjectiveActivateLootPointConfigs
// Size: 0x20 (Inherited: 0x0)
struct FMissionObjectiveActivateLootPointConfigs
{
	struct TArray<int32_t> ForceActivateLootPoints; // 0x0(0x10)
	struct TArray<struct FMissionObjectiveActivateLootPointConfig> ActivateConfigs; // 0x10(0x10)
};

// Object: ScriptStruct UAGame.MissionObjectiveActivateLootPointConfig
// Size: 0xC (Inherited: 0x0)
struct FMissionObjectiveActivateLootPointConfig
{
	int32_t LootPointType; // 0x0(0x4)
	int32_t ActivateMinCount; // 0x4(0x4)
	int32_t ActivateMaxCount; // 0x8(0x4)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_AddInventoryToLootContainer
// Size: 0x18 (Inherited: 0x0)
struct FGlobalEventMessage_AddInventoryToLootContainer
{
	struct AActor* Instigator; // 0x0(0x8)
	struct ASGInventory* Inventory; // 0x8(0x8)
	struct AActor* Container; // 0x10(0x8)
};

// Object: ScriptStruct UAGame.MissionObjectiveBroadcastedCheckTimeConfigs
// Size: 0x10 (Inherited: 0x0)
struct FMissionObjectiveBroadcastedCheckTimeConfigs
{
	struct TArray<int32_t> CheckIndexs; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_BroadcastOnGameHUD
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_BroadcastOnGameHUD
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.MissionObjectiveBroadcastGameHUDConfigs
// Size: 0x10 (Inherited: 0x0)
struct FMissionObjectiveBroadcastGameHUDConfigs
{
	struct TArray<struct FBroadcastOnGameHUDConfig> GameHUDConfigs; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.MFMissionCapturePointChooseConifg
// Size: 0x20 (Inherited: 0x0)
struct FMFMissionCapturePointChooseConifg
{
	struct FMissionActorReference VolumeRef; // 0x0(0x18)
	int32_t Weight; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct UAGame.MFMissionChooseVolumeConifg
// Size: 0x20 (Inherited: 0x0)
struct FMFMissionChooseVolumeConifg
{
	struct FMissionActorReference VolumeRef; // 0x0(0x18)
	int32_t Weight; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_DisableLootPoint
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_DisableLootPoint
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_DistributeMission
// Size: 0x10 (Inherited: 0x0)
struct FGlobalEventMessage_DistributeMission
{
	struct AActor* Instigator; // 0x0(0x8)
	int32_t IntCount; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_EscapeVolumeStateChange
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_EscapeVolumeStateChange
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_Escort
// Size: 0x18 (Inherited: 0x0)
struct FGlobalEventMessage_Escort
{
	struct ACharacter* Instigator; // 0x0(0x8)
	struct ACharacter* TeamMember; // 0x8(0x8)
	struct AActor* EscapeVolume; // 0x10(0x8)
};

// Object: ScriptStruct UAGame.MFMissionFactionCompeteInfo
// Size: 0x50 (Inherited: 0x0)
struct FMFMissionFactionCompeteInfo
{
	struct TArray<struct UMFMissionVariableWrite_ActorReference*> VictoryEscapePointVariables; // 0x0(0x10)
	struct TArray<struct UMFMissionVariableWrite_ActorReference*> DefeatedEscapePointVariables_Time; // 0x10(0x10)
	struct TArray<struct UMFMissionVariableWrite_ActorReference*> DefeatedEscapePointVariables_NoBag; // 0x20(0x10)
	struct UMFMissionVariableWrite_StringArray* InitialSpawnAIEventStrArray; // 0x30(0x8)
	struct UMFMissionVariableWrite_StringArray* VictorySpawnAIEventStrArray; // 0x38(0x8)
	struct UMFMissionVariableWrite_StringArray* StageChangeSceneEventTagArray; // 0x40(0x8)
	struct UMFMissionVariableWrite_StringArray* FactionWarSpawnTypeTagArray; // 0x48(0x8)
};

// Object: ScriptStruct UAGame.MFMissionFactionCompeteConfig
// Size: 0x88 (Inherited: 0x0)
struct FMFMissionFactionCompeteConfig
{
	struct TArray<struct FMFMissionVariableRead_ActorReference> DomainVolumes; // 0x0(0x10)
	bool PlayerStartEnable; // 0x10(0x1)
	bool bOccupyDomainPlayerStart; // 0x11(0x1)
	bool AISpawnPointEnable; // 0x12(0x1)
	uint8_t Pad_0x13[0x5]; // 0x13(0x5)
	struct TArray<struct FMFMissionVariableRead_ActorReference> VictoryEscapePoints; // 0x18(0x10)
	struct TArray<struct FMFMissionVariableRead_ActorReference> DefeatedEscapePoints_Time; // 0x28(0x10)
	struct TArray<struct FMFMissionVariableRead_ActorReference> DefeatedEscapePoints_NoBag; // 0x38(0x10)
	struct TArray<struct FString> InitialSpawnAIEventStrs; // 0x48(0x10)
	struct TArray<struct FString> VictorySpawnAIEventStrs; // 0x58(0x10)
	struct TArray<struct FString> StageChangeSceneEventTags; // 0x68(0x10)
	struct TArray<struct FString> FactionWarSpawnTypeTags; // 0x78(0x10)
};

// Object: ScriptStruct UAGame.FactionScoreAction
// Size: 0x10 (Inherited: 0x0)
struct FFactionScoreAction
{
	struct TArray<struct UMFMissionAction*> Actions; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_GiveItem
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_GiveItem
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.InventoryList
// Size: 0x10 (Inherited: 0x0)
struct FInventoryList
{
	struct TArray<struct ASGInventory*> Inventories; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_InvokeAnnounce
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_InvokeAnnounce
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_KillAI
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_KillAI
{
	struct ASGAICharacter* KilledAI; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_OrderPlayerStart
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_OrderPlayerStart
{
	struct AGameState* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.RecordTargetList
// Size: 0x10 (Inherited: 0x0)
struct FRecordTargetList
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_RandTimeRange
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_RandTimeRange
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.ScoreAction
// Size: 0x10 (Inherited: 0x0)
struct FScoreAction
{
	struct TArray<struct UMFMissionAction*> Actions; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_ShowControl
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_ShowControl
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.MissionObjectiveSpawnedNetRelevantActors
// Size: 0x10 (Inherited: 0x0)
struct FMissionObjectiveSpawnedNetRelevantActors
{
	struct TArray<struct ASGNetRelevantConfigurableActor*> NetRelevantActors; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.MissionObjectiveActorSpawnPointInfo
// Size: 0x10 (Inherited: 0x0)
struct FMissionObjectiveActorSpawnPointInfo
{
	struct AUAActorSpawnPoint* ActorSpawnPoint; // 0x0(0x8)
	int32_t Weight; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_SpawnActor
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_SpawnActor
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_SpawnGashapon
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_SpawnGashapon
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.MissionObjectiveSpawnedInteractItems
// Size: 0x10 (Inherited: 0x0)
struct FMissionObjectiveSpawnedInteractItems
{
	struct TArray<struct TWeakObjectPtr<struct ASGNetRelevantConfigurableActor>> InteractItems; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_SpawnInteractItem
// Size: 0x10 (Inherited: 0x0)
struct FGlobalEventMessage_SpawnInteractItem
{
	struct AActor* Instigator; // 0x0(0x8)
	struct AActor* InteractActor; // 0x8(0x8)
};

// Object: ScriptStruct UAGame.MissionObjectiveSpawnedInventories
// Size: 0x10 (Inherited: 0x0)
struct FMissionObjectiveSpawnedInventories
{
	struct TArray<struct TWeakObjectPtr<struct ASGInventory>> Inventories; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_SpawnInventory
// Size: 0x10 (Inherited: 0x0)
struct FGlobalEventMessage_SpawnInventory
{
	struct AActor* Instigator; // 0x0(0x8)
	struct ASGInventory* Inventory; // 0x8(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_SpawnParticle
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_SpawnParticle
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.MissionObjectiveSpawnedPickups
// Size: 0x10 (Inherited: 0x0)
struct FMissionObjectiveSpawnedPickups
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_SpawnPickup
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_SpawnPickup
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.MissionTimerHelper
// Size: 0x58 (Inherited: 0x0)
struct FMissionTimerHelper
{
	uint8_t Pad_0x0[0x50]; // 0x0(0x50)
	struct UWorld* World; // 0x50(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_StayInVolume
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_StayInVolume
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_Survival
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_Survival
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_TakeOutItem
// Size: 0x28 (Inherited: 0x0)
struct FGlobalEventMessage_TakeOutItem
{
	struct AActor* Instigator; // 0x0(0x8)
	struct ASGInventory* Inventory; // 0x8(0x8)
	struct FStackableItemSourceInfo StackableItemSourceInfo; // 0x10(0x18)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_TakeOutType
// Size: 0x10 (Inherited: 0x0)
struct FGlobalEventMessage_TakeOutType
{
	struct AActor* Instigator; // 0x0(0x8)
	struct ASGInventory* Inventory; // 0x8(0x8)
};

// Object: ScriptStruct UAGame.UseRecoveryInventoryRecord
// Size: 0x10 (Inherited: 0x0)
struct FUseRecoveryInventoryRecord
{
	struct TArray<struct ASGInventory*> InventoryList; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_WalkDistance
// Size: 0x10 (Inherited: 0x0)
struct FGlobalEventMessage_WalkDistance
{
	struct APlayerState* Instigator; // 0x0(0x8)
	EPlayerEndGameType EndGameType; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
};

// Object: ScriptStruct UAGame.GlobalEventMessage_WriteBattleLine
// Size: 0x8 (Inherited: 0x0)
struct FGlobalEventMessage_WriteBattleLine
{
	struct AActor* Instigator; // 0x0(0x8)
};

// Object: ScriptStruct UAGame.MissionFlowUploadData
// Size: 0x28 (Inherited: 0x0)
struct FMissionFlowUploadData
{
	struct FString MissionFlowName; // 0x0(0x10)
	EMissionStatus MissionFlowStatus; // 0x10(0x1)
	bool bBeforeState; // 0x11(0x1)
	uint8_t Pad_0x12[0x6]; // 0x12(0x6)
	struct TArray<struct FMissionUploadData> MissionUploadDataList; // 0x18(0x10)
};

// Object: ScriptStruct UAGame.MissionUploadData
// Size: 0x20 (Inherited: 0x0)
struct FMissionUploadData
{
	struct FString MissionName; // 0x0(0x10)
	EMissionStatus MissionStatus; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	int32_t CurProgress; // 0x14(0x4)
	int32_t InitialProgress; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct UAGame.ActivityTemplateMissionTableRow
// Size: 0x38 (Inherited: 0x8)
struct FActivityTemplateMissionTableRow : FTableRowBase
{
	int32_t TargetTypeID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TSoftObjectPtr<UMFMissionFlow> MissionFlowAsset; // 0x10(0x28)
};

// Object: ScriptStruct UAGame.MissionFlowPlayers
// Size: 0x10 (Inherited: 0x0)
struct FMissionFlowPlayers
{
	struct TArray<struct TWeakObjectPtr<struct APlayerController>> PlayerList; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.MissionTraceableParam
// Size: 0x4 (Inherited: 0x0)
struct FMissionTraceableParam
{
	int32_t ConfigID; // 0x0(0x4)
};

// Object: ScriptStruct UAGame.MissionConditionTimeOfDay
// Size: 0xC (Inherited: 0x0)
struct FMissionConditionTimeOfDay
{
	int32_t Hour; // 0x0(0x4)
	int32_t Minute; // 0x4(0x4)
	int32_t Second; // 0x8(0x4)
};

// Object: ScriptStruct UAGame.MissionActionVolumeMarkableInfo
// Size: 0x60 (Inherited: 0x0)
struct FMissionActionVolumeMarkableInfo
{
	bool bShowTraceableActor; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct TArray<int32_t> SpawnedInventories; // 0x8(0x10)
	struct FMFGlobalEventParameterTag VolumeTag; // 0x18(0x8)
	int32_t VolumeID; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct FMFMissionVariableRead_Int NewVolumeID; // 0x28(0x30)
	int32_t ConfigID; // 0x58(0x4)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
};

// Object: ScriptStruct UAGame.MissionActionInventoryMarkableInfo
// Size: 0x58 (Inherited: 0x0)
struct FMissionActionInventoryMarkableInfo
{
	bool bShowTraceableActor; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct FMissionActorReference SpawnVolumeActor; // 0x8(0x18)
	struct FMFGlobalEventParameterTag SpawnVolumeTag; // 0x20(0x8)
	struct FMissionActorReference InVolumeInventoryContainer; // 0x28(0x18)
	bool bNotCharacterOwner; // 0x40(0x1)
	ESGInventoryOwnerMarkableType InvOwnerMarkableType; // 0x41(0x1)
	uint8_t Pad_0x42[0x2]; // 0x42(0x2)
	struct FMFGlobalEventParameterTag InventoryTag; // 0x44(0x8)
	int32_t itemID; // 0x4C(0x4)
	ESGInventoryType InventoryType; // 0x50(0x1)
	ESGInventoryContainerLootStatus LootStatus; // 0x51(0x1)
	bool bIgnoreFultonRecoveryTakeOut; // 0x52(0x1)
	bool bEnableHideInventoryMarkCheck; // 0x53(0x1)
	int32_t ConfigID; // 0x54(0x4)
};

// Object: ScriptStruct UAGame.MissionActionCharacterMarkableInfo
// Size: 0x78 (Inherited: 0x0)
struct FMissionActionCharacterMarkableInfo
{
	bool bShowTraceableActor; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct FMFMissionSelectParameter TraceTarget; // 0x8(0x38)
	struct TArray<EMissionRelatedTargetType> TraceTargetTypes; // 0x40(0x10)
	struct TArray<EFactionType> TraceFactionTypes; // 0x50(0x10)
	struct TArray<ECharacterJobType> TraceJobTypes; // 0x60(0x10)
	float SearchDistance; // 0x70(0x4)
	int32_t ConfigID; // 0x74(0x4)
};

// Object: ScriptStruct UAGame.MissionActionAICharacterMarkableInfo
// Size: 0x78 (Inherited: 0x0)
struct FMissionActionAICharacterMarkableInfo
{
	bool bShowTraceableActor; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct FMFMissionSelectParameter SelectParameter; // 0x8(0x38)
	struct FString TagName; // 0x40(0x10)
	int64_t AIID; // 0x50(0x8)
	ESpawnReason SpawnReason; // 0x58(0x1)
	uint8_t Pad_0x59[0x7]; // 0x59(0x7)
	struct FString SpawnArea; // 0x60(0x10)
	int32_t ConfigID; // 0x70(0x4)
	uint8_t Pad_0x74[0x4]; // 0x74(0x4)
};

// Object: ScriptStruct UAGame.MissionActionActorMarkableInfo
// Size: 0x60 (Inherited: 0x0)
struct FMissionActionActorMarkableInfo
{
	bool bShowTraceableActor; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct FMFGlobalEventParameterTag ActorTag; // 0x4(0x8)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct FMissionActorReference ActorRef; // 0x10(0x18)
	struct FMFMissionVariableRead_Object ActorVar; // 0x28(0x30)
	int32_t ConfigID; // 0x58(0x4)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
};

// Object: ScriptStruct UAGame.MissionActionRandomEscapePoint
// Size: 0x80 (Inherited: 0x0)
struct FMissionActionRandomEscapePoint
{
	int32_t EscapePointID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FMFMissionVariableRead_Int NewEscapePointID; // 0x8(0x30)
	struct FMFMissionVariableRead_ActorReference EscapeVolume; // 0x38(0x40)
	int32_t Weight; // 0x78(0x4)
	uint8_t Pad_0x7C[0x4]; // 0x7C(0x4)
};

// Object: ScriptStruct UAGame.MissionActionRelevantToAI
// Size: 0x18 (Inherited: 0x0)
struct FMissionActionRelevantToAI
{
	struct TArray<int32_t> AIIDs; // 0x0(0x10)
	int32_t ConfigID; // 0x10(0x4)
	int32_t FailedAINum; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.MissionActionRelevantToInventory
// Size: 0x18 (Inherited: 0x0)
struct FMissionActionRelevantToInventory
{
	struct TArray<int32_t> InventoryItemIDs; // 0x0(0x10)
	int32_t ConfigID; // 0x10(0x4)
	int32_t FailedInventoryNum; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.MissionActionRelevantToVolume
// Size: 0x18 (Inherited: 0x0)
struct FMissionActionRelevantToVolume
{
	struct TArray<int32_t> VolumeItemIDs; // 0x0(0x10)
	int32_t ConfigID; // 0x10(0x4)
	int32_t FailedInteractNum; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.MissionActionRelevantToInteract
// Size: 0x18 (Inherited: 0x0)
struct FMissionActionRelevantToInteract
{
	struct TArray<int32_t> InteractItemIDs; // 0x0(0x10)
	int32_t ConfigID; // 0x10(0x4)
	int32_t FailedInteractNum; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.MissionActionGiveItemInfo
// Size: 0x18 (Inherited: 0x0)
struct FMissionActionGiveItemInfo
{
	int32_t itemID; // 0x0(0x4)
	int32_t MinStackCount; // 0x4(0x4)
	int32_t MaxStackCount; // 0x8(0x4)
	EAttachPosition Pos; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	struct ASGInventory* InventoryClass; // 0x10(0x8)
};

// Object: ScriptStruct UAGame.RandomMissionTableRow
// Size: 0x18 (Inherited: 0x8)
struct FRandomMissionTableRow : FTableRowBase
{
	int32_t TaskId; // 0x8(0x4)
	int32_t Weight; // 0xC(0x4)
	int32_t MinLevel; // 0x10(0x4)
	int32_t MaxLevel; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.MissionObjectiveGiveItemInfo
// Size: 0x18 (Inherited: 0x0)
struct FMissionObjectiveGiveItemInfo
{
	int32_t itemID; // 0x0(0x4)
	int32_t MinStackCount; // 0x4(0x4)
	int32_t MaxStackCount; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct ASGInventory* InventoryClass; // 0x10(0x8)
};

// Object: ScriptStruct UAGame.MissionObjectiveAddInventoryToSearchContainerInfo
// Size: 0x4 (Inherited: 0x0)
struct FMissionObjectiveAddInventoryToSearchContainerInfo
{
	int32_t itemID; // 0x0(0x4)
};

// Object: ScriptStruct UAGame.AddInventoryToLootContainer_RandomPool
// Size: 0x10 (Inherited: 0x0)
struct FAddInventoryToLootContainer_RandomPool
{
	struct TArray<struct FRandomPoolItem> RandomPoolItemList; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.MissionObjectiveAddInventoryToLootContainerInfo
// Size: 0x18 (Inherited: 0x0)
struct FMissionObjectiveAddInventoryToLootContainerInfo
{
	int32_t Weight; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FAddInventoryToLootContainer_RandomPool RandomPool; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.RandomPoolItem
// Size: 0x8 (Inherited: 0x0)
struct FRandomPoolItem
{
	int32_t Weight; // 0x0(0x4)
	int32_t itemID; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.MissionObjectiveSceneEventInfo
// Size: 0xA0 (Inherited: 0x0)
struct FMissionObjectiveSceneEventInfo
{
	struct TSoftClassPtr<struct UAISceneEventMessage*> SceneEventClassPtr; // 0x0(0x28)
	float ValidTime; // 0x28(0x4)
	float ValidScope; // 0x2C(0x4)
	struct FVector Location; // 0x30(0xC)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
	struct TArray<struct FMFGlobalEventParameterTag> EventParameterTags; // 0x40(0x10)
	float CoverRange; // 0x50(0x4)
	int32_t Weight; // 0x54(0x4)
	struct TArray<struct FString> Tags; // 0x58(0x10)
	struct FMFMissionVariableRead_StringArray TagArray; // 0x68(0x38)
};

// Object: ScriptStruct UAGame.MissionObjectiveSpawnParticleInfo
// Size: 0x28 (Inherited: 0x0)
struct FMissionObjectiveSpawnParticleInfo
{
	struct FMissionActorReference SpawnPointActor; // 0x0(0x18)
	struct UParticleSystem* Effect; // 0x18(0x8)
	int32_t Weight; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
};

// Object: ScriptStruct UAGame.MissionObjectiveSpawnActorInfo
// Size: 0x38 (Inherited: 0x0)
struct FMissionObjectiveSpawnActorInfo
{
	struct FMissionActorReference SpawnPointActor; // 0x0(0x18)
	struct UStaticMesh* StaticMesh; // 0x18(0x8)
	int32_t Weight; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct TArray<EMissionRelatedTargetType> RelatedTargetTypes; // 0x28(0x10)
};

// Object: ScriptStruct UAGame.MissionObjectiveSpawnPickupInfo
// Size: 0x38 (Inherited: 0x0)
struct FMissionObjectiveSpawnPickupInfo
{
	struct FMissionActorReference SpawnPointActor; // 0x0(0x18)
	struct ASGPickup* PickupClass; // 0x18(0x8)
	int32_t Weight; // 0x20(0x4)
	int32_t ConfigID; // 0x24(0x4)
	struct TArray<EMissionRelatedTargetType> RelatedTargetTypes; // 0x28(0x10)
};

// Object: ScriptStruct UAGame.MissionObjectiveSpawnInteractItemInfo
// Size: 0x38 (Inherited: 0x0)
struct FMissionObjectiveSpawnInteractItemInfo
{
	struct FMissionActorReference SpawnPointActor; // 0x0(0x18)
	struct ASGNetRelevantConfigurableActor* InteractItemClass; // 0x18(0x8)
	int32_t Weight; // 0x20(0x4)
	int32_t ConfigID; // 0x24(0x4)
	struct TArray<EMissionRelatedTargetType> RelatedTargetTypes; // 0x28(0x10)
};

// Object: ScriptStruct UAGame.MissionObjectiveSpawnInventoryInfo
// Size: 0xA8 (Inherited: 0x0)
struct FMissionObjectiveSpawnInventoryInfo
{
	struct FMissionActorReference SpawnPointActor; // 0x0(0x18)
	struct FMFMissionVariableRead_Object VariableRead_SpawnPointActor; // 0x18(0x30)
	struct FMissionActorReference SpawnVolumeActor; // 0x48(0x18)
	struct ASGInventory* ContainerClass; // 0x60(0x8)
	struct TArray<int64_t> itemIds; // 0x68(0x10)
	int32_t Weight; // 0x78(0x4)
	int32_t ConfigID; // 0x7C(0x4)
	int32_t LootPointType; // 0x80(0x4)
	uint8_t Pad_0x84[0x4]; // 0x84(0x4)
	struct TArray<EMissionRelatedTargetType> RelatedTargetTypes; // 0x88(0x10)
	struct TArray<EFactionType> FactionTypes; // 0x98(0x10)
};

// Object: ScriptStruct UAGame.MissionObjectiveSpawnAIPlanConfig
// Size: 0x70 (Inherited: 0x0)
struct FMissionObjectiveSpawnAIPlanConfig
{
	struct FString PlanName; // 0x0(0x10)
	struct FVector SpawnPosition; // 0x10(0xC)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	struct FMissionActorReference SpawnPosActorRef; // 0x20(0x18)
	struct FMFMissionVariableRead_Object SpawnPosActorVar; // 0x38(0x30)
	float SpawnCheckRange; // 0x68(0x4)
	bool bEnableSpawnDeathBox; // 0x6C(0x1)
	uint8_t Pad_0x6D[0x3]; // 0x6D(0x3)
};

// Object: ScriptStruct UAGame.MissionObjectiveSpawnAIEventConfig
// Size: 0x18 (Inherited: 0x0)
struct FMissionObjectiveSpawnAIEventConfig
{
	int32_t SpawnNum; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FMissionObjectiveSpawnAIEventParams> EventParams; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.MissionObjectiveSpawnAIEventParams
// Size: 0x50 (Inherited: 0x0)
struct FMissionObjectiveSpawnAIEventParams
{
	struct TArray<struct FString> EventStrList; // 0x0(0x10)
	struct FMFMissionVariableRead_StringArray EventStrArray; // 0x10(0x38)
	int32_t Weight; // 0x48(0x4)
	uint8_t Pad_0x4C[0x4]; // 0x4C(0x4)
};

// Object: ScriptStruct UAGame.MissionObjectiveInteractTargets
// Size: 0x10 (Inherited: 0x0)
struct FMissionObjectiveInteractTargets
{
	struct TArray<struct AActor*> InteractTargets; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.MissionObjectiveCollectedItems
// Size: 0x10 (Inherited: 0x0)
struct FMissionObjectiveCollectedItems
{
	struct TArray<struct ASGInventory*> Inventories; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.MissionObjectiveEffectMissionFlowInfo
// Size: 0x18 (Inherited: 0x0)
struct FMissionObjectiveEffectMissionFlowInfo
{
	int32_t MissionFlowID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<int32_t> MissionIDs; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.MissionRelatedPlayers
// Size: 0x50 (Inherited: 0x0)
struct FMissionRelatedPlayers
{
	struct TArray<struct APlayerState*> PlayerStates; // 0x0(0x10)
	struct TArray<struct ASGTeamInfo*> TeamInfos; // 0x10(0x10)
	struct TArray<EPlayerTeamType> PlayerTeamTypes; // 0x20(0x10)
	struct TArray<EFactionType> FactionTypes; // 0x30(0x10)
	struct TArray<ECharacterJobType> JobTypes; // 0x40(0x10)
};

// Object: ScriptStruct UAGame.MissionRelatedTargets
// Size: 0x60 (Inherited: 0x0)
struct FMissionRelatedTargets
{
	struct TArray<struct ACharacter*> Characters; // 0x0(0x10)
	struct TArray<struct APlayerState*> PlayerStates; // 0x10(0x10)
	struct TArray<struct ASGTeamInfo*> TeamInfos; // 0x20(0x10)
	struct TArray<EPlayerTeamType> PlayerTeamTypes; // 0x30(0x10)
	struct TArray<EFactionType> FactionTypes; // 0x40(0x10)
	struct TArray<ECharacterJobType> JobTypes; // 0x50(0x10)
};

// Object: ScriptStruct UAGame.MissionFlowClassTableRow
// Size: 0x38 (Inherited: 0x8)
struct FMissionFlowClassTableRow : FTableRowBase
{
	int32_t MissionFlowID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TSoftObjectPtr<UMFMissionFlow> MissionFlowAsset; // 0x10(0x28)
};

// Object: ScriptStruct UAGame.MissionFlowCreateData
// Size: 0x28 (Inherited: 0x0)
struct FMissionFlowCreateData
{
	int32_t MissionFlowID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FMissionCreateData> MissionList; // 0x8(0x10)
	bool bActTask; // 0x18(0x1)
	bool bShowInGame; // 0x19(0x1)
	uint8_t Pad_0x1A[0xE]; // 0x1A(0xE)
};

// Object: ScriptStruct UAGame.MissionCreateData
// Size: 0x20 (Inherited: 0x0)
struct FMissionCreateData
{
	int32_t MissionID; // 0x0(0x4)
	int32_t CurProgress; // 0x4(0x4)
	int32_t MaxProgress; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TArray<int32_t> ActivityTemplateParams; // 0x10(0x10)
};

// Object: ScriptStruct UAGame.ParticlePlayRow
// Size: 0x10 (Inherited: 0x0)
struct FParticlePlayRow
{
	struct UParticleSystem* Asset; // 0x0(0x8)
	float playtime; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.EntryPlaceInfo
// Size: 0xB8 (Inherited: 0x8)
struct FEntryPlaceInfo : FTableRowBase
{
	bool ShowDebug; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
	struct TArray<struct FEntryInfo> InRoomGroup; // 0x10(0x10)
	struct TArray<struct FEntryInfo> OutDoorGroup; // 0x20(0x10)
	struct TMap<struct TSoftClassPtr<struct AActor*>, int32_t> MeshLayoutGroup; // 0x30(0x50)
	float EdgeMaxDistance; // 0x80(0x4)
	float EntryDistance_Min; // 0x84(0x4)
	float EntryDistance_Max; // 0x88(0x4)
	float GroupDistance; // 0x8C(0x4)
	float ZOffest; // 0x90(0x4)
	uint8_t Pad_0x94[0x4]; // 0x94(0x4)
	struct FString ScanFirstName; // 0x98(0x10)
	struct TArray<struct FString> ScanSubNames; // 0xA8(0x10)
};

// Object: ScriptStruct UAGame.EntryInfo
// Size: 0x58 (Inherited: 0x8)
struct FEntryInfo : FTableRowBase
{
	struct TMap<struct TSoftClassPtr<struct AActor*>, int32_t> entry; // 0x8(0x50)
};

// Object: ScriptStruct UAGame.ObjPoolClassWeight
// Size: 0x30 (Inherited: 0x0)
struct FObjPoolClassWeight
{
	struct TSoftClassPtr<struct ASGInventory*> Class; // 0x0(0x28)
	int32_t Weight; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct UAGame.UAObjPoolExpectationMem
// Size: 0x8 (Inherited: 0x0)
struct FUAObjPoolExpectationMem
{
	int32_t Priority; // 0x0(0x4)
	float ExpectationMem; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.CombinePickupData
// Size: 0x40 (Inherited: 0x0)
struct FCombinePickupData
{
	struct TSoftClassPtr<struct AUAPickup*> PickupClass; // 0x0(0x28)
	struct FVector LocationOffset; // 0x28(0xC)
	struct FRotator RotatorOffset; // 0x34(0xC)
};

// Object: ScriptStruct UAGame.NewMapSubWidgetAdaptionScope
// Size: 0x8 (Inherited: 0x0)
struct FNewMapSubWidgetAdaptionScope
{
	float MinScale; // 0x0(0x4)
	float MaxScale; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.NiagaraSwitherRow
// Size: 0x10 (Inherited: 0x0)
struct FNiagaraSwitherRow
{
	struct UNiagaraSystem* Asset; // 0x0(0x8)
	float playtime; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.UARocketLaunchConfig
// Size: 0x80 (Inherited: 0x0)
struct FUARocketLaunchConfig
{
	struct TSet<int32_t> LaunchSchedule; // 0x0(0x50)
	float ExplosionProbability; // 0x50(0x4)
	int32_t MinExplosionNum; // 0x54(0x4)
	struct FName ParadropConfigRowName; // 0x58(0x8)
	struct FName ParadropWaveRowName; // 0x60(0x8)
	int32_t ParadropTriggerNum; // 0x68(0x4)
	bool bEnableTrajectoryOptimization; // 0x6C(0x1)
	uint8_t Pad_0x6D[0x3]; // 0x6D(0x3)
	float WreckageFlightEndPointHeightOffset; // 0x70(0x4)
	struct FVector2D TrajectoryOptimizationParameter; // 0x74(0x8)
	uint8_t Pad_0x7C[0x4]; // 0x7C(0x4)
};

// Object: ScriptStruct UAGame.UARocketLaunchModeIdentity
// Size: 0x30 (Inherited: 0x20)
struct FUARocketLaunchModeIdentity : FModeTableRowBase
{
	struct TArray<int32_t> ActIDs; // 0x20(0x10)
};

// Object: ScriptStruct UAGame.UAParadropVolumeInfo
// Size: 0x10 (Inherited: 0x0)
struct FUAParadropVolumeInfo
{
	struct TArray<int32_t> AvailablePointIDs; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.UAParadropWave
// Size: 0x48 (Inherited: 0x0)
struct FUAParadropWave
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
	struct TArray<struct FUAParadropFlight> Flights; // 0x10(0x10)
	uint8_t Pad_0x20[0x8]; // 0x20(0x8)
	struct APawn* ParadropInstigator; // 0x28(0x8)
	uint8_t Pad_0x30[0x18]; // 0x30(0x18)
};

// Object: ScriptStruct UAGame.UAMultiKeyPoints
// Size: 0x48 (Inherited: 0x0)
struct FUAMultiKeyPoints
{
	struct TArray<struct FVector> PointArray; // 0x0(0x10)
	struct TArray<float> ArriveTime; // 0x10(0x10)
	struct TArray<float> DelayFallingTime; // 0x20(0x10)
	struct TArray<bool> ForceSpecial; // 0x30(0x10)
	float MinArrivedTime; // 0x40(0x4)
	int32_t AirlineAngle; // 0x44(0x4)
};

// Object: ScriptStruct UAGame.UAParadropFlight
// Size: 0xC8 (Inherited: 0x0)
struct FUAParadropFlight
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct TArray<struct AActor*> ParadropPoints; // 0x8(0x10)
	uint8_t Pad_0x18[0x8]; // 0x18(0x8)
	struct TArray<struct FVector> OverWriteKeyPoints; // 0x20(0x10)
	struct TMap<int32_t, struct FUAMultiKeyPoints> MultiKeyPointsMap; // 0x30(0x50)
	uint8_t Pad_0x80[0x8]; // 0x80(0x8)
	struct TArray<struct FVector> CustomSpawnKeyPoints; // 0x88(0x10)
	uint8_t Pad_0x98[0x30]; // 0x98(0x30)
};

// Object: ScriptStruct UAGame.UAParadropGroup
// Size: 0x10 (Inherited: 0x0)
struct FUAParadropGroup
{
	struct TArray<struct AActor*> ParadropPointArray; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.UAParadropSupplyInfo
// Size: 0x10 (Inherited: 0x0)
struct FUAParadropSupplyInfo
{
	struct AActor* LootContainer; // 0x0(0x8)
	struct FName SocketName; // 0x8(0x8)
};

// Object: ScriptStruct UAGame.ParticalSwitherRow
// Size: 0x10 (Inherited: 0x0)
struct FParticalSwitherRow
{
	struct ASGShowControlEffectActor* EffectActor; // 0x0(0x8)
	float playtime; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.UANLPMentorConfigTableRow
// Size: 0x30 (Inherited: 0x8)
struct FUANLPMentorConfigTableRow : FTableRowBase
{
	struct FName ConfigName; // 0x8(0x8)
	float FireFailRequestCoolDown; // 0x10(0x4)
	float FillFailRequestCoolDown; // 0x14(0x4)
	float TakeDamageRequestCoolDown; // 0x18(0x4)
	float TimerRequestCoolDown; // 0x1C(0x4)
	int32_t BroadcastAnnounceID; // 0x20(0x4)
	bool bEnableCombatBlock; // 0x24(0x1)
	uint8_t Pad_0x25[0x3]; // 0x25(0x3)
	float CombatStateDuration; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct UAGame.QuestReplicateData
// Size: 0x28 (Inherited: 0x0)
struct FQuestReplicateData
{
	struct AController* Controller; // 0x0(0x8)
	int32_t GraphID; // 0x8(0x4)
	EQuestStatus GraphState; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	struct TArray<struct AMFQuestBase*> QuestActors; // 0x10(0x10)
	bool IsSeasonTask; // 0x20(0x1)
	bool QuestBeforeState; // 0x21(0x1)
	EQuestStatus OldGraphState; // 0x22(0x1)
	uint8_t Pad_0x23[0x1]; // 0x23(0x1)
	float GraphStateChangeTime; // 0x24(0x4)
};

// Object: ScriptStruct UAGame.LastRoundArmorInfo
// Size: 0xC (Inherited: 0x0)
struct FLastRoundArmorInfo
{
	int32_t itemID; // 0x0(0x4)
	float Durability; // 0x4(0x4)
	float MaxDurability; // 0x8(0x4)
};

// Object: ScriptStruct UAGame.LastRoundItems
// Size: 0x40 (Inherited: 0x0)
struct FLastRoundItems
{
	int32_t PrimaryItemId; // 0x0(0x4)
	int32_t SecondaryItemId; // 0x4(0x4)
	int32_t PistolItemId; // 0x8(0x4)
	int32_t FaceCoverItemId; // 0xC(0x4)
	int32_t ThighArmorItemId; // 0x10(0x4)
	struct FLastRoundArmorInfo HelmetInfo; // 0x14(0xC)
	struct FLastRoundArmorInfo VestInfo; // 0x20(0xC)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
	struct TArray<struct FLastRoundPropInfo> PropInfoArray; // 0x30(0x10)
};

// Object: ScriptStruct UAGame.LastRoundPropInfo
// Size: 0x8 (Inherited: 0x0)
struct FLastRoundPropInfo
{
	int32_t itemID; // 0x0(0x4)
	int32_t Num; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.UARebornConfigRow
// Size: 0x10 (Inherited: 0x0)
struct FUARebornConfigRow
{
	int32_t RebornID; // 0x0(0x4)
	int32_t Priority; // 0x4(0x4)
	struct UUARebornDataAsset* RebornDataAsset; // 0x8(0x8)
};

// Object: ScriptStruct UAGame.PCRoundHeroInfo
// Size: 0x8 (Inherited: 0x0)
struct FPCRoundHeroInfo
{
	int32_t AttackerHeroID; // 0x0(0x4)
	int32_t DefenderHeroID; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.RoundStateInfo
// Size: 0xC (Inherited: 0x0)
struct FRoundStateInfo
{
	EUAPlayerRoundState CurrState; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t CurrRound; // 0x4(0x4)
	EUAPlayerRoundReulst LastRoundReulst; // 0x8(0x1)
	bool bSwitchSides; // 0x9(0x1)
	uint8_t Pad_0xA[0x2]; // 0xA(0x2)
};

// Object: ScriptStruct UAGame.PhotoInteractInfo
// Size: 0x10 (Inherited: 0x0)
struct FPhotoInteractInfo
{
	int64_t InteracteRuleID; // 0x0(0x8)
	int32_t InteractCount; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.UAAmmoSpawnRow
// Size: 0x10 (Inherited: 0x8)
struct FUAAmmoSpawnRow : FTableRowBase
{
	int32_t MinCount; // 0x8(0x4)
	int32_t MaxCount; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.TeamTraceGroupInfo
// Size: 0x10 (Inherited: 0x0)
struct FTeamTraceGroupInfo
{
	struct TArray<struct ASGTeamInfo*> UnKnowTeamInfoList; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.GuaranteedActInfo
// Size: 0x18 (Inherited: 0x0)
struct FGuaranteedActInfo
{
	int32_t ACtID; // 0x0(0x4)
	int32_t BoxId; // 0x4(0x4)
	int32_t Rate; // 0x8(0x4)
	int32_t RateInc; // 0xC(0x4)
	int32_t PrizeCount; // 0x10(0x4)
	int32_t PrizeLimit; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.CollectKillInfo
// Size: 0x20 (Inherited: 0x0)
struct FCollectKillInfo
{
	float KillTime; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FString KilledGID; // 0x8(0x10)
	bool bKilledIsAI; // 0x18(0x1)
	uint8_t Pad_0x19[0x7]; // 0x19(0x7)
};

// Object: ScriptStruct UAGame.CollectTakeRealDamageInfo
// Size: 0x14 (Inherited: 0x0)
struct FCollectTakeRealDamageInfo
{
	float DamageTime; // 0x0(0x4)
	float DamageAmount; // 0x4(0x4)
	float DamageReal; // 0x8(0x4)
	ESGDamageCauserType DamageCauserType; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	int32_t BodyPart; // 0x10(0x4)
};

// Object: ScriptStruct UAGame.CollectGameAbilityInfo
// Size: 0x18 (Inherited: 0x0)
struct FCollectGameAbilityInfo
{
	float AbilityTime; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FString AbilityName; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.CollectAreaInfo
// Size: 0x18 (Inherited: 0x0)
struct FCollectAreaInfo
{
	int32_t AreaID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FString AreaName; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.CollectEnvInfo
// Size: 0x30 (Inherited: 0x0)
struct FCollectEnvInfo
{
	uint32_t RankedLevel; // 0x0(0x4)
	uint32_t Ranking; // 0x4(0x4)
	struct FCollectAreaInfo AreaInfo; // 0x8(0x18)
	struct TArray<struct FCollectEscapePointInfo> EscapePointInfoList; // 0x20(0x10)
};

// Object: ScriptStruct UAGame.CollectEscapePointInfo
// Size: 0x58 (Inherited: 0x0)
struct FCollectEscapePointInfo
{
	int32_t EscapePointID; // 0x0(0x4)
	struct FVector EscapePointLocation; // 0x4(0xC)
	float EscapePointDistance; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct FString EscapePointName; // 0x18(0x10)
	struct FString ConditionText; // 0x28(0x10)
	struct FString ConditionPassText; // 0x38(0x10)
	struct FString ConditionState; // 0x48(0x10)
};

// Object: ScriptStruct UAGame.CollectMovementInfo
// Size: 0x30 (Inherited: 0x0)
struct FCollectMovementInfo
{
	struct FVector Location; // 0x0(0xC)
	struct FRotator Rotation; // 0xC(0xC)
	struct FVector Velocity; // 0x18(0xC)
	bool bIsSprinting; // 0x24(0x1)
	bool bIsSilentWalking; // 0x25(0x1)
	uint8_t Pad_0x26[0x2]; // 0x26(0x2)
	int32_t Pose; // 0x28(0x4)
	EWeaponLeanAimType LeanAimType; // 0x2C(0x1)
	uint8_t Pad_0x2D[0x3]; // 0x2D(0x3)
};

// Object: ScriptStruct UAGame.CollectWeaponInfo
// Size: 0x28 (Inherited: 0x0)
struct FCollectWeaponInfo
{
	int32_t Type; // 0x0(0x4)
	int32_t FireDistanceMax; // 0x4(0x4)
	int32_t CurrentMagAmmo; // 0x8(0x4)
	int32_t CurrentBoreAmmo; // 0xC(0x4)
	int32_t CurrentAmmo; // 0x10(0x4)
	bool bIsShooting; // 0x14(0x1)
	bool bIsZooming; // 0x15(0x1)
	uint8_t Pad_0x16[0x2]; // 0x16(0x2)
	int32_t MagMaxCapacity; // 0x18(0x4)
	bool bIsCollapsed; // 0x1C(0x1)
	uint8_t Pad_0x1D[0x3]; // 0x1D(0x3)
	uint64_t GunId; // 0x20(0x8)
};

// Object: ScriptStruct UAGame.CollectBodyInfo
// Size: 0x14 (Inherited: 0x0)
struct FCollectBodyInfo
{
	int32_t UpperLimbStamina; // 0x0(0x4)
	int32_t LowerLimbStamina; // 0x4(0x4)
	int32_t energy; // 0x8(0x4)
	int32_t Hydration; // 0xC(0x4)
	int32_t Load; // 0x10(0x4)
};

// Object: ScriptStruct UAGame.CollectHealthInfo
// Size: 0x24 (Inherited: 0x0)
struct FCollectHealthInfo
{
	int32_t AllHealth; // 0x0(0x4)
	int32_t HeadHealth; // 0x4(0x4)
	int32_t ChestHealth; // 0x8(0x4)
	int32_t StomachHealth; // 0xC(0x4)
	int32_t LeftArmHealth; // 0x10(0x4)
	int32_t RightArmHealth; // 0x14(0x4)
	int32_t LeftLegHealth; // 0x18(0x4)
	int32_t RightLegHealth; // 0x1C(0x4)
	bool bIsDBNO; // 0x20(0x1)
	uint8_t Pad_0x21[0x3]; // 0x21(0x3)
};

// Object: ScriptStruct UAGame.CollectItemInfo
// Size: 0x60 (Inherited: 0x0)
struct FCollectItemInfo
{
	struct FString itemID; // 0x0(0x10)
	struct FString ItemUid; // 0x10(0x10)
	uint32_t ItemType; // 0x20(0x4)
	uint32_t ItemPos; // 0x24(0x4)
	uint32_t ItemNum; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
	struct FString ParentID; // 0x30(0x10)
	struct FString AncestorId; // 0x40(0x10)
	float Durability; // 0x50(0x4)
	int32_t rarity; // 0x54(0x4)
	int64_t StandardPrice; // 0x58(0x8)
};

// Object: ScriptStruct UAGame.RleCompressedBitMap
// Size: 0x18 (Inherited: 0x0)
struct FRleCompressedBitMap
{
	int32_t DeadZoneTexturesWidth; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<uint32_t> RleCompressedBitMapData; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.DetectNearbyEnemiesService
// Size: 0x50 (Inherited: 0x48)
struct FDetectNearbyEnemiesService : FSGPurchasableService
{
	float DetectRadius; // 0x48(0x4)
	uint8_t Pad_0x4C[0x4]; // 0x4C(0x4)
};

// Object: ScriptStruct UAGame.DetectSafeContainerLootStatusService
// Size: 0x60 (Inherited: 0x48)
struct FDetectSafeContainerLootStatusService : FSGPurchasableService
{
	float DetectRadius; // 0x48(0x4)
	uint8_t Pad_0x4C[0x4]; // 0x4C(0x4)
	struct TArray<int32_t> AllowedLootPointTypesFilter; // 0x50(0x10)
};

// Object: ScriptStruct UAGame.PVETraceVolumeBindConf
// Size: 0x28 (Inherited: 0x0)
struct FPVETraceVolumeBindConf
{
	int32_t VolumeID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FMissionActorReference TraceActorRef; // 0x8(0x18)
	int32_t MinCheckPointIndex; // 0x20(0x4)
	int32_t MaxCheckPointIndex; // 0x24(0x4)
};

// Object: ScriptStruct UAGame.PVECoachSpawnPointEdit
// Size: 0x48 (Inherited: 0x0)
struct FPVECoachSpawnPointEdit
{
	int32_t CoachID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FString CoachName; // 0x8(0x10)
	int32_t EquipPoolID; // 0x18(0x4)
	bool IsAIPlayerTeammate; // 0x1C(0x1)
	uint8_t Pad_0x1D[0x3]; // 0x1D(0x3)
	struct TSoftObjectPtr<ASGAISpawnPoint> SpawnPoint; // 0x20(0x28)
};

// Object: ScriptStruct UAGame.PVEDirectorRebornAISetting
// Size: 0x10 (Inherited: 0x0)
struct FPVEDirectorRebornAISetting
{
	int32_t GroupID; // 0x0(0x4)
	int32_t EquipPoolID; // 0x4(0x4)
	int32_t CampID; // 0x8(0x4)
	int32_t MaxNum; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.PVECheckPointPreSpawn
// Size: 0x8 (Inherited: 0x0)
struct FPVECheckPointPreSpawn
{
	int32_t DeveiceLevel; // 0x0(0x4)
	int32_t PreSpawnCPNums; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.PVEAISpawnPending
// Size: 0x98 (Inherited: 0x0)
struct FPVEAISpawnPending
{
	uint8_t Pad_0x0[0x38]; // 0x0(0x38)
	struct TSoftClassPtr<struct ACharacter*> AICharacterClass; // 0x38(0x28)
	struct TSoftClassPtr<struct AAIController*> AIControllerClass; // 0x60(0x28)
	struct TArray<struct TSoftClassPtr<struct ASGInventory*>> InventoryClass; // 0x88(0x10)
};

// Object: ScriptStruct UAGame.PVEEachCharacterNeedsInfo
// Size: 0x78 (Inherited: 0x0)
struct FPVEEachCharacterNeedsInfo
{
	struct FString KeyName; // 0x0(0x10)
	struct TSoftClassPtr<struct ACharacter*> AICharacterClass; // 0x10(0x28)
	struct TSoftClassPtr<struct AAIController*> AIControllerClass; // 0x38(0x28)
	struct TArray<struct FPVECheckPointInvNeeds> InventoryList; // 0x60(0x10)
	int32_t AINum; // 0x70(0x4)
	uint8_t Pad_0x74[0x4]; // 0x74(0x4)
};

// Object: ScriptStruct UAGame.PVECoachNeedsInfo
// Size: 0x80 (Inherited: 0x0)
struct FPVECoachNeedsInfo
{
	int32_t FormCheckPoint; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FPVEEachCharacterNeedsInfo CharacterNeedsInfo; // 0x8(0x78)
};

// Object: ScriptStruct UAGame.PVECheckPointInvNeeds
// Size: 0x30 (Inherited: 0x0)
struct FPVECheckPointInvNeeds
{
	struct TSoftClassPtr<struct ASGInventory*> InventoryClass; // 0x0(0x28)
	int32_t InvNum; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct UAGame.PVECheckPointNeedsInfo
// Size: 0x20 (Inherited: 0x0)
struct FPVECheckPointNeedsInfo
{
	struct TArray<int32_t> DirectorNeedsList; // 0x0(0x10)
	struct TArray<int32_t> DirectorPreLoadList; // 0x10(0x10)
};

// Object: ScriptStruct UAGame.PVECheckPointDirectorNeedsInfo
// Size: 0x18 (Inherited: 0x0)
struct FPVECheckPointDirectorNeedsInfo
{
	int32_t DirectorID; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<struct FPVEEachCharacterNeedsInfo> CharacterNeedsList; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.UARadarParamTableRow
// Size: 0x10 (Inherited: 0x8)
struct FUARadarParamTableRow : FTableRowBase
{
	int32_t NumberOfSegments; // 0x8(0x4)
	float DetectRadius; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.UARebornEquipment
// Size: 0x50 (Inherited: 0x0)
struct FUARebornEquipment
{
	struct TMap<int32_t, int32_t> IDAndPrice; // 0x0(0x50)
};

// Object: ScriptStruct UAGame.UARebornConfig
// Size: 0x38 (Inherited: 0x8)
struct FUARebornConfig : FTableRowBase
{
	int32_t RebornID; // 0x8(0x4)
	int32_t Priority; // 0xC(0x4)
	struct TSoftObjectPtr<UUARebornDataAsset> RebornDataAsset; // 0x10(0x28)
};

// Object: ScriptStruct UAGame.BPClassMappingPolicy
// Size: 0x30 (Inherited: 0x0)
struct FBPClassMappingPolicy
{
	struct TSoftClassPtr<struct AActor*> ClassPath; // 0x0(0x28)
	uint32_t EnumValueMappingPolicy; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct UAGame.RelevantFollowActorList
// Size: 0x10 (Inherited: 0x0)
struct FRelevantFollowActorList
{
	struct TArray<struct AActor*> ActorList; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.SGRepGraphActorList
// Size: 0x10 (Inherited: 0x0)
struct FSGRepGraphActorList
{
	struct TArray<struct AActor*> Nest; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.SGRepGraphListWithStreamingLevel
// Size: 0x20 (Inherited: 0x0)
struct FSGRepGraphListWithStreamingLevel
{
	struct TArray<struct FSGStreamingLevelCollectionUnit> Collections; // 0x0(0x10)
	struct FSGRepGraphActorList PersistentList; // 0x10(0x10)
};

// Object: ScriptStruct UAGame.SGStreamingLevelCollectionUnit
// Size: 0x18 (Inherited: 0x0)
struct FSGStreamingLevelCollectionUnit
{
	struct FName LevelName; // 0x0(0x8)
	struct TArray<struct AActor*> LevelActors; // 0x8(0x10)
};

// Object: ScriptStruct UAGame.DeadCharacterCacheInfo
// Size: 0x10 (Inherited: 0x0)
struct FDeadCharacterCacheInfo
{
	struct AActor* Character; // 0x0(0x8)
	uint8_t Pad_0x8[0x8]; // 0x8(0x8)
};

// Object: ScriptStruct UAGame.RoundGameFactionData
// Size: 0x28 (Inherited: 0x0)
struct FRoundGameFactionData
{
	EFactionType Faction; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct FLinearColor FactionColor; // 0x4(0x10)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct TArray<struct FRoundGamePlayerData> FactionPlayerList; // 0x18(0x10)
};

// Object: ScriptStruct UAGame.RoundGamePlayerData
// Size: 0x30 (Inherited: 0x0)
struct FRoundGamePlayerData
{
	struct FString PlayerName; // 0x0(0x10)
	int64_t PlayerGID; // 0x10(0x8)
	int32_t PlayerKillerNum; // 0x18(0x4)
	int32_t PlayerDeathNum; // 0x1C(0x4)
	int32_t PlayerAssistNum; // 0x20(0x4)
	int32_t Money; // 0x24(0x4)
	bool bAlive; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
};

// Object: ScriptStruct UAGame.PlayerHeroSelection
// Size: 0x10 (Inherited: 0x0)
struct FPlayerHeroSelection
{
	uint64_t gid; // 0x0(0x8)
	int32_t TemplateID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.CanBeDestroyedActorConfig
// Size: 0xC0 (Inherited: 0x0)
struct FCanBeDestroyedActorConfig
{
	struct FString ConfigName; // 0x0(0x10)
	struct FString ActorName; // 0x10(0x10)
	struct TSoftObjectPtr<UStaticMesh> PropMesh; // 0x20(0x28)
	struct TSoftObjectPtr<UParticleSystem> DestroyedParticle; // 0x48(0x28)
	struct UAkAudioEvent* DestroyedAudio; // 0x70(0x8)
	float MaxHealth; // 0x78(0x4)
	float DelayDestroyedAfterBroken; // 0x7C(0x4)
	struct FVector DropLocationBias; // 0x80(0xC)
	int32_t BrokenDropTimes; // 0x8C(0x4)
	struct TArray<int32_t> BrokenDropInventoryIDs; // 0x90(0x10)
	struct TArray<int32_t> BrokenDropInventoryItemNum; // 0xA0(0x10)
	struct TArray<float> BrokenDropInventoryWeights; // 0xB0(0x10)
};

// Object: ScriptStruct UAGame.CanBeDestroyedActorConfigTableRow
// Size: 0xD0 (Inherited: 0x8)
struct FCanBeDestroyedActorConfigTableRow : FTableRowBase
{
	int32_t ConfigID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct FCanBeDestroyedActorConfig Config; // 0x10(0xC0)
};

// Object: ScriptStruct UAGame.ASkeletalAnimSwitherRow
// Size: 0x10 (Inherited: 0x0)
struct FASkeletalAnimSwitherRow
{
	struct UAnimationAsset* Asset; // 0x0(0x8)
	float playtime; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.SceneObjInfo_Stat
// Size: 0x38 (Inherited: 0x28)
struct FSceneObjInfo_Stat : FSceneObjeInfo_Base
{
	uint8_t Pad_0x28[0x10]; // 0x28(0x10)
};

// Object: ScriptStruct UAGame.VallyMistCameraUseInfo
// Size: 0x18 (Inherited: 0x0)
struct FVallyMistCameraUseInfo
{
	struct TArray<struct FVallyMistCameraActionInfo> UseCameraActionArray; // 0x0(0x10)
	float TotalUseTime; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct UAGame.VallyMistCameraActionInfo
// Size: 0x14 (Inherited: 0x0)
struct FVallyMistCameraActionInfo
{
	bool bIsHoldUp; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float Timestamp; // 0x4(0x4)
	struct FVector position; // 0x8(0xC)
};

// Object: ScriptStruct UAGame.TutorialReportData
// Size: 0x4 (Inherited: 0x0)
struct FTutorialReportData
{
	int32_t ReportIndex; // 0x0(0x4)
};

// Object: ScriptStruct UAGame.UAPlayerTachikomaStatics
// Size: 0x8 (Inherited: 0x0)
struct FUAPlayerTachikomaStatics
{
	uint32_t BrokenNum; // 0x0(0x4)
	float TotalUseTime; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.PreFireAimStateCharacter
// Size: 0x28 (Inherited: 0x0)
struct FPreFireAimStateCharacter
{
	struct FVector Velocity; // 0x0(0xC)
	struct FVector CameraLocation; // 0xC(0xC)
	struct FRotator CameraRotation; // 0x18(0xC)
	uint8_t Pose; // 0x24(0x1)
	uint8_t Pad_0x25[0x3]; // 0x25(0x3)
};

// Object: ScriptStruct UAGame.PreFireAimState
// Size: 0x58 (Inherited: 0x0)
struct FPreFireAimState
{
	struct FPreFireAimStateCharacter StatePlayer; // 0x0(0x28)
	struct FPreFireAimStateCharacter StateEnemy; // 0x28(0x28)
	bool bEnemyValid; // 0x50(0x1)
	uint8_t Pad_0x51[0x3]; // 0x51(0x3)
	float UpdateTime; // 0x54(0x4)
};

// Object: ScriptStruct UAGame.PreFireAimJsonMetaData
// Size: 0x70 (Inherited: 0x0)
struct FPreFireAimJsonMetaData
{
	struct FPreFireAimState PreFireAimState; // 0x0(0x58)
	uint64_t PlayerGID; // 0x58(0x8)
	uint32_t RankedLevel; // 0x60(0x4)
	uint32_t Ranking; // 0x64(0x4)
	int32_t InSequenceIndex; // 0x68(0x4)
	uint8_t Pad_0x6C[0x4]; // 0x6C(0x4)
};

// Object: ScriptStruct UAGame.PreFireAimData
// Size: 0x28 (Inherited: 0x0)
struct FPreFireAimData
{
	struct TArray<struct FPreFireAimState> StateSequence; // 0x0(0x10)
	int32_t NextIndex; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	uint64_t PlayerGID; // 0x18(0x8)
	uint32_t RankedLevel; // 0x20(0x4)
	uint32_t Ranking; // 0x24(0x4)
};

// Object: ScriptStruct UAGame.FireAimRecoilStateAuxiliary
// Size: 0x14 (Inherited: 0x0)
struct FFireAimRecoilStateAuxiliary
{
	float TimeSeconds; // 0x0(0x4)
	float FireInterval; // 0x4(0x4)
	struct FVector2D PlayerControlRotation; // 0x8(0x8)
	int32_t HitGroup; // 0x10(0x4)
};

// Object: ScriptStruct UAGame.FireAimRecoilStateEnemy
// Size: 0x38 (Inherited: 0x0)
struct FFireAimRecoilStateEnemy
{
	struct FVector RelativeVelocity; // 0x0(0xC)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TArray<struct FVector> RelativeBodyPartLocations; // 0x10(0x10)
	struct TArray<struct FRotator> RelativeBodyPartRotations; // 0x20(0x10)
	uint8_t Pose; // 0x30(0x1)
	uint8_t Pad_0x31[0x7]; // 0x31(0x7)
};

// Object: ScriptStruct UAGame.FireAimRecoilStatePlayer
// Size: 0x34 (Inherited: 0x0)
struct FFireAimRecoilStatePlayer
{
	struct FVector LocalVelocity; // 0x0(0xC)
	struct FVector LocalCameraLocation; // 0xC(0xC)
	struct FRotator LocalCameraRotation; // 0x18(0xC)
	struct FVector2D Recoil; // 0x24(0x8)
	uint8_t Pose; // 0x2C(0x1)
	uint8_t Pad_0x2D[0x3]; // 0x2D(0x3)
	float FOV; // 0x30(0x4)
};

// Object: ScriptStruct UAGame.FireAimRecoilState
// Size: 0x88 (Inherited: 0x0)
struct FFireAimRecoilState
{
	struct FFireAimRecoilStatePlayer StatePlayer; // 0x0(0x34)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
	struct FFireAimRecoilStateEnemy StateEnemy; // 0x38(0x38)
	struct FFireAimRecoilStateAuxiliary StateAuxiliary; // 0x70(0x14)
	uint8_t Pad_0x84[0x4]; // 0x84(0x4)
};

// Object: ScriptStruct UAGame.FireAimRecoilStatisJsonMetaData
// Size: 0x98 (Inherited: 0x0)
struct FFireAimRecoilStatisJsonMetaData
{
	struct FFireAimRecoilState FireAimRecoilState; // 0x0(0x88)
	uint64_t PlayerGID; // 0x88(0x8)
	uint32_t RankedLevel; // 0x90(0x4)
	uint32_t Ranking; // 0x94(0x4)
};

// Object: ScriptStruct UAGame.FireAimRecoilStatisData
// Size: 0x60 (Inherited: 0x0)
struct FFireAimRecoilStatisData
{
	struct TMap<struct FString, struct FFireAimRecoilState> StateSequence; // 0x0(0x50)
	uint64_t PlayerGID; // 0x50(0x8)
	uint32_t RankedLevel; // 0x58(0x4)
	uint32_t Ranking; // 0x5C(0x4)
};

// Object: ScriptStruct UAGame.AimStatisConfig
// Size: 0x10 (Inherited: 0x0)
struct FAimStatisConfig
{
	int32_t MinPlayerRanking; // 0x0(0x4)
	int32_t MinDeviceLevel; // 0x4(0x4)
	int32_t UpdateFps; // 0x8(0x4)
	int32_t WindowTime; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.ThrowableDebuffStruct
// Size: 0x10 (Inherited: 0x0)
struct FThrowableDebuffStruct
{
	float DizzyTime; // 0x0(0x4)
	float BlindTime; // 0x4(0x4)
	float SlowDownTime; // 0x8(0x4)
	float TinnitusTime; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.InventoryFlashDebuffStruct
// Size: 0x10 (Inherited: 0x0)
struct FInventoryFlashDebuffStruct
{
	float DebuffTime; // 0x0(0x4)
	float GetDebuffPosX; // 0x4(0x4)
	float GetDebuffPosY; // 0x8(0x4)
	float GetDebuffPosZ; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.UseInventoryFlashStruct
// Size: 0x10 (Inherited: 0x0)
struct FUseInventoryFlashStruct
{
	float UseTime; // 0x0(0x4)
	float UsePosX; // 0x4(0x4)
	float UsePosY; // 0x8(0x4)
	float UsePosZ; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.SecHurtFlowStruct
// Size: 0xC8 (Inherited: 0x0)
struct FSecHurtFlowStruct
{
	int32_t MapID; // 0x0(0x4)
	int32_t Weatherid; // 0x4(0x4)
	int32_t HurtFlowID; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct FString EnemyOpenID; // 0x10(0x10)
	struct FString EnemyRoleID; // 0x20(0x10)
	int32_t EnemyRoleType; // 0x30(0x4)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
	struct FString EnemyUserName; // 0x38(0x10)
	int32_t HurtTime; // 0x48(0x4)
	int32_t HurtType; // 0x4C(0x4)
	int32_t HitType; // 0x50(0x4)
	int32_t DamageStart; // 0x54(0x4)
	int32_t DamageReduce; // 0x58(0x4)
	int32_t ArmorDef; // 0x5C(0x4)
	int32_t HPstart; // 0x60(0x4)
	int32_t HPEnd; // 0x64(0x4)
	int32_t HelmetHPStart; // 0x68(0x4)
	int32_t HelmetHPEnd; // 0x6C(0x4)
	int32_t ArmorHPStart; // 0x70(0x4)
	int32_t ArmorHPEnd; // 0x74(0x4)
	int32_t FallHeight; // 0x78(0x4)
	int32_t PlayerKilled; // 0x7C(0x4)
	int32_t IfIsAI; // 0x80(0x4)
	uint8_t Pad_0x84[0x4]; // 0x84(0x4)
	struct FString DebuffStartList; // 0x88(0x10)
	struct FString DebuffEndList; // 0x98(0x10)
	struct FString DebuffLevelStartList; // 0xA8(0x10)
	struct FString DebuffLevelEndList; // 0xB8(0x10)
};

// Object: ScriptStruct UAGame.OnKillOtherStruct
// Size: 0x100 (Inherited: 0x0)
struct FOnKillOtherStruct
{
	struct FString WeaponName; // 0x0(0x10)
	struct FString BulletName; // 0x10(0x10)
	float KillTime; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct FString HitHelmetInventoryName; // 0x28(0x10)
	struct FString HitVestInventoryName; // 0x38(0x10)
	int32_t KilledPlayerTeamType; // 0x48(0x4)
	int32_t ArmorLevel; // 0x4C(0x4)
	int32_t HitEndurance; // 0x50(0x4)
	int32_t TeamType; // 0x54(0x4)
	bool bADS; // 0x58(0x1)
	uint8_t Pad_0x59[0x7]; // 0x59(0x7)
	struct ASGInventory* WeaponInventory; // 0x60(0x8)
	float HitDistance; // 0x68(0x4)
	uint8_t Pad_0x6C[0x4]; // 0x6C(0x4)
	int64_t KillerPlayerID; // 0x70(0x8)
	float CauseArmorConsume; // 0x78(0x4)
	float CauseArmorReduceDamage; // 0x7C(0x4)
	bool bHitHead; // 0x80(0x1)
	uint8_t Pad_0x81[0x3]; // 0x81(0x3)
	float ResultDamage; // 0x84(0x4)
	float GameRunningTime; // 0x88(0x4)
	uint8_t Pad_0x8C[0x4]; // 0x8C(0x4)
	int64_t KilledCharacterID; // 0x90(0x8)
	int32_t HitGroup; // 0x98(0x4)
	int32_t HitHeadPart; // 0x9C(0x4)
	float KillerPosX; // 0xA0(0x4)
	float KillerPosY; // 0xA4(0x4)
	float KillerPosZ; // 0xA8(0x4)
	float DeathPosX; // 0xAC(0x4)
	float DeathPosY; // 0xB0(0x4)
	float DeathPosZ; // 0xB4(0x4)
	int32_t GunId; // 0xB8(0x4)
	uint32_t BulletItemID; // 0xBC(0x4)
	uint32_t VestItemID; // 0xC0(0x4)
	uint32_t HelmetItemID; // 0xC4(0x4)
	float VerticalRecoil; // 0xC8(0x4)
	float HorizontalRecoil; // 0xCC(0x4)
	float MoaX; // 0xD0(0x4)
	float MoaY; // 0xD4(0x4)
	float Ergonomics; // 0xD8(0x4)
	float Accuracy; // 0xDC(0x4)
	struct FString AccessoryIds; // 0xE0(0x10)
	float DemoTime; // 0xF0(0x4)
	uint32_t KillerVehicleID; // 0xF4(0x4)
	int32_t SuspiciousStatus; // 0xF8(0x4)
	uint8_t Pad_0xFC[0x4]; // 0xFC(0x4)
};

// Object: ScriptStruct UAGame.BulletDamageStruct
// Size: 0x50 (Inherited: 0x0)
struct FBulletDamageStruct
{
	struct FString WeaponName; // 0x0(0x10)
	struct FString BulletName; // 0x10(0x10)
	struct FString WeaponType; // 0x20(0x10)
	int32_t HitCharacter; // 0x30(0x4)
	int32_t HitArmor; // 0x34(0x4)
	int32_t HitEndurance; // 0x38(0x4)
	int32_t HitGroup; // 0x3C(0x4)
	float HitEnduranceDamage; // 0x40(0x4)
	int32_t HitSubEndurance; // 0x44(0x4)
	int32_t HitSubGroup; // 0x48(0x4)
	float HitSubEnduranceDamage; // 0x4C(0x4)
};

// Object: ScriptStruct UAGame.ChangeWeaponOrStartFireStruct
// Size: 0x38 (Inherited: 0x0)
struct FChangeWeaponOrStartFireStruct
{
	uint64_t FireID; // 0x0(0x8)
	struct FString WeaponName; // 0x8(0x10)
	int32_t bIsChangeWeaponOrStartFire; // 0x18(0x4)
	int32_t bHitCharacter; // 0x1C(0x4)
	int32_t HitEndurance; // 0x20(0x4)
	int32_t HitGroup; // 0x24(0x4)
	float HitEnduranceDamage; // 0x28(0x4)
	int32_t HitSubEndurance; // 0x2C(0x4)
	int32_t HitSubGroup; // 0x30(0x4)
	float HitSubEnduranceDamage; // 0x34(0x4)
};

// Object: ScriptStruct UAGame.AntiDataStruct
// Size: 0x30 (Inherited: 0x0)
struct FAntiDataStruct
{
	uint64_t RoomID; // 0x0(0x8)
	struct FString ClientVersion; // 0x8(0x10)
	struct FString AntiData; // 0x18(0x10)
	uint32_t Source; // 0x28(0x4)
	uint32_t bIsOverLength; // 0x2C(0x4)
};

// Object: ScriptStruct UAGame.JumpshotInfoStruct
// Size: 0x10 (Inherited: 0x0)
struct FJumpshotInfoStruct
{
	uint32_t ShotCount; // 0x0(0x4)
	uint32_t HitCount; // 0x4(0x4)
	uint32_t Kill; // 0x8(0x4)
	uint32_t Death; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.JumpshotReoprtStruct
// Size: 0x50 (Inherited: 0x0)
struct FJumpshotReoprtStruct
{
	uint64_t JumpshotTimestamp; // 0x0(0x8)
	uint32_t MapID; // 0x8(0x4)
	uint32_t RankedLevel; // 0xC(0x4)
	struct FString WeaponName; // 0x10(0x10)
	int64_t BulletID; // 0x20(0x8)
	float ShotTargetDistance; // 0x28(0x4)
	bool bFlashlightActive; // 0x2C(0x1)
	uint8_t Pad_0x2D[0x3]; // 0x2D(0x3)
	struct FJumpshotInfoStruct JumpshotGround; // 0x30(0x10)
	struct FJumpshotInfoStruct JumpshotAir; // 0x40(0x10)
};

// Object: ScriptStruct UAGame.ThrowableStartFireInformationStatistics
// Size: 0x1D0 (Inherited: 0x0)
struct FThrowableStartFireInformationStatistics
{
	int64_t Timestamp; // 0x0(0x8)
	int64_t WeaponId; // 0x8(0x8)
	struct FString WeaponName; // 0x10(0x10)
	struct FString WeaponType; // 0x20(0x10)
	bool bHit; // 0x30(0x1)
	uint8_t Pad_0x31[0x7]; // 0x31(0x7)
	struct TArray<struct FString> HitCharacterArray; // 0x38(0x10)
	int32_t HitNumber; // 0x48(0x4)
	int32_t HitPmcNumber; // 0x4C(0x4)
	int32_t HitScavNumber; // 0x50(0x4)
	float ThrowDistance; // 0x54(0x4)
	int32_t TeamType; // 0x58(0x4)
	int32_t HitCharacterTeamType; // 0x5C(0x4)
	int64_t HitCharacterPlayerID; // 0x60(0x8)
	int32_t HitEndurance; // 0x68(0x4)
	int32_t HitSubEndurance; // 0x6C(0x4)
	int64_t ArmorId; // 0x70(0x8)
	int32_t ArmorLevel; // 0x78(0x4)
	float CauseArmorConsume; // 0x7C(0x4)
	float CauseArmorReduceDamage; // 0x80(0x4)
	float ResultDamage; // 0x84(0x4)
	struct ASGInventory* WeaponInventory; // 0x88(0x8)
	int32_t HitCharacterType; // 0x90(0x4)
	uint8_t Pad_0x94[0x4]; // 0x94(0x4)
	int64_t HitAIID; // 0x98(0x8)
	int32_t ShotTime; // 0xA0(0x4)
	int32_t HitTime; // 0xA4(0x4)
	int32_t PlayerPositionX; // 0xA8(0x4)
	int32_t PlayerPositionY; // 0xAC(0x4)
	int32_t PlayerPositionZ; // 0xB0(0x4)
	int32_t ThrowPositionX; // 0xB4(0x4)
	int32_t ThrowPositionY; // 0xB8(0x4)
	int32_t ThrowPositionZ; // 0xBC(0x4)
	int32_t ProjectileBornPositionX; // 0xC0(0x4)
	int32_t ProjectileBornPositionY; // 0xC4(0x4)
	int32_t ProjectileBornPositionZ; // 0xC8(0x4)
	int32_t HitPositionX; // 0xCC(0x4)
	int32_t HitPositionY; // 0xD0(0x4)
	int32_t HitPositionZ; // 0xD4(0x4)
	int32_t HitCharacterPositionX; // 0xD8(0x4)
	int32_t HitCharacterPositionY; // 0xDC(0x4)
	int32_t HitCharacterPositionZ; // 0xE0(0x4)
	int32_t HitCharacterTeammateNumber; // 0xE4(0x4)
	struct FString ThrowCharacterID; // 0xE8(0x10)
	bool HegPenetrateObstacle; // 0xF8(0x1)
	uint8_t Pad_0xF9[0x3]; // 0xF9(0x3)
	int32_t HegPenetrateObstacleNum; // 0xFC(0x4)
	float HegPenetrateObstacleDamage; // 0x100(0x4)
	int32_t HegNumCauseTinnitus; // 0x104(0x4)
	float FragSumBodyDamage; // 0x108(0x4)
	float FragSumArmorDamage; // 0x10C(0x4)
	int32_t FragHitNumber; // 0x110(0x4)
	int32_t FragHitHeadNumber; // 0x114(0x4)
	int32_t FragHitChestNumber; // 0x118(0x4)
	int32_t FragHitStomachNumber; // 0x11C(0x4)
	int32_t FragHitLeftArmNumber; // 0x120(0x4)
	int32_t FragHitRightArmNumber; // 0x124(0x4)
	int32_t FragHitLeftLegNumber; // 0x128(0x4)
	int32_t FragHitRightLegNumber; // 0x12C(0x4)
	int32_t FragHitArmorLevel; // 0x130(0x4)
	float MolotovTime; // 0x134(0x4)
	int32_t MolotovHitNumber; // 0x138(0x4)
	bool ActivityUse; // 0x13C(0x1)
	uint8_t Pad_0x13D[0x3]; // 0x13D(0x3)
	int32_t OwnerTeamIndex; // 0x140(0x4)
	bool TeamFlash; // 0x144(0x1)
	uint8_t Pad_0x145[0x3]; // 0x145(0x3)
	int32_t MapID; // 0x148(0x4)
	int32_t TimeSeconds; // 0x14C(0x4)
	int32_t TimeFromLastThrow; // 0x150(0x4)
	uint8_t Pad_0x154[0x4]; // 0x154(0x4)
	struct TArray<struct FString> InfectedCharacterTeamTypeArray; // 0x158(0x10)
	struct TArray<struct FString> InfectedCharacterArray; // 0x168(0x10)
	struct FString InfectedCharacterTeamType; // 0x178(0x10)
	struct FString InfectedCharacter; // 0x188(0x10)
	struct FString OnVehicleList; // 0x198(0x10)
	struct FString VehicleName; // 0x1A8(0x10)
	float VehicleBodyDamage; // 0x1B8(0x4)
	uint8_t Pad_0x1BC[0x4]; // 0x1BC(0x4)
	struct FString VehicleWheelsDamage; // 0x1C0(0x10)
};

// Object: ScriptStruct UAGame.MeleeStartFireInformationStatistics
// Size: 0xC0 (Inherited: 0x0)
struct FMeleeStartFireInformationStatistics
{
	int64_t Timestamp; // 0x0(0x8)
	int64_t WeaponId; // 0x8(0x8)
	struct FString WeaponName; // 0x10(0x10)
	struct FString WeaponType; // 0x20(0x10)
	bool bHit; // 0x30(0x1)
	uint8_t Pad_0x31[0x3]; // 0x31(0x3)
	int32_t HitNumber; // 0x34(0x4)
	int32_t HitPmcNumber; // 0x38(0x4)
	int32_t HitScavNumber; // 0x3C(0x4)
	float HitDistance; // 0x40(0x4)
	int32_t TeamType; // 0x44(0x4)
	int32_t HitCharacterTeamType; // 0x48(0x4)
	uint8_t Pad_0x4C[0x4]; // 0x4C(0x4)
	int64_t HitCharacterPlayerID; // 0x50(0x8)
	int32_t HitEndurance; // 0x58(0x4)
	int32_t HitSubEndurance; // 0x5C(0x4)
	int64_t ArmorId; // 0x60(0x8)
	int32_t ArmorLevel; // 0x68(0x4)
	float CauseArmorConsume; // 0x6C(0x4)
	float CauseArmorReduceDamage; // 0x70(0x4)
	float ResultDamage; // 0x74(0x4)
	struct ASGInventory* WeaponInventory; // 0x78(0x8)
	int32_t HitCharacterType; // 0x80(0x4)
	int32_t ShotTime; // 0x84(0x4)
	int32_t HitTime; // 0x88(0x4)
	int32_t PlayerPositionX; // 0x8C(0x4)
	int32_t PlayerPositionY; // 0x90(0x4)
	int32_t PlayerPositionZ; // 0x94(0x4)
	int32_t MeleePositionX; // 0x98(0x4)
	int32_t MeleePositionY; // 0x9C(0x4)
	int32_t MeleePositionZ; // 0xA0(0x4)
	int32_t HitPositionX; // 0xA4(0x4)
	int32_t HitPositionY; // 0xA8(0x4)
	int32_t HitPositionZ; // 0xAC(0x4)
	int32_t TimeSeconds; // 0xB0(0x4)
	int32_t TimeFromLastThrow; // 0xB4(0x4)
	float DamageCauserLocDelta; // 0xB8(0x4)
	float DamageTakerLocDelta; // 0xBC(0x4)
};

// Object: ScriptStruct UAGame.StartFireInformationStatistics
// Size: 0x268 (Inherited: 0x0)
struct FStartFireInformationStatistics
{
	int64_t Timestamp; // 0x0(0x8)
	int64_t WeaponId; // 0x8(0x8)
	struct FString WeaponName; // 0x10(0x10)
	int64_t BulletID; // 0x20(0x8)
	struct FString BulletName; // 0x28(0x10)
	int32_t BulletCount; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
	struct FString WeaponType; // 0x40(0x10)
	bool bADS; // 0x50(0x1)
	bool bHit; // 0x51(0x1)
	bool bHitHead; // 0x52(0x1)
	uint8_t Pad_0x53[0x1]; // 0x53(0x1)
	float HitDistance; // 0x54(0x4)
	float VerticalRecoil; // 0x58(0x4)
	float HorizontalRecoil; // 0x5C(0x4)
	struct FString SightName; // 0x60(0x10)
	float EngageDistance; // 0x70(0x4)
	float WaistShotAccuracy; // 0x74(0x4)
	float EffectiveDistance; // 0x78(0x4)
	int32_t TeamType; // 0x7C(0x4)
	int32_t HitCharacterTeamType; // 0x80(0x4)
	uint8_t Pad_0x84[0x4]; // 0x84(0x4)
	int64_t HitCharacterPlayerID; // 0x88(0x8)
	int32_t HitEndurance; // 0x90(0x4)
	int32_t HitGroup; // 0x94(0x4)
	float HitEnduranceDamage; // 0x98(0x4)
	int32_t HitSubEndurance; // 0x9C(0x4)
	int32_t HitSubGroup; // 0xA0(0x4)
	float HitSubEnduranceDamage; // 0xA4(0x4)
	int64_t ArmorId; // 0xA8(0x8)
	int32_t ArmorLevel; // 0xB0(0x4)
	float CauseArmorConsume; // 0xB4(0x4)
	float CauseArmorReduceDamage; // 0xB8(0x4)
	float ResultDamage; // 0xBC(0x4)
	struct ASGInventory* WeaponInventory; // 0xC0(0x8)
	uint32_t ChangeWeaponOrFire; // 0xC8(0x4)
	int32_t HitCharacterType; // 0xCC(0x4)
	int64_t HitAIID; // 0xD0(0x8)
	float MoaX; // 0xD8(0x4)
	float MoaY; // 0xDC(0x4)
	int32_t ShootingMode; // 0xE0(0x4)
	int32_t MapID; // 0xE4(0x4)
	int32_t Weatherid; // 0xE8(0x4)
	int32_t AtackFlowID; // 0xEC(0x4)
	struct FString TargetUserName; // 0xF0(0x10)
	int32_t GunType; // 0x100(0x4)
	uint8_t Pad_0x104[0x4]; // 0x104(0x4)
	struct FString GunPartslist; // 0x108(0x10)
	int32_t BulletSpeed; // 0x118(0x4)
	int32_t MagazineMax; // 0x11C(0x4)
	int32_t MagazineLeft; // 0x120(0x4)
	int32_t ShotFrequency; // 0x124(0x4)
	int32_t BulletDamage; // 0x128(0x4)
	int32_t BulletDamageReduce; // 0x12C(0x4)
	int32_t BulletDown; // 0x130(0x4)
	int32_t ReloadTime; // 0x134(0x4)
	int32_t PlayerPose; // 0x138(0x4)
	int32_t ShotPose; // 0x13C(0x4)
	int32_t FireType; // 0x140(0x4)
	int32_t Sideways; // 0x144(0x4)
	int32_t ShotTime; // 0x148(0x4)
	int32_t HitTime; // 0x14C(0x4)
	int32_t PlayerPositionX; // 0x150(0x4)
	int32_t PlayerPositionY; // 0x154(0x4)
	int32_t PlayerPositionZ; // 0x158(0x4)
	int32_t GunPositionX; // 0x15C(0x4)
	int32_t GunPositionY; // 0x160(0x4)
	int32_t GunPositionZ; // 0x164(0x4)
	int32_t BulletsBornPositionX; // 0x168(0x4)
	int32_t BulletsBornPositionY; // 0x16C(0x4)
	int32_t BulletsBornPositionZ; // 0x170(0x4)
	int32_t LastHitTime; // 0x174(0x4)
	int32_t BulletFlyDistance; // 0x178(0x4)
	int32_t BulletFlyTime; // 0x17C(0x4)
	int32_t HitPositionX; // 0x180(0x4)
	int32_t HitPositionY; // 0x184(0x4)
	int32_t HitPositionZ; // 0x188(0x4)
	int32_t HitPart; // 0x18C(0x4)
	int32_t RecoilMoveX; // 0x190(0x4)
	int32_t RecoilMoveY; // 0x194(0x4)
	int32_t WeaponAimFOV; // 0x198(0x4)
	int32_t BulletDamageBuff; // 0x19C(0x4)
	int32_t HitSubHeadPart; // 0x1A0(0x4)
	bool bPenetrateArmor; // 0x1A4(0x1)
	uint8_t Pad_0x1A5[0x3]; // 0x1A5(0x3)
	int64_t HitMovableArmorID; // 0x1A8(0x8)
	float MovableArmorConsume; // 0x1B0(0x4)
	float MovableArmorBlockDamage; // 0x1B4(0x4)
	float FireNetAvgLag; // 0x1B8(0x4)
	float FireNetLossPercentage; // 0x1BC(0x4)
	float FireNetAvgLossPercentage; // 0x1C0(0x4)
	float CauserMaxLocDelta; // 0x1C4(0x4)
	float HitNetAvgLag; // 0x1C8(0x4)
	float HitNetLossPercentage; // 0x1CC(0x4)
	float HitNetAvgLossPercentage; // 0x1D0(0x4)
	float TakerMaxLocDelta; // 0x1D4(0x4)
	uint32_t TargetVestArmorID; // 0x1D8(0x4)
	uint32_t TargetHelmetArmorID; // 0x1DC(0x4)
	uint32_t TargetFaceShieldID; // 0x1E0(0x4)
	uint32_t TargetThighArmorID; // 0x1E4(0x4)
	int32_t QuietStep; // 0x1E8(0x4)
	int32_t ContinuousFireCount; // 0x1EC(0x4)
	float ShotTargetDistance; // 0x1F0(0x4)
	int32_t TimeSeconds; // 0x1F4(0x4)
	uint64_t ShotTargetGID; // 0x1F8(0x8)
	int32_t TimeFromLastThrow; // 0x200(0x4)
	float DamageTakerMoveReceivedTimeDelta; // 0x204(0x4)
	int32_t AttackerVehicleSeatIndex; // 0x208(0x4)
	int32_t VictimVehicleSeatIndex; // 0x20C(0x4)
	int64_t HitVehicleID; // 0x210(0x8)
	struct FString HitBoneName; // 0x218(0x10)
	bool bFlashlightActive; // 0x228(0x1)
	uint8_t Pad_0x229[0x3]; // 0x229(0x3)
	float DamageCauserLocDelta; // 0x22C(0x4)
	float DamageTakerLocDelta; // 0x230(0x4)
	int32_t HasValidate; // 0x234(0x4)
	int32_t DamageTakerIsGamePlayer; // 0x238(0x4)
	float CauserOutLossPercentage; // 0x23C(0x4)
	float CauserOutAvgLossPercentage; // 0x240(0x4)
	float CauserOutLossPercentageWhenHit; // 0x244(0x4)
	float CauserOutAvgLossPercentageWhenHit; // 0x248(0x4)
	float TakerNetAvgLag; // 0x24C(0x4)
	float TakerInLossPercentage; // 0x250(0x4)
	float TakerInAvgLossPercentage; // 0x254(0x4)
	uint8_t Pad_0x258[0x10]; // 0x258(0x10)
};

// Object: ScriptStruct UAGame.InteractionStatistics
// Size: 0xC (Inherited: 0x0)
struct FInteractionStatistics
{
	uint32_t itemID; // 0x0(0x4)
	uint32_t MapID; // 0x4(0x4)
	int32_t InteractionType; // 0x8(0x4)
};

// Object: ScriptStruct UAGame.PlayerTakeDamageByWeaponStatistics
// Size: 0x170 (Inherited: 0x0)
struct FPlayerTakeDamageByWeaponStatistics
{
	struct FString WeaponName; // 0x0(0x10)
	struct FString BulletName; // 0x10(0x10)
	struct FString WeaponType; // 0x20(0x10)
	int32_t VestLevel; // 0x30(0x4)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
	struct FString VestName; // 0x38(0x10)
	int32_t HelmetLevel; // 0x48(0x4)
	uint8_t Pad_0x4C[0x4]; // 0x4C(0x4)
	struct FString HelmetName; // 0x50(0x10)
	struct FString DamageHitType; // 0x60(0x10)
	float ResultDamage; // 0x70(0x4)
	float ArmorConsume; // 0x74(0x4)
	float PenetrateDamage; // 0x78(0x4)
	float CharacterAllEndurance; // 0x7C(0x4)
	struct FString HitArmorName; // 0x80(0x10)
	float CurWeaponADSTime; // 0x90(0x4)
	float CurWeaponFireInterval; // 0x94(0x4)
	float ValidAimTime; // 0x98(0x4)
	int32_t DamageHitTypeInt; // 0x9C(0x4)
	float ArmorReduceDamage; // 0xA0(0x4)
	float ShootDistance; // 0xA4(0x4)
	int32_t TeamType; // 0xA8(0x4)
	bool bIsDead; // 0xAC(0x1)
	uint8_t Pad_0xAD[0x3]; // 0xAD(0x3)
	uint64_t ShooterCharacterID; // 0xB0(0x8)
	int32_t ShooterTeamType; // 0xB8(0x4)
	int32_t CharacterType; // 0xBC(0x4)
	int32_t WeaponValue; // 0xC0(0x4)
	int32_t HitSubEndurance; // 0xC4(0x4)
	float VerticalRecoil; // 0xC8(0x4)
	float HorizontalRecoil; // 0xCC(0x4)
	struct FString SightName; // 0xD0(0x10)
	int32_t WeaponId; // 0xE0(0x4)
	int32_t MapID; // 0xE4(0x4)
	int32_t Weatherid; // 0xE8(0x4)
	int32_t HurtFlowID; // 0xEC(0x4)
	int32_t EnemyRoleType; // 0xF0(0x4)
	uint8_t Pad_0xF4[0x4]; // 0xF4(0x4)
	struct FString EnemyRoleID; // 0xF8(0x10)
	struct FString EnemyUserName; // 0x108(0x10)
	int32_t HurtTime; // 0x118(0x4)
	int32_t HurtType; // 0x11C(0x4)
	int32_t DamageStart; // 0x120(0x4)
	int32_t DamageReduce; // 0x124(0x4)
	int32_t HPstart; // 0x128(0x4)
	int32_t HPEnd; // 0x12C(0x4)
	int32_t HelmetHPStart; // 0x130(0x4)
	int32_t HelmetHPEnd; // 0x134(0x4)
	int32_t ArmorHPStart; // 0x138(0x4)
	int32_t ArmorHPEnd; // 0x13C(0x4)
	int32_t FallHeight; // 0x140(0x4)
	int32_t PlayerKilled; // 0x144(0x4)
	struct FString DebuffStartList; // 0x148(0x10)
	struct FString DebuffEndList; // 0x158(0x10)
	bool bPenetrateArmor; // 0x168(0x1)
	uint8_t Pad_0x169[0x7]; // 0x169(0x7)
};

// Object: ScriptStruct UAGame.UATeamEscapeRow
// Size: 0x8 (Inherited: 0x0)
struct FUATeamEscapeRow
{
	int32_t EscapePointID; // 0x0(0x4)
	EEscapeExploreState State; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
};

// Object: ScriptStruct UAGame.TeammemberIdentityInfo
// Size: 0x20 (Inherited: 0x0)
struct FTeammemberIdentityInfo
{
	struct FString PlayerName; // 0x0(0x10)
	int32_t PlayerLevel; // 0x10(0x4)
	int32_t HeadBoxID; // 0x14(0x4)
	int32_t NationalFlagIso; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct UAGame.TeammemberStatusInfo
// Size: 0x20 (Inherited: 0x0)
struct FTeammemberStatusInfo
{
	ESGPlayerCondition Condition; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct FVector2D DeathLocation; // 0x4(0x8)
	struct FVector TransientLocation; // 0xC(0xC)
	struct AActor* DeathBoxContainer; // 0x18(0x8)
};

// Object: ScriptStruct UAGame.TeammemberTitleInfo
// Size: 0xC (Inherited: 0x0)
struct FTeammemberTitleInfo
{
	int32_t TitleID; // 0x0(0x4)
	int32_t TitleStarNum; // 0x4(0x4)
	int32_t TitleRank; // 0x8(0x4)
};

// Object: ScriptStruct UAGame.TeammemberPlayerBaseInfo
// Size: 0xE0 (Inherited: 0x0)
struct FTeammemberPlayerBaseInfo
{
	int32_t IndexInTeam; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	uint64_t gid; // 0x8(0x8)
	int32_t SquadIndex; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct ASGPlayerState* SGPlayerState; // 0x18(0x8)
	struct AController* Controller; // 0x20(0x8)
	struct ASGCharacter* Character; // 0x28(0x8)
	ECharacterSex CharacterSex; // 0x30(0x1)
	uint8_t Pad_0x31[0x3]; // 0x31(0x3)
	struct FTeammemberTitleInfo TitleInfo; // 0x34(0xC)
	struct FTeammemberStatusInfo StatusInfo; // 0x40(0x20)
	struct FTeammemberIdentityInfo IdentityInfo; // 0x60(0x20)
	bool bIsAI; // 0x80(0x1)
	bool bRemoved; // 0x81(0x1)
	EPlayerEndGameType PlayerEndGameType; // 0x82(0x1)
	uint8_t Pad_0x83[0x1]; // 0x83(0x1)
	struct FTraceableActorInfo Sign_QuestTraceInfo; // 0x84(0x58)
	uint8_t Pad_0xDC[0x4]; // 0xDC(0x4)
};

// Object: ScriptStruct UAGame.UATeamMarketInfo
// Size: 0x70 (Inherited: 0x0)
struct FUATeamMarketInfo
{
	int64_t PlayerGID; // 0x0(0x8)
	int32_t WeaponMarketId; // 0x8(0x4)
	int32_t ArmorMarketId; // 0xC(0x4)
	int32_t PistolMarketId; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct TArray<struct FUAPropMarketInfo> PropMarketInfo; // 0x18(0x10)
	int32_t Money; // 0x28(0x4)
	int32_t CostMoney; // 0x2C(0x4)
	struct FLastRoundItems LastRoundItems; // 0x30(0x40)
};

// Object: ScriptStruct UAGame.UAPropMarketInfo
// Size: 0x8 (Inherited: 0x0)
struct FUAPropMarketInfo
{
	int32_t MarketId; // 0x0(0x4)
	int32_t Num; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.UAVehicleInformation
// Size: 0x38 (Inherited: 0x0)
struct FUAVehicleInformation
{
	struct ASGWheeledVehicle* Vehicle; // 0x0(0x8)
	struct FVector VehicleLocation; // 0x8(0xC)
	struct FRotator VehicleRotator; // 0x14(0xC)
	struct TArray<struct ACharacter*> SeatCharacterList; // 0x20(0x10)
	int32_t VehicleKeyID; // 0x30(0x4)
	bool bVaild; // 0x34(0x1)
	uint8_t Pad_0x35[0x3]; // 0x35(0x3)
};

// Object: ScriptStruct UAGame.TraceInfoHistoryBlackboard
// Size: 0x28 (Inherited: 0x0)
struct FTraceInfoHistoryBlackboard
{
	struct UUATraceDataInfoComponent* TraceDataInfoComponent; // 0x0(0x8)
	struct TArray<struct FNewTraceableActorInfo> ActiveTraceDataList; // 0x8(0x10)
	struct TArray<struct FNewTraceableActorInfo> PassivityTraceDataList; // 0x18(0x10)
};

// Object: ScriptStruct UAGame.UATraceDispatcherConfigTable
// Size: 0x38 (Inherited: 0x20)
struct FUATraceDispatcherConfigTable : FModeTableRowBase
{
	struct UUATraceDispatcherBase* SceneDispatcherClass; // 0x20(0x8)
	struct UUATraceDispatcherBase* NewMapDispatcherClass; // 0x28(0x8)
	struct UUATraceDispatcherBase* DirectionalBarDispatcherClass; // 0x30(0x8)
};

// Object: ScriptStruct UAGame.ForceRelevancyTraceInfoGroup
// Size: 0x10 (Inherited: 0x0)
struct FForceRelevancyTraceInfoGroup
{
	struct TArray<struct FForceRelevancyTraceInfo> TraceInfos; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.ForceRelevancyTraceInfo
// Size: 0x14 (Inherited: 0x0)
struct FForceRelevancyTraceInfo
{
	uint8_t Pad_0x0[0x14]; // 0x0(0x14)
};

// Object: ScriptStruct UAGame.TutorialCheckpointSettings
// Size: 0x10 (Inherited: 0x0)
struct FTutorialCheckpointSettings
{
	struct ASGPlayerStart* PlayerStart; // 0x0(0x8)
	bool bResetCaptainRotation; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
};

// Object: ScriptStruct UAGame.TutorialCaptainTipRow
// Size: 0x38 (Inherited: 0x8)
struct FTutorialCaptainTipRow : FTableRowBase
{
	int64_t HUDTableID; // 0x8(0x8)
	struct FName VoiceRowName; // 0x10(0x8)
	struct UAnimMontage* BodyMontage; // 0x18(0x8)
	struct FName MontageSectionName; // 0x20(0x8)
	struct FString FacialMontage; // 0x28(0x10)
};

// Object: ScriptStruct UAGame.MissionActionTutorialGiveItemInfo
// Size: 0x20 (Inherited: 0x0)
struct FMissionActionTutorialGiveItemInfo
{
	int32_t itemID; // 0x0(0x4)
	int32_t Durability; // 0x4(0x4)
	int32_t MinStackCount; // 0x8(0x4)
	int32_t MaxStackCount; // 0xC(0x4)
	EAttachPosition Pos; // 0x10(0x1)
	ESGGiveInventoryByClassType GiveInvType; // 0x11(0x1)
	uint8_t Pad_0x12[0x6]; // 0x12(0x6)
	struct ASGInventory* InventoryClass; // 0x18(0x8)
};

// Object: ScriptStruct UAGame.TutorialSetMaterialData
// Size: 0x20 (Inherited: 0x0)
struct FTutorialSetMaterialData
{
	int32_t Index; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FString ParamKey; // 0x8(0x10)
	float ParamValue; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct UAGame.UAKillReportData
// Size: 0x28 (Inherited: 0x0)
struct FUAKillReportData
{
	int64_t KilledPlayerGid; // 0x0(0x8)
	struct FString KilledPlayerName; // 0x8(0x10)
	int64_t LastKilledPlayerGid; // 0x18(0x8)
	bool bHeadShot; // 0x20(0x1)
	uint8_t Pad_0x21[0x7]; // 0x21(0x7)
};

// Object: ScriptStruct UAGame.NewTraceableActorInfoList
// Size: 0x10 (Inherited: 0x0)
struct FNewTraceableActorInfoList
{
	struct TArray<struct FNewTraceableActorInfo> TraceableActorInfos; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.InventoryInfo
// Size: 0x48 (Inherited: 0x0)
struct FInventoryInfo
{
	int64_t ItemGID; // 0x0(0x8)
	int64_t itemID; // 0x8(0x8)
	int32_t StackCount; // 0x10(0x4)
	int32_t Durability; // 0x14(0x4)
	int32_t MaxDurability; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	int64_t ParentGID; // 0x20(0x8)
	int32_t Index; // 0x28(0x4)
	int32_t StartRow; // 0x2C(0x4)
	int32_t StartColumn; // 0x30(0x4)
	EAttachPosition AttachPosition; // 0x34(0x1)
	uint8_t Pad_0x35[0x3]; // 0x35(0x3)
	int32_t InsureType; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
	int64_t TakeInPlayerGID; // 0x40(0x8)
};

// Object: ScriptStruct UAGame.DarkZonePlayerStartPointInfo
// Size: 0x38 (Inherited: 0x0)
struct FDarkZonePlayerStartPointInfo
{
	struct TArray<struct AActor*> PlayerStartPointList; // 0x0(0x10)
	struct TArray<int32_t> TeamIndexList; // 0x10(0x10)
	int32_t GroupIndex; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct TArray<struct AActor*> TeamPlayerStartPointList; // 0x28(0x10)
};

// Object: ScriptStruct UAGame.DarkZoneEscapePointInfo
// Size: 0x10 (Inherited: 0x0)
struct FDarkZoneEscapePointInfo
{
	struct AActor* EscapePoint; // 0x0(0x8)
	float Ratio; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct UAGame.RestrictedAreaInfo
// Size: 0x24 (Inherited: 0x0)
struct FRestrictedAreaInfo
{
	float CenterPointOffsetMax; // 0x0(0x4)
	struct FVector CenterPoint; // 0x4(0xC)
	float Radius; // 0x10(0x4)
	float WaitTime; // 0x14(0x4)
	float ShrinkTime; // 0x18(0x4)
	int32_t Damage; // 0x1C(0x4)
	float DamageInterval; // 0x20(0x4)
};

// Object: ScriptStruct UAGame.UASelectInventorySubmitWidgetConfigTableRow
// Size: 0x90 (Inherited: 0x8)
struct FUASelectInventorySubmitWidgetConfigTableRow : FTableRowBase
{
	struct TArray<int32_t> ShowItemIdArray; // 0x8(0x10)
	struct TArray<int32_t> CantSubmitItemIdArray; // 0x18(0x10)
	bool IsMultiSelection; // 0x28(0x1)
	bool ItemShowPrice; // 0x29(0x1)
	bool ItemShowCount; // 0x2A(0x1)
	uint8_t Pad_0x2B[0x5]; // 0x2B(0x5)
	struct FText TitleText; // 0x30(0x18)
	struct FText TitleTipsText; // 0x48(0x18)
	struct FText SubmitBtnText; // 0x60(0x18)
	struct FText DefaultCantSubmitMaskTipsText; // 0x78(0x18)
};

// Object: ScriptStruct UAGame.UAPickupLevelConfigsTableRow
// Size: 0x38 (Inherited: 0x8)
struct FUAPickupLevelConfigsTableRow : FTableRowBase
{
	int32_t Level; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct FString Describtion; // 0x10(0x10)
	float Percent; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct TArray<struct FUAPickupPercentage> PickupPercentages; // 0x28(0x10)
};

// Object: ScriptStruct UAGame.UAPickupPercentage
// Size: 0x30 (Inherited: 0x0)
struct FUAPickupPercentage
{
	struct TSoftClassPtr<struct AActor*> PickupClass; // 0x0(0x28)
	float Percent; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct UAGame.UAPickupLevelPercentage
// Size: 0x8 (Inherited: 0x0)
struct FUAPickupLevelPercentage
{
	int32_t Level; // 0x0(0x4)
	float Percent; // 0x4(0x4)
};

// Object: ScriptStruct UAGame.InvisibleTag
// Size: 0x10 (Inherited: 0x0)
struct FInvisibleTag
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct UAGame.VolumeSpawnedInventoryInfo
// Size: 0xB0 (Inherited: 0x0)
struct FVolumeSpawnedInventoryInfo
{
	struct TWeakObjectPtr<struct ASGInventory> SpawnedInventory; // 0x0(0x8)
	struct FMissionObjectiveSpawnInventoryInfo SpawnInventoryInfo; // 0x8(0xA8)
};

// Object: ScriptStruct UAGame.RichHyperlinkRow
// Size: 0x548 (Inherited: 0x8)
struct FRichHyperlinkRow : FTableRowBase
{
	struct FHyperlinkStyle HlStyle; // 0x8(0x540)
};

// Object: Class UAGame.AssetsProfilingCommandlet
// Size: 0x140 (Inherited: 0x80)
struct UAssetsProfilingCommandlet : UCommandlet
{
	DEFINE_UE_CLASS_HELPERS(UAssetsProfilingCommandlet, "AssetsProfilingCommandlet")

	uint8_t Pad_0x80[0xC0]; // 0x80(0xC0)
};

// Object: Class UAGame.AudioPropagateManager
// Size: 0x590 (Inherited: 0x300)
struct AAudioPropagateManager : AActor
{
	DEFINE_UE_CLASS_HELPERS(AAudioPropagateManager, "AudioPropagateManager")

	int32_t VisibleNearistPortalNum; // 0x300(0x4)
	int32_t InVisiblePortalNum; // 0x304(0x4)
	float FadeCollisionRadius; // 0x308(0x4)
	uint8_t Pad_0x30C[0x4]; // 0x30C(0x4)
	struct TArray<struct AActor*> AudioPortals; // 0x310(0x10)
	uint8_t Pad_0x320[0x220]; // 0x320(0x220)
	struct TMap<struct AAkAcousticPortal*, EAkAcousticPortalState> PortalStateCache; // 0x540(0x50)

	// Object: Function UAGame.AudioPropagateManager.InitManager
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f6fb38
	// Params: [ Num(0) Size(0x0) ]
	void InitManager();
};

// Object: Class UAGame.AutoTestActor
// Size: 0x310 (Inherited: 0x310)
struct AAutoTestActor : AStaticMeshActor
{
	DEFINE_UE_CLASS_HELPERS(AAutoTestActor, "AutoTestActor")
};

// Object: Class UAGame.BigMapInfoActor
// Size: 0x3F8 (Inherited: 0x300)
struct ABigMapInfoActor : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABigMapInfoActor, "BigMapInfoActor")

	struct FVector WorldCenter; // 0x300(0xC)
	struct FVector MapTopLeftLocation; // 0x30C(0xC)
	struct FVector WorldExtent; // 0x318(0xC)
	bool bOverrideNorthVector; // 0x324(0x1)
	uint8_t Pad_0x325[0x3]; // 0x325(0x3)
	struct FVector NorthVector; // 0x328(0xC)
	uint8_t Pad_0x334[0x4]; // 0x334(0x4)
	struct TSoftObjectPtr<UTexture2D> MapTextureSoftPtr; // 0x338(0x28)
	struct FVector2D MapTextureOffset; // 0x360(0x8)
	struct FText DefaultMapName; // 0x368(0x18)
	struct TSoftObjectPtr<UTexture2D> CoreAreaTexturePtr; // 0x380(0x28)
	int32_t ScaleText; // 0x3A8(0x4)
	float MinMapScale; // 0x3AC(0x4)
	int32_t MaxMapScale; // 0x3B0(0x4)
	float DefaultMapScale; // 0x3B4(0x4)
	float MiniMapDisplayRadius; // 0x3B8(0x4)
	int32_t SceneSignOffset_Y; // 0x3BC(0x4)
	float BuildingVolumeHeight; // 0x3C0(0x4)
	uint8_t Pad_0x3C4[0x4]; // 0x3C4(0x4)
	struct TArray<struct FBigMapAreaTextureInfo> MapAreaTextureInfos; // 0x3C8(0x10)
	int32_t UncompressedSize; // 0x3D8(0x4)
	int32_t CompressedSize; // 0x3DC(0x4)
	int32_t CoreWidth; // 0x3E0(0x4)
	int32_t CoreHeight; // 0x3E4(0x4)
	struct TArray<uint8_t> CompressedCoreAreaData; // 0x3E8(0x10)
};

// Object: Class UAGame.BirdAlertArea
// Size: 0x440 (Inherited: 0x300)
struct ABirdAlertArea : AActor
{
	DEFINE_UE_CLASS_HELPERS(ABirdAlertArea, "BirdAlertArea")

	struct USceneComponent* SceneRoot; // 0x300(0x8)
	struct UCapsuleComponent* InnerArea; // 0x308(0x8)
	struct UCapsuleComponent* OuterArea; // 0x310(0x8)
	struct FBirdEffect IdleEffect; // 0x318(0x28)
	struct FBirdEffect TakingOffEffect; // 0x340(0x28)
	float TakingOffDuration; // 0x368(0x4)
	uint8_t Pad_0x36C[0x4]; // 0x36C(0x4)
	struct FBirdEffect HoverEffect; // 0x370(0x28)
	float HoverDuration; // 0x398(0x4)
	uint8_t Pad_0x39C[0x4]; // 0x39C(0x4)
	struct FBirdEffect LandingEffect; // 0x3A0(0x28)
	float LandingDuration; // 0x3C8(0x4)
	uint8_t Pad_0x3CC[0x4]; // 0x3CC(0x4)
	struct FTransform ParticleOffset; // 0x3D0(0x30)
	EBirdAlertAreaState CurrentState; // 0x400(0x1)
	uint8_t Pad_0x401[0x3]; // 0x401(0x3)
	int32_t InteractActorConfigID; // 0x404(0x4)
	int32_t InteractActorGID; // 0x408(0x4)
	uint8_t Pad_0x40C[0x4]; // 0x40C(0x4)
	struct UParticleSystemComponent* PSC; // 0x410(0x8)
	bool bLocalPawnOverlapping; // 0x418(0x1)
	uint8_t Pad_0x419[0x27]; // 0x419(0x27)

	// Object: Function UAGame.BirdAlertArea.OnRep_CurrentState
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f6fc24
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_CurrentState();

	// Object: Function UAGame.BirdAlertArea.OnOuterAreaEndOverlap
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f6fc38
	// Params: [ Num(4) Size(0x1C) ]
	void OnOuterAreaEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex);

	// Object: Function UAGame.BirdAlertArea.OnOuterAreaBeginOverlap
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x9f6fd9c
	// Params: [ Num(6) Size(0xB8) ]
	void OnOuterAreaBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

	// Object: Function UAGame.BirdAlertArea.OnInnerAreaBeginOverlap
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x9f6ffa8
	// Params: [ Num(6) Size(0xB8) ]
	void OnInnerAreaBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
};

// Object: Class UAGame.LineDrawWidget
// Size: 0x2B0 (Inherited: 0x290)
struct ULineDrawWidget : UUserWidget
{
	DEFINE_UE_CLASS_HELPERS(ULineDrawWidget, "LineDrawWidget")

	struct UImage* LineImage; // 0x290(0x8)
	struct UUANewMapSubWidgetBase* SubWidget; // 0x298(0x8)
	uint8_t Pad_0x2A0[0x10]; // 0x2A0(0x10)

	// Object: Function UAGame.LineDrawWidget.OnSubWidgetPositionChanged
	// Flags: [Native|Protected|HasDefaults]
	// Offset: 0x9c5d1b8
	// Params: [ Num(1) Size(0x8) ]
	void OnSubWidgetPositionChanged(struct FVector2D NewPosition);

	// Object: Function UAGame.LineDrawWidget.DrawLineWrapper
	// Flags: [Native|Protected|BlueprintCallable]
	// Offset: 0x9f77c9c
	// Params: [ Num(0) Size(0x0) ]
	void DrawLineWrapper();

	// Object: Function UAGame.LineDrawWidget.DrawLine
	// Flags: [Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x9f77cb8
	// Params: [ Num(2) Size(0x10) ]
	void DrawLine(const struct FVector2D& InStartPoint, const struct FVector2D& InEndPoint);

	// Object: Function UAGame.LineDrawWidget.DrawDynamicLine
	// Flags: [Native|Public|HasOutParms|HasDefaults|BlueprintCallable]
	// Offset: 0x9c5d264
	// Params: [ Num(2) Size(0x14) ]
	void DrawDynamicLine(struct UUANewMapSubWidgetBase* InSubWidget, const struct FVector& InTraceWorldPosition);
};

// Object: Class UAGame.BRLineDrawWidget
// Size: 0x2D0 (Inherited: 0x2B0)
struct UBRLineDrawWidget : ULineDrawWidget
{
	DEFINE_UE_CLASS_HELPERS(UBRLineDrawWidget, "BRLineDrawWidget")

	float ALength; // 0x2B0(0x4)
	float BLength; // 0x2B4(0x4)
	uint8_t Pad_0x2B8[0x18]; // 0x2B8(0x18)

	// Object: Function UAGame.BRLineDrawWidget.SetIsMinimap
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f70328
	// Params: [ Num(1) Size(0x1) ]
	void SetIsMinimap(bool bInIsMinimap);

	// Object: Function UAGame.BRLineDrawWidget.OnLimitRandomAreaPlanDataInfoChange
	// Flags: [Final|Native|Protected|BlueprintCallable]
	// Offset: 0x9f70280
	// Params: [ Num(1) Size(0x8) ]
	void OnLimitRandomAreaPlanDataInfoChange(struct USGGameStateLimitRandomAreaPointManager* LimitRandomAreaPointManager);
};

// Object: Class UAGame.BuildingVolume
// Size: 0x408 (Inherited: 0x3B8)
struct ABuildingVolume : ASGVolume
{
	DEFINE_UE_CLASS_HELPERS(ABuildingVolume, "BuildingVolume")

	struct TMap<int32_t, float> LayerStartPointZMap; // 0x3B8(0x50)

	// Object: Function UAGame.BuildingVolume.TryGetStartPointZ
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x9f703e8
	// Params: [ Num(3) Size(0x9) ]
	bool TryGetStartPointZ(int32_t LayerID, float& OutHeight);
};

// Object: Class UAGame.CardMovementManager
// Size: 0x310 (Inherited: 0x300)
struct ACardMovementManager : AActor
{
	DEFINE_UE_CLASS_HELPERS(ACardMovementManager, "CardMovementManager")

	struct TArray<struct AActor*> ActiveMovingActors; // 0x300(0x10)

	// Object: Function UAGame.CardMovementManager.UpdateActorTransform
	// Flags: [Final|Native|Protected|HasDefaults|BlueprintCallable]
	// Offset: 0x9f704fc
	// Params: [ Num(5) Size(0xD0) ]
	void UpdateActorTransform(int32_t ActorIndex, struct FTransform DefaultFrom, struct FTransform DefaultTo, struct FTransform From, struct FTransform To);

	// Object: Function UAGame.CardMovementManager.GetCardNonScaledTransform
	// Flags: [Event|Protected|HasDefaults|BlueprintEvent]
	// Offset: 0x5d8cbc8
	// Params: [ Num(2) Size(0x40) ]
	struct FTransform GetCardNonScaledTransform(struct AActor* Interactor);

	// Object: Function UAGame.CardMovementManager.CalculateTransformMat
	// Flags: [Final|Native|Private|HasDefaults|BlueprintCallable]
	// Offset: 0x9f70770
	// Params: [ Num(6) Size(0x120) ]
	struct FTransform CalculateTransformMat(struct FTransform X, struct FTransform A, struct FTransform B, struct FTransform C, struct FTransform D);
};

// Object: Class UAGame.CompetitionHUD
// Size: 0x570 (Inherited: 0x540)
struct ACompetitionHUD : ASGHUD
{
	DEFINE_UE_CLASS_HELPERS(ACompetitionHUD, "CompetitionHUD")

	uint8_t Pad_0x540[0x8]; // 0x540(0x8)
	struct TArray<struct TSoftClassPtr<struct USGUserWidget*>> CompetitionPlayerComponentClasses; // 0x548(0x10)
	struct TArray<struct TSoftClassPtr<struct USGUserWidget*>> OBPlayerComponentClasses; // 0x558(0x10)
	bool bCreate; // 0x568(0x1)
	uint8_t Pad_0x569[0x7]; // 0x569(0x7)

	// Object: Function UAGame.CompetitionHUD.RequestAsyncLoadWidgets
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x9f70ae8
	// Params: [ Num(1) Size(0x10) ]
	void RequestAsyncLoadWidgets(const struct TArray<struct TSoftClassPtr<struct USGUserWidget*>>& TempComponentClasses);

	// Object: Function UAGame.CompetitionHUD.OnPlayerIdentityTypeChange
	// Flags: [Final|Native|Public]
	// Offset: 0x9f70bb8
	// Params: [ Num(1) Size(0x8) ]
	void OnPlayerIdentityTypeChange(struct ASGPlayerState* PS);

	// Object: Function UAGame.CompetitionHUD.CheckStartMatchHandle
	// Flags: [Final|Native|Private]
	// Offset: 0x9f70c60
	// Params: [ Num(0) Size(0x0) ]
	void CheckStartMatchHandle();
};

// Object: Class UAGame.DSTestGameMode
// Size: 0x6C0 (Inherited: 0x690)
struct ADSTestGameMode : ASGGameMode
{
	DEFINE_UE_CLASS_HELPERS(ADSTestGameMode, "DSTestGameMode")

	struct ACharacter* AICharacterClass; // 0x690(0x8)
	struct AAIController* AIControllerClass; // 0x698(0x8)
	struct UBehaviorTree* BehaviorTreeTemplate; // 0x6A0(0x8)
	int32_t AIMaxCount; // 0x6A8(0x4)
	int32_t SpawnAIRadius; // 0x6AC(0x4)
	struct FVector CenterPoint; // 0x6B0(0xC)
	uint8_t Pad_0x6BC[0x4]; // 0x6BC(0x4)
};

// Object: Class UAGame.DZPCInputHandleComponent
// Size: 0xF0 (Inherited: 0xF0)
struct UDZPCInputHandleComponent : USGPCInputHandleComponent
{
	DEFINE_UE_CLASS_HELPERS(UDZPCInputHandleComponent, "DZPCInputHandleComponent")
};

// Object: Class UAGame.UAPCUIModeComponent
// Size: 0x100 (Inherited: 0xF0)
struct UUAPCUIModeComponent : USGPCUIModeComponent
{
	DEFINE_UE_CLASS_HELPERS(UUAPCUIModeComponent, "UAPCUIModeComponent")

	bool ForceDisableBagStateChange; // 0xEA(0x1)
	bool bPreparationsOpened; // 0xEC(0x1)
	bool bOBFreeView; // 0xED(0x1)
	bool bDBNO; // 0xEE(0x1)
	bool bMainMenuOpened; // 0xEF(0x1)
	bool bBagOpened; // 0xF0(0x1)
	bool bBagOpened_Real; // 0xF1(0x1)
	EUABagOperation CurBagOperation; // 0xF2(0x1)
	bool bMapOpened; // 0xF3(0x1)
	bool bSettlement; // 0xF4(0x1)
	bool bAIDebugInfoOpen; // 0xF5(0x1)
	bool bCombatStatsOpened; // 0xF6(0x1)
	bool bGameSetttingOpened; // 0xF7(0x1)
	bool bIsBagTemporarilyHidden; // 0xF8(0x1)
	bool bPhotoGraphOpen; // 0xF9(0x1)
	bool bPrepareStage; // 0xFA(0x1)
	bool bMovablePrepareStage; // 0xFB(0x1)
	bool bEscapePerformOpen; // 0xFC(0x1)
	bool bMinigameOpen; // 0xFD(0x1)
	bool bCommonPrepareStage; // 0xFE(0x1)
	EPhotoGraphType PhotoGraphType; // 0xFF(0x1)

	// Object: Function UAGame.UAPCUIModeComponent.SwitchMapOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa118240
	// Params: [ Num(0) Size(0x0) ]
	void SwitchMapOpen();

	// Object: Function UAGame.UAPCUIModeComponent.SwitchMainMenu
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa118268
	// Params: [ Num(0) Size(0x0) ]
	void SwitchMainMenu();

	// Object: Function UAGame.UAPCUIModeComponent.SwitchBagOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa118254
	// Params: [ Num(0) Size(0x0) ]
	void SwitchBagOpen();

	// Object: Function UAGame.UAPCUIModeComponent.SwitchAIDebugInfo
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa11822c
	// Params: [ Num(0) Size(0x0) ]
	void SwitchAIDebugInfo();

	// Object: Function UAGame.UAPCUIModeComponent.SetPrepareStage
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa11801c
	// Params: [ Num(1) Size(0x1) ]
	void SetPrepareStage(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.SetPreparationsOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa117c00
	// Params: [ Num(1) Size(0x1) ]
	void SetPreparationsOpen(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.SetPhotoGraphOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa1180cc
	// Params: [ Num(1) Size(0x1) ]
	void SetPhotoGraphOpen(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.SetOBFreeViewOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa117b54
	// Params: [ Num(1) Size(0x1) ]
	void SetOBFreeViewOpen(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.SetMovablePrepareStage
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa117f6c
	// Params: [ Num(1) Size(0x1) ]
	void SetMovablePrepareStage(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.SetMinigameOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa1182f4
	// Params: [ Num(1) Size(0x1) ]
	void SetMinigameOpen(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.SetMapOpen
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa118454
	// Params: [ Num(1) Size(0x1) ]
	void SetMapOpen(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.SetMainMenuOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa11850c
	// Params: [ Num(1) Size(0x1) ]
	void SetMainMenuOpen(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.SetGameSettingOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x97d7b5c
	// Params: [ Num(1) Size(0x1) ]
	void SetGameSettingOpen(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.SetEscapePerformOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa117ce4
	// Params: [ Num(1) Size(0x1) ]
	void SetEscapePerformOpen(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.SetDBNOOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9cc2108
	// Params: [ Num(1) Size(0x1) ]
	void SetDBNOOpen(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.SetCommonPrepareStage
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa117ebc
	// Params: [ Num(1) Size(0x1) ]
	void SetCommonPrepareStage(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.SetCombatStatsOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa11817c
	// Params: [ Num(1) Size(0x1) ]
	void SetCombatStatsOpen(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.SetBagOpen
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0x9cc21b4
	// Params: [ Num(4) Size(0x12) ]
	void SetBagOpen(bool bOpen, struct AActor* InteractTarget, EUABagOperation Operation, bool bSkipOpenBagAnim);

	// Object: Function UAGame.UAPCUIModeComponent.SetAIDebugInfoOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa1183a4
	// Params: [ Num(1) Size(0x1) ]
	void SetAIDebugInfoOpen(bool bOpen);

	// Object: Function UAGame.UAPCUIModeComponent.RoundModeSetPrepareStage
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa117d94
	// Params: [ Num(3) Size(0x10) ]
	void RoundModeSetPrepareStage(struct APlayerController* PlayerController, EUAPlayerRoundState RoundState, int32_t CurrRound);

	// Object: Function UAGame.UAPCUIModeComponent.RefreshUIMode
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9cc2334
	// Params: [ Num(0) Size(0x0) ]
	void RefreshUIMode();

	// Object: Function UAGame.UAPCUIModeComponent.OnPhotographAbilityDeactivated
	// Flags: [Final|Native|Public]
	// Offset: 0xa117914
	// Params: [ Num(1) Size(0x8) ]
	void OnPhotographAbilityDeactivated(struct ASGCharacter* Character);

	// Object: Function UAGame.UAPCUIModeComponent.OnPhotographAbilityActivated
	// Flags: [Final|Native|Public]
	// Offset: 0xa1179bc
	// Params: [ Num(2) Size(0x9) ]
	void OnPhotographAbilityActivated(struct ASGCharacter* Character, EPhotoGraphType InPhotoGraphType);

	// Object: Function UAGame.UAPCUIModeComponent.OnEnterDBNOMessageReceived
	// Flags: [Final|Native|Public]
	// Offset: 0xa1185bc
	// Params: [ Num(1) Size(0x8) ]
	void OnEnterDBNOMessageReceived(struct ACharacter* Character);

	// Object: Function UAGame.UAPCUIModeComponent.IsMapOpenned
	// Flags: [Native|Public|BlueprintCallable]
	// Offset: 0xa1182b4
	// Params: [ Num(1) Size(0x1) ]
	bool IsMapOpenned();

	// Object: Function UAGame.UAPCUIModeComponent.IsCombatStatsOpenned
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa117cac
	// Params: [ Num(1) Size(0x1) ]
	bool IsCombatStatsOpenned();

	// Object: Function UAGame.UAPCUIModeComponent.IsAIDebugInfoOpened
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa11827c
	// Params: [ Num(1) Size(0x1) ]
	bool IsAIDebugInfoOpened();

	// Object: Function UAGame.UAPCUIModeComponent.GetPhotoGraphType
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa1178cc
	// Params: [ Num(1) Size(0x1) ]
	EPhotoGraphType GetPhotoGraphType();

	// Object: Function UAGame.UAPCUIModeComponent.GetPermissionControlWidget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9816fd8
	// Params: [ Num(2) Size(0x10) ]
	struct USGUserWidget* GetPermissionControlWidget(int32_t InZOrder);

	// Object: Function UAGame.UAPCUIModeComponent.GetDynamicEventControlWidget
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0xa117aa4
	// Params: [ Num(2) Size(0x10) ]
	struct USGUserWidget* GetDynamicEventControlWidget(int32_t InZOrder);

	// Object: Function UAGame.UAPCUIModeComponent.CheckBagStateChange
	// Flags: [Final|Native|Public]
	// Offset: 0xa117900
	// Params: [ Num(0) Size(0x0) ]
	void CheckBagStateChange();
};

// Object: Class UAGame.DZPCUIModeComponent
// Size: 0x108 (Inherited: 0x100)
struct UDZPCUIModeComponent : UUAPCUIModeComponent
{
	DEFINE_UE_CLASS_HELPERS(UDZPCUIModeComponent, "DZPCUIModeComponent")

	bool bEscapeInfoOpen; // 0x100(0x1)
	uint8_t Pad_0x101[0x7]; // 0x101(0x7)

	// Object: Function UAGame.DZPCUIModeComponent.SwitchEscapeInfoOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f70d50
	// Params: [ Num(0) Size(0x0) ]
	void SwitchEscapeInfoOpen();

	// Object: Function UAGame.DZPCUIModeComponent.SetEscapeInfoOpen
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f70ca0
	// Params: [ Num(1) Size(0x1) ]
	void SetEscapeInfoOpen(bool bOpen);
};

// Object: Class UAGame.FallenLeavesController
// Size: 0x488 (Inherited: 0x300)
struct AFallenLeavesController : AActor
{
	DEFINE_UE_CLASS_HELPERS(AFallenLeavesController, "FallenLeavesController")

	uint8_t Pad_0x300[0x28]; // 0x300(0x28)
	struct FString CurrentClimateTypeName; // 0x328(0x10)
	struct ASceneObjectSwitcher* SceneObjectSwitcher; // 0x338(0x8)
	float SpawnDistance; // 0x340(0x4)
	uint8_t Pad_0x344[0x4]; // 0x344(0x4)
	struct TMap<struct FString, struct FallenLeavesEffectStruct> ClimateFallenLeavesEffectMap; // 0x348(0x50)
	struct TMap<struct UParticleSystem*, float> FallenLeavesEffectWarmupTimeMap; // 0x398(0x50)
	struct TMap<struct FName, struct UStaticMesh*> FoliageFNameStaticMeshMap; // 0x3E8(0x50)
	struct TMap<uint32_t, struct UParticleSystemComponent*> GeneratedPSCMap; // 0x438(0x50)
};

// Object: Class UAGame.GameModeAutoTest
// Size: 0x408 (Inherited: 0x3E8)
struct AGameModeAutoTest : AGameMode
{
	DEFINE_UE_CLASS_HELPERS(AGameModeAutoTest, "GameModeAutoTest")

	struct TArray<struct UParticleSystemComponent*> ParticleSystemComponentArray; // 0x3E8(0x10)
	struct TArray<struct AActor*> ActorArray; // 0x3F8(0x10)

	// Object: Function UAGame.GameModeAutoTest.TestSpawnActorWithMaterial
	// Flags: [Final|Exec|Native|Public|BlueprintCallable]
	// Offset: 0x9f70e80
	// Params: [ Num(3) Size(0x30) ]
	void TestSpawnActorWithMaterial(struct FString ClassName, struct FString MaterialName, struct FString position);

	// Object: Function UAGame.GameModeAutoTest.TestSpawnActor
	// Flags: [Final|Exec|Native|Public|BlueprintCallable]
	// Offset: 0x9f710ec
	// Params: [ Num(2) Size(0x20) ]
	void TestSpawnActor(struct FString ClassName, struct FString position);

	// Object: Function UAGame.GameModeAutoTest.TestDestroyActor
	// Flags: [Final|Exec|Native|Public|BlueprintCallable]
	// Offset: 0x9f710d8
	// Params: [ Num(0) Size(0x0) ]
	void TestDestroyActor();

	// Object: Function UAGame.GameModeAutoTest.EnableLightShadow
	// Flags: [Final|Exec|Native|Public|BlueprintCallable]
	// Offset: 0x9f71028
	// Params: [ Num(1) Size(0x1) ]
	void EnableLightShadow(bool bEnable);
};

// Object: Class UAGame.InteractiveActorCollector
// Size: 0x300 (Inherited: 0x300)
struct AInteractiveActorCollector : AActor
{
	DEFINE_UE_CLASS_HELPERS(AInteractiveActorCollector, "InteractiveActorCollector")
};

// Object: Class UAGame.Interface_CallFunction
// Size: 0x28 (Inherited: 0x28)
struct IInterface_CallFunction : IInterface
{
	DEFINE_UE_CLASS_HELPERS(IInterface_CallFunction, "Interface_CallFunction")

	// Object: Function UAGame.Interface_CallFunction.CallFunction
	// Flags: [Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent]
	// Offset: 0x9f7124c
	// Params: [ Num(1) Size(0x10) ]
	void CallFunction(const struct FInstancedStruct& StateData);
};

// Object: Class UAGame.InventoryFultonRecoveryComponent
// Size: 0x150 (Inherited: 0xE0)
struct UInventoryFultonRecoveryComponent : UActorComponent
{
	DEFINE_UE_CLASS_HELPERS(UInventoryFultonRecoveryComponent, "InventoryFultonRecoveryComponent")

	uint8_t Pad_0xE0[0x8]; // 0xE0(0x8)
	struct APlayerController* FultonOwner; // 0xE8(0x8)
	float DurationBeforeStartUp; // 0xF0(0x4)
	float LifeDurationAfterStartUp; // 0xF4(0x4)
	uint8_t Pad_0xF8[0x18]; // 0xF8(0x18)
	struct TArray<float> ToastTime; // 0x110(0x10)
	struct TArray<struct FString> ToastKey; // 0x120(0x10)
	uint8_t Pad_0x130[0x9]; // 0x130(0x9)
	bool bPlayRecycleAnim; // 0x139(0x1)
	uint8_t Pad_0x13A[0x2]; // 0x13A(0x2)
	struct FRotator TargetRot; // 0x13C(0xC)
	float RotateInterpSpeed; // 0x148(0x4)
	uint8_t Pad_0x14C[0x4]; // 0x14C(0x4)

	// Object: Function UAGame.InventoryFultonRecoveryComponent.SetFultonOwner
	// Flags: [Final|Native|Public]
	// Offset: 0x9f7143c
	// Params: [ Num(1) Size(0x8) ]
	void SetFultonOwner(struct APlayerController* InOwner);

	// Object: Function UAGame.InventoryFultonRecoveryComponent.PlayCountDownToast
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f714e4
	// Params: [ Num(0) Size(0x0) ]
	void PlayCountDownToast();

	// Object: Function UAGame.InventoryFultonRecoveryComponent.OnRep_bPlayRecycleAnim
	// Flags: [Final|Native|Public]
	// Offset: 0x9f71428
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_bPlayRecycleAnim();

	// Object: Function UAGame.InventoryFultonRecoveryComponent.OnPlayerFinishGame
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f71520
	// Params: [ Num(3) Size(0x18) ]
	void OnPlayerFinishGame(struct APlayerController* PlayerController, EPlayerEndGameType FinishType, struct AActor* EscapeVolume);

	// Object: Function UAGame.InventoryFultonRecoveryComponent.OnOwnerSettle
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f7172c
	// Params: [ Num(1) Size(0x8) ]
	void OnOwnerSettle(struct APlayerController* PlayerController);

	// Object: Function UAGame.InventoryFultonRecoveryComponent.OnOwnerDied
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f717d4
	// Params: [ Num(3) Size(0x18) ]
	void OnOwnerDied(struct ACharacter* DeadCharacter, struct AController* Killer, struct UDamageEventObject* DamageEventObject);

	// Object: Function UAGame.InventoryFultonRecoveryComponent.OnNewActorSpawned
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f71648
	// Params: [ Num(2) Size(0x10) ]
	void OnNewActorSpawned(struct AActor* SpawnedActor, struct APlayerController* Controller);

	// Object: Function UAGame.InventoryFultonRecoveryComponent.FultonStartUpEnd
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f714f8
	// Params: [ Num(0) Size(0x0) ]
	void FultonStartUpEnd();

	// Object: Function UAGame.InventoryFultonRecoveryComponent.FultonStartUp
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f7150c
	// Params: [ Num(0) Size(0x0) ]
	void FultonStartUp();
};

// Object: Class UAGame.MediaPlayerController
// Size: 0x338 (Inherited: 0x300)
struct AMediaPlayerController : AActor
{
	DEFINE_UE_CLASS_HELPERS(AMediaPlayerController, "MediaPlayerController")

	struct UMediaPlayer* MediaPlayer; // 0x300(0x8)
	uint8_t Pad_0x308[0x30]; // 0x308(0x30)

	// Object: Function UAGame.MediaPlayerController.OpenVideo
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x7509d30
	// Params: [ Num(2) Size(0x11) ]
	void OpenVideo(struct FString URL, const bool& Loop);
};

// Object: Class UAGame.MFMissionVariableWrite_ActorReference
// Size: 0x68 (Inherited: 0x50)
struct UMFMissionVariableWrite_ActorReference : UMFMissionVariableWriteBase
{
	DEFINE_UE_CLASS_HELPERS(UMFMissionVariableWrite_ActorReference, "MFMissionVariableWrite_ActorReference")

	struct FMissionActorReference Value; // 0x50(0x18)
};

// Object: Class UAGame.MFMobileGamePadViewEffect
// Size: 0x3B0 (Inherited: 0x3A8)
struct UMFMobileGamePadViewEffect : UMFMobileGamePadView
{
	DEFINE_UE_CLASS_HELPERS(UMFMobileGamePadViewEffect, "MFMobileGamePadViewEffect")

	struct USoundIndicatorWidget* SoundIndicatorHUD; // 0x3A8(0x8)
};

// Object: Class UAGame.MFSlider
// Size: 0x548 (Inherited: 0x548)
struct UMFSlider : USlider
{
	DEFINE_UE_CLASS_HELPERS(UMFSlider, "MFSlider")
};

// Object: Class UAGame.MiniMapDisplayRadiusVolume
// Size: 0x3C0 (Inherited: 0x3B8)
struct AMiniMapDisplayRadiusVolume : ASGVolume
{
	DEFINE_UE_CLASS_HELPERS(AMiniMapDisplayRadiusVolume, "MiniMapDisplayRadiusVolume")

	float MapDisplayRadius; // 0x3B8(0x4)
	uint8_t Pad_0x3BC[0x4]; // 0x3BC(0x4)

	// Object: Function UAGame.MiniMapDisplayRadiusVolume.GetMapDisplayRadius
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x9f77fb0
	// Params: [ Num(1) Size(0x4) ]
	float GetMapDisplayRadius();

	// Object: Function UAGame.MiniMapDisplayRadiusVolume.FindOverlappingVolumeRadius
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x9f77ebc
	// Params: [ Num(3) Size(0x10) ]
	static int32_t FindOverlappingVolumeRadius(struct UObject* WorldContextObject, float& DisplayRadius);
};

// Object: Class UAGame.NewTraceableActorInfo_StructLib
// Size: 0x28 (Inherited: 0x28)
struct UNewTraceableActorInfo_StructLib : UBlueprintFunctionLibrary
{
	DEFINE_UE_CLASS_HELPERS(UNewTraceableActorInfo_StructLib, "NewTraceableActorInfo_StructLib")

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.TryGetEscapePointID
	// Flags: [Final|Native|Static|Public|HasOutParms]
	// Offset: 0x9f7830c
	// Params: [ Num(2) Size(0xB4) ]
	static int32_t TryGetEscapePointID(struct FNewTraceableActorInfo& TempTraceInfo);

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.ToString
	// Flags: [Final|Native|Static|Public|HasOutParms]
	// Offset: 0x9f78498
	// Params: [ Num(2) Size(0xC0) ]
	static struct FString ToString(struct FNewTraceableActorInfo& TempTraceInfo);

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.IsSame
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f7891c
	// Params: [ Num(3) Size(0x161) ]
	static bool IsSame(struct FNewTraceableActorInfo& LeftTraceInfo, const struct FNewTraceableActorInfo& RightTraceInfo);

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.IsNeedDisplay
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f78d6c
	// Params: [ Num(4) Size(0xBA) ]
	static bool IsNeedDisplay(struct FNewTraceableActorInfo& TempTraceInfo, struct UObject* WorldContextObject, ENewTraceDisplayPlatform PlatformType);

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.IsDefault
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f78bdc
	// Params: [ Num(2) Size(0xB1) ]
	static bool IsDefault(struct FNewTraceableActorInfo& TempTraceInfo);

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.GetTraceSyncRule
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f78f88
	// Params: [ Num(3) Size(0xB9) ]
	static ENewTraceSyncRule GetTraceSyncRule(struct FNewTraceableActorInfo& TempTraceInfo, struct UObject* WorldContextObject);

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.GetTraceStyleTableByConfigID
	// Flags: [Final|Native|Static|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f78680
	// Params: [ Num(3) Size(0x210) ]
	static struct FUANewTraceStyleTable GetTraceStyleTableByConfigID(int32_t InConfigID, struct UObject* WorldContextObject);

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.GetTraceStyleTable
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure]
	// Offset: 0x9298fcc
	// Params: [ Num(3) Size(0x2B8) ]
	static struct FUANewTraceStyleTable GetTraceStyleTable(struct FNewTraceableActorInfo& TempTraceInfo, struct UObject* WorldContextObject);

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.GetTraceMarkType
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure]
	// Offset: 0x73337f0
	// Params: [ Num(3) Size(0xB9) ]
	static ENewTraceableMarkType GetTraceMarkType(struct FNewTraceableActorInfo& TempTraceInfo, struct UObject* WorldContextObject);

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.GetTraceHash
	// Flags: [Final|Native|Static|Public|HasOutParms]
	// Offset: 0x9f78790
	// Params: [ Num(2) Size(0xB4) ]
	static uint32_t GetTraceHash(struct FNewTraceableActorInfo& TempTraceInfo);

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.GetStyleParamsUMGType
	// Flags: [Final|Native|Static|Public|HasOutParms]
	// Offset: 0x9f77fd4
	// Params: [ Num(3) Size(0xE0) ]
	static struct TSoftClassPtr<struct UUserWidget*> GetStyleParamsUMGType(struct FNewTraceableActorInfo& TempTraceInfo, struct UObject* WorldContextObject);

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.GetScanningInterval
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f7915c
	// Params: [ Num(3) Size(0xBC) ]
	static float GetScanningInterval(struct FNewTraceableActorInfo& TempTraceInfo, struct UObject* WorldContextObject);

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.GetOwner
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f79330
	// Params: [ Num(2) Size(0xB8) ]
	static struct AActor* GetOwner(struct FNewTraceableActorInfo& TempTraceInfo);

	// Object: Function UAGame.NewTraceableActorInfo_StructLib.EqualFunc
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f794bc
	// Params: [ Num(3) Size(0x161) ]
	static bool EqualFunc(struct FNewTraceableActorInfo& LeftTraceInfo, const struct FNewTraceableActorInfo& RightTraceInfo);
};

// Object: Class UAGame.PieChart
// Size: 0x1A0 (Inherited: 0x130)
struct UPieChart : UWidget
{
	DEFINE_UE_CLASS_HELPERS(UPieChart, "PieChart")

	int32_t NumSegments; // 0x12C(0x4)
	int32_t Offset; // 0x130(0x4)
	float OuterMaxRadius; // 0x134(0x4)
	float OuterMinRadius; // 0x138(0x4)
	float HighLightRadius; // 0x13C(0x4)
	float InnerRadius; // 0x140(0x4)
	bool isShowText; // 0x144(0x1)
	bool isShowLine; // 0x145(0x1)
	struct TArray<struct FColor> ColorArray; // 0x148(0x10)
	struct TArray<struct FColor> HighLightColorArray; // 0x158(0x10)
	uint8_t Pad_0x16A[0x36]; // 0x16A(0x36)

	// Object: Function UAGame.PieChart.SetValuArray
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x9f79c6c
	// Params: [ Num(1) Size(0x10) ]
	void SetValuArray(const struct TArray<float>& PercentArray);

	// Object: Function UAGame.PieChart.SetHightLightColorArray
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x9f79aa4
	// Params: [ Num(1) Size(0x10) ]
	void SetHightLightColorArray(const struct TArray<struct FColor>& InColorArray);

	// Object: Function UAGame.PieChart.SetColorArray
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x9f79b88
	// Params: [ Num(1) Size(0x10) ]
	void SetColorArray(const struct TArray<struct FColor>& InColorArray);

	// Object: Function UAGame.PieChart.GetLocation_Position
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x9f799c0
	// Params: [ Num(1) Size(0x10) ]
	void GetLocation_Position(const struct TArray<float>& Location_Position);
};

// Object: Class UAGame.PylonPoint
// Size: 0x328 (Inherited: 0x328)
struct APylonPoint : ANavigationObjectBase
{
	DEFINE_UE_CLASS_HELPERS(APylonPoint, "PylonPoint")

	int32_t PylonID; // 0x324(0x4)

	// Object: Function UAGame.PylonPoint.ResetAllPylonPointID
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f79f08
	// Params: [ Num(0) Size(0x0) ]
	void ResetAllPylonPointID();

	// Object: Function UAGame.PylonPoint.PrintAllNearByLootPoint
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f79d70
	// Params: [ Num(1) Size(0x4) ]
	void PrintAllNearByLootPoint(float Distance);

	// Object: Function UAGame.PylonPoint.GetPositionKey
	// Flags: [Final|Native|Public|HasDefaults]
	// Offset: 0x9f79e18
	// Params: [ Num(3) Size(0x18) ]
	struct FIntPoint GetPositionKey(struct FVector WorldLocation, float GridSize);
};

// Object: Class UAGame.QuestAction_CompleteEvent_G
// Size: 0xE8 (Inherited: 0xE8)
struct UQuestAction_CompleteEvent_G : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_CompleteEvent_G, "QuestAction_CompleteEvent_G")

	// Object: Function UAGame.QuestAction_CompleteEvent_G.OnQuestStateChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f79f24
	// Params: [ Num(2) Size(0x2) ]
	void OnQuestStateChange(EQuestStatus NewState, EQuestStatus OldState);
};

// Object: Class UAGame.QuestAction_Damage_T
// Size: 0xF0 (Inherited: 0xE8)
struct UQuestAction_Damage_T : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_Damage_T, "QuestAction_Damage_T")

	ECharacterEnduranceType EnduranceType; // 0xE8(0x1)
	uint8_t Pad_0xE9[0x7]; // 0xE9(0x7)
};

// Object: Class UAGame.QuestAction_Debuff_T
// Size: 0x100 (Inherited: 0xE8)
struct UQuestAction_Debuff_T : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_Debuff_T, "QuestAction_Debuff_T")

	ECharacterEnduranceType EnduranceType; // 0xE8(0x1)
	uint8_t Pad_0xE9[0x7]; // 0xE9(0x7)
	struct FString BuffName; // 0xF0(0x10)

	// Object: Function UAGame.QuestAction_Debuff_T.AddDebuff
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f7a020
	// Params: [ Num(0) Size(0x0) ]
	void AddDebuff();
};

// Object: Class UAGame.QuestAction_FinishQuest
// Size: 0xE8 (Inherited: 0xE8)
struct UQuestAction_FinishQuest : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_FinishQuest, "QuestAction_FinishQuest")

	// Object: Function UAGame.QuestAction_FinishQuest.OnQuestStateChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f7a03c
	// Params: [ Num(4) Size(0x18) ]
	void OnQuestStateChange(struct AActor* Owner, struct AActor* QuestActor, int32_t NewState, int32_t OldState);
};

// Object: Class UAGame.QuestAction_FollowBar_T
// Size: 0x120 (Inherited: 0xE8)
struct UQuestAction_FollowBar_T : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_FollowBar_T, "QuestAction_FollowBar_T")

	ETutorialFlowBarType FlowBarType; // 0xE8(0x1)
	bool bShow; // 0xE9(0x1)
	uint8_t Pad_0xEA[0x6]; // 0xEA(0x6)
	struct AActor* TargetActor; // 0xF0(0x8)
	struct FVector Offset; // 0xF8(0xC)
	uint8_t Pad_0x104[0x4]; // 0x104(0x4)
	struct FString TextStrKey; // 0x108(0x10)
	bool IsLocalOffset; // 0x118(0x1)
	bool IsDetiveAction; // 0x119(0x1)
	uint8_t Pad_0x11A[0x6]; // 0x11A(0x6)
};

// Object: Class UAGame.QuestAction_HUDMask_T
// Size: 0xF8 (Inherited: 0xE8)
struct UQuestAction_HUDMask_T : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_HUDMask_T, "QuestAction_HUDMask_T")

	int32_t Maskid; // 0xE8(0x4)
	bool bShow; // 0xEC(0x1)
	bool IsDeactiveAction; // 0xED(0x1)
	bool bShowMaskVisual; // 0xEE(0x1)
	uint8_t Pad_0xEF[0x9]; // 0xEF(0x9)
};

// Object: Class UAGame.QuestAction_HudMessage_T
// Size: 0x110 (Inherited: 0xE8)
struct UQuestAction_HudMessage_T : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_HudMessage_T, "QuestAction_HudMessage_T")

	struct TArray<int64_t> MessageArray; // 0xE8(0x10)
	struct TArray<int64_t> ClearMessageArray; // 0xF8(0x10)
	bool IsDetiveAction; // 0x108(0x1)
	uint8_t Pad_0x109[0x7]; // 0x109(0x7)
};

// Object: Class UAGame.QuestAction_InputChange_T
// Size: 0xF0 (Inherited: 0xE8)
struct UQuestAction_InputChange_T : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_InputChange_T, "QuestAction_InputChange_T")

	EUAGamePadTable PadButtonType; // 0xE8(0x1)
	bool bShow; // 0xE9(0x1)
	bool IsDetiveAction; // 0xEA(0x1)
	bool bLimitInput; // 0xEB(0x1)
	uint8_t Pad_0xEC[0x4]; // 0xEC(0x4)
};

// Object: Class UAGame.QuestAction_InventoryDestroyed
// Size: 0x100 (Inherited: 0xE8)
struct UQuestAction_InventoryDestroyed : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_InventoryDestroyed, "QuestAction_InventoryDestroyed")

	struct TArray<int32_t> InventoryIDs; // 0xE8(0x10)
	EInventoryDestroyedEffectType EffectType; // 0xF8(0x1)
	uint8_t Pad_0xF9[0x7]; // 0xF9(0x7)

	// Object: Function UAGame.QuestAction_InventoryDestroyed.OnActorSpawned
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f7a338
	// Params: [ Num(1) Size(0x8) ]
	void OnActorSpawned(struct AActor* InActor);

	// Object: Function UAGame.QuestAction_InventoryDestroyed.OnActorDestroyed
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f7a290
	// Params: [ Num(1) Size(0x8) ]
	void OnActorDestroyed(struct AActor* DestroyedActor);
};

// Object: Class UAGame.QuestAction_ItemMenu_T
// Size: 0xF0 (Inherited: 0xE8)
struct UQuestAction_ItemMenu_T : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_ItemMenu_T, "QuestAction_ItemMenu_T")

	bool bEnable; // 0xE8(0x1)
	bool IsDeactiveAction; // 0xE9(0x1)
	uint8_t Pad_0xEA[0x6]; // 0xEA(0x6)
};

// Object: Class UAGame.QuestAction_LetVolumeInteractable
// Size: 0x1B8 (Inherited: 0xE8)
struct UQuestAction_LetVolumeInteractable : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_LetVolumeInteractable, "QuestAction_LetVolumeInteractable")

	struct TArray<int32_t> MapIds; // 0xE8(0x10)
	struct FString VolumeName; // 0xF8(0x10)
	bool bForceUsePointMark; // 0x108(0x1)
	bool bEnterVolumeAutoComplete; // 0x109(0x1)
	uint8_t Pad_0x10A[0x6]; // 0x10A(0x6)
	struct FUserWidgetPopInfo UserWidgetPopInfo; // 0x110(0x70)
	bool bCheckCostBeforePopWidget; // 0x180(0x1)
	uint8_t Pad_0x181[0x7]; // 0x181(0x7)
	struct TArray<struct FInteractInventoryInfo> CostInventoryInfos; // 0x188(0x10)
	struct TArray<struct FInteractInventoryInfo> ObtainInventoryInfos; // 0x198(0x10)
	struct ASGVolume* ValidVolume; // 0x1A8(0x8)
	bool bAlreadyGathered; // 0x1B0(0x1)
	uint8_t Pad_0x1B1[0x7]; // 0x1B1(0x7)

	// Object: Function UAGame.QuestAction_LetVolumeInteractable.OnQuestStateChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f7a40c
	// Params: [ Num(2) Size(0x2) ]
	void OnQuestStateChange(EQuestStatus NewState, EQuestStatus OldState);
};

// Object: Class UAGame.QuestAction_LockInput_T
// Size: 0xF0 (Inherited: 0xE8)
struct UQuestAction_LockInput_T : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_LockInput_T, "QuestAction_LockInput_T")

	bool bLock; // 0xE8(0x1)
	bool IsDeactiveAction; // 0xE9(0x1)
	uint8_t Pad_0xEA[0x6]; // 0xEA(0x6)
};

// Object: Class UAGame.QuestAction_MessageInState_T
// Size: 0x168 (Inherited: 0xE8)
struct UQuestAction_MessageInState_T : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_MessageInState_T, "QuestAction_MessageInState_T")

	uint8_t Pad_0xE8[0x18]; // 0xE8(0x18)
	ETutorialCharacterState characterState; // 0x100(0x1)
	uint8_t Pad_0x101[0x7]; // 0x101(0x7)
	struct TArray<int64_t> InStateMessageArray; // 0x108(0x10)
	struct TArray<int64_t> InStateClearMessageArray; // 0x118(0x10)
	EGamePadEffectTable InStateEffect; // 0x128(0x1)
	uint8_t Pad_0x129[0x7]; // 0x129(0x7)
	struct TArray<int64_t> NotInStateMessageArray; // 0x130(0x10)
	struct TArray<int64_t> NotInStateClearMessageArray; // 0x140(0x10)
	EGamePadEffectTable NotInStateEffect; // 0x150(0x1)
	EUAGamePadTable InStatePadButtonType; // 0x151(0x1)
	EUAGamePadHightWidgetTable InStateHightWidget; // 0x152(0x1)
	uint8_t Pad_0x153[0x1]; // 0x153(0x1)
	struct FVector2D InStateOffSet; // 0x154(0x8)
	EUAGamePadTable NotInStatePadButtonType; // 0x15C(0x1)
	EUAGamePadHightWidgetTable NotInStateHightWidget; // 0x15D(0x1)
	uint8_t Pad_0x15E[0x2]; // 0x15E(0x2)
	struct FVector2D NotInStateOffSet; // 0x160(0x8)

	// Object: Function UAGame.QuestAction_MessageInState_T.IsInState
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f7a578
	// Params: [ Num(1) Size(0x1) ]
	bool IsInState();

	// Object: Function UAGame.QuestAction_MessageInState_T.BroadCastNoInstateHighEffect
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f7a550
	// Params: [ Num(0) Size(0x0) ]
	void BroadCastNoInstateHighEffect();

	// Object: Function UAGame.QuestAction_MessageInState_T.BroadCastInstateHighEffect
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f7a564
	// Params: [ Num(0) Size(0x0) ]
	void BroadCastInstateHighEffect();
};

// Object: Class UAGame.QuestAction_MoveVolumeParticle_T
// Size: 0xF8 (Inherited: 0xE8)
struct UQuestAction_MoveVolumeParticle_T : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_MoveVolumeParticle_T, "QuestAction_MoveVolumeParticle_T")

	struct AUAMTutorialMoveToVolume* MoveVolume; // 0xE8(0x8)
	bool bShow; // 0xF0(0x1)
	bool IsDetiveAction; // 0xF1(0x1)
	uint8_t Pad_0xF2[0x6]; // 0xF2(0x6)
};

// Object: Class UAGame.QuestAction_PadHightEffect_T
// Size: 0xF8 (Inherited: 0xE8)
struct UQuestAction_PadHightEffect_T : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_PadHightEffect_T, "QuestAction_PadHightEffect_T")

	EUAGamePadTable PadButtonType; // 0xE8(0x1)
	EUAGamePadHightWidgetTable HightWidget; // 0xE9(0x1)
	uint8_t Pad_0xEA[0x2]; // 0xEA(0x2)
	struct FVector2D Offset; // 0xEC(0x8)
	bool bShow; // 0xF4(0x1)
	bool IsDetiveAction; // 0xF5(0x1)
	uint8_t Pad_0xF6[0x2]; // 0xF6(0x2)

	// Object: Function UAGame.QuestAction_PadHightEffect_T.BroadCastHighEffect
	// Flags: [Final|Native|Public]
	// Offset: 0x9f80258
	// Params: [ Num(0) Size(0x0) ]
	void BroadCastHighEffect();
};

// Object: Class UAGame.QuestAction_QuestReport
// Size: 0x118 (Inherited: 0xE8)
struct UQuestAction_QuestReport : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_QuestReport, "QuestAction_QuestReport")

	struct TArray<int32_t> AcitveReportIDList; // 0xE8(0x10)
	struct TArray<int32_t> SuccessReportIDList; // 0xF8(0x10)
	struct TArray<int32_t> FaildReportIDList; // 0x108(0x10)

	// Object: Function UAGame.QuestAction_QuestReport.OnQuestStateChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f8028c
	// Params: [ Num(2) Size(0x2) ]
	void OnQuestStateChange(EQuestStatus NewState, EQuestStatus OldState);
};

// Object: Class UAGame.QuestAction_RelevantToActors
// Size: 0x148 (Inherited: 0xE8)
struct UQuestAction_RelevantToActors : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_RelevantToActors, "QuestAction_RelevantToActors")

	struct TArray<struct AActor*> TargetActors; // 0xE8(0x10)
	struct TArray<int32_t> InteractItemIDs; // 0xF8(0x10)
	struct TArray<int32_t> VolumeItemIDs; // 0x108(0x10)
	struct TArray<int32_t> InventoryItemIDs; // 0x118(0x10)
	struct TArray<int32_t> AIIDs; // 0x128(0x10)
	bool bForceUsePointMark; // 0x138(0x1)
	ETraceMarkOperatorType OperatorType; // 0x139(0x1)
	ETraceableMarkType MarkType; // 0x13A(0x1)
	uint8_t Pad_0x13B[0x1]; // 0x13B(0x1)
	float ScanningInterval; // 0x13C(0x4)
	int32_t ConfigID; // 0x140(0x4)
	uint8_t Pad_0x144[0x4]; // 0x144(0x4)

	// Object: Function UAGame.QuestAction_RelevantToActors.OnKilledEvent
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x9f8037c
	// Params: [ Num(2) Size(0x178) ]
	void OnKilledEvent(struct APawn* KilledPawn, const struct FKillInfo& KillInfo);
};

// Object: Class UAGame.QuestAction_SoundUI_T
// Size: 0xF0 (Inherited: 0xE8)
struct UQuestAction_SoundUI_T : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_SoundUI_T, "QuestAction_SoundUI_T")

	bool bShow; // 0xE8(0x1)
	bool IsDetiveAction; // 0xE9(0x1)
	uint8_t Pad_0xEA[0x6]; // 0xEA(0x6)
};

// Object: Class UAGame.QuestInteractItemSpawnInfo
// Size: 0x40 (Inherited: 0x28)
struct UQuestInteractItemSpawnInfo : UObject
{
	DEFINE_UE_CLASS_HELPERS(UQuestInteractItemSpawnInfo, "QuestInteractItemSpawnInfo")

	struct AQuestItemSpawnPoint* InventorySpawnPoint; // 0x28(0x8)
	struct ASGNetRelevantConfigurableActor* InteractItemClass; // 0x30(0x8)
	bool bCheckPlacement; // 0x38(0x1)
	ETraceMarkOperatorType OperatorType; // 0x39(0x1)
	uint8_t Pad_0x3A[0x2]; // 0x3A(0x2)
	int32_t ConfigID; // 0x3C(0x4)
};

// Object: Class UAGame.QuestAction_SpawnInteractItem
// Size: 0x110 (Inherited: 0xE8)
struct UQuestAction_SpawnInteractItem : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_SpawnInteractItem, "QuestAction_SpawnInteractItem")

	struct TArray<struct UQuestInteractItemSpawnInfo*> QuestInteractItemSpawnInfos; // 0xE8(0x10)
	struct TArray<struct ASGNetRelevantConfigurableActor*> SpawnedInteractItem; // 0xF8(0x10)
	bool bDontDestroyOnDeactive; // 0x108(0x1)
	uint8_t Pad_0x109[0x7]; // 0x109(0x7)
};

// Object: Class UAGame.QuestAction_SpawnQuestDistributer
// Size: 0xF8 (Inherited: 0xE8)
struct UQuestAction_SpawnQuestDistributer : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_SpawnQuestDistributer, "QuestAction_SpawnQuestDistributer")

	int32_t MapID; // 0xE8(0x4)
	uint8_t Pad_0xEC[0x4]; // 0xEC(0x4)
	struct AMFQuestDistributerBase* DistributerClass; // 0xF0(0x8)
};

// Object: Class UAGame.QuestInventorySpawnInfo
// Size: 0x48 (Inherited: 0x28)
struct UQuestInventorySpawnInfo : UObject
{
	DEFINE_UE_CLASS_HELPERS(UQuestInventorySpawnInfo, "QuestInventorySpawnInfo")

	struct AQuestItemSpawnPoint* InventorySpawnPoint; // 0x28(0x8)
	uint64_t itemID; // 0x30(0x8)
	int32_t ItemStackCount; // 0x38(0x4)
	bool bCheckPlacement; // 0x3C(0x1)
	ETraceMarkOperatorType OperatorType; // 0x3D(0x1)
	ETraceableMarkType MarkType; // 0x3E(0x1)
	uint8_t Pad_0x3F[0x1]; // 0x3F(0x1)
	float ScanningInterval; // 0x40(0x4)
	int32_t ConfigID; // 0x44(0x4)
};

// Object: Class UAGame.QuestAction_SpawnQuestInventory
// Size: 0x120 (Inherited: 0xE8)
struct UQuestAction_SpawnQuestInventory : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_SpawnQuestInventory, "QuestAction_SpawnQuestInventory")

	struct TArray<struct UQuestInventorySpawnInfo*> QuestInventorySpawnInfos; // 0xE8(0x10)
	int32_t SpawnInventoryNum; // 0xF8(0x4)
	uint8_t Pad_0xFC[0x4]; // 0xFC(0x4)
	struct TArray<struct FQuestActionSpawnInventoryInfo> SpawnInventoryInfos; // 0x100(0x10)
	struct TArray<struct ASGInventory*> SpawnedQuestInventorys; // 0x110(0x10)
};

// Object: Class UAGame.QuestAction_TimeLimitCountDown
// Size: 0x150 (Inherited: 0xE8)
struct UQuestAction_TimeLimitCountDown : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_TimeLimitCountDown, "QuestAction_TimeLimitCountDown")

	float CountDownStartSecond; // 0xE8(0x4)
	float RemainTime; // 0xEC(0x4)
	float RemainTimeUpdateServerTime; // 0xF0(0x4)
	uint8_t Pad_0xF4[0x4]; // 0xF4(0x4)
	struct FTimerHandle CountDownTimerHandle; // 0xF8(0x8)
	struct TArray<struct AActor*> TargetActors; // 0x100(0x10)
	struct TArray<int32_t> InteractItemIDs; // 0x110(0x10)
	struct TArray<int32_t> VolumeItemIDs; // 0x120(0x10)
	struct TArray<int32_t> InventoryItemIDs; // 0x130(0x10)
	struct TArray<int32_t> AIIDs; // 0x140(0x10)

	// Object: Function UAGame.QuestAction_TimeLimitCountDown.SetMissionRemainTime
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f80664
	// Params: [ Num(0) Size(0x0) ]
	void SetMissionRemainTime();

	// Object: Function UAGame.QuestAction_TimeLimitCountDown.RemoveQuestTraceInfo
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f80628
	// Params: [ Num(0) Size(0x0) ]
	void RemoveQuestTraceInfo();

	// Object: Function UAGame.QuestAction_TimeLimitCountDown.OnRep_RemainTime
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f80650
	// Params: [ Num(0) Size(0x0) ]
	void OnRep_RemainTime();

	// Object: Function UAGame.QuestAction_TimeLimitCountDown.OnQuestStateChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f80678
	// Params: [ Num(2) Size(0x2) ]
	void OnQuestStateChange(EQuestStatus NewState, EQuestStatus OldState);

	// Object: Function UAGame.QuestAction_TimeLimitCountDown.OnFinishCountDown
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f8063c
	// Params: [ Num(0) Size(0x0) ]
	void OnFinishCountDown();

	// Object: Function UAGame.QuestAction_TimeLimitCountDown.GetServerWorldTime
	// Flags: [Final|Native|Public|Const]
	// Offset: 0x9f80798
	// Params: [ Num(1) Size(0x4) ]
	float GetServerWorldTime();

	// Object: Function UAGame.QuestAction_TimeLimitCountDown.GetRemainTime
	// Flags: [Final|Native|Public]
	// Offset: 0x9f807cc
	// Params: [ Num(1) Size(0x4) ]
	float GetRemainTime();

	// Object: Function UAGame.QuestAction_TimeLimitCountDown.GetQuestRemainTimeUpdateServerTime
	// Flags: [Final|Native|Public]
	// Offset: 0x9f80760
	// Params: [ Num(1) Size(0x4) ]
	float GetQuestRemainTimeUpdateServerTime();

	// Object: Function UAGame.QuestAction_TimeLimitCountDown.GetQuestRemainTime
	// Flags: [Final|Native|Public]
	// Offset: 0x9f8077c
	// Params: [ Num(1) Size(0x4) ]
	float GetQuestRemainTime();
};

// Object: Class UAGame.QuestAction_WidgetEffect_T
// Size: 0xF0 (Inherited: 0xE8)
struct UQuestAction_WidgetEffect_T : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestAction_WidgetEffect_T, "QuestAction_WidgetEffect_T")

	EGamePadEffectTable PadEffectType; // 0xE8(0x1)
	bool bShow; // 0xE9(0x1)
	bool IsDetiveAction; // 0xEA(0x1)
	uint8_t Pad_0xEB[0x5]; // 0xEB(0x5)
};

// Object: Class UAGame.QuestActionComp_SendNPCRequest
// Size: 0x108 (Inherited: 0xE8)
struct UQuestActionComp_SendNPCRequest : UMFQuestActionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestActionComp_SendNPCRequest, "QuestActionComp_SendNPCRequest")

	uint8_t Pad_0xE8[0x8]; // 0xE8(0x8)
	struct AActor* DestinationActor; // 0xF0(0x8)
	float Timeout; // 0xF8(0x4)
	uint8_t Pad_0xFC[0xC]; // 0xFC(0xC)

	// Object: Function UAGame.QuestActionComp_SendNPCRequest.RequestStep
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x5d8cbc8
	// Params: [ Num(1) Size(0x4) ]
	void RequestStep(int32_t Step);

	// Object: Function UAGame.QuestActionComp_SendNPCRequest.OnRequestTimeout
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f80954
	// Params: [ Num(0) Size(0x0) ]
	void OnRequestTimeout();

	// Object: Function UAGame.QuestActionComp_SendNPCRequest.OnQuestProgressed
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f80a10
	// Params: [ Num(2) Size(0x8) ]
	void OnQuestProgressed(int32_t ProgressToAdd, int32_t CurrentProgress);

	// Object: Function UAGame.QuestActionComp_SendNPCRequest.OnQuestDeactived
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f80968
	// Params: [ Num(1) Size(0x1) ]
	void OnQuestDeactived(EQuestStatus InResult);

	// Object: Function UAGame.QuestActionComp_SendNPCRequest.GetOwnerQuest
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x9f80af4
	// Params: [ Num(1) Size(0x8) ]
	struct AMFQuestBase* GetOwnerQuest();

	// Object: Function UAGame.QuestActionComp_SendNPCRequest.GetActionOwner
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure|Const]
	// Offset: 0x9f80b28
	// Params: [ Num(1) Size(0x8) ]
	struct ASGCharacter* GetActionOwner();

	// Object: Function UAGame.QuestActionComp_SendNPCRequest.FinishQuest
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f80b5c
	// Params: [ Num(0) Size(0x0) ]
	void FinishQuest();

	// Object: Function UAGame.QuestActionComp_SendNPCRequest.EndQuestAction
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x5d8cbc8
	// Params: [ Num(0) Size(0x0) ]
	void EndQuestAction();
};

// Object: Class UAGame.QuestBase
// Size: 0x3F8 (Inherited: 0x3E0)
struct AQuestBase : AMFQuestBase
{
	DEFINE_UE_CLASS_HELPERS(AQuestBase, "QuestBase")

	bool bClearProgressWhenFinishGame; // 0x3E0(0x1)
	uint8_t Pad_0x3E1[0x7]; // 0x3E1(0x7)
	struct UQuestTraceInfoComponent* QuestTraceInfoComponent; // 0x3E8(0x8)
	uint8_t Pad_0x3F0[0x8]; // 0x3F0(0x8)

	// Object: Function UAGame.QuestBase.OnPlayerFinishGame
	// Flags: [Final|Native|Public]
	// Offset: 0x9f80c58
	// Params: [ Num(3) Size(0x18) ]
	void OnPlayerFinishGame(struct APlayerController* PlayerController, EPlayerEndGameType FinishType, struct AActor* EscapeVolume);

	// Object: Function UAGame.QuestBase.GetQuestTraceInfoComponent
	// Flags: [Final|Native|Public|Const]
	// Offset: 0x9f80c24
	// Params: [ Num(1) Size(0x8) ]
	struct UQuestTraceInfoComponent* GetQuestTraceInfoComponent();

	// Object: Function UAGame.QuestBase.GetMaxProgress
	// Flags: [Final|Native|Public]
	// Offset: 0x9f80d80
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetMaxProgress();

	// Object: Function UAGame.QuestBase.GetCurrProgress
	// Flags: [Final|Native|Public]
	// Offset: 0x9f80db4
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetCurrProgress();
};

// Object: Class UAGame.QuestConditionComp_ArmorType
// Size: 0x58 (Inherited: 0x50)
struct UQuestConditionComp_ArmorType : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_ArmorType, "QuestConditionComp_ArmorType")

	bool bEqualType; // 0x50(0x1)
	ESGArmorType ArmorType; // 0x51(0x1)
	uint8_t Pad_0x52[0x6]; // 0x52(0x6)
};

// Object: Class UAGame.QuestConditionComp_CharacterEnduranceType
// Size: 0x70 (Inherited: 0x50)
struct UQuestConditionComp_CharacterEnduranceType : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CharacterEnduranceType, "QuestConditionComp_CharacterEnduranceType")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	ECharacterEnduranceType CharacterEnduranceType; // 0x58(0x1)
	uint8_t Pad_0x59[0x7]; // 0x59(0x7)
	struct TArray<ECharacterEnduranceType> CharacterEnduranceTypes; // 0x60(0x10)
};

// Object: Class UAGame.QuestConditionComp_CharacterGameEffectType
// Size: 0x60 (Inherited: 0x50)
struct UQuestConditionComp_CharacterGameEffectType : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CharacterGameEffectType, "QuestConditionComp_CharacterGameEffectType")

	struct TArray<ECharacterGameEffectType> CharacterGameEffectTypes; // 0x50(0x10)
};

// Object: Class UAGame.QuestConditionComp_CharacterState_T
// Size: 0x60 (Inherited: 0x50)
struct UQuestConditionComp_CharacterState_T : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CharacterState_T, "QuestConditionComp_CharacterState_T")

	struct UMFQuestContextSourceBase* SourceActorContextConfig; // 0x50(0x8)
	ETutorialCharacterState characterState; // 0x58(0x1)
	ETutorialCharacterStateCheckType CharacterStateCheckType; // 0x59(0x1)
	uint8_t Pad_0x5A[0x6]; // 0x5A(0x6)

	// Object: Function UAGame.QuestConditionComp_CharacterState_T.IsInState
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f80e70
	// Params: [ Num(1) Size(0x1) ]
	bool IsInState();
};

// Object: Class UAGame.QuestConditionComp_CharacterStatus
// Size: 0x80 (Inherited: 0x50)
struct UQuestConditionComp_CharacterStatus : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CharacterStatus, "QuestConditionComp_CharacterStatus")

	EQuestConditionCharacterType CharacterType; // 0x50(0x1)
	EQuestConditionCharacterStatus CharacterStatus; // 0x51(0x1)
	uint8_t Pad_0x52[0x6]; // 0x52(0x6)
	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x58(0x8)
	struct TArray<int32_t> AIIDs; // 0x60(0x10)
	struct TArray<struct FString> AreaIDs; // 0x70(0x10)

	// Object: Function UAGame.QuestConditionComp_CharacterStatus.CheckTeammate
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x9f80fcc
	// Params: [ Num(2) Size(0x11) ]
	bool CheckTeammate(const struct TArray<struct FQuestContextPair>& QuestContextList);

	// Object: Function UAGame.QuestConditionComp_CharacterStatus.CheckAreaIDs
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f810bc
	// Params: [ Num(1) Size(0x1) ]
	bool CheckAreaIDs();

	// Object: Function UAGame.QuestConditionComp_CharacterStatus.CheckAIIDs
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f810f4
	// Params: [ Num(1) Size(0x1) ]
	bool CheckAIIDs();
};

// Object: Class UAGame.QuestConditionComp_CharacterType
// Size: 0x70 (Inherited: 0x50)
struct UQuestConditionComp_CharacterType : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CharacterType, "QuestConditionComp_CharacterType")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	struct TArray<ECharacterType> SpecifiedTypes; // 0x58(0x10)
	int64_t BossGroupID; // 0x68(0x8)
};

// Object: Class UAGame.QuestConditionComp_ChaseActivityState
// Size: 0x58 (Inherited: 0x50)
struct UQuestConditionComp_ChaseActivityState : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_ChaseActivityState, "QuestConditionComp_ChaseActivityState")

	EChaseActivityState ChaseActivityState; // 0x50(0x1)
	uint8_t Pad_0x51[0x7]; // 0x51(0x7)
};

// Object: Class UAGame.QuestConditionComp_CheckAIID
// Size: 0x68 (Inherited: 0x50)
struct UQuestConditionComp_CheckAIID : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CheckAIID, "QuestConditionComp_CheckAIID")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	struct TArray<int64_t> ValidAIIDPrefix; // 0x58(0x10)
};

// Object: Class UAGame.CharacterAttributeCheckInfo
// Size: 0x78 (Inherited: 0x28)
struct UCharacterAttributeCheckInfo : UObject
{
	DEFINE_UE_CLASS_HELPERS(UCharacterAttributeCheckInfo, "CharacterAttributeCheckInfo")

	bool bUseCustomAttribute; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
	struct FGameplayAttribute Attribute; // 0x30(0x38)
	EQuestCheckCustomAttribute CustomAttribute; // 0x68(0x1)
	uint8_t Pad_0x69[0x3]; // 0x69(0x3)
	float MinValue; // 0x6C(0x4)
	float MaxValue; // 0x70(0x4)
	uint8_t Pad_0x74[0x4]; // 0x74(0x4)
};

// Object: Class UAGame.QuestConditionComp_CheckAttribute
// Size: 0x68 (Inherited: 0x50)
struct UQuestConditionComp_CheckAttribute : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CheckAttribute, "QuestConditionComp_CheckAttribute")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	struct TArray<struct UCharacterAttributeCheckInfo*> AttributeCheckInfoList; // 0x58(0x10)
};

// Object: Class UAGame.QuestConditionComp_CheckCharacterEquipItem
// Size: 0x70 (Inherited: 0x50)
struct UQuestConditionComp_CheckCharacterEquipItem : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CheckCharacterEquipItem, "QuestConditionComp_CheckCharacterEquipItem")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	bool bCheckTeammate; // 0x58(0x1)
	ECheckItemType CheckItemType; // 0x59(0x1)
	uint8_t Pad_0x5A[0x6]; // 0x5A(0x6)
	struct TArray<struct UCheckItemParamBase*> CheckParams; // 0x60(0x10)
};

// Object: Class UAGame.CheckDamageInfoParamBase
// Size: 0x28 (Inherited: 0x28)
struct UCheckDamageInfoParamBase : UObject
{
	DEFINE_UE_CLASS_HELPERS(UCheckDamageInfoParamBase, "CheckDamageInfoParamBase")
};

// Object: Class UAGame.CheckCaptureWeaponZoomType
// Size: 0x30 (Inherited: 0x28)
struct UCheckCaptureWeaponZoomType : UCheckDamageInfoParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckCaptureWeaponZoomType, "CheckCaptureWeaponZoomType")

	ESGZoomType ZoomType; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
};

// Object: Class UAGame.CheckDamageTypeClass
// Size: 0x30 (Inherited: 0x28)
struct UCheckDamageTypeClass : UCheckDamageInfoParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckDamageTypeClass, "CheckDamageTypeClass")

	struct UDamageType* DamageTypeClass; // 0x28(0x8)
};

// Object: Class UAGame.CheckBulletItemId
// Size: 0x38 (Inherited: 0x28)
struct UCheckBulletItemId : UCheckDamageInfoParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckBulletItemId, "CheckBulletItemId")

	struct TArray<uint64_t> ValidBulletIds; // 0x28(0x10)
};

// Object: Class UAGame.QuestConditionComp_CheckDamageInfo
// Size: 0x68 (Inherited: 0x50)
struct UQuestConditionComp_CheckDamageInfo : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CheckDamageInfo, "QuestConditionComp_CheckDamageInfo")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	struct TArray<struct UCheckDamageInfoParamBase*> CheckParams; // 0x58(0x10)
};

// Object: Class UAGame.CharacterGameplayTagCheckInfo
// Size: 0x50 (Inherited: 0x28)
struct UCharacterGameplayTagCheckInfo : UObject
{
	DEFINE_UE_CLASS_HELPERS(UCharacterGameplayTagCheckInfo, "CharacterGameplayTagCheckInfo")

	struct FGameplayTagContainer TagContainer; // 0x28(0x20)
	EGameplayTagCheckType CheckType; // 0x48(0x1)
	uint8_t Pad_0x49[0x7]; // 0x49(0x7)
};

// Object: Class UAGame.QuestConditionComp_CheckGameplayEffect
// Size: 0x68 (Inherited: 0x50)
struct UQuestConditionComp_CheckGameplayEffect : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CheckGameplayEffect, "QuestConditionComp_CheckGameplayEffect")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	struct TArray<struct UCharacterGameplayTagCheckInfo*> GameplayTagCheckInfoList; // 0x58(0x10)
};

// Object: Class UAGame.CheckItemParamBase
// Size: 0x28 (Inherited: 0x28)
struct UCheckItemParamBase : UObject
{
	DEFINE_UE_CLASS_HELPERS(UCheckItemParamBase, "CheckItemParamBase")
};

// Object: Class UAGame.CheckItemTypeID
// Size: 0x38 (Inherited: 0x28)
struct UCheckItemTypeID : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckItemTypeID, "CheckItemTypeID")

	struct TArray<uint64_t> ItemTypeIDs; // 0x28(0x10)
};

// Object: Class UAGame.CheckIsTakeInItem
// Size: 0x30 (Inherited: 0x28)
struct UCheckIsTakeInItem : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckIsTakeInItem, "CheckIsTakeInItem")

	bool bIsTakeIn; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
};

// Object: Class UAGame.CheckOccupiedGridCount
// Size: 0x30 (Inherited: 0x28)
struct UCheckOccupiedGridCount : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckOccupiedGridCount, "CheckOccupiedGridCount")

	int32_t OccupiedGridCountMin; // 0x28(0x4)
	int32_t OccupiedGridCountMax; // 0x2C(0x4)
};

// Object: Class UAGame.CheckDurability
// Size: 0x30 (Inherited: 0x28)
struct UCheckDurability : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckDurability, "CheckDurability")

	float MinDurability; // 0x28(0x4)
	float MaxDurability; // 0x2C(0x4)
};

// Object: Class UAGame.CheckWeight
// Size: 0x30 (Inherited: 0x28)
struct UCheckWeight : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckWeight, "CheckWeight")

	float MinWeight; // 0x28(0x4)
	float MaxWeight; // 0x2C(0x4)
};

// Object: Class UAGame.CheckEngonomics
// Size: 0x30 (Inherited: 0x28)
struct UCheckEngonomics : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckEngonomics, "CheckEngonomics")

	float MinEngonomics; // 0x28(0x4)
	float MaxEngonomics; // 0x2C(0x4)
};

// Object: Class UAGame.CheckAccuracy
// Size: 0x30 (Inherited: 0x28)
struct UCheckAccuracy : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckAccuracy, "CheckAccuracy")

	float MinAccuracy; // 0x28(0x4)
	float MaxAccuracy; // 0x2C(0x4)
};

// Object: Class UAGame.CheckHorizontalRecoil
// Size: 0x30 (Inherited: 0x28)
struct UCheckHorizontalRecoil : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckHorizontalRecoil, "CheckHorizontalRecoil")

	float MinHorizontalRecoil; // 0x28(0x4)
	float MaxHorizontalRecoil; // 0x2C(0x4)
};

// Object: Class UAGame.CheckVerticalRecoil
// Size: 0x30 (Inherited: 0x28)
struct UCheckVerticalRecoil : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckVerticalRecoil, "CheckVerticalRecoil")

	float MinVerticalRecoil; // 0x28(0x4)
	float MaxVerticalRecoil; // 0x2C(0x4)
};

// Object: Class UAGame.CheckRequireAdapters
// Size: 0x38 (Inherited: 0x28)
struct UCheckRequireAdapters : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckRequireAdapters, "CheckRequireAdapters")

	struct TArray<uint64_t> RequireAdapters; // 0x28(0x10)
};

// Object: Class UAGame.CheckExclusionAdapters
// Size: 0x38 (Inherited: 0x28)
struct UCheckExclusionAdapters : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckExclusionAdapters, "CheckExclusionAdapters")

	struct TArray<uint64_t> ExclusionAdapters; // 0x28(0x10)
};

// Object: Class UAGame.CheckFireMode
// Size: 0x30 (Inherited: 0x28)
struct UCheckFireMode : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckFireMode, "CheckFireMode")

	ESGWeaponShootingMode FireMode; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
};

// Object: Class UAGame.CheckRuntimeFireRate
// Size: 0x30 (Inherited: 0x28)
struct UCheckRuntimeFireRate : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckRuntimeFireRate, "CheckRuntimeFireRate")

	int32_t MinFireRatePerMinute; // 0x28(0x4)
	int32_t MaxFireRatePerMinute; // 0x2C(0x4)
};

// Object: Class UAGame.CheckSightRange
// Size: 0x30 (Inherited: 0x28)
struct UCheckSightRange : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckSightRange, "CheckSightRange")

	float MinSightRange; // 0x28(0x4)
	float MaxSightRange; // 0x2C(0x4)
};

// Object: Class UAGame.CheckCurrentBulletCount
// Size: 0x30 (Inherited: 0x28)
struct UCheckCurrentBulletCount : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckCurrentBulletCount, "CheckCurrentBulletCount")

	int32_t MinBulletCount; // 0x28(0x4)
	int32_t MaxBulletCount; // 0x2C(0x4)
};

// Object: Class UAGame.CheckMaxBulletCount
// Size: 0x30 (Inherited: 0x28)
struct UCheckMaxBulletCount : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckMaxBulletCount, "CheckMaxBulletCount")

	int32_t MinBulletCount; // 0x28(0x4)
	int32_t MaxBulletCount; // 0x2C(0x4)
};

// Object: Class UAGame.CheckMuzzleVelocity
// Size: 0x30 (Inherited: 0x28)
struct UCheckMuzzleVelocity : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckMuzzleVelocity, "CheckMuzzleVelocity")

	float MinMuzzleVelocity; // 0x28(0x4)
	float MaxMuzzleVelocity; // 0x2C(0x4)
};

// Object: Class UAGame.CheckAdsMoa
// Size: 0x38 (Inherited: 0x28)
struct UCheckAdsMoa : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckAdsMoa, "CheckAdsMoa")

	float AdsMoaXMin; // 0x28(0x4)
	float AdsMoaXMax; // 0x2C(0x4)
	float AdsMoaYMin; // 0x30(0x4)
	float AdsMoaYMax; // 0x34(0x4)
};

// Object: Class UAGame.CheckLootPointType
// Size: 0x38 (Inherited: 0x28)
struct UCheckLootPointType : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckLootPointType, "CheckLootPointType")

	struct TArray<int32_t> LootPointTypes; // 0x28(0x10)
};

// Object: Class UAGame.CheckWeaponCanFire
// Size: 0x30 (Inherited: 0x28)
struct UCheckWeaponCanFire : UCheckItemParamBase
{
	DEFINE_UE_CLASS_HELPERS(UCheckWeaponCanFire, "CheckWeaponCanFire")

	bool IsCanFire; // 0x28(0x1)
	uint8_t Pad_0x29[0x7]; // 0x29(0x7)
};

// Object: Class UAGame.QuestConditionComp_CheckItem
// Size: 0x70 (Inherited: 0x50)
struct UQuestConditionComp_CheckItem : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CheckItem, "QuestConditionComp_CheckItem")

	struct UMFQuestContextSourceBase* CheckCharacterContextSource; // 0x50(0x8)
	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x58(0x8)
	struct TArray<struct UCheckItemParamBase*> CheckParams; // 0x60(0x10)
};

// Object: Class UAGame.QuestConditionComp_CheckItemID
// Size: 0x68 (Inherited: 0x50)
struct UQuestConditionComp_CheckItemID : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CheckItemID, "QuestConditionComp_CheckItemID")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	struct TArray<uint64_t> CheckItemIDs; // 0x58(0x10)
};

// Object: Class UAGame.QuestConditionComp_CheckNumber
// Size: 0x70 (Inherited: 0x50)
struct UQuestConditionComp_CheckNumber : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CheckNumber, "QuestConditionComp_CheckNumber")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	bool bIntNumber; // 0x58(0x1)
	ENumberCompareType CompareType; // 0x59(0x1)
	uint8_t Pad_0x5A[0x2]; // 0x5A(0x2)
	int32_t MinIntValue; // 0x5C(0x4)
	int32_t MaxIntValue; // 0x60(0x4)
	float MinFloatValue; // 0x64(0x4)
	float MaxFloatValue; // 0x68(0x4)
	uint8_t Pad_0x6C[0x4]; // 0x6C(0x4)
};

// Object: Class UAGame.QuestConditionComp_CheckPlayerLevel
// Size: 0x60 (Inherited: 0x50)
struct UQuestConditionComp_CheckPlayerLevel : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CheckPlayerLevel, "QuestConditionComp_CheckPlayerLevel")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	int32_t MinLevel; // 0x58(0x4)
	int32_t MaxLevel; // 0x5C(0x4)
};

// Object: Class UAGame.QuestConditionComp_CheckUseInventoryPhase
// Size: 0x60 (Inherited: 0x50)
struct UQuestConditionComp_CheckUseInventoryPhase : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CheckUseInventoryPhase, "QuestConditionComp_CheckUseInventoryPhase")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	EUseInventoryPhase UseInventoryPhase; // 0x58(0x1)
	uint8_t Pad_0x59[0x7]; // 0x59(0x7)
};

// Object: Class UAGame.QuestConditionComp_CurrentTODTime
// Size: 0x68 (Inherited: 0x50)
struct UQuestConditionComp_CurrentTODTime : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_CurrentTODTime, "QuestConditionComp_CurrentTODTime")

	struct FTimeOfDay startTime; // 0x50(0xC)
	struct FTimeOfDay endTime; // 0x5C(0xC)
};

// Object: Class UAGame.QuestConditionComp_EscapeVolume
// Size: 0x70 (Inherited: 0x50)
struct UQuestConditionComp_EscapeVolume : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_EscapeVolume, "QuestConditionComp_EscapeVolume")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	struct TArray<int32_t> EscapePointIDs; // 0x58(0x10)
	ETraceMarkOperatorType OperatorType; // 0x68(0x1)
	uint8_t Pad_0x69[0x3]; // 0x69(0x3)
	int32_t ConfigID; // 0x6C(0x4)
};

// Object: Class UAGame.QuestConditionComp_MapName
// Size: 0x60 (Inherited: 0x50)
struct UQuestConditionComp_MapName : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_MapName, "QuestConditionComp_MapName")

	struct FString MapName; // 0x50(0x10)
};

// Object: Class UAGame.QuestConditionComp_MvItemFail_T
// Size: 0x58 (Inherited: 0x50)
struct UQuestConditionComp_MvItemFail_T : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_MvItemFail_T, "QuestConditionComp_MvItemFail_T")

	uint8_t Pad_0x50[0x8]; // 0x50(0x8)

	// Object: Function UAGame.QuestConditionComp_MvItemFail_T.OnMoveResult
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f873bc
	// Params: [ Num(0) Size(0x0) ]
	void OnMoveResult();
};

// Object: Class UAGame.QuestConditionComp_PlayerEndGameType
// Size: 0x68 (Inherited: 0x50)
struct UQuestConditionComp_PlayerEndGameType : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_PlayerEndGameType, "QuestConditionComp_PlayerEndGameType")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	struct TArray<EPlayerEndGameType> PlayerEndGameTypes; // 0x58(0x10)
};

// Object: Class UAGame.QuestConditionComp_PlayModeId
// Size: 0xA0 (Inherited: 0x50)
struct UQuestConditionComp_PlayModeId : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_PlayModeId, "QuestConditionComp_PlayModeId")

	struct TArray<int32_t> ModeIDArray; // 0x50(0x10)
	struct TArray<int32_t> SubModeIDArray; // 0x60(0x10)
	struct TArray<int32_t> MapIDArray; // 0x70(0x10)
	struct TArray<int32_t> RuleIdArray; // 0x80(0x10)
	struct TArray<int32_t> DifficultyArray; // 0x90(0x10)
};

// Object: Class UAGame.QuestConditionComp_RecoveryAttributeType
// Size: 0x58 (Inherited: 0x50)
struct UQuestConditionComp_RecoveryAttributeType : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_RecoveryAttributeType, "QuestConditionComp_RecoveryAttributeType")

	ESGRecoveryAttributeType RecoveryAttributeType; // 0x50(0x1)
	uint8_t Pad_0x51[0x7]; // 0x51(0x7)
};

// Object: Class UAGame.QuestConditionComp_StayVolume
// Size: 0xA0 (Inherited: 0x50)
struct UQuestConditionComp_StayVolume : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_StayVolume, "QuestConditionComp_StayVolume")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	struct TArray<int32_t> ValidVolumeIDs; // 0x58(0x10)
	struct TArray<struct FString> ValidVolumeNames; // 0x68(0x10)
	bool bForceUsePointMark; // 0x78(0x1)
	uint8_t Pad_0x79[0x7]; // 0x79(0x7)
	struct TArray<struct ASGVolume*> ValidVolumes; // 0x80(0x10)
	ETraceMarkOperatorType OperatorType; // 0x90(0x1)
	uint8_t Pad_0x91[0x3]; // 0x91(0x3)
	int32_t ConfigID; // 0x94(0x4)
	uint8_t Pad_0x98[0x8]; // 0x98(0x8)
};

// Object: Class UAGame.QuestConditionComp_TakeLimit
// Size: 0x68 (Inherited: 0x50)
struct UQuestConditionComp_TakeLimit : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_TakeLimit, "QuestConditionComp_TakeLimit")

	struct TArray<uint64_t> ItemTypeIDs; // 0x50(0x10)
	EQuestTakeLimitLogicType LogicType; // 0x60(0x1)
	uint8_t Pad_0x61[0x7]; // 0x61(0x7)

	// Object: Function UAGame.QuestConditionComp_TakeLimit.RefreshTakeLimitResult
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f87650
	// Params: [ Num(0) Size(0x0) ]
	void RefreshTakeLimitResult();

	// Object: Function UAGame.QuestConditionComp_TakeLimit.RefreshProgressWhenReadyToPlay
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f87458
	// Params: [ Num(1) Size(0x8) ]
	void RefreshProgressWhenReadyToPlay(struct ASGCharacter* SGCharacter);

	// Object: Function UAGame.QuestConditionComp_TakeLimit.OnProcessPawn
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f87500
	// Params: [ Num(1) Size(0x8) ]
	void OnProcessPawn(struct APawn* Pawn);

	// Object: Function UAGame.QuestConditionComp_TakeLimit.OnCharacterReadyToPlay
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f875a8
	// Params: [ Num(1) Size(0x8) ]
	void OnCharacterReadyToPlay(struct ASGCharacter* Character);
};

// Object: Class UAGame.QuestConditionComp_TeamInfo
// Size: 0x80 (Inherited: 0x50)
struct UQuestConditionComp_TeamInfo : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_TeamInfo, "QuestConditionComp_TeamInfo")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	ETeamInfoCheckType TeamInfoCheckType; // 0x58(0x1)
	uint8_t Pad_0x59[0x7]; // 0x59(0x7)
	struct FString StringValue1; // 0x60(0x10)
	struct FString StringValue2; // 0x70(0x10)

	// Object: Function UAGame.QuestConditionComp_TeamInfo.IsPassCheck
	// Flags: [Native|Public]
	// Offset: 0x9f876f4
	// Params: [ Num(2) Size(0x9) ]
	bool IsPassCheck(struct AActor* Actor);
};

// Object: Class UAGame.QuestConditionComp_TimeAfterActivation
// Size: 0x60 (Inherited: 0x50)
struct UQuestConditionComp_TimeAfterActivation : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_TimeAfterActivation, "QuestConditionComp_TimeAfterActivation")

	ENumCompareType CompareType; // 0x50(0x1)
	uint8_t Pad_0x51[0x3]; // 0x51(0x3)
	int32_t Value1; // 0x54(0x4)
	int32_t Value2; // 0x58(0x4)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
};

// Object: Class UAGame.QuestConditionComp_TimeLimit
// Size: 0x70 (Inherited: 0x50)
struct UQuestConditionComp_TimeLimit : UMFQuestConditionComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestConditionComp_TimeLimit, "QuestConditionComp_TimeLimit")

	struct UMFQuestContextSourceBase* CheckTargetContextSource; // 0x50(0x8)
	uint8_t Pad_0x58[0x8]; // 0x58(0x8)
	ETimeLimitType TimeLimitType; // 0x60(0x1)
	uint8_t Pad_0x61[0x3]; // 0x61(0x3)
	int32_t TimeLimitSeconds; // 0x64(0x4)
	int32_t TimeRecordCount; // 0x68(0x4)
	uint8_t Pad_0x6C[0x4]; // 0x6C(0x4)
};

// Object: Class UAGame.QuestContextSource_ArmorType
// Size: 0x28 (Inherited: 0x28)
struct UQuestContextSource_ArmorType : UMFQuestContextSourceBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestContextSource_ArmorType, "QuestContextSource_ArmorType")
};

// Object: Class UAGame.QuestContextSource_BodyParts
// Size: 0x28 (Inherited: 0x28)
struct UQuestContextSource_BodyParts : UMFQuestContextSourceBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestContextSource_BodyParts, "QuestContextSource_BodyParts")
};

// Object: Class UAGame.QuestContextSource_CharacterEnduranceType
// Size: 0x28 (Inherited: 0x28)
struct UQuestContextSource_CharacterEnduranceType : UMFQuestContextSourceBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestContextSource_CharacterEnduranceType, "QuestContextSource_CharacterEnduranceType")
};

// Object: Class UAGame.QuestContextSource_CharacterGameEffectType
// Size: 0x28 (Inherited: 0x28)
struct UQuestContextSource_CharacterGameEffectType : UMFQuestContextSourceBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestContextSource_CharacterGameEffectType, "QuestContextSource_CharacterGameEffectType")
};

// Object: Class UAGame.QuestContextSource_DamageInfo
// Size: 0x28 (Inherited: 0x28)
struct UQuestContextSource_DamageInfo : UMFQuestContextSourceBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestContextSource_DamageInfo, "QuestContextSource_DamageInfo")
};

// Object: Class UAGame.QuestContextSource_PlayerEndGameType
// Size: 0x28 (Inherited: 0x28)
struct UQuestContextSource_PlayerEndGameType : UMFQuestContextSourceBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestContextSource_PlayerEndGameType, "QuestContextSource_PlayerEndGameType")
};

// Object: Class UAGame.QuestContextSource_RecoveryAttributeType
// Size: 0x28 (Inherited: 0x28)
struct UQuestContextSource_RecoveryAttributeType : UMFQuestContextSourceBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestContextSource_RecoveryAttributeType, "QuestContextSource_RecoveryAttributeType")
};

// Object: Class UAGame.QuestContextSource_Teammate
// Size: 0x28 (Inherited: 0x28)
struct UQuestContextSource_Teammate : UMFQuestContextSourceBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestContextSource_Teammate, "QuestContextSource_Teammate")
};

// Object: Class UAGame.QuestContextSource_UseInventoryPhase
// Size: 0x28 (Inherited: 0x28)
struct UQuestContextSource_UseInventoryPhase : UMFQuestContextSourceBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestContextSource_UseInventoryPhase, "QuestContextSource_UseInventoryPhase")
};

// Object: Class UAGame.QuestContextSource_Weapon
// Size: 0x28 (Inherited: 0x28)
struct UQuestContextSource_Weapon : UMFQuestContextSourceBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestContextSource_Weapon, "QuestContextSource_Weapon")
};

// Object: Class UAGame.QuestDistributerBase
// Size: 0x3A8 (Inherited: 0x3A0)
struct AQuestDistributerBase : AMFQuestDistributerBase
{
	DEFINE_UE_CLASS_HELPERS(AQuestDistributerBase, "QuestDistributerBase")

	bool bClearProgressWhenFinishGame; // 0x3A0(0x1)
	uint8_t Pad_0x3A1[0x7]; // 0x3A1(0x7)

	// Object: Function UAGame.QuestDistributerBase.OnPrePlayerFinishGame
	// Flags: [Final|Native|Public]
	// Offset: 0x9f87898
	// Params: [ Num(3) Size(0x18) ]
	void OnPrePlayerFinishGame(struct APlayerController* PlayerController, EPlayerEndGameType FinishType, struct AActor* EscapeVolume);
};

// Object: Class UAGame.QuestEffect_ActivateLootPoint
// Size: 0x88 (Inherited: 0x38)
struct UQuestEffect_ActivateLootPoint : UMFQuestEffectBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestEffect_ActivateLootPoint, "QuestEffect_ActivateLootPoint")

	struct TMap<int64_t, struct FActivateLootPointConfigs> ActivateLootPointConfigs; // 0x38(0x50)
};

// Object: Class UAGame.QuestEffect_Broadcast
// Size: 0x88 (Inherited: 0x38)
struct UQuestEffect_Broadcast : UMFQuestEffectBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestEffect_Broadcast, "QuestEffect_Broadcast")

	struct UMFQuestContextSourceBase* RelatedTargetContextSource; // 0x38(0x8)
	struct TArray<ERelatedTargetType> RelatedTargetTypes; // 0x40(0x10)
	struct FBroadcastOnGameHUDConfig GameHUDConfig; // 0x50(0x38)
};

// Object: Class UAGame.QuestEffect_DistributeQuest
// Size: 0x60 (Inherited: 0x38)
struct UQuestEffect_DistributeQuest : UMFQuestEffectBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestEffect_DistributeQuest, "QuestEffect_DistributeQuest")

	struct UMFQuestContextSourceBase* TargetContextSource; // 0x38(0x8)
	struct TArray<ERelatedTargetType> RelatedTargetTypes; // 0x40(0x10)
	bool bUseRandomQuestTable; // 0x50(0x1)
	uint8_t Pad_0x51[0x3]; // 0x51(0x3)
	int32_t GraphID; // 0x54(0x4)
	struct UDataTable* RandomQuestTable; // 0x58(0x8)

	// Object: Function UAGame.QuestEffect_DistributeQuest.DistributeQuest
	// Flags: [Final|Native|Public]
	// Offset: 0x9f8d330
	// Params: [ Num(3) Size(0xD) ]
	void DistributeQuest(struct ACharacter* Character, int32_t DistributeQuestID, EQuestType QuestType);
};

// Object: Class UAGame.QuestEffect_GiveItem
// Size: 0x60 (Inherited: 0x38)
struct UQuestEffect_GiveItem : UMFQuestEffectBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestEffect_GiveItem, "QuestEffect_GiveItem")

	struct UMFQuestContextSourceBase* TargetContextSource; // 0x38(0x8)
	struct TArray<ERelatedTargetType> RelatedTargetTypes; // 0x40(0x10)
	struct TArray<struct FGiveItemInfo> GiveItemInfos; // 0x50(0x10)
};

// Object: Class UAGame.QuestEffect_ModifyEscapePoint
// Size: 0x88 (Inherited: 0x38)
struct UQuestEffect_ModifyEscapePoint : UMFQuestEffectBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestEffect_ModifyEscapePoint, "QuestEffect_ModifyEscapePoint")

	struct FTimerHandle TickTimerHandle; // 0x38(0x8)
	bool bOpenEscapePoint; // 0x40(0x1)
	uint8_t Pad_0x41[0x3]; // 0x41(0x3)
	int32_t RandomEscapePoint; // 0x44(0x4)
	struct TArray<struct FRandomEscapePoint> RandomEscapePointIDs; // 0x48(0x10)
	struct TArray<int32_t> EscapePointIDs; // 0x58(0x10)
	ECharacterType CharacterType; // 0x68(0x1)
	uint8_t Pad_0x69[0x7]; // 0x69(0x7)
	struct TArray<struct FString> EscapePresetNames; // 0x70(0x10)
	bool bUseCharacterType; // 0x80(0x1)
	uint8_t Pad_0x81[0x3]; // 0x81(0x3)
	float DelayTime; // 0x84(0x4)

	// Object: Function UAGame.QuestEffect_ModifyEscapePoint.OnTimer
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f8d478
	// Params: [ Num(0) Size(0x0) ]
	void OnTimer();
};

// Object: Class UAGame.QuestEffect_ModifyMarkable
// Size: 0x90 (Inherited: 0x38)
struct UQuestEffect_ModifyMarkable : UMFQuestEffectBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestEffect_ModifyMarkable, "QuestEffect_ModifyMarkable")

	struct UMFQuestContextSourceBase* RelatedTargetContextSource; // 0x38(0x8)
	struct TArray<ERelatedTargetType> RelatedTargetTypes; // 0x40(0x10)
	bool bMarkable; // 0x50(0x1)
	uint8_t Pad_0x51[0x7]; // 0x51(0x7)
	struct UMFQuestContextSourceBase* AICharacterMarkContextSource; // 0x58(0x8)
	struct TArray<struct FAICharacterMarkableInfo> AICharacterMarkables; // 0x60(0x10)
	struct TArray<struct FInventoryMarkableInfo> InventoryMarkables; // 0x70(0x10)
	struct TArray<struct FVolumeMarkableInfo> VolumeMarkables; // 0x80(0x10)

	// Object: Function UAGame.QuestEffect_ModifyMarkable.ModifyVolumeMarkable
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f8d4ac
	// Params: [ Num(2) Size(0x18) ]
	void ModifyVolumeMarkable(struct UUAPlayerStateTraceComponent* InPlayerStateTraceComponent, struct TArray<struct AActor*> InVolumeActors);

	// Object: Function UAGame.QuestEffect_ModifyMarkable.ModifyInventoryMarkable
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f8d61c
	// Params: [ Num(2) Size(0x18) ]
	void ModifyInventoryMarkable(struct UUAPlayerStateTraceComponent* InPlayerStateTraceComponent, struct TArray<struct AActor*> InInventoryActors);

	// Object: Function UAGame.QuestEffect_ModifyMarkable.ModifyAICharacterMarkable
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f8d78c
	// Params: [ Num(2) Size(0x10) ]
	void ModifyAICharacterMarkable(struct UUAPlayerStateTraceComponent* InPlayerStateTraceComponent, struct ASGAICharacter* InMarkAICharacter);
};

// Object: Class UAGame.QuestEffect_SpawnActorAtPylon
// Size: 0x68 (Inherited: 0x38)
struct UQuestEffect_SpawnActorAtPylon : UMFQuestEffectBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestEffect_SpawnActorAtPylon, "QuestEffect_SpawnActorAtPylon")

	struct AActor* SpawnActorClass; // 0x38(0x8)
	bool bUsePylonIDMapTable; // 0x40(0x1)
	uint8_t Pad_0x41[0x7]; // 0x41(0x7)
	struct UMFQuestContextSourceBase* TargetContextSource; // 0x48(0x8)
	struct UDataTable* PylonIDTable; // 0x50(0x8)
	struct TArray<int32_t> PylonIDs; // 0x58(0x10)
};

// Object: Class UAGame.QuestEffect_SpawnAI
// Size: 0x90 (Inherited: 0x38)
struct UQuestEffect_SpawnAI : UMFQuestEffectBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestEffect_SpawnAI, "QuestEffect_SpawnAI")

	struct FTriggerSpawnByAreaConfig TriggerSpawnByAreaConfig; // 0x38(0x18)
	struct FTriggerSpawnByVolumeConfig TriggerSpawnByVolumeConfig; // 0x50(0x18)
	struct FTriggerSpawnByEventConfig TriggerSpawnByEventConfig; // 0x68(0x18)
	struct TArray<struct FString> EventStrs; // 0x80(0x10)
};

// Object: Class UAGame.QuestEffect_SpawnInteractItem
// Size: 0x60 (Inherited: 0x38)
struct UQuestEffect_SpawnInteractItem : UMFQuestEffectBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestEffect_SpawnInteractItem, "QuestEffect_SpawnInteractItem")

	int32_t SpawnInteractItemNum; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
	struct TArray<struct FQuestEffectSpawnInteractItemInfo> SpawnInteractItemInfos; // 0x40(0x10)
	struct TArray<struct ASGNetRelevantConfigurableActor*> SpawnedInteractItem; // 0x50(0x10)
};

// Object: Class UAGame.QuestEffect_SpawnInventory
// Size: 0x80 (Inherited: 0x38)
struct UQuestEffect_SpawnInventory : UMFQuestEffectBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestEffect_SpawnInventory, "QuestEffect_SpawnInventory")

	struct FVector SpawnLocation; // 0x38(0xC)
	struct FRotator SpawnRotation; // 0x44(0xC)
	struct ASGInventory* ContainerClass; // 0x50(0x8)
	struct TArray<int64_t> itemIds; // 0x58(0x10)
	int32_t SpawnInventoryNum; // 0x68(0x4)
	uint8_t Pad_0x6C[0x4]; // 0x6C(0x4)
	struct TArray<struct FQuestEffectSpawnInventoryInfo> SpawnInventoryInfos; // 0x70(0x10)
};

// Object: Class UAGame.QuestEffect_SpawnPickup
// Size: 0x50 (Inherited: 0x38)
struct UQuestEffect_SpawnPickup : UMFQuestEffectBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestEffect_SpawnPickup, "QuestEffect_SpawnPickup")

	int32_t SpawnPickupNum; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
	struct TArray<struct FQuestEffectSpawnPickupInfo> SpawnPickupInfos; // 0x40(0x10)
};

// Object: Class UAGame.QuestItemSpawnPoint
// Size: 0x340 (Inherited: 0x328)
struct AQuestItemSpawnPoint : ANavigationObjectBase
{
	DEFINE_UE_CLASS_HELPERS(AQuestItemSpawnPoint, "QuestItemSpawnPoint")

	int32_t SpawnPointID; // 0x324(0x4)
	struct ACharacter* CurrentInstigator; // 0x328(0x8)
	struct TArray<struct UActorComponent*> AdditionComponents; // 0x330(0x10)
};

// Object: Class UAGame.QuestManagerActor
// Size: 0x340 (Inherited: 0x310)
struct AQuestManagerActor : AMFQuestManagerActor
{
	DEFINE_UE_CLASS_HELPERS(AQuestManagerActor, "QuestManagerActor")

	struct UDataTable* QuestTable; // 0x310(0x8)
	struct UDataTable* ActQuestTemplateTable; // 0x318(0x8)
	struct TArray<int32_t> TraceTasks; // 0x320(0x10)
	int32_t MaxTraceNum; // 0x330(0x4)
	uint8_t Pad_0x334[0x4]; // 0x334(0x4)
	struct AMFQuestBase* DummyQuestClass; // 0x338(0x8)

	// Object: Function UAGame.QuestManagerActor.SaveTraceQuest
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f8dacc
	// Params: [ Num(0) Size(0x0) ]
	void SaveTraceQuest();

	// Object: Function UAGame.QuestManagerActor.ResetTraceTask
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f8dae0
	// Params: [ Num(1) Size(0x4) ]
	void ResetTraceTask(int32_t TaskId);

	// Object: Function UAGame.QuestManagerActor.RemoveTraceTask
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f8dbb0
	// Params: [ Num(1) Size(0x4) ]
	void RemoveTraceTask(int32_t TaskId);

	// Object: Function UAGame.QuestManagerActor.RemoveCompleteTraceTask
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f8db88
	// Params: [ Num(0) Size(0x0) ]
	void RemoveCompleteTraceTask();

	// Object: Function UAGame.QuestManagerActor.RefreshQuestBeforeState
	// Flags: [Final|Native|Public]
	// Offset: 0x9f8eaac
	// Params: [ Num(2) Size(0x10) ]
	void RefreshQuestBeforeState(int32_t InQuestID, struct APlayerController* InPC);

	// Object: Function UAGame.QuestManagerActor.PrintReplicateData
	// Flags: [Final|Native|Public]
	// Offset: 0x9f8e0b8
	// Params: [ Num(0) Size(0x0) ]
	void PrintReplicateData();

	// Object: Function UAGame.QuestManagerActor.OnQuestGraphStatusChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f8d8e4
	// Params: [ Num(2) Size(0x9) ]
	void OnQuestGraphStatusChange(struct UMFQuestNodeGraph* NodeGraph, EQuestStatus NewStatus);

	// Object: Function UAGame.QuestManagerActor.LoadTraceQuest
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f8dab8
	// Params: [ Num(0) Size(0x0) ]
	void LoadTraceQuest();

	// Object: Function UAGame.QuestManagerActor.IsSeasonQuest
	// Flags: [Final|Native|Public]
	// Offset: 0x9f8e004
	// Params: [ Num(2) Size(0x5) ]
	bool IsSeasonQuest(int32_t InGraphID);

	// Object: Function UAGame.QuestManagerActor.GetTraceTasks
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f8dd34
	// Params: [ Num(1) Size(0x10) ]
	struct TArray<int32_t> GetTraceTasks();

	// Object: Function UAGame.QuestManagerActor.GetQuestIDFromQuest
	// Flags: [Final|Native|Public]
	// Offset: 0x9f8e9fc
	// Params: [ Num(2) Size(0xC) ]
	int32_t GetQuestIDFromQuest(struct AMFQuestBase* InQuest);

	// Object: Function UAGame.QuestManagerActor.GetQuestGraphIDFromQuestGraph
	// Flags: [Native|Public]
	// Offset: 0x9f8ee60
	// Params: [ Num(2) Size(0xC) ]
	int32_t GetQuestGraphIDFromQuestGraph(struct UMFQuestNodeGraph* InGraph);

	// Object: Function UAGame.QuestManagerActor.GetQuestGraphByID
	// Flags: [Final|Native|Public]
	// Offset: 0x9f8e81c
	// Params: [ Num(3) Size(0x18) ]
	struct UMFQuestNodeGraph* GetQuestGraphByID(int32_t InGraphID, struct APlayerController* InPlayerController);

	// Object: Function UAGame.QuestManagerActor.GetQuestDataWithID
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f8e6b0
	// Params: [ Num(3) Size(0x38) ]
	struct FQuestReplicateData GetQuestDataWithID(int32_t InGraphID, struct APlayerController* InPC);

	// Object: Function UAGame.QuestManagerActor.GetPlayerSeasonQuestsPartByState
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f8e17c
	// Params: [ Num(4) Size(0x38) ]
	void GetPlayerSeasonQuestsPartByState(struct APlayerController* InPC, struct TArray<struct FQuestReplicateData>& InProgress, struct TArray<struct FQuestReplicateData>& Success, struct TArray<struct FQuestReplicateData>& Fail);

	// Object: Function UAGame.QuestManagerActor.GetPlayerQuestTraceInfos
	// Flags: [Final|Native|Public]
	// Offset: 0x9f8def4
	// Params: [ Num(2) Size(0x18) ]
	struct TArray<struct FTraceableActorInfo> GetPlayerQuestTraceInfos(struct APlayerController* InPC);

	// Object: Function UAGame.QuestManagerActor.GetPlayerQuestTraceInfoByTargetID
	// Flags: [Final|Native|Public]
	// Offset: 0x9f8ddf4
	// Params: [ Num(3) Size(0x64) ]
	struct FTraceableActorInfo GetPlayerQuestTraceInfoByTargetID(struct APlayerController* InPC, int32_t TargetId);

	// Object: Function UAGame.QuestManagerActor.GetPlayerQuestsPartByState
	// Flags: [Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f8e364
	// Params: [ Num(4) Size(0x38) ]
	void GetPlayerQuestsPartByState(struct APlayerController* InPC, struct TArray<struct FQuestReplicateData>& InProgress, struct TArray<struct FQuestReplicateData>& Success, struct TArray<struct FQuestReplicateData>& Fail);

	// Object: Function UAGame.QuestManagerActor.GetPlayerQuests
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f8e54c
	// Params: [ Num(2) Size(0x18) ]
	struct TArray<struct FQuestReplicateData> GetPlayerQuests(struct APlayerController* InPC);

	// Object: Function UAGame.QuestManagerActor.GetMaxTraceNum
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f8dd00
	// Params: [ Num(1) Size(0x4) ]
	int32_t GetMaxTraceNum();

	// Object: Function UAGame.QuestManagerActor.GetGraphQuestFromQuestID
	// Flags: [Final|Native|Public]
	// Offset: 0x9f8e90c
	// Params: [ Num(3) Size(0x18) ]
	struct AMFQuestBase* GetGraphQuestFromQuestID(struct UMFQuestNodeGraph* InGraph, int32_t InQuestID);

	// Object: Function UAGame.QuestManagerActor.GetGraphIDFromQuest
	// Flags: [Final|Native|Public]
	// Offset: 0x9f8e0cc
	// Params: [ Num(2) Size(0xC) ]
	int32_t GetGraphIDFromQuest(struct AMFQuestBase* InQuest);

	// Object: Function UAGame.QuestManagerActor.GetAllQuestInventoryData
	// Flags: [Final|Native|Public|BlueprintCallable|BlueprintPure]
	// Offset: 0x9f8d9cc
	// Params: [ Num(2) Size(0x18) ]
	struct TArray<struct FQuestInventory> GetAllQuestInventoryData(struct APlayerController* PC);

	// Object: Function UAGame.QuestManagerActor.CreateNewQuestGraphWithID
	// Flags: [Native|Public]
	// Offset: 0x9f8ef18
	// Params: [ Num(4) Size(0x20) ]
	struct UMFQuestNodeGraph* CreateNewQuestGraphWithID(int32_t InGraphID, struct AController* InController, bool bAct);

	// Object: Function UAGame.QuestManagerActor.CreateNewQuestFromID
	// Flags: [Final|Native|Public]
	// Offset: 0x9f8ed30
	// Params: [ Num(4) Size(0x18) ]
	struct AMFQuestBase* CreateNewQuestFromID(int32_t InGraphID, int32_t InQuestID, struct AController* InController);

	// Object: Function UAGame.QuestManagerActor.CreateNewQuestFromCreateData
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x9f8eb94
	// Params: [ Num(3) Size(0x78) ]
	struct AMFQuestBase* CreateNewQuestFromCreateData(struct FTaskCreateData& InTaskCreateData, struct FQuestCreateData& InQuestCreateData);

	// Object: Function UAGame.QuestManagerActor.ClearTraceTask
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f8db9c
	// Params: [ Num(0) Size(0x0) ]
	void ClearTraceTask();

	// Object: Function UAGame.QuestManagerActor.AutoTraceOneQuest
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f8daa4
	// Params: [ Num(0) Size(0x0) ]
	void AutoTraceOneQuest();

	// Object: Function UAGame.QuestManagerActor.AddTraceTask
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f8dc58
	// Params: [ Num(1) Size(0x4) ]
	void AddTraceTask(int32_t TaskId);
};

// Object: Class UAGame.QuestManagerComponent
// Size: 0x130 (Inherited: 0xF0)
struct UQuestManagerComponent : UMFQuestManagerComponent
{
	DEFINE_UE_CLASS_HELPERS(UQuestManagerComponent, "QuestManagerComponent")

	float MaxSecondInOneFrame; // 0xF0(0x4)
	uint8_t Pad_0xF4[0x1C]; // 0xF4(0x1C)
	struct TArray<struct UMFQuestNodeGraph*> WaitDestroyGraph; // 0x110(0x10)
	struct TArray<struct APlayerController*> HasFinishPC; // 0x120(0x10)

	// Object: Function UAGame.QuestManagerComponent.OnGameModePlayerFinishGame
	// Flags: [Final|Native|Public]
	// Offset: 0x9f96040
	// Params: [ Num(3) Size(0x18) ]
	void OnGameModePlayerFinishGame(struct APlayerController* PlayerController, EPlayerEndGameType FinishType, struct AActor* EscapeVolume);

	// Object: Function UAGame.QuestManagerComponent.DoDestroyGraph
	// Flags: [Final|Native|Public]
	// Offset: 0x9f96168
	// Params: [ Num(0) Size(0x0) ]
	void DoDestroyGraph();

	// Object: Function UAGame.QuestManagerComponent.DoCreateTask
	// Flags: [Final|Native|Public]
	// Offset: 0x9f9617c
	// Params: [ Num(0) Size(0x0) ]
	void DoCreateTask();

	// Object: Function UAGame.QuestManagerComponent.AddTaskData
	// Flags: [Final|Native|Public]
	// Offset: 0x9f96190
	// Params: [ Num(2) Size(0x38) ]
	void AddTaskData(struct FTaskCreateData TaskCreateData, struct APlayerController* PC);
};

// Object: Class UAGame.QuestObjCom_TakeOutItemType
// Size: 0x1A8 (Inherited: 0x150)
struct UQuestObjCom_TakeOutItemType : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjCom_TakeOutItemType, "QuestObjCom_TakeOutItemType")

	int32_t LimitItemMainMidTypePreix; // 0x150(0x4)
	uint8_t Pad_0x154[0x54]; // 0x154(0x54)

	// Object: Function UAGame.QuestObjCom_TakeOutItemType.OnPlayerFinishGame
	// Flags: [Final|Native|Public]
	// Offset: 0x9f965c4
	// Params: [ Num(3) Size(0x18) ]
	void OnPlayerFinishGame(struct APlayerController* PlayerController, EPlayerEndGameType FinishType, struct AActor* EscapeVolume);

	// Object: Function UAGame.QuestObjCom_TakeOutItemType.OnPlayerDied
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x9f96448
	// Params: [ Num(2) Size(0x178) ]
	void OnPlayerDied(struct APawn* KilledPawn, const struct FKillInfo& KillInfo);
};

// Object: Class UAGame.QuestObjectiveComp_AIMove_T
// Size: 0x180 (Inherited: 0x150)
struct UQuestObjectiveComp_AIMove_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_AIMove_T, "QuestObjectiveComp_AIMove_T")

	struct TArray<struct ASGCharacter*> AllCharacter; // 0x150(0x10)
	struct TArray<struct ASGAISpawnPoint*> AllAISpawnPoint; // 0x160(0x10)
	struct TArray<struct ASGCharacter*> ArriveCharacter; // 0x170(0x10)

	// Object: Function UAGame.QuestObjectiveComp_AIMove_T.CharacterArrive
	// Flags: [Final|Native|Public|BlueprintCallable]
	// Offset: 0x9f966f4
	// Params: [ Num(1) Size(0x8) ]
	void CharacterArrive(struct ASGCharacter* Character);

	// Object: Function UAGame.QuestObjectiveComp_AIMove_T.BP_DeactivateQuestComponent
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x5d8cbc8
	// Params: [ Num(0) Size(0x0) ]
	void BP_DeactivateQuestComponent();

	// Object: Function UAGame.QuestObjectiveComp_AIMove_T.BP_ActivateQuestComponent
	// Flags: [Event|Public|BlueprintEvent]
	// Offset: 0x5d8cbc8
	// Params: [ Num(0) Size(0x0) ]
	void BP_ActivateQuestComponent();
};

// Object: Class UAGame.QuestObjectiveComp_Assemble_T
// Size: 0x160 (Inherited: 0x150)
struct UQuestObjectiveComp_Assemble_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_Assemble_T, "QuestObjectiveComp_Assemble_T")

	struct ASGInventory* ItemClass; // 0x150(0x8)
	struct ASGInventory* WeaponClass; // 0x158(0x8)

	// Object: Function UAGame.QuestObjectiveComp_Assemble_T.OnWeaponAssemble
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f9681c
	// Params: [ Num(3) Size(0x18) ]
	void OnWeaponAssemble(struct ACharacter* Character, struct ASGInventory* Weapon, struct ASGInventory* ChildInventory);
};

// Object: Class UAGame.QuestObjectiveComp_AttractAI
// Size: 0x158 (Inherited: 0x150)
struct UQuestObjectiveComp_AttractAI : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_AttractAI, "QuestObjectiveComp_AttractAI")

	bool bEnableTeamMemberHelp; // 0x150(0x1)
	uint8_t Pad_0x151[0x7]; // 0x151(0x7)

	// Object: Function UAGame.QuestObjectiveComp_AttractAI.OnInventoryAttractAI
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f96948
	// Params: [ Num(2) Size(0x10) ]
	void OnInventoryAttractAI(struct AActor* Actor, struct ACharacter* AICharacter);
};

// Object: Class UAGame.QuestObjectiveComp_Bag_T
// Size: 0x168 (Inherited: 0x150)
struct UQuestObjectiveComp_Bag_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_Bag_T, "QuestObjectiveComp_Bag_T")

	ETutorialBagState BagState; // 0x150(0x1)
	ETutorialBagType BagType; // 0x151(0x1)
	uint8_t Pad_0x152[0x6]; // 0x152(0x6)
	struct ASGAISpawnPoint* SpawnPoint; // 0x158(0x8)
	struct ASGInventory* ContainerClass; // 0x160(0x8)

	// Object: Function UAGame.QuestObjectiveComp_Bag_T.OnBagOpenStateChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f96a84
	// Params: [ Num(3) Size(0x10) ]
	void OnBagOpenStateChange(bool bShow, ETutorialBagType InBagType, struct AActor* Container);
};

// Object: Class UAGame.QuestObjectiveComp_BagHoldPress_T
// Size: 0x150 (Inherited: 0x150)
struct UQuestObjectiveComp_BagHoldPress_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_BagHoldPress_T, "QuestObjectiveComp_BagHoldPress_T")

	// Object: Function UAGame.QuestObjectiveComp_BagHoldPress_T.OnBagHoldPress
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f96bc8
	// Params: [ Num(0) Size(0x0) ]
	void OnBagHoldPress();
};

// Object: Class UAGame.QuestObjectiveComp_BagScrollDown_T
// Size: 0x158 (Inherited: 0x150)
struct UQuestObjectiveComp_BagScrollDown_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_BagScrollDown_T, "QuestObjectiveComp_BagScrollDown_T")

	ETutorialBagType BagType; // 0x150(0x1)
	ETutorialBagTabType BagTabType; // 0x151(0x1)
	uint8_t Pad_0x152[0x6]; // 0x152(0x6)

	// Object: Function UAGame.QuestObjectiveComp_BagScrollDown_T.OnBagScrollDown
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f96be4
	// Params: [ Num(2) Size(0x8) ]
	void OnBagScrollDown(ETutorialBagType TutorialBagType, int32_t TabType);
};

// Object: Class UAGame.QuestObjectiveComp_BagTabSign_T
// Size: 0x158 (Inherited: 0x150)
struct UQuestObjectiveComp_BagTabSign_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_BagTabSign_T, "QuestObjectiveComp_BagTabSign_T")

	ETutorialBagType BagType; // 0x150(0x1)
	ETutorialBagTabType BagTabType; // 0x151(0x1)
	uint8_t Pad_0x152[0x6]; // 0x152(0x6)

	// Object: Function UAGame.QuestObjectiveComp_BagTabSign_T.OnBagTabClick
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f96cd4
	// Params: [ Num(2) Size(0x8) ]
	void OnBagTabClick(ETutorialBagType TutorialBagType, int32_t TabType);
};

// Object: Class UAGame.QuestObjectiveComp_BgnUseItem_T
// Size: 0x160 (Inherited: 0x150)
struct UQuestObjectiveComp_BgnUseItem_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_BgnUseItem_T, "QuestObjectiveComp_BgnUseItem_T")

	struct ASGInventory* ItemClass; // 0x150(0x8)
	ECharacterEnduranceType CharacterEnduranceType; // 0x158(0x1)
	uint8_t Pad_0x159[0x7]; // 0x159(0x7)

	// Object: Function UAGame.QuestObjectiveComp_BgnUseItem_T.BeginUseItem
	// Flags: [Final|Native|Public]
	// Offset: 0x9f96dc4
	// Params: [ Num(3) Size(0x11) ]
	void BeginUseItem(struct AActor* Character, struct ASGInventory* Inventory, ECharacterEnduranceType UseInBodyType);
};

// Object: Class UAGame.QuestObjectiveComp_BigMap_T
// Size: 0x158 (Inherited: 0x150)
struct UQuestObjectiveComp_BigMap_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_BigMap_T, "QuestObjectiveComp_BigMap_T")

	EBigMapState BigMapState; // 0x150(0x1)
	uint8_t Pad_0x151[0x7]; // 0x151(0x7)

	// Object: Function UAGame.QuestObjectiveComp_BigMap_T.OnBigMapOpenStateChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f96f34
	// Params: [ Num(1) Size(0x1) ]
	void OnBigMapOpenStateChange(bool bShow);
};

// Object: Class UAGame.QuestObjectiveComp_ChangeState_T
// Size: 0x158 (Inherited: 0x150)
struct UQuestObjectiveComp_ChangeState_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_ChangeState_T, "QuestObjectiveComp_ChangeState_T")

	ETutorialCharacterState characterState; // 0x150(0x1)
	uint8_t Pad_0x151[0x7]; // 0x151(0x7)

	// Object: Function UAGame.QuestObjectiveComp_ChangeState_T.IsInState
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f96ff8
	// Params: [ Num(1) Size(0x1) ]
	bool IsInState();
};

// Object: Class UAGame.QuestObjectiveComp_CharacterMove
// Size: 0x158 (Inherited: 0x150)
struct UQuestObjectiveComp_CharacterMove : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_CharacterMove, "QuestObjectiveComp_CharacterMove")

	int32_t MinUpdateDistance; // 0x150(0x4)
	int32_t CacheDistance; // 0x154(0x4)

	// Object: Function UAGame.QuestObjectiveComp_CharacterMove.OnCharacterMoveEvent
	// Flags: [Final|Native|Public]
	// Offset: 0x9f97044
	// Params: [ Num(1) Size(0x8) ]
	void OnCharacterMoveEvent(int64_t Distance);
};

// Object: Class UAGame.QuestObjectiveComp_CheckPoint_T
// Size: 0x150 (Inherited: 0x150)
struct UQuestObjectiveComp_CheckPoint_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_CheckPoint_T, "QuestObjectiveComp_CheckPoint_T")
};

// Object: Class UAGame.QuestObjectiveComp_CheckWeapon_T
// Size: 0x150 (Inherited: 0x150)
struct UQuestObjectiveComp_CheckWeapon_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_CheckWeapon_T, "QuestObjectiveComp_CheckWeapon_T")

	// Object: Function UAGame.QuestObjectiveComp_CheckWeapon_T.OnCheckWeaponBtnClick
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f97100
	// Params: [ Num(0) Size(0x0) ]
	void OnCheckWeaponBtnClick();
};

// Object: Class UAGame.QuestObjectiveComp_ClearArea
// Size: 0x180 (Inherited: 0x150)
struct UQuestObjectiveComp_ClearArea : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_ClearArea, "QuestObjectiveComp_ClearArea")

	struct TArray<ECharacterType> SpecifiedTypes; // 0x150(0x10)
	int64_t VolumeID; // 0x160(0x8)
	struct UUAVolumeStatisComponent* VolumeStatisComponent; // 0x168(0x8)
	uint32_t TargetNum; // 0x170(0x4)
	uint8_t Pad_0x174[0x4]; // 0x174(0x4)
	struct FTimerHandle TickTimerHandle; // 0x178(0x8)

	// Object: Function UAGame.QuestObjectiveComp_ClearArea.OnVolumeActorChanged
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f972ac
	// Params: [ Num(1) Size(0x8) ]
	void OnVolumeActorChanged(int64_t InVolumeID);

	// Object: Function UAGame.QuestObjectiveComp_ClearArea.OnTimerTick
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f9711c
	// Params: [ Num(0) Size(0x0) ]
	void OnTimerTick();

	// Object: Function UAGame.QuestObjectiveComp_ClearArea.OnKilledEvent
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x9f97130
	// Params: [ Num(2) Size(0x178) ]
	void OnKilledEvent(struct APawn* KilledPawn, const struct FKillInfo& KillInfo);

	// Object: Function UAGame.QuestObjectiveComp_ClearArea.GetTargetNum
	// Flags: [Final|Native|Public]
	// Offset: 0x9f97354
	// Params: [ Num(1) Size(0x4) ]
	uint32_t GetTargetNum();
};

// Object: Class UAGame.QuestObjectiveComp_ClickFakeMap
// Size: 0x158 (Inherited: 0x150)
struct UQuestObjectiveComp_ClickFakeMap : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_ClickFakeMap, "QuestObjectiveComp_ClickFakeMap")

	float DelayTime; // 0x150(0x4)
	uint8_t Pad_0x154[0x4]; // 0x154(0x4)

	// Object: Function UAGame.QuestObjectiveComp_ClickFakeMap.OnFakeMapUIClick
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f97418
	// Params: [ Num(0) Size(0x0) ]
	void OnFakeMapUIClick();
};

// Object: Class UAGame.QuestObjectiveComp_ClickItem_T
// Size: 0x158 (Inherited: 0x150)
struct UQuestObjectiveComp_ClickItem_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_ClickItem_T, "QuestObjectiveComp_ClickItem_T")

	struct ASGInventory* ItemClass; // 0x150(0x8)

	// Object: Function UAGame.QuestObjectiveComp_ClickItem_T.OnClickItem
	// Flags: [Final|Native|Public]
	// Offset: 0x9f97434
	// Params: [ Num(1) Size(0x8) ]
	void OnClickItem(struct ASGInventory* Inventory);
};

// Object: Class UAGame.QuestObjectiveComp_CollectItem
// Size: 0x180 (Inherited: 0x150)
struct UQuestObjectiveComp_CollectItem : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_CollectItem, "QuestObjectiveComp_CollectItem")

	struct TArray<struct ASGInventory*> CollectedItems; // 0x150(0x10)
	uint8_t Pad_0x160[0x18]; // 0x160(0x18)
	bool bEnableTeamMemberHelp; // 0x178(0x1)
	bool bAddProgressWhenActivate; // 0x179(0x1)
	bool bChangeCountsToValue; // 0x17A(0x1)
	uint8_t Pad_0x17B[0x5]; // 0x17B(0x5)

	// Object: Function UAGame.QuestObjectiveComp_CollectItem.UnRegistedEvent
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f977bc
	// Params: [ Num(0) Size(0x0) ]
	void UnRegistedEvent();

	// Object: Function UAGame.QuestObjectiveComp_CollectItem.RegistedEvent
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f977d0
	// Params: [ Num(1) Size(0x8) ]
	void RegistedEvent(struct ASGCharacter* SGCharacter);

	// Object: Function UAGame.QuestObjectiveComp_CollectItem.RefreshProgressWhenReadyToPlay
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f974e4
	// Params: [ Num(1) Size(0x8) ]
	void RefreshProgressWhenReadyToPlay(struct ASGCharacter* SGCharacter);

	// Object: Function UAGame.QuestObjectiveComp_CollectItem.RefreshProgress
	// Flags: [Final|Native|Public]
	// Offset: 0x9f97878
	// Params: [ Num(0) Size(0x0) ]
	void RefreshProgress();

	// Object: Function UAGame.QuestObjectiveComp_CollectItem.OnTeamMemberAddInventory
	// Flags: [Final|Native|Public]
	// Offset: 0x9f97cf8
	// Params: [ Num(3) Size(0x18) ]
	void OnTeamMemberAddInventory(struct ASGTeamInfo* TeamInfo, struct ACharacter* Character, struct ASGInventory* Inventory);

	// Object: Function UAGame.QuestObjectiveComp_CollectItem.OnProcessPawn
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f9758c
	// Params: [ Num(1) Size(0x8) ]
	void OnProcessPawn(struct APawn* Pawn);

	// Object: Function UAGame.QuestObjectiveComp_CollectItem.OnPlayerFinishGame
	// Flags: [Final|Native|Public]
	// Offset: 0x9f9788c
	// Params: [ Num(3) Size(0x18) ]
	void OnPlayerFinishGame(struct APlayerController* PlayerController, EPlayerEndGameType FinishType, struct AActor* EscapeVolume);

	// Object: Function UAGame.QuestObjectiveComp_CollectItem.OnPlayerDied
	// Flags: [Final|Native|Public|HasOutParms]
	// Offset: 0x9f979b4
	// Params: [ Num(2) Size(0x178) ]
	void OnPlayerDied(struct APawn* KilledPawn, const struct FKillInfo& KillInfo);

	// Object: Function UAGame.QuestObjectiveComp_CollectItem.OnInventoryRemoved
	// Flags: [Final|Native|Public]
	// Offset: 0x9f97b30
	// Params: [ Num(2) Size(0x10) ]
	void OnInventoryRemoved(struct ACharacter* Character, struct ASGInventory* Inventory);

	// Object: Function UAGame.QuestObjectiveComp_CollectItem.OnInventoryAdded
	// Flags: [Final|Native|Public]
	// Offset: 0x9f97c14
	// Params: [ Num(2) Size(0x10) ]
	void OnInventoryAdded(struct ACharacter* Character, struct ASGInventory* Inventory);

	// Object: Function UAGame.QuestObjectiveComp_CollectItem.OnCharacterReadyToPlay
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f97634
	// Params: [ Num(1) Size(0x8) ]
	void OnCharacterReadyToPlay(struct ASGCharacter* Character);

	// Object: Function UAGame.QuestObjectiveComp_CollectItem.IsCollectingQuestInventory
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f97784
	// Params: [ Num(1) Size(0x1) ]
	bool IsCollectingQuestInventory();

	// Object: Function UAGame.QuestObjectiveComp_CollectItem.CheckLoseQuestInventory
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f976dc
	// Params: [ Num(1) Size(0x8) ]
	void CheckLoseQuestInventory(struct ASGCharacter* Character);
};

// Object: Class UAGame.QuestObjectiveComp_CompleteRequest
// Size: 0x158 (Inherited: 0x150)
struct UQuestObjectiveComp_CompleteRequest : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_CompleteRequest, "QuestObjectiveComp_CompleteRequest")

	bool bIncreaseQuestPrgress; // 0x150(0x1)
	uint8_t Pad_0x151[0x7]; // 0x151(0x7)

	// Object: Function UAGame.QuestObjectiveComp_CompleteRequest.OnRequestGiveUp
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f97f78
	// Params: [ Num(1) Size(0x8) ]
	void OnRequestGiveUp(struct UNPCAIGroupBaseRequest* GiveUpRequest);

	// Object: Function UAGame.QuestObjectiveComp_CompleteRequest.OnRequestCompleted
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f98020
	// Params: [ Num(1) Size(0x8) ]
	void OnRequestCompleted(struct UNPCAIGroupBaseRequest* CompletedRequest);

	// Object: Function UAGame.QuestObjectiveComp_CompleteRequest.OnInstigatorDied
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f97e54
	// Params: [ Num(3) Size(0x18) ]
	void OnInstigatorDied(struct ACharacter* DeadCharacter, struct AController* Killer, struct UDamageEventObject* DamageEventObject);
};

// Object: Class UAGame.QuestObjectiveComp_DestroyActor
// Size: 0x150 (Inherited: 0x150)
struct UQuestObjectiveComp_DestroyActor : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_DestroyActor, "QuestObjectiveComp_DestroyActor")

	// Object: Function UAGame.QuestObjectiveComp_DestroyActor.OnProcessPawn
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f981c0
	// Params: [ Num(1) Size(0x8) ]
	void OnProcessPawn(struct APawn* Pawn);

	// Object: Function UAGame.QuestObjectiveComp_DestroyActor.OnInstigatorDestroyActor
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f980dc
	// Params: [ Num(2) Size(0x10) ]
	void OnInstigatorDestroyActor(struct ACharacter* Character, struct AActor* Actor);
};

// Object: Class UAGame.QuestObjectiveComp_Door_T
// Size: 0x160 (Inherited: 0x150)
struct UQuestObjectiveComp_Door_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_Door_T, "QuestObjectiveComp_Door_T")

	struct ASGDoorBase* Door; // 0x150(0x8)
	ETutorialDoorState DoorState; // 0x158(0x1)
	uint8_t Pad_0x159[0x7]; // 0x159(0x7)

	// Object: Function UAGame.QuestObjectiveComp_Door_T.OnDoorStateChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f982b4
	// Params: [ Num(2) Size(0x9) ]
	void OnDoorStateChange(struct ASGDoorBase* InDoor, ESGDoorState InDoorState);
};

// Object: Class UAGame.QuestObjectiveComp_EscapeMap
// Size: 0x150 (Inherited: 0x150)
struct UQuestObjectiveComp_EscapeMap : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_EscapeMap, "QuestObjectiveComp_EscapeMap")

	// Object: Function UAGame.QuestObjectiveComp_EscapeMap.OnPlayerFinishGame
	// Flags: [Final|Native|Public]
	// Offset: 0x9f983a4
	// Params: [ Num(3) Size(0x18) ]
	void OnPlayerFinishGame(struct APlayerController* PlayerController, EPlayerEndGameType FinishType, struct AActor* EscapeVolume);
};

// Object: Class UAGame.QuestObjectiveComp_Escort
// Size: 0x150 (Inherited: 0x150)
struct UQuestObjectiveComp_Escort : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_Escort, "QuestObjectiveComp_Escort")

	// Object: Function UAGame.QuestObjectiveComp_Escort.OnPlayerFinishGame
	// Flags: [Final|Native|Public]
	// Offset: 0x9f984d4
	// Params: [ Num(3) Size(0x18) ]
	void OnPlayerFinishGame(struct APlayerController* PlayerController, EPlayerEndGameType FinishType, struct AActor* EscapeVolume);
};

// Object: Class UAGame.QuestObjectiveComp_FacePanel_T
// Size: 0x158 (Inherited: 0x150)
struct UQuestObjectiveComp_FacePanel_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_FacePanel_T, "QuestObjectiveComp_FacePanel_T")

	EFacePanelState FacePanelState; // 0x150(0x1)
	uint8_t Pad_0x151[0x7]; // 0x151(0x7)

	// Object: Function UAGame.QuestObjectiveComp_FacePanel_T.OnFacePanelOpenStateChange
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f98648
	// Params: [ Num(2) Size(0x8) ]
	void OnFacePanelOpenStateChange(bool bShow, int32_t WidgetID);
};

// Object: Class UAGame.QuestObjectiveComp_Fire_T
// Size: 0x150 (Inherited: 0x150)
struct UQuestObjectiveComp_Fire_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_Fire_T, "QuestObjectiveComp_Fire_T")

	// Object: Function UAGame.QuestObjectiveComp_Fire_T.OnBeginFire
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f9db9c
	// Params: [ Num(0) Size(0x0) ]
	void OnBeginFire();
};

// Object: Class UAGame.QuestObjectiveComp_HealthUI_T
// Size: 0x158 (Inherited: 0x150)
struct UQuestObjectiveComp_HealthUI_T : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_HealthUI_T, "QuestObjectiveComp_HealthUI_T")

	ECharacterEnduranceType BodyType; // 0x150(0x1)
	uint8_t Pad_0x151[0x7]; // 0x151(0x7)

	// Object: Function UAGame.QuestObjectiveComp_HealthUI_T.OnHealthUIClick
	// Flags: [Final|Native|Protected]
	// Offset: 0x9f9dbb8
	// Params: [ Num(1) Size(0x1) ]
	void OnHealthUIClick(ECharacterEnduranceType InEnduranceType);
};

// Object: Class UAGame.QuestObjectiveComp_HitTarget
// Size: 0x158 (Inherited: 0x150)
struct UQuestObjectiveComp_HitTarget : UMFQuestObjectiveComponentBase
{
	DEFINE_UE_CLASS_HELPERS(UQuestObjectiveComp_HitTarget, "QuestObjectiveComp_HitTarget")

	bool bEnableTeamMemberHelp; // 0x150(0x1)
	uint8_t Pad_0x151[0x7]; // 0x151(0x7)

	// Object: Function UAGame.QuestObjectiveComp_HitTarget.OnTeamMemberCauseDamage
	// Flags: [Final|Native|Protected|HasOutParms]
	// Offset: 0x9f9ddd8
	// Params: [ Num(2) Size(0x50) ]
