#pragma once

#include "../CoreUObject_classes.hpp"
#include "InputCore.hpp"
#include "PacketHandler.hpp"
#include "Slate.hpp"
#include "SlateCore.hpp"

namespace SDK
{

// Package: Engine
// Enums: 465
// Structs: 770
// Classes: 1074

enum class EChaosBufferMode : uint8_t;
enum class EChaosSolverTickMode : uint8_t;
enum class EChaosThreadingMode : uint8_t;
enum class EControllerHand : uint8_t;
enum class EFontHinting : uint8_t;
enum class EFontLayoutMethod : uint8_t;
enum class EFontLoadingPolicy : uint8_t;
enum class ESoundwaveSampleRateSettings : uint8_t;
enum class ETouchIndex : uint8_t;
enum class EUINavigation : uint8_t;
enum class EUINavigationAction : uint8_t;
struct FAnalogInputEvent;
struct FInputChord;
struct FInputEvent;
struct FKey;
struct FKeyEvent;
struct FPointerEvent;
struct UClothingAssetBase;
struct UClothingSimulationFactory;
struct UClothingSimulationInteractor;
struct UStaticMeshDescription;
struct UUserWidget;
struct FDistributionLookupTable;
struct FRawDistribution;
struct FFloatDistribution;
struct FVectorDistribution;
struct FVector4Distribution;
struct FFloatRK4SpringInterpolator;
struct FVectorRK4SpringInterpolator;
struct FFormatArgumentData;
struct FExpressionInput;
struct FMaterialAttributesInput;
struct FExpressionOutput;
struct FMaterialInput;
struct FColorMaterialInput;
struct FScalarMaterialInput;
struct FShadingModelMaterialInput;
struct FVectorMaterialInput;
struct FVector2MaterialInput;
struct FTimerHandle;
struct FVector_NetQuantize;

struct USoundCue;
struct USoundCueTemplate;
struct USoundEffectSourcePreset;
struct USoundEffectSourcePresetChain;
struct USoundGroups;
struct USoundMix;
struct USoundNode;
struct USoundNodeAssetReferencer;
struct USoundNodeAttenuation;
struct USoundNodeBranch;
struct USoundNodeConcatenator;
struct USoundNodeDelay;
struct USoundNodeDialoguePlayer;
struct USoundNodeDistanceCrossFade;
struct USoundNodeDoppler;
struct USoundNodeEnveloper;
struct USoundNodeGroupControl;
struct USoundNodeLooping;
struct USoundNodeMature;
struct USoundNodeMixer;
struct USoundNodeModulator;
struct USoundNodeModulatorContinuous;
struct USoundNodeOscillator;
struct USoundNodeParamCrossFade;
struct USoundNodeQualityLevel;
struct USoundNodeRandom;
struct USoundNodeSoundClass;
struct USoundNodeSwitch;
struct USoundNodeWaveParam;
struct USoundNodeWavePlayer;
struct USoundSourceBus;
struct USoundSubmix;
struct USpectatorPawnMovement;
struct ASphereReflectionCapture;
struct USphereReflectionCaptureComponent;
struct USplineMetadata;
struct ASplineMeshActor;
struct USplineMeshComponent;
struct USpotLightComponent;
struct UStaticMeshSocket;
struct UStereoLayerComponent;
struct UStereoLayerFunctionLibrary;
struct UStringTable;
struct USubsurfaceProfile;
struct USubsystemBlueprintLibrary;
struct USubUVAnimation;
struct UTimecodeProvider;
struct USystemTimeTimecodeProvider;
struct ATargetPoint;
struct UTextPropertyTestObject;
struct ATextRenderActor;
struct UTextRenderComponent;
struct UTexture2DArray;
struct UTexture2DDynamic;
struct UTexture2DSpriteAtlas;
struct UTextureGroupSettingsConfig;
struct UTextureLightProfile;
struct UTextureRenderTargetCube;
struct UThumbnailInfo;
struct UTickTaskWhiteList;
struct UTimelineComponent;
struct UTimelineTemplate;
struct UTireType;
struct UTOD_ReflectionManager;
struct UABCNatrualLightObj;
struct UPRTScriptObj;
struct UTodRangedScriptObj;
struct UTodSaveMarker;
struct UPRTGlobalMetaData;
struct UPRTMonolithicFarGIData;
struct AExposureOverrideVolume;
struct AInteriorVolume;
struct AGIReplaceVolume;
struct UTODManager;
struct UTouchInterface;
struct ATriggerCapsule;
struct ATriggerVolume;
struct UTwitterIntegrationBase;
struct UUMaterialExpressionUnscaledViewSize;
struct UUserDefinedEnum;
struct UUserDefinedStruct;
struct UUserInterfaceSettings;
struct UVectorField;
struct UVectorFieldAnimated;
struct UVectorFieldComponent;
struct UVectorFieldStatic;
struct AVectorFieldVolume;
struct UVirtualTexture;
struct ULightMapVirtualTexture;
struct ULightMapVirtualTexture2D;
struct UVirtualTexturePoolConfig;
struct UVisualLoggerAutomationTests;
struct IVisualLoggerDebugSnapshotInterface;
struct UVisualLoggerKismetLibrary;
struct UVoiceChannel;
struct UVOIPTalker;
struct UVOIPStatics;
struct UVolumeTexture;
struct AVolumetricLightmapDensityVolume;
struct AWindDirectionalSource;
struct UWindDirectionalSourceComponent;
struct UHierarchicalLODSetup;
struct Default__BlueprintGeneratedClass;
struct Default__AnimBlueprintGeneratedClass;

// Object: Enum Engine.ETextGender
enum class ETextGender : uint8_t
{
	Masculine = 0,
	Feminine = 1,
	Neuter = 2,
	ETextGender_MAX = 3
};

// Object: Enum Engine.EFormatArgumentType
enum class EFormatArgumentType : uint8_t
{
	Int = 0,
	UInt = 1,
	Float = 2,
	Double = 3,
	Text = 4,
	Gender = 5,
	EFormatArgumentType_MAX = 6
};

// Object: Enum Engine.EEndPlayReason
enum class EEndPlayReason : uint8_t
{
	Destroyed = 0,
	LevelTransition = 1,
	EndPlayInEditor = 2,
	RemovedFromWorld = 3,
	Quit = 4,
	EEndPlayReason_MAX = 5
};

// Object: Enum Engine.ETickingGroup
enum class ETickingGroup : uint8_t
{
	TG_PrePhysics = 0,
	TG_StartPhysics = 1,
	TG_DuringPhysics = 2,
	TG_EndPhysics = 3,
	TG_PostPhysics = 4,
	TG_PostUpdateWork = 5,
	TG_LastDemotable = 6,
	TG_NewlySpawned = 7,
	TG_MAX = 8
};

// Object: Enum Engine.EComponentCreationMethod
enum class EComponentCreationMethod : uint8_t
{
	Native = 0,
	SimpleConstructionScript = 1,
	UserConstructionScript = 2,
	Instance = 3,
	EComponentCreationMethod_MAX = 4
};

// Object: Enum Engine.EComponentReplicationFlags
enum class EComponentReplicationFlags : uint8_t
{
	Rep_Always = 0,
	Rep_OwnerOnly = 1,
	Rep_SimulateOnly = 4,
	Rep_ToBeObservedOnly = 8,
	Rep_OwnerAndSimulate = 16,
	Rep_OwnerAndOB = 32,
	Rep_SimulteAndOB = 64,
	Rep_MAX = 65
};

// Object: Enum Engine.ETemperatureSeverityType
enum class ETemperatureSeverityType : uint8_t
{
	Unknown = 0,
	Good = 1,
	Bad = 2,
	Serious = 3,
	Critical = 4,
	NumSeverities = 5,
	ETemperatureSeverityType_MAX = 6
};

// Object: Enum Engine.EPlaneConstraintAxisSetting
enum class EPlaneConstraintAxisSetting : uint8_t
{
	Custom = 0,
	X = 1,
	Y = 2,
	Z = 3,
	UseGlobalPhysicsSetting = 4,
	EPlaneConstraintAxisSetting_MAX = 5
};

// Object: Enum Engine.EInterpToBehaviourType
enum class EInterpToBehaviourType : uint8_t
{
	OneShot = 0,
	OneShot_Reverse = 1,
	Loop_Reset = 2,
	PingPong = 3,
	EInterpToBehaviourType_MAX = 4
};

// Object: Enum Engine.ETeleportType
enum class ETeleportType : uint8_t
{
	None = 0,
	TeleportPhysics = 1,
	ResetPhysics = 2,
	SkipSkeletalMeshUpdateChildComponents = 4,
	ETeleportType_MAX = 5
};

// Object: Enum Engine.EPlatformInterfaceDataType
enum class EPlatformInterfaceDataType : uint8_t
{
	PIDT_None = 0,
	PIDT_Int = 1,
	PIDT_Float = 2,
	PIDT_String = 3,
	PIDT_Object = 4,
	PIDT_Custom = 5,
	PIDT_MAX = 6
};

// Object: Enum Engine.EMovementMode
enum class EMovementMode : uint8_t
{
	MOVE_None = 0,
	MOVE_Walking = 1,
	MOVE_NavWalking = 2,
	MOVE_Falling = 3,
	MOVE_Swimming = 4,
	MOVE_Flying = 5,
	MOVE_Custom = 6,
	MOVE_MAX = 7
};

// Object: Enum Engine.ENetworkFailure
enum class ENetworkFailure : uint8_t
{
	NetDriverAlreadyExists = 0,
	NetDriverCreateFailure = 1,
	NetDriverListenFailure = 2,
	ConnectionLost = 3,
	ConnectionTimeout = 4,
	FailureReceived = 5,
	OutdatedClient = 6,
	OutdatedServer = 7,
	PendingConnectionFailure = 8,
	NetGuidMismatch = 9,
	NetChecksumMismatch = 10,
	NonExistantPackage = 11,
	CorruptedPacket = 12,
	ENetworkFailure_MAX = 13
};

// Object: Enum Engine.ETravelFailure
enum class ETravelFailure : uint8_t
{
	NoLevel = 0,
	LoadMapFailure = 1,
	InvalidURL = 2,
	PackageMissing = 3,
	PackageVersion = 4,
	NoDownload = 5,
	TravelFailure = 6,
	CheatCommands = 7,
	PendingNetGameCreateFailure = 8,
	CloudSaveFailure = 9,
	ServerTravelFailure = 10,
	ClientTravelFailure = 11,
	ETravelFailure_MAX = 12
};

// Object: Enum Engine.EScreenOrientation
enum class EScreenOrientation : uint8_t
{
	Unknown = 0,
	Portrait = 1,
	PortraitUpsideDown = 2,
	LandscapeLeft = 3,
	LandscapeRight = 4,
	FaceUp = 5,
	FaceDown = 6,
	EScreenOrientation_MAX = 7
};

// Object: Enum Engine.EApplicationState
enum class EApplicationState : uint8_t
{
	Unknown = 0,
	Inactive = 1,
	Background = 2,
	Active = 3,
	EApplicationState_MAX = 4
};

// Object: Enum Engine.EObjectTypeQuery
enum class EObjectTypeQuery : uint8_t
{
	ObjectTypeQuery1 = 0,
	ObjectTypeQuery2 = 1,
	ObjectTypeQuery3 = 2,
	ObjectTypeQuery4 = 3,
	ObjectTypeQuery5 = 4,
	ObjectTypeQuery6 = 5,
	ObjectTypeQuery7 = 6,
	ObjectTypeQuery8 = 7,
	ObjectTypeQuery9 = 8,
	ObjectTypeQuery10 = 9,
	ObjectTypeQuery11 = 10,
	ObjectTypeQuery12 = 11,
	ObjectTypeQuery13 = 12,
	ObjectTypeQuery14 = 13,
	ObjectTypeQuery15 = 14,
	ObjectTypeQuery16 = 15,
	ObjectTypeQuery17 = 16,
	ObjectTypeQuery18 = 17,
	ObjectTypeQuery19 = 18,
	ObjectTypeQuery20 = 19,
	ObjectTypeQuery21 = 20,
	ObjectTypeQuery22 = 21,
	ObjectTypeQuery23 = 22,
	ObjectTypeQuery24 = 23,
	ObjectTypeQuery25 = 24,
	ObjectTypeQuery26 = 25,
	ObjectTypeQuery27 = 26,
	ObjectTypeQuery28 = 27,
	ObjectTypeQuery29 = 28,
	ObjectTypeQuery30 = 29,
	ObjectTypeQuery31 = 30,
	ObjectTypeQuery32 = 31,
	ObjectTypeQuery_MAX = 32,
	EObjectTypeQuery_MAX = 33
};

// Object: Enum Engine.EDrawDebugTrace
enum class EDrawDebugTrace : uint8_t
{
	None = 0,
	ForOneFrame = 1,
	ForDuration = 2,
	Persistent = 3,
	EDrawDebugTrace_MAX = 4
};

// Object: Enum Engine.ETraceTypeQuery
enum class ETraceTypeQuery : uint8_t
{
	TraceTypeQuery1 = 0,
	TraceTypeQuery2 = 1,
	TraceTypeQuery3 = 2,
	TraceTypeQuery4 = 3,
	TraceTypeQuery5 = 4,
	TraceTypeQuery6 = 5,
	TraceTypeQuery7 = 6,
	TraceTypeQuery8 = 7,
	TraceTypeQuery9 = 8,
	TraceTypeQuery10 = 9,
	TraceTypeQuery11 = 10,
	TraceTypeQuery12 = 11,
	TraceTypeQuery13 = 12,
	TraceTypeQuery14 = 13,
	TraceTypeQuery15 = 14,
	TraceTypeQuery16 = 15,
	TraceTypeQuery17 = 16,
	TraceTypeQuery18 = 17,
	TraceTypeQuery19 = 18,
	TraceTypeQuery20 = 19,
	TraceTypeQuery21 = 20,
	TraceTypeQuery22 = 21,
	TraceTypeQuery23 = 22,
	TraceTypeQuery24 = 23,
	TraceTypeQuery25 = 24,
	TraceTypeQuery26 = 25,
	TraceTypeQuery27 = 26,
	TraceTypeQuery28 = 27,
	TraceTypeQuery29 = 28,
	TraceTypeQuery30 = 29,
	TraceTypeQuery31 = 30,
	TraceTypeQuery32 = 31,
	TraceTypeQuery_MAX = 32,
	ETraceTypeQuery_MAX = 33
};

// Object: Enum Engine.EMoveComponentAction
enum class EMoveComponentAction : uint8_t
{
	Move = 0,
	Stop = 1,
	Return = 2,
	EMoveComponentAction_MAX = 3
};

// Object: Enum Engine.EQuitPreference
enum class EQuitPreference : uint8_t
{
	Quit = 0,
	Background = 1,
	EQuitPreference_MAX = 2
};

// Object: Enum Engine.EMouseLockMode
enum class EMouseLockMode : uint8_t
{
	DoNotLock = 0,
	LockOnCapture = 1,
	LockAlways = 2,
	LockInFullscreen = 3,
	EMouseLockMode_MAX = 4
};

// Object: Enum Engine.EWindowTitleBarMode
enum class EWindowTitleBarMode : uint8_t
{
	Overlay = 0,
	VerticalBox = 1,
	EWindowTitleBarMode_MAX = 2
};

// Object: Enum Engine.EMaterialAtlasUsage
enum class EMaterialAtlasUsage : uint8_t
{
	None = 0,
	Usage0 = 1,
	Usage1 = 2,
	Usage2 = 3,
	Usage3 = 4,
	EMaterialAtlasUsage_MAX = 5
};

// Object: Enum Engine.ERoundingMode
enum class ERoundingMode : uint8_t
{
	HalfToEven = 0,
	HalfFromZero = 1,
	HalfToZero = 2,
	FromZero = 3,
	ToZero = 4,
	ToNegativeInfinity = 5,
	ToPositiveInfinity = 6,
	ERoundingMode_MAX = 7
};

// Object: Enum Engine.EFastArraySerializerDeltaFlags
enum class EFastArraySerializerDeltaFlags : uint8_t
{
	None = 0,
	HasBeenSerialized = 1,
	HasDeltaBeenRequested = 2,
	IsUsingDeltaSerialization = 4,
	EFastArraySerializerDeltaFlags_MAX = 5
};

// Object: Enum Engine.ENetRole
enum class ENetRole : uint8_t
{
	ROLE_None = 0,
	ROLE_SimulatedProxy = 1,
	ROLE_AutonomousProxy = 2,
	ROLE_Authority = 3,
	ROLE_MAX = 4
};

// Object: Enum Engine.EAttachLocation
enum class EAttachLocation : uint8_t
{
	KeepRelativeOffset = 0,
	KeepWorldPosition = 1,
	SnapToTarget = 2,
	SnapToTargetIncludingScale = 3,
	EAttachLocation_MAX = 4
};

// Object: Enum Engine.EAttachmentRule
enum class EAttachmentRule : uint8_t
{
	KeepRelative = 0,
	KeepWorld = 1,
	SnapToTarget = 2,
	EAttachmentRule_MAX = 3
};

// Object: Enum Engine.EDetachmentRule
enum class EDetachmentRule : uint8_t
{
	KeepRelative = 0,
	KeepWorld = 1,
	EDetachmentRule_MAX = 2
};

// Object: Enum Engine.ENetDormancy
enum class ENetDormancy : uint8_t
{
	DORM_Never = 0,
	DORM_Awake = 1,
	DORM_DormantAll = 2,
	DORM_DormantPartial = 3,
	DORM_Initial = 4,
	DORM_DormantAll_KeelChannel = 5,
	DORM_MAX = 6
};

// Object: Enum Engine.EAutoReceiveInput
enum class EAutoReceiveInput : uint8_t
{
	Disabled = 0,
	Player0 = 1,
	Player1 = 2,
	Player2 = 3,
	Player3 = 4,
	Player4 = 5,
	Player5 = 6,
	Player6 = 7,
	Player7 = 8,
	EAutoReceiveInput_MAX = 9
};

// Object: Enum Engine.ESpawnActorCollisionHandlingMethod
enum class ESpawnActorCollisionHandlingMethod : uint8_t
{
	Undefined = 0,
	AlwaysSpawn = 1,
	AdjustIfPossibleButAlwaysSpawn = 2,
	AdjustIfPossibleButDontSpawnIfColliding = 3,
	DontSpawnIfColliding = 4,
	ESpawnActorCollisionHandlingMethod_MAX = 5
};

// Object: Enum Engine.ERotatorQuantization
enum class ERotatorQuantization : uint8_t
{
	ByteComponents = 0,
	ShortComponents = 1,
	ERotatorQuantization_MAX = 2
};

// Object: Enum Engine.EVectorQuantization
enum class EVectorQuantization : uint8_t
{
	RoundWholeNumber = 0,
	RoundOneDecimal = 1,
	RoundTwoDecimals = 2,
	EVectorQuantization_MAX = 3
};

// Object: Enum Engine.EActorUpdateOverlapsMethod
enum class EActorUpdateOverlapsMethod : uint8_t
{
	UseConfigDefault = 0,
	AlwaysUpdate = 1,
	OnlyUpdateMovable = 2,
	NeverUpdate = 3,
	EActorUpdateOverlapsMethod_MAX = 4
};

// Object: Enum Engine.EViewTargetBlendFunction
enum class EViewTargetBlendFunction : uint8_t
{
	VTBlend_Linear = 0,
	VTBlend_Cubic = 1,
	VTBlend_EaseIn = 2,
	VTBlend_EaseOut = 3,
	VTBlend_EaseInOut = 4,
	VTBlend_MAX = 5
};

// Object: Enum Engine.EAspectRatioAxisConstraint
enum class EAspectRatioAxisConstraint : uint8_t
{
	AspectRatio_MaintainYFOV = 0,
	AspectRatio_MaintainXFOV = 1,
	AspectRatio_MajorAxisFOV = 2,
	AspectRatio_MAX = 3
};

// Object: Enum Engine.EInputEvent
enum class EInputEvent : uint8_t
{
	IE_Pressed = 0,
	IE_Released = 1,
	IE_Repeat = 2,
	IE_DoubleClick = 3,
	IE_Axis = 4,
	IE_MAX = 5
};

// Object: Enum Engine.EAutoPossessAI
enum class EAutoPossessAI : uint8_t
{
	Disabled = 0,
	PlacedInWorld = 1,
	Spawned = 2,
	PlacedInWorldOrSpawned = 3,
	EAutoPossessAI_MAX = 4
};

// Object: Enum Engine.ECollisionChannel
enum class ECollisionChannel : uint8_t
{
	ECC_WorldStatic = 0,
	ECC_WorldDynamic = 1,
	ECC_Pawn = 2,
	ECC_Visibility = 3,
	ECC_Camera = 4,
	ECC_PhysicsBody = 5,
	ECC_Vehicle = 6,
	ECC_Destructible = 7,
	ECC_EngineTraceChannel1 = 8,
	ECC_EngineTraceChannel2 = 9,
	ECC_EngineTraceChannel3 = 10,
	ECC_EngineTraceChannel4 = 11,
	ECC_EngineTraceChannel5 = 12,
	ECC_EngineTraceChannel6 = 13,
	ECC_GameTraceChannel1 = 14,
	ECC_GameTraceChannel2 = 15,
	ECC_GameTraceChannel3 = 16,
	ECC_GameTraceChannel4 = 17,
	ECC_GameTraceChannel5 = 18,
	ECC_GameTraceChannel6 = 19,
	ECC_GameTraceChannel7 = 20,
	ECC_GameTraceChannel8 = 21,
	ECC_GameTraceChannel9 = 22,
	ECC_GameTraceChannel10 = 23,
	ECC_GameTraceChannel11 = 24,
	ECC_GameTraceChannel12 = 25,
	ECC_GameTraceChannel13 = 26,
	ECC_GameTraceChannel14 = 27,
	ECC_GameTraceChannel15 = 28,
	ECC_GameTraceChannel16 = 29,
	ECC_GameTraceChannel17 = 30,
	ECC_GameTraceChannel18 = 31,
	ECC_OverlapAll_Deprecated = 32,
	ECC_MAX = 33
};

// Object: Enum Engine.EComponentMobility
enum class EComponentMobility : uint8_t
{
	Static = 0,
	Stationary = 1,
	Movable = 2,
	EComponentMobility_MAX = 3
};

// Object: Enum Engine.ECollisionResponse
enum class ECollisionResponse : uint8_t
{
	ECR_Ignore = 0,
	ECR_Overlap = 1,
	ECR_Block = 2,
	ECR_MAX = 3
};

// Object: Enum Engine.ERichCurveExtrapolation
enum class ERichCurveExtrapolation : uint8_t
{
	RCCE_Cycle = 0,
	RCCE_CycleWithOffset = 1,
	RCCE_Oscillate = 2,
	RCCE_Linear = 3,
	RCCE_Constant = 4,
	RCCE_None = 5,
	RCCE_MAX = 6
};

// Object: Enum Engine.ERichCurveTangentWeightMode
enum class ERichCurveTangentWeightMode : uint8_t
{
	RCTWM_WeightedNone = 0,
	RCTWM_WeightedArrive = 1,
	RCTWM_WeightedLeave = 2,
	RCTWM_WeightedBoth = 3,
	RCTWM_MAX = 4
};

// Object: Enum Engine.ERichCurveTangentMode
enum class ERichCurveTangentMode : uint8_t
{
	RCTM_Auto = 0,
	RCTM_User = 1,
	RCTM_Break = 2,
	RCTM_None = 3,
	RCTM_MAX = 4
};

// Object: Enum Engine.ERichCurveInterpMode
enum class ERichCurveInterpMode : uint8_t
{
	RCIM_Linear = 0,
	RCIM_Constant = 1,
	RCIM_Cubic = 2,
	RCIM_None = 3,
	RCIM_MAX = 4
};

// Object: Enum Engine.ECollisionEnabled
enum class ECollisionEnabled : uint8_t
{
	NoCollision = 0,
	QueryOnly = 1,
	PhysicsOnly = 2,
	QueryAndPhysics = 3,
	ECollisionEnabled_MAX = 4
};

// Object: Enum Engine.EAnimLinkMethod
enum class EAnimLinkMethod : uint8_t
{
	Absolute = 0,
	Relative = 1,
	Proportional = 2,
	EAnimLinkMethod_MAX = 3
};

// Object: Enum Engine.ENotifyFilterType
enum class ENotifyFilterType : uint8_t
{
	NoFiltering = 0,
	LOD = 1,
	AnimLOD = 2,
	ENotifyFilterType_MAX = 3
};

// Object: Enum Engine.EMontageNotifyTickType
enum class EMontageNotifyTickType : uint8_t
{
	Queued = 0,
	BranchingPoint = 1,
	EMontageNotifyTickType_MAX = 2
};

// Object: Enum Engine.TextureGroup
enum class ETextureGroup : uint8_t
{
	TEXTUREGROUP_World = 0,
	TEXTUREGROUP_WorldNormalMap = 1,
	TEXTUREGROUP_WorldSpecular = 2,
	TEXTUREGROUP_Character = 3,
	TEXTUREGROUP_CharacterNormalMap = 4,
	TEXTUREGROUP_CharacterSpecular = 5,
	TEXTUREGROUP_Weapon = 6,
	TEXTUREGROUP_WeaponNormalMap = 7,
	TEXTUREGROUP_WeaponSpecular = 8,
	TEXTUREGROUP_Vehicle = 9,
	TEXTUREGROUP_VehicleNormalMap = 10,
	TEXTUREGROUP_VehicleSpecular = 11,
	TEXTUREGROUP_Cinematic = 12,
	TEXTUREGROUP_Effects = 13,
	TEXTUREGROUP_EffectsNotFiltered = 14,
	TEXTUREGROUP_Skybox = 15,
	TEXTUREGROUP_UI = 16,
	TEXTUREGROUP_Lightmap = 17,
	TEXTUREGROUP_RenderTarget = 18,
	TEXTUREGROUP_MobileFlattened = 19,
	TEXTUREGROUP_ProcBuilding_Face = 20,
	TEXTUREGROUP_ProcBuilding_LightMap = 21,
	TEXTUREGROUP_Shadowmap = 22,
	TEXTUREGROUP_ColorLookupTable = 23,
	TEXTUREGROUP_Terrain_Heightmap = 24,
	TEXTUREGROUP_Terrain_Weightmap = 25,
	TEXTUREGROUP_Bokeh = 26,
	TEXTUREGROUP_IESLightProfile = 27,
	TEXTUREGROUP_Pixels2D = 28,
	TEXTUREGROUP_HierarchicalLOD = 29,
	TEXTUREGROUP_Impostor = 30,
	TEXTUREGROUP_ImpostorNormalDepth = 31,
	TEXTUREGROUP_8BitData = 32,
	TEXTUREGROUP_16BitData = 33,
	TEXTUREGROUP_WorldAniso = 34,
	TEXTUREGROUP_WorldNoSmallPak = 35,
	TEXTUREGROUP_Grass = 36,
	TEXTUREGROUP_Tree = 37,
	TEXTUREGROUP_Building = 38,
	TEXTUREGROUP_Stone = 39,
	TEXTUREGROUP_Prop = 40,
	TEXTUREGROUP_Decal = 41,
	TEXTUREGROUP_Project01 = 42,
	TEXTUREGROUP_Project02 = 43,
	TEXTUREGROUP_Project03 = 44,
	TEXTUREGROUP_Project04 = 45,
	TEXTUREGROUP_Project05 = 46,
	TEXTUREGROUP_Project06 = 47,
	TEXTUREGROUP_Project07 = 48,
	TEXTUREGROUP_Project08 = 49,
	TEXTUREGROUP_Project09 = 50,
	TEXTUREGROUP_Project10 = 51,
	TEXTUREGROUP_MAX = 52
};

// Object: Enum Engine.ERelativeTransformSpace
enum class ERelativeTransformSpace : uint8_t
{
	RTS_World = 0,
	RTS_Actor = 1,
	RTS_Component = 2,
	RTS_ParentBoneSpace = 3,
	RTS_MAX = 4
};

// Object: Enum Engine.EDetailMode
enum class EDetailMode : uint8_t
{
	DM_Low = 0,
	DM_Medium = 1,
	DM_High = 2,
	DM_MAX = 3
};

// Object: Enum Engine.EAlphaBlendOption
enum class EAlphaBlendOption : uint8_t
{
	Linear = 0,
	Cubic = 1,
	HermiteCubic = 2,
	Sinusoidal = 3,
	QuadraticInOut = 4,
	CubicInOut = 5,
	QuarticInOut = 6,
	QuinticInOut = 7,
	CircularIn = 8,
	CircularOut = 9,
	CircularInOut = 10,
	ExpIn = 11,
	ExpOut = 12,
	ExpInOut = 13,
	Custom = 14,
	EAlphaBlendOption_MAX = 15
};

// Object: Enum Engine.EAnimGroupRole
enum class EAnimGroupRole : uint8_t
{
	CanBeLeader = 0,
	AlwaysFollower = 1,
	AlwaysLeader = 2,
	TransitionLeader = 3,
	TransitionFollower = 4,
	EAnimGroupRole_MAX = 5
};

// Object: Enum Engine.EPreviewAnimationBlueprintApplicationMethod
enum class EPreviewAnimationBlueprintApplicationMethod : uint8_t
{
	LinkedLayers = 0,
	LinkedAnimGraph = 1,
	EPreviewAnimationBlueprintApplicationMethod_MAX = 2
};

// Object: Enum Engine.AnimationKeyFormat
enum class EAnimationKeyFormat : uint8_t
{
	AKF_ConstantKeyLerp = 0,
	AKF_VariableKeyLerp = 1,
	AKF_PerTrackCompression = 2,
	AKF_MAX = 3
};

// Object: Enum Engine.ERawCurveTrackTypes
enum class ERawCurveTrackTypes : uint8_t
{
	RCT_Float = 0,
	RCT_Vector = 1,
	RCT_Transform = 2,
	RCT_MAX = 3
};

// Object: Enum Engine.EAnimAssetCurveFlags
enum class EAnimAssetCurveFlags : uint8_t
{
	AACF_NONE = 0,
	AACF_DriveMorphTarget_DEPRECATED = 1,
	AACF_DriveAttribute_DEPRECATED = 2,
	AACF_Editable = 4,
	AACF_DriveMaterial_DEPRECATED = 8,
	AACF_Metadata = 16,
	AACF_DriveTrack = 32,
	AACF_Disabled = 64,
	AACF_MAX = 65
};

// Object: Enum Engine.AnimationCompressionFormat
enum class EAnimationCompressionFormat : uint8_t
{
	ACF_None = 0,
	ACF_Float96NoW = 1,
	ACF_Fixed48NoW = 2,
	ACF_IntervalFixed32NoW = 3,
	ACF_Fixed32NoW = 4,
	ACF_Float32NoW = 5,
	ACF_Identity = 6,
	ACF_MAX = 7
};

// Object: Enum Engine.EAdditiveBasePoseType
enum class EAdditiveBasePoseType : uint8_t
{
	ABPT_None = 0,
	ABPT_RefPose = 1,
	ABPT_AnimScaled = 2,
	ABPT_AnimFrame = 3,
	ABPT_MAX = 4
};

// Object: Enum Engine.ERootMotionMode
enum class ERootMotionMode : uint8_t
{
	NoRootMotionExtraction = 0,
	IgnoreRootMotion = 1,
	RootMotionFromEverything = 2,
	RootMotionFromMontagesOnly = 3,
	ERootMotionMode_MAX = 4
};

// Object: Enum Engine.ERootMotionRootLock
enum class ERootMotionRootLock : uint8_t
{
	RefPose = 0,
	AnimFirstFrame = 1,
	Zero = 2,
	ERootMotionRootLock_MAX = 3
};

// Object: Enum Engine.EMontagePlayReturnType
enum class EMontagePlayReturnType : uint8_t
{
	MontageLength = 0,
	Duration = 1,
	EMontagePlayReturnType_MAX = 2
};

// Object: Enum Engine.EDrawDebugItemType
enum class EDrawDebugItemType : uint8_t
{
	DirectionalArrow = 0,
	Sphere = 1,
	Line = 2,
	OnScreenMessage = 3,
	CoordinateSystem = 4,
	EDrawDebugItemType_MAX = 5
};

// Object: Enum Engine.EMontageSubStepResult
enum class EMontageSubStepResult : uint8_t
{
	Moved = 0,
	NotMoved = 1,
	InvalidSection = 2,
	InvalidMontage = 3,
	EMontageSubStepResult_MAX = 4
};

// Object: Enum Engine.EAnimNotifyEventType
enum class EAnimNotifyEventType : uint8_t
{
	Begin = 0,
	End = 1,
	EAnimNotifyEventType_MAX = 2
};

// Object: Enum Engine.EInertializationSpace
enum class EInertializationSpace : uint8_t
{
	Default = 0,
	WorldSpace = 1,
	WorldRotation = 2,
	EInertializationSpace_MAX = 3
};

// Object: Enum Engine.EInertializationBoneState
enum class EInertializationBoneState : uint8_t
{
	Invalid = 0,
	Valid = 1,
	Excluded = 2,
	EInertializationBoneState_MAX = 3
};

// Object: Enum Engine.EInertializationState
enum class EInertializationState : uint8_t
{
	Inactive = 0,
	Pending = 1,
	Active = 2,
	EInertializationState_MAX = 3
};

// Object: Enum Engine.EEvaluatorMode
enum class EEvaluatorMode : uint8_t
{
	EM_Standard = 0,
	EM_Freeze = 1,
	EM_DelayedFreeze = 2,
	EM_MAX = 3
};

// Object: Enum Engine.EEvaluatorDataSource
enum class EEvaluatorDataSource : uint8_t
{
	EDS_SourcePose = 0,
	EDS_DestinationPose = 1,
	EDS_MAX = 2
};

// Object: Enum Engine.ECopyType
enum class ECopyType : uint8_t
{
	MemCopy = 0,
	BoolProperty = 1,
	StructProperty = 2,
	ObjectProperty = 3,
	ECopyType_MAX = 4
};

// Object: Enum Engine.EPostCopyOperation
enum class EPostCopyOperation : uint8_t
{
	None = 0,
	LogicalNegateBool = 1,
	EPostCopyOperation_MAX = 2
};

// Object: Enum Engine.EPinHidingMode
enum class EPinHidingMode : uint8_t
{
	NeverAsPin = 0,
	PinHiddenByDefault = 1,
	PinShownByDefault = 2,
	AlwaysAsPin = 3,
	EPinHidingMode_MAX = 4
};

// Object: Enum Engine.AnimPhysCollisionType
enum class EAnimPhysCollisionType : uint8_t
{
	CoM = 0,
	CustomSphere = 1,
	InnerSphere = 2,
	OuterSphere = 3,
	AnimPhysCollisionType_MAX = 4
};

// Object: Enum Engine.AnimPhysTwistAxis
enum class EAnimPhysTwistAxis : uint8_t
{
	AxisX = 0,
	AxisY = 1,
	AxisZ = 2,
	AnimPhysTwistAxis_MAX = 3
};

// Object: Enum Engine.ETypeAdvanceAnim
enum class ETypeAdvanceAnim : uint8_t
{
	ETAA_Default = 0,
	ETAA_Finished = 1,
	ETAA_Looped = 2,
	ETAA_MAX = 3
};

// Object: Enum Engine.ETransitionLogicType
enum class ETransitionLogicType : uint8_t
{
	TLT_StandardBlend = 0,
	TLT_Inertialization = 1,
	TLT_Custom = 2,
	TLT_MAX = 3
};

// Object: Enum Engine.ETransitionBlendMode
enum class ETransitionBlendMode : uint8_t
{
	TBM_Linear = 0,
	TBM_Cubic = 1,
	TBM_MAX = 2
};

// Object: Enum Engine.EComponentType
enum class EComponentType : uint8_t
{
	None = 0,
	TranslationX = 1,
	TranslationY = 2,
	TranslationZ = 3,
	RotationX = 4,
	RotationY = 5,
	RotationZ = 6,
	Scale = 7,
	ScaleX = 8,
	ScaleY = 9,
	ScaleZ = 10,
	EComponentType_MAX = 11
};

// Object: Enum Engine.EAxisOption
enum class EAxisOption : uint8_t
{
	X = 0,
	Y = 1,
	Z = 2,
	X_Neg = 3,
	Y_Neg = 4,
	Z_Neg = 5,
	Custom = 6,
	EAxisOption_MAX = 7
};

// Object: Enum Engine.EAnimInterpolationType
enum class EAnimInterpolationType : uint8_t
{
	Linear = 0,
	Step = 1,
	EAnimInterpolationType_MAX = 2
};

// Object: Enum Engine.ECurveBlendOption
enum class ECurveBlendOption : uint8_t
{
	MaxWeight = 0,
	NormalizeByWeight = 1,
	BlendByWeight = 2,
	ECurveBlendOption_MAX = 3
};

// Object: Enum Engine.EAdditiveAnimationType
enum class EAdditiveAnimationType : uint8_t
{
	AAT_None = 0,
	AAT_LocalSpaceBase = 1,
	AAT_RotationOffsetMeshSpace = 2,
	AAT_MAX = 3
};

// Object: Enum Engine.EBoneRotationSource
enum class EBoneRotationSource : uint8_t
{
	BRS_KeepComponentSpaceRotation = 0,
	BRS_KeepLocalSpaceRotation = 1,
	BRS_CopyFromTarget = 2,
	BRS_MAX = 3
};

// Object: Enum Engine.EBoneControlSpace
enum class EBoneControlSpace : uint8_t
{
	BCS_WorldSpace = 0,
	BCS_ComponentSpace = 1,
	BCS_ParentBoneSpace = 2,
	BCS_BoneSpace = 3,
	BCS_MAX = 4
};

// Object: Enum Engine.EBoneAxis
enum class EBoneAxis : uint8_t
{
	BA_X = 0,
	BA_Y = 1,
	BA_Z = 2,
	BA_MAX = 3
};

// Object: Enum Engine.EAOReplacingSearchDirection
enum class EAOReplacingSearchDirection : uint8_t
{
	ForwardX = 0,
	BidirectionalX = 1,
	AllAxes = 2,
	EAOReplacingSearchDirection_MAX = 3
};

// Object: Enum Engine.EAOReplacingWeightingMethod
enum class EAOReplacingWeightingMethod : uint8_t
{
	Uniform = 0,
	ByVolume = 1,
	ByProjectedArea = 2,
	ByProjectedIntersectionArea = 3,
	EAOReplacingWeightingMethod_MAX = 4
};

// Object: Enum Engine.EPrimaryAssetPakRule
enum class EPrimaryAssetPakRule : uint8_t
{
	Default = 0,
	Necessary = 1,
	Auto = 2,
	Options = 3,
	EPrimaryAssetPakRule_MAX = 4
};

// Object: Enum Engine.EPrimaryAssetCookRule
enum class EPrimaryAssetCookRule : uint8_t
{
	Unknown = 0,
	NeverCook = 1,
	DevelopmentCook = 2,
	DevelopmentAlwaysCook = 3,
	AlwaysCook = 4,
	EPrimaryAssetCookRule_MAX = 5
};

// Object: Enum Engine.EAttenuationShape
enum class EAttenuationShape : uint8_t
{
	Sphere = 0,
	Capsule = 1,
	Box = 2,
	Cone = 3,
	EAttenuationShape_MAX = 4
};

// Object: Enum Engine.EAttenuationDistanceModel
enum class EAttenuationDistanceModel : uint8_t
{
	Linear = 0,
	Logarithmic = 1,
	Inverse = 2,
	LogReverse = 3,
	NaturalSound = 4,
	Custom = 5,
	EAttenuationDistanceModel_MAX = 6
};

// Object: Enum Engine.EAudioFaderCurve
enum class EAudioFaderCurve : uint8_t
{
	Linear = 0,
	Logarithmic = 1,
	SCurve = 2,
	Sin = 3,
	Count = 4,
	EAudioFaderCurve_MAX = 5
};

// Object: Enum Engine.EAudioComponentPlayState
enum class EAudioComponentPlayState : uint8_t
{
	Playing = 0,
	Stopped = 1,
	Paused = 2,
	FadingIn = 3,
	FadingOut = 4,
	Count = 5,
	EAudioComponentPlayState_MAX = 6
};

// Object: Enum Engine.EMonoChannelUpmixMethod
enum class EMonoChannelUpmixMethod : uint8_t
{
	Linear = 0,
	EqualPower = 1,
	FullVolume = 2,
	EMonoChannelUpmixMethod_MAX = 3
};

// Object: Enum Engine.EPanningMethod
enum class EPanningMethod : uint8_t
{
	Linear = 0,
	EqualPower = 1,
	EPanningMethod_MAX = 2
};

// Object: Enum Engine.EVoiceSampleRate
enum class EVoiceSampleRate : uint16_t
{
	Low16000Hz = 16000,
	Normal24000Hz = 24000,
	EVoiceSampleRate_MAX = 24001
};

// Object: Enum Engine.ReverbPreset
enum class EReverbPreset : uint8_t
{
	REVERB_Default = 0,
	REVERB_Bathroom = 1,
	REVERB_StoneRoom = 2,
	REVERB_Auditorium = 3,
	REVERB_ConcertHall = 4,
	REVERB_Cave = 5,
	REVERB_Hallway = 6,
	REVERB_StoneCorridor = 7,
	REVERB_Alley = 8,
	REVERB_Forest = 9,
	REVERB_City = 10,
	REVERB_Mountains = 11,
	REVERB_Quarry = 12,
	REVERB_Plain = 13,
	REVERB_ParkingLot = 14,
	REVERB_SewerPipe = 15,
	REVERB_Underwater = 16,
	REVERB_SmallRoom = 17,
	REVERB_MediumRoom = 18,
	REVERB_LargeRoom = 19,
	REVERB_MediumHall = 20,
	REVERB_LargeHall = 21,
	REVERB_Plate = 22,
	REVERB_MAX = 23
};

// Object: Enum Engine.EBlendableLocation
enum class EBlendableLocation : uint8_t
{
	BL_AfterTonemapping = 0,
	BL_BeforeTonemapping = 1,
	BL_BeforeTranslucency = 2,
	BL_ReplacingTonemapper = 3,
	BL_SSRInput = 4,
	BL_MAX = 5
};

// Object: Enum Engine.ENotifyTriggerMode
enum class ENotifyTriggerMode : uint8_t
{
	AllAnimations = 0,
	HighestWeightedAnimation = 1,
	None = 2,
	ENotifyTriggerMode_MAX = 3
};

// Object: Enum Engine.EBlendSpaceAxis
enum class EBlendSpaceAxis : uint8_t
{
	BSA_None = 0,
	BSA_X = 1,
	BSA_Y = 2,
	BSA_Max = 3
};

// Object: Enum Engine.EBlueprintNativizationFlag
enum class EBlueprintNativizationFlag : uint8_t
{
	Disabled = 0,
	Dependency = 1,
	ExplicitlyEnabled = 2,
	EBlueprintNativizationFlag_MAX = 3
};

// Object: Enum Engine.EBlueprintCompileMode
enum class EBlueprintCompileMode : uint8_t
{
	Default = 0,
	Development = 1,
	FinalRelease = 2,
	EBlueprintCompileMode_MAX = 3
};

// Object: Enum Engine.EBlueprintType
enum class EBlueprintType : uint8_t
{
	BPTYPE_Normal = 0,
	BPTYPE_Const = 1,
	BPTYPE_MacroLibrary = 2,
	BPTYPE_Interface = 3,
	BPTYPE_LevelScript = 4,
	BPTYPE_FunctionLibrary = 5,
	BPTYPE_MAX = 6
};

// Object: Enum Engine.EBlueprintStatus
enum class EBlueprintStatus : uint8_t
{
	BS_Unknown = 0,
	BS_Dirty = 1,
	BS_Error = 2,
	BS_UpToDate = 3,
	BS_BeingCreated = 4,
	BS_UpToDateWithWarnings = 5,
	BS_MAX = 6
};

// Object: Enum Engine.EDOFMode
enum class EDOFMode : uint8_t
{
	Default = 0,
	SixDOF = 1,
	YZPlane = 2,
	XZPlane = 3,
	XYPlane = 4,
	CustomPlane = 5,
	None = 6,
	EDOFMode_MAX = 7
};

// Object: Enum Engine.EBodyCollisionResponse
enum class EBodyCollisionResponse : uint8_t
{
	BodyCollision_Enabled = 0,
	BodyCollision_Disabled = 1,
	BodyCollision_MAX = 2
};

// Object: Enum Engine.EPhysicsType
enum class EPhysicsType : uint8_t
{
	PhysType_Default = 0,
	PhysType_Kinematic = 1,
	PhysType_Simulated = 2,
	PhysType_MAX = 3
};

// Object: Enum Engine.ECollisionTraceFlag
enum class ECollisionTraceFlag : uint8_t
{
	CTF_UseDefault = 0,
	CTF_UseSimpleAndComplex = 1,
	CTF_UseSimpleAsComplex = 2,
	CTF_UseComplexAsSimple = 3,
	CTF_MAX = 4
};

// Object: Enum Engine.EBrushType
enum class EBrushType : uint8_t
{
	Brush_Default = 0,
	Brush_Add = 1,
	Brush_Subtract = 2,
	Brush_MAX = 3
};

// Object: Enum Engine.ECsgOper
enum class ECsgOper : uint8_t
{
	CSG_Active = 0,
	CSG_Add = 1,
	CSG_Subtract = 2,
	CSG_Intersect = 3,
	CSG_Deintersect = 4,
	CSG_None = 5,
	CSG_MAX = 6
};

// Object: Enum Engine.EInitialOscillatorOffset
enum class EInitialOscillatorOffset : uint8_t
{
	EOO_OffsetRandom = 0,
	EOO_OffsetZero = 1,
	EOO_MAX = 2
};

// Object: Enum Engine.EOscillatorWaveform
enum class EOscillatorWaveform : uint8_t
{
	SineWave = 0,
	PerlinNoise = 1,
	EOscillatorWaveform_MAX = 2
};

// Object: Enum Engine.ECameraAlphaBlendMode
enum class ECameraAlphaBlendMode : uint8_t
{
	CABM_Linear = 0,
	CABM_Cubic = 1,
	CABM_MAX = 2
};

// Object: Enum Engine.ECameraAnimPlaySpace
enum class ECameraAnimPlaySpace : uint8_t
{
	CameraLocal = 0,
	World = 1,
	UserDefined = 2,
	ECameraAnimPlaySpace_MAX = 3
};

// Object: Enum Engine.ECameraProjectionMode
enum class ECameraProjectionMode : uint8_t
{
	Perspective = 0,
	Orthographic = 1,
	ECameraProjectionMode_MAX = 2
};

// Object: Enum Engine.ECloudStorageDelegate
enum class ECloudStorageDelegate : uint8_t
{
	CSD_KeyValueReadComplete = 0,
	CSD_KeyValueWriteComplete = 1,
	CSD_ValueChanged = 2,
	CSD_DocumentQueryComplete = 3,
	CSD_DocumentReadComplete = 4,
	CSD_DocumentWriteComplete = 5,
	CSD_DocumentConflictDetected = 6,
	CSD_MAX = 7
};

// Object: Enum Engine.EAngularDriveMode
enum class EAngularDriveMode : uint8_t
{
	SLERP = 0,
	TwistAndSwing = 1,
	EAngularDriveMode_MAX = 2
};

// Object: Enum Engine.ELinearConstraintMotion
enum class ELinearConstraintMotion : uint8_t
{
	LCM_Free = 0,
	LCM_Limited = 1,
	LCM_Locked = 2,
	LCM_MAX = 3
};

// Object: Enum Engine.ECurveTableMode
enum class ECurveTableMode : uint8_t
{
	Empty = 0,
	SimpleCurves = 1,
	RichCurves = 2,
	ECurveTableMode_MAX = 3
};

// Object: Enum Engine.EEvaluateCurveTableResult
enum class EEvaluateCurveTableResult : uint8_t
{
	RowFound = 0,
	RowNotFound = 1,
	EEvaluateCurveTableResult_MAX = 2
};

// Object: Enum Engine.EGrammaticalNumber
enum class EGrammaticalNumber : uint8_t
{
	Singular = 0,
	Plural = 1,
	EGrammaticalNumber_MAX = 2
};

// Object: Enum Engine.EGrammaticalGender
enum class EGrammaticalGender : uint8_t
{
	Neuter = 0,
	Masculine = 1,
	Feminine = 2,
	Mixed = 3,
	EGrammaticalGender_MAX = 4
};

// Object: Enum Engine.DistributionParamMode
enum class EDistributionParamMode : uint8_t
{
	DPM_Normal = 0,
	DPM_Abs = 1,
	DPM_Direct = 2,
	DPM_MAX = 3
};

// Object: Enum Engine.EDistributionVectorMirrorFlags
enum class EDistributionVectorMirrorFlags : uint8_t
{
	EDVMF_Same = 0,
	EDVMF_Different = 1,
	EDVMF_Mirror = 2,
	EDVMF_MAX = 3
};

// Object: Enum Engine.EDistributionVectorLockFlags
enum class EDistributionVectorLockFlags : uint8_t
{
	EDVLF_None = 0,
	EDVLF_XY = 1,
	EDVLF_XZ = 2,
	EDVLF_YZ = 3,
	EDVLF_XYZ = 4,
	EDVLF_MAX = 5
};

// Object: Enum Engine.ENodeEnabledState
enum class ENodeEnabledState : uint8_t
{
	Enabled = 0,
	Disabled = 1,
	DevelopmentOnly = 2,
	ENodeEnabledState_MAX = 3
};

// Object: Enum Engine.ENodeAdvancedPins
enum class ENodeAdvancedPins : uint8_t
{
	NoPins = 0,
	Shown = 1,
	Hidden = 2,
	ENodeAdvancedPins_MAX = 3
};

// Object: Enum Engine.ENodeTitleType
enum class ENodeTitleType : uint8_t
{
	FullTitle = 0,
	ListView = 1,
	EditableTitle = 2,
	MenuTitle = 3,
	MAX_TitleTypes = 4,
	ENodeTitleType_MAX = 5
};

// Object: Enum Engine.EPinContainerType
enum class EPinContainerType : uint8_t
{
	None = 0,
	Array = 1,
	Set = 2,
	Map = 3,
	EPinContainerType_MAX = 4
};

// Object: Enum Engine.EEdGraphPinDirection
enum class EEdGraphPinDirection : uint8_t
{
	EGPD_Input = 0,
	EGPD_Output = 1,
	EGPD_MAX = 2
};

// Object: Enum Engine.EBlueprintPinStyleType
enum class EBlueprintPinStyleType : uint8_t
{
	BPST_Original = 0,
	BPST_VariantA = 1,
	BPST_MAX = 2
};

// Object: Enum Engine.ECanCreateConnectionResponse
enum class ECanCreateConnectionResponse : uint8_t
{
	CONNECT_RESPONSE_MAKE = 0,
	CONNECT_RESPONSE_DISALLOW = 1,
	CONNECT_RESPONSE_BREAK_OTHERS_A = 2,
	CONNECT_RESPONSE_BREAK_OTHERS_B = 3,
	CONNECT_RESPONSE_BREAK_OTHERS_AB = 4,
	CONNECT_RESPONSE_MAKE_WITH_CONVERSION_NODE = 5,
	CONNECT_RESPONSE_MAX = 6
};

// Object: Enum Engine.EGraphType
enum class EGraphType : uint8_t
{
	GT_Function = 0,
	GT_Ubergraph = 1,
	GT_Macro = 2,
	GT_Animation = 3,
	GT_StateMachine = 4,
	GT_MAX = 5
};

// Object: Enum Engine.ELowMemoryWarningLevel
enum class ELowMemoryWarningLevel : uint8_t
{
	None = 0,
	Light = 1,
	Moderate = 2,
	Serious = 3,
	Critical = 4,
	ELowMemoryWarningLevel_MAX = 5
};

// Object: Enum Engine.ETransitionType
enum class ETransitionType : uint8_t
{
	None = 0,
	Paused = 1,
	Loading = 2,
	Saving = 3,
	Connecting = 4,
	Precaching = 5,
	WaitingToConnect = 6,
	MAX = 7
};

// Object: Enum Engine.EFullyLoadPackageType
enum class EFullyLoadPackageType : uint8_t
{
	FULLYLOAD_Map = 0,
	FULLYLOAD_Game_PreLoadClass = 1,
	FULLYLOAD_Game_PostLoadClass = 2,
	FULLYLOAD_Always = 3,
	FULLYLOAD_Mutator = 4,
	FULLYLOAD_MAX = 5
};

// Object: Enum Engine.EViewModeIndex
enum class EViewModeIndex : uint8_t
{
	VMI_BrushWireframe = 0,
	VMI_Wireframe = 1,
	VMI_Unlit = 2,
	VMI_Lit = 3,
	VMI_Lit_DetailLighting = 4,
	VMI_LightingOnly = 5,
	VMI_LightComplexity = 6,
	VMI_ShaderComplexity = 8,
	VMI_LightmapDensity = 9,
	VMI_LitLightmapDensity = 10,
	VMI_ReflectionOverride = 11,
	VMI_VisualizeBuffer = 12,
	VMI_StationaryLightOverlap = 14,
	VMI_CollisionPawn = 15,
	VMI_CollisionVisibility = 16,
	VMI_LODColoration = 18,
	VMI_QuadOverdraw = 19,
	VMI_PrimitiveDistanceAccuracy = 20,
	VMI_MeshUVDensityAccuracy = 21,
	VMI_ShaderComplexityWithQuadOverdraw = 22,
	VMI_HLODColoration = 23,
	VMI_GroupLODColoration = 24,
	VMI_MaterialTextureScaleAccuracy = 25,
	VMI_RequiredTextureResolution = 26,
	VMI_PathTracing = 27,
	VMI_RayTracingDebug = 28,
	VMI_PRT = 29,
	VMI_PRT_Normal = 30,
	VMI_PRT_PbCheck = 31,
	VMI_LIGHT_Check = 32,
	VMI_MeshTextureDensity = 33,
	VMI_RayTracingCausticsDebug = 34,
	VMI_Max = 35,
	VMI_Unknown = 255
};

// Object: Enum Engine.ENetMode
enum class ENetMode : uint8_t
{
	NM_Standalone = 0,
	NM_DedicatedServer = 1,
	NM_ListenServer = 2,
	NM_Client = 3,
	NM_MAX = 4
};

// Object: Enum Engine.EDemoPlayFailure
enum class EDemoPlayFailure : uint8_t
{
	Generic = 0,
	DemoNotFound = 1,
	Corrupt = 2,
	InvalidVersion = 3,
	InitBase = 4,
	GameSpecificHeader = 5,
	ReplayStreamerInternal = 6,
	LoadMap = 7,
	Serialization = 8,
	EDemoPlayFailure_MAX = 9
};

// Object: Enum Engine.ETravelType
enum class ETravelType : uint8_t
{
	TRAVEL_Absolute = 0,
	TRAVEL_Partial = 1,
	TRAVEL_Relative = 2,
	TRAVEL_MAX = 3
};

// Object: Enum Engine.ENetworkLagState
enum class ENetworkLagState : uint8_t
{
	NotLagging = 0,
	Lagging = 1,
	ENetworkLagState_MAX = 2
};

// Object: Enum Engine.ETickListType
enum class ETickListType : uint8_t
{
	AnyTickList = 0,
	EnabledTickList = 1,
	CoolingDownTickList = 2,
	DisabledTickList = 3,
	RescheduleTickList = 4,
	NewlySpawnedTickList = 5,
	MaxTypeCount = 6,
	ETickListType_MAX = 7
};

// Object: Enum Engine.EMouseCaptureMode
enum class EMouseCaptureMode : uint8_t
{
	NoCapture = 0,
	CapturePermanently = 1,
	CapturePermanently_IncludingInitialMouseDown = 2,
	CaptureDuringMouseDown = 3,
	CaptureDuringRightMouseDown = 4,
	EMouseCaptureMode_MAX = 5
};

// Object: Enum Engine.ECustomTimeStepSynchronizationState
enum class ECustomTimeStepSynchronizationState : uint8_t
{
	Closed = 0,
	Error = 1,
	Synchronized = 2,
	Synchronizing = 3,
	ECustomTimeStepSynchronizationState_MAX = 4
};

// Object: Enum Engine.EPrebakeShadowCascadeIndex
enum class EPrebakeShadowCascadeIndex : uint8_t
{
	Cascade_None = 0,
	Cascade_0 = 1,
	Cascade_1 = 2,
	Cascade_2 = 3,
	Cascade_3 = 4,
	Cascade_MAX = 5
};

// Object: Enum Engine.ELODShadowBiasType
enum class ELODShadowBiasType : uint8_t
{
	LOD_None = 0,
	LOD_0 = 1,
	LOD_1 = 2,
	LOD_2 = 3,
	LOD_3 = 4,
	LOD_4 = 5,
	LOD_5 = 6,
	LOD_6 = 7,
	LOD_7 = 8,
	LOD_MAX = 9
};

// Object: Enum Engine.EMaterialStencilOpType
enum class EMaterialStencilOpType : uint8_t
{
	MSOP_None = 0,
	MSOP_Equal = 1,
	MSOP_NoEqual = 2,
	MSOP_Always = 4,
	MSOP_MAX = 5
};

// Object: Enum Engine.ELightMapAllocationPolicy
enum class ELightMapAllocationPolicy : uint8_t
{
	LMAP_FixTexelLengthRatio = 0,
	LMAP_FixLightMapCount = 1,
	LMAP_MAX = 2
};

// Object: Enum Engine.ELightMapGroupingPolicy
enum class ELightMapGroupingPolicy : uint8_t
{
	LMGP_DefaultUE = 0,
	LMGP_Distance = 1,
	LMGP_PreDefinedLightMapGroup = 2,
	LMGP_MAX = 3
};

// Object: Enum Engine.EWorldScale
enum class EWorldScale : uint8_t
{
	MiniWorld = 0,
	MidWorld = 1,
	BigWorld = 2,
	EWorldScale_MAX = 3
};

// Object: Enum Engine.EMeshBufferAccess
enum class EMeshBufferAccess : uint8_t
{
	Default = 0,
	ForceCPUAndGPU = 1,
	EMeshBufferAccess_MAX = 2
};

// Object: Enum Engine.EConstraintFrame
enum class EConstraintFrame : uint8_t
{
	Frame1 = 0,
	Frame2 = 1,
	EConstraintFrame_MAX = 2
};

// Object: Enum Engine.EAngularConstraintMotion
enum class EAngularConstraintMotion : uint8_t
{
	ACM_Free = 0,
	ACM_Limited = 1,
	ACM_Locked = 2,
	ACM_MAX = 3
};

// Object: Enum Engine.EComponentSocketType
enum class EComponentSocketType : uint8_t
{
	Invalid = 0,
	Bone = 1,
	Socket = 2,
	EComponentSocketType_MAX = 3
};

// Object: Enum Engine.EPhysicalSurface
enum class EPhysicalSurface : uint8_t
{
	SurfaceType_Default = 0,
	SurfaceType1 = 1,
	SurfaceType2 = 2,
	SurfaceType3 = 3,
	SurfaceType4 = 4,
	SurfaceType5 = 5,
	SurfaceType6 = 6,
	SurfaceType7 = 7,
	SurfaceType8 = 8,
	SurfaceType9 = 9,
	SurfaceType10 = 10,
	SurfaceType11 = 11,
	SurfaceType12 = 12,
	SurfaceType13 = 13,
	SurfaceType14 = 14,
	SurfaceType15 = 15,
	SurfaceType16 = 16,
	SurfaceType17 = 17,
	SurfaceType18 = 18,
	SurfaceType19 = 19,
	SurfaceType20 = 20,
	SurfaceType21 = 21,
	SurfaceType22 = 22,
	SurfaceType23 = 23,
	SurfaceType24 = 24,
	SurfaceType25 = 25,
	SurfaceType26 = 26,
	SurfaceType27 = 27,
	SurfaceType28 = 28,
	SurfaceType29 = 29,
	SurfaceType30 = 30,
	SurfaceType31 = 31,
	SurfaceType32 = 32,
	SurfaceType33 = 33,
	SurfaceType34 = 34,
	SurfaceType35 = 35,
	SurfaceType36 = 36,
	SurfaceType37 = 37,
	SurfaceType38 = 38,
	SurfaceType39 = 39,
	SurfaceType40 = 40,
	SurfaceType41 = 41,
	SurfaceType42 = 42,
	SurfaceType43 = 43,
	SurfaceType44 = 44,
	SurfaceType45 = 45,
	SurfaceType46 = 46,
	SurfaceType47 = 47,
	SurfaceType48 = 48,
	SurfaceType49 = 49,
	SurfaceType50 = 50,
	SurfaceType51 = 51,
	SurfaceType52 = 52,
	SurfaceType53 = 53,
	SurfaceType54 = 54,
	SurfaceType55 = 55,
	SurfaceType56 = 56,
	SurfaceType57 = 57,
	SurfaceType58 = 58,
	SurfaceType59 = 59,
	SurfaceType60 = 60,
	SurfaceType61 = 61,
	SurfaceType62 = 62,
	SurfaceType_Max = 63,
	EPhysicalSurface_MAX = 64
};

// Object: Enum Engine.EWalkableSlopeBehavior
enum class EWalkableSlopeBehavior : uint8_t
{
	WalkableSlope_Default = 0,
	WalkableSlope_Increase = 1,
	WalkableSlope_Decrease = 2,
	WalkableSlope_Unwalkable = 3,
	WalkableSlope_Max = 4
};

// Object: Enum Engine.EUpdateRateShiftBucket
enum class EUpdateRateShiftBucket : uint8_t
{
	ShiftBucket0 = 0,
	ShiftBucket1 = 1,
	ShiftBucket2 = 2,
	ShiftBucket3 = 3,
	ShiftBucket4 = 4,
	ShiftBucket5 = 5,
	ShiftBucketMax = 6,
	EUpdateRateShiftBucket_MAX = 7
};

// Object: Enum Engine.EShadowMapFlags
enum class EShadowMapFlags : uint8_t
{
	SMF_None = 0,
	SMF_Streamed = 1,
	SMF_MAX = 2
};

// Object: Enum Engine.ELightMapPaddingType
enum class ELightMapPaddingType : uint8_t
{
	LMPT_NormalPadding = 0,
	LMPT_PrePadding = 1,
	LMPT_NoPadding = 2,
	LMPT_MAX = 3
};

// Object: Enum Engine.ETimelineSigType
enum class ETimelineSigType : uint8_t
{
	ETS_EventSignature = 0,
	ETS_FloatSignature = 1,
	ETS_VectorSignature = 2,
	ETS_LinearColorSignature = 3,
	ETS_InvalidSignature = 4,
	ETS_MAX = 5
};

// Object: Enum Engine.ESleepFamily
enum class ESleepFamily : uint8_t
{
	Normal = 0,
	Sensitive = 1,
	Custom = 2,
	ESleepFamily_MAX = 3
};

// Object: Enum Engine.ERadialImpulseFalloff
enum class ERadialImpulseFalloff : uint8_t
{
	RIF_Constant = 0,
	RIF_Linear = 1,
	RIF_MAX = 2
};

// Object: Enum Engine.EFilterInterpolationType
enum class EFilterInterpolationType : uint8_t
{
	BSIT_Average = 0,
	BSIT_Linear = 1,
	BSIT_Cubic = 2,
	BSIT_MAX = 3
};

// Object: Enum Engine.ETraceMaskFilter
enum class ETraceMaskFilter : uint8_t
{
	TraceMaskFilter_0 = 0,
	TraceMaskFilter_1 = 1,
	TraceMaskFilter_2 = 2,
	TraceMaskFilter_3 = 3,
	TraceMaskFilter_4 = 4,
	TraceMaskFilter_5 = 5,
	TraceMaskFilter_MAX = 6
};

// Object: Enum Engine.EOverlapFilterOption
enum class EOverlapFilterOption : uint8_t
{
	OverlapFilter_All = 0,
	OverlapFilter_DynamicOnly = 1,
	OverlapFilter_StaticOnly = 2,
	OverlapFilter_MAX = 3
};

// Object: Enum Engine.ENetworkSmoothingMode
enum class ENetworkSmoothingMode : uint8_t
{
	Disabled = 0,
	Linear = 1,
	Exponential = 2,
	Replay = 3,
	ENetworkSmoothingMode_MAX = 4
};

// Object: Enum Engine.ELightingBuildMode
enum class ELightingBuildMode : uint8_t
{
	LBM_Default = 0,
	LBM_BakeForHD = 1,
	LBM_MAX = 2
};

// Object: Enum Engine.ELightingBuildQuality
enum class ELightingBuildQuality : uint8_t
{
	Quality_Preview = 0,
	Quality_Medium = 1,
	Quality_High = 2,
	Quality_Production = 3,
	Quality_MAX = 4
};

// Object: Enum Engine.ESimpleEFXLitQuality
enum class ESimpleEFXLitQuality : uint8_t
{
	SIMPLE_EFX_LIT_QUALITY_NONE = 0,
	SIMPLE_EFX_LIT_QUALITY_LOW = 1,
	SIMPLE_EFX_LIT_QUALITY_MID = 2,
	SIMPLE_EFX_LIT_QUALITY_HIGH = 3,
	SIMPLE_EFX_LIT_QUALITY_ULTRA = 4,
	SIMPLE_EFX_LIT_QUALITY_COUNT = 5,
	SIMPLE_EFX_LIT_QUALITY_MAX = 6
};

// Object: Enum Engine.EMaterialShadingRate
enum class EMaterialShadingRate : uint8_t
{
	MSR_1x1 = 0,
	MSR_2x1 = 1,
	MSR_1x2 = 2,
	MSR_2x2 = 3,
	MSR_4x2 = 4,
	MSR_2x4 = 5,
	MSR_4x4 = 6,
	MSR_Count = 7,
	MSR_MAX = 8
};

// Object: Enum Engine.EParticleVRSShadingRate
enum class EParticleVRSShadingRate : uint8_t
{
	VRS_None = 0,
	VRS_2X2 = 1,
	Num = 2,
	EParticleVRSShadingRate_MAX = 3
};

// Object: Enum Engine.EMaterialStencilCompare
enum class EMaterialStencilCompare : uint8_t
{
	MSC_Less = 0,
	MSC_LessEqual = 1,
	MSC_Greater = 2,
	MSC_GreaterEqual = 3,
	MSC_Equal = 4,
	MSC_NotEqual = 5,
	MSC_Never = 6,
	MSC_Always = 7,
	MSC_Count = 8,
	MSC_MAX = 9
};

// Object: Enum Engine.EMaterialSamplerType
enum class EMaterialSamplerType : uint8_t
{
	SAMPLERTYPE_Color = 0,
	SAMPLERTYPE_Grayscale = 1,
	SAMPLERTYPE_Alpha = 2,
	SAMPLERTYPE_Normal = 3,
	SAMPLERTYPE_Masks = 4,
	SAMPLERTYPE_DistanceFieldFont = 5,
	SAMPLERTYPE_LinearColor = 6,
	SAMPLERTYPE_LinearGrayscale = 7,
	SAMPLERTYPE_Data = 8,
	SAMPLERTYPE_External = 9,
	SAMPLERTYPE_VirtualColor = 10,
	SAMPLERTYPE_VirtualGrayscale = 11,
	SAMPLERTYPE_VirtualAlpha = 12,
	SAMPLERTYPE_VirtualNormal = 13,
	SAMPLERTYPE_VirtualMasks = 14,
	SAMPLERTYPE_VirtualLinearColor = 15,
	SAMPLERTYPE_VirtualLinearGrayscale = 16,
	SAMPLERTYPE_MAX = 17
};

// Object: Enum Engine.EMaterialTessellationMode
enum class EMaterialTessellationMode : uint8_t
{
	MTM_NoTessellation = 0,
	MTM_FlatTessellation = 1,
	MTM_PNTriangles = 2,
	MTM_MAX = 3
};

// Object: Enum Engine.EMaterialShadingModel
enum class EMaterialShadingModel : uint8_t
{
	MSM_Unlit = 0,
	MSM_DefaultLit = 1,
	MSM_Subsurface = 2,
	MSM_PreintegratedSkin = 3,
	MSM_ClearCoat = 4,
	MSM_SubsurfaceProfile = 5,
	MSM_TwoSidedFoliage = 6,
	MSM_Hair = 7,
	MSM_Mobile_Hair_Mask = 8,
	MSM_Mobile_Hair_Blend = 9,
	MSM_Cloth = 10,
	MSM_Eye = 11,
	MSM_SingleLayerWater = 12,
	MSM_SGSSS = 13,
	MSM_ThinTranslucent = 14,
	MSM_Weapon = 15,
	MSM_NUM = 16,
	MSM_FromMaterialExpression = 17,
	MSM_MAX = 18
};

// Object: Enum Engine.EParticleCollisionMode
enum class EParticleCollisionMode : uint8_t
{
	SceneDepth = 0,
	DistanceField = 1,
	EParticleCollisionMode_MAX = 2
};

// Object: Enum Engine.ETrailWidthMode
enum class ETrailWidthMode : uint8_t
{
	ETrailWidthMode_FromCentre = 0,
	ETrailWidthMode_FromFirst = 1,
	ETrailWidthMode_FromSecond = 2,
	ETrailWidthMode_MAX = 3
};

// Object: Enum Engine.EGBufferFormat
enum class EGBufferFormat : uint8_t
{
	Force8BitsPerChannel = 0,
	Default = 1,
	HighPrecisionNormals = 3,
	Force16BitsPerChannel = 5,
	EGBufferFormat_MAX = 6
};

// Object: Enum Engine.ESceneCaptureCompositeMode
enum class ESceneCaptureCompositeMode : uint8_t
{
	SCCM_Overwrite = 0,
	SCCM_Additive = 1,
	SCCM_Composite = 2,
	SCCM_MAX = 3
};

// Object: Enum Engine.ESceneCaptureSource
enum class ESceneCaptureSource : uint8_t
{
	SCS_SceneColorHDR = 0,
	SCS_SceneColorHDRNoAlpha = 1,
	SCS_FinalColorLDR = 2,
	SCS_SceneColorSceneDepth = 3,
	SCS_SceneDepth = 4,
	SCS_DeviceDepth = 5,
	SCS_Normal = 6,
	SCS_BaseColor = 7,
	SCS_FinalColorHDR = 8,
	SCS_LinearColorLDR = 9,
	SCS_MAX = 10
};

// Object: Enum Engine.ETranslucentSortPolicy
enum class ETranslucentSortPolicy : uint8_t
{
	SortByDistance = 0,
	SortByProjectedZ = 1,
	SortAlongAxis = 2,
	ETranslucentSortPolicy_MAX = 3
};

// Object: Enum Engine.ERefractionMode
enum class ERefractionMode : uint8_t
{
	RM_IndexOfRefraction = 0,
	RM_PixelNormalOffset = 1,
	RM_MAX = 2
};

// Object: Enum Engine.ETranslucencyLightingMode
enum class ETranslucencyLightingMode : uint8_t
{
	TLM_VolumetricNonDirectional = 0,
	TLM_VolumetricDirectional = 1,
	TLM_VolumetricPerVertexNonDirectional = 2,
	TLM_VolumetricPerVertexDirectional = 3,
	TLM_Surface = 4,
	TLM_SurfacePerPixelLighting = 5,
	TLM_MAX = 6
};

// Object: Enum Engine.ESamplerSourceMode
enum class ESamplerSourceMode : uint8_t
{
	SSM_FromTextureAsset = 0,
	SSM_Wrap_WorldGroupSettings = 1,
	SSM_Clamp_WorldGroupSettings = 2,
	SSM_MAX = 3
};

// Object: Enum Engine.EMaterialLightingChannelMask
enum class EMaterialLightingChannelMask : uint8_t
{
	MLCM_0000 = 0,
	MLCM_0001 = 1,
	MLCM_0010 = 2,
	MLCM_0100 = 4,
	MLCM_1000 = 8,
	MLCM_MAX = 9
};

// Object: Enum Engine.EMaterialWetnessMode
enum class EMaterialWetnessMode : uint8_t
{
	MWM_None = 0,
	MWM_General = 1,
	MWM_MAX = 2
};

// Object: Enum Engine.EBlendMode
enum class EBlendMode : uint8_t
{
	BLEND_Opaque = 0,
	BLEND_Masked = 1,
	BLEND_Translucent = 2,
	BLEND_Additive = 3,
	BLEND_Modulate = 4,
	BLEND_AlphaComposite = 5,
	BLEND_AlphaHoldout = 6,
	BLEND_AdditiveRGB = 7,
	BLEND_MAX = 8
};

// Object: Enum Engine.EOcclusionCombineMode
enum class EOcclusionCombineMode : uint8_t
{
	OCM_Minimum = 0,
	OCM_Multiply = 1,
	OCM_MAX = 2
};

// Object: Enum Engine.ELightmapType
enum class ELightmapType : uint8_t
{
	Default = 0,
	ForceSurface = 1,
	ForceVolumetric = 2,
	ELightmapType_MAX = 3
};

// Object: Enum Engine.EIndirectLightingCacheQuality
enum class EIndirectLightingCacheQuality : uint8_t
{
	ILCQ_Off = 0,
	ILCQ_Point = 1,
	ILCQ_Volume = 2,
	ILCQ_MAX = 3
};

// Object: Enum Engine.ESceneDepthPriorityGroup
enum class ESceneDepthPriorityGroup : uint8_t
{
	SDPG_World = 0,
	SDPG_Foreground = 1,
	SDPG_MAX = 2
};

// Object: Enum Engine.EFontCacheType
enum class EFontCacheType : uint8_t
{
	Offline = 0,
	Runtime = 1,
	EFontCacheType_MAX = 2
};

// Object: Enum Engine.EFontImportCharacterSet
enum class EFontImportCharacterSet : uint8_t
{
	FontICS_Default = 0,
	FontICS_Ansi = 1,
	FontICS_Symbol = 2,
	FontICS_MAX = 3
};

// Object: Enum Engine.EStandbyType
enum class EStandbyType : uint8_t
{
	STDBY_Rx = 0,
	STDBY_Tx = 1,
	STDBY_BadPing = 2,
	STDBY_MAX = 3
};

// Object: Enum Engine.ESuggestProjVelocityTraceOption
enum class ESuggestProjVelocityTraceOption : uint8_t
{
	DoNotTrace = 0,
	TraceFullPath = 1,
	OnlyTraceWhileAscending = 2,
	ESuggestProjVelocityTraceOption_MAX = 3
};

// Object: Enum Engine.EWindowMode
enum class EWindowMode : uint8_t
{
	Fullscreen = 0,
	WindowedFullscreen = 1,
	Windowed = 2,
	EWindowMode_MAX = 3
};

// Object: Enum Engine.EImportanceWeight
enum class EImportanceWeight : uint8_t
{
	Luminance = 0,
	Red = 1,
	Green = 2,
	Blue = 3,
	Alpha = 4,
	EImportanceWeight_MAX = 5
};

// Object: Enum Engine.EAdManagerDelegate
enum class EAdManagerDelegate : uint8_t
{
	AMD_ClickedBanner = 0,
	AMD_UserClosedAd = 1,
	AMD_MAX = 2
};

// Object: Enum Engine.EControllerAnalogStick
enum class EControllerAnalogStick : uint8_t
{
	CAS_LeftStick = 0,
	CAS_RightStick = 1,
	CAS_MAX = 2
};

// Object: Enum Engine.EAnimAlphaInputType
enum class EAnimAlphaInputType : uint8_t
{
	Float = 0,
	Bool = 1,
	Curve = 2,
	EAnimAlphaInputType_MAX = 3
};

// Object: Enum Engine.ETrackActiveCondition
enum class ETrackActiveCondition : uint8_t
{
	ETAC_Always = 0,
	ETAC_GoreEnabled = 1,
	ETAC_GoreDisabled = 2,
	ETAC_MAX = 3
};

// Object: Enum Engine.EInterpTrackMoveRotMode
enum class EInterpTrackMoveRotMode : uint8_t
{
	IMR_Keyframed = 0,
	IMR_LookAtGroup = 1,
	IMR_Ignore = 2,
	IMR_MAX = 3
};

// Object: Enum Engine.EInterpMoveAxis
enum class EInterpMoveAxis : uint8_t
{
	AXIS_TranslationX = 0,
	AXIS_TranslationY = 1,
	AXIS_TranslationZ = 2,
	AXIS_RotationX = 3,
	AXIS_RotationY = 4,
	AXIS_RotationZ = 5,
	AXIS_MAX = 6
};

// Object: Enum Engine.ETrackToggleAction
enum class ETrackToggleAction : uint8_t
{
	ETTA_Off = 0,
	ETTA_On = 1,
	ETTA_Toggle = 2,
	ETTA_Trigger = 3,
	ETTA_MAX = 4
};

// Object: Enum Engine.EVisibilityTrackCondition
enum class EVisibilityTrackCondition : uint8_t
{
	EVTC_Always = 0,
	EVTC_GoreEnabled = 1,
	EVTC_GoreDisabled = 2,
	EVTC_MAX = 3
};

// Object: Enum Engine.EVisibilityTrackAction
enum class EVisibilityTrackAction : uint8_t
{
	EVTA_Hide = 0,
	EVTA_Show = 1,
	EVTA_Toggle = 2,
	EVTA_MAX = 3
};

// Object: Enum Engine.ESlateGesture
enum class ESlateGesture : uint8_t
{
	None = 0,
	Scroll = 1,
	Magnify = 2,
	Swipe = 3,
	Rotate = 4,
	LongPress = 5,
	ESlateGesture_MAX = 6
};

// Object: Enum Engine.EMatrixColumns
enum class EMatrixColumns : uint8_t
{
	First = 0,
	Second = 1,
	Third = 2,
	Fourth = 3,
	EMatrixColumns_MAX = 4
};

// Object: Enum Engine.ELerpInterpolationMode
enum class ELerpInterpolationMode : uint8_t
{
	QuatInterp = 0,
	EulerInterp = 1,
	DualQuatInterp = 2,
	ELerpInterpolationMode_MAX = 3
};

// Object: Enum Engine.EEasingFunc
enum class EEasingFunc : uint8_t
{
	Linear = 0,
	Step = 1,
	SinusoidalIn = 2,
	SinusoidalOut = 3,
	SinusoidalInOut = 4,
	EaseIn = 5,
	EaseOut = 6,
	EaseInOut = 7,
	ExpoIn = 8,
	ExpoOut = 9,
	ExpoInOut = 10,
	CircularIn = 11,
	CircularOut = 12,
	CircularInOut = 13,
	EEasingFunc_MAX = 14
};

// Object: Enum Engine.EStreamingVolumeUsage
enum class EStreamingVolumeUsage : uint8_t
{
	SVB_Loading = 0,
	SVB_LoadingAndVisibility = 1,
	SVB_VisibilityBlockingOnLoad = 2,
	SVB_BlockingOnLoad = 3,
	SVB_LoadingNotVisible = 4,
	SVB_MAX = 5
};

// Object: Enum Engine.ELocalLightBakeMode
enum class ELocalLightBakeMode : uint8_t
{
	SKY_AO_MODE = 0,
	SDF_SHADOW_MASK_MODE = 1,
	OUTDOOR_AO_MODE = 2,
	ELocalLightBakeMode_MAX = 3
};

// Object: Enum Engine.EMaterialVertexColorBlendWeightChannels
enum class EMaterialVertexColorBlendWeightChannels : uint8_t
{
	None = 0,
	R = 1,
	RG = 2,
	RGB = 3,
	RGBA = 4,
	EMaterialVertexColorBlendWeightChannels_MAX = 5
};

// Object: Enum Engine.EMaterialDecalResponse
enum class EMaterialDecalResponse : uint8_t
{
	MDR_None = 0,
	MDR_ColorNormalRoughness = 1,
	MDR_Color = 2,
	MDR_ColorNormal = 3,
	MDR_ColorRoughness = 4,
	MDR_Normal = 5,
	MDR_NormalRoughness = 6,
	MDR_Roughness = 7,
	MDR_MAX = 8
};

// Object: Enum Engine.EDecalBlendMode
enum class EDecalBlendMode : uint8_t
{
	DBM_Translucent = 0,
	DBM_Stain = 1,
	DBM_Normal = 2,
	DBM_Emissive = 3,
	DBM_DBuffer_ColorNormalRoughness = 4,
	DBM_DBuffer_Color = 5,
	DBM_DBuffer_ColorNormal = 6,
	DBM_DBuffer_ColorRoughness = 7,
	DBM_DBuffer_Normal = 8,
	DBM_DBuffer_NormalRoughness = 9,
	DBM_DBuffer_Roughness = 10,
	DBM_DBuffer_Emissive = 11,
	DBM_DBuffer_AlphaComposite = 12,
	DBM_DBuffer_EmissiveAlphaComposite = 13,
	DBM_Volumetric_DistanceFunction = 14,
	DBM_AlphaComposite = 15,
	DBM_AmbientOcclusion = 16,
	DBM_MAX = 17
};

// Object: Enum Engine.ETextureColorChannel
enum class ETextureColorChannel : uint8_t
{
	TCC_Red = 0,
	TCC_Green = 1,
	TCC_Blue = 2,
	TCC_Alpha = 3,
	TCC_MAX = 4
};

// Object: Enum Engine.EMaterialAttributeBlend
enum class EMaterialAttributeBlend : uint8_t
{
	Blend = 0,
	UseA = 1,
	UseB = 2,
	EMaterialAttributeBlend_MAX = 3
};

// Object: Enum Engine.EChannelMaskParameterColor
enum class EChannelMaskParameterColor : uint8_t
{
	Red = 0,
	Green = 1,
	Blue = 2,
	Alpha = 3,
	EChannelMaskParameterColor_MAX = 4
};

// Object: Enum Engine.EClampMode
enum class EClampMode : uint8_t
{
	CMODE_Clamp = 0,
	CMODE_ClampMin = 1,
	CMODE_ClampMax = 2,
	CMODE_MAX = 3
};

// Object: Enum Engine.ECustomMaterialOutputType
enum class ECustomMaterialOutputType : uint8_t
{
	CMOT_Float1 = 0,
	CMOT_Float2 = 1,
	CMOT_Float3 = 2,
	CMOT_Float4 = 3,
	CMOT_MaterialAttributes = 4,
	CMOT_MAX = 5
};

// Object: Enum Engine.EDepthOfFieldFunctionValue
enum class EDepthOfFieldFunctionValue : uint8_t
{
	TDOF_NearAndFarMask = 0,
	TDOF_NearMask = 1,
	TDOF_FarMask = 2,
	TDOF_CircleOfConfusionRadius = 3,
	TDOF_MAX = 4
};

// Object: Enum Engine.EFunctionInputType
enum class EFunctionInputType : uint8_t
{
	FunctionInput_Scalar = 0,
	FunctionInput_Vector2 = 1,
	FunctionInput_Vector3 = 2,
	FunctionInput_Vector4 = 3,
	FunctionInput_Texture2D = 4,
	FunctionInput_TextureCube = 5,
	FunctionInput_Texture2DArray = 6,
	FunctionInput_VolumeTexture = 7,
	FunctionInput_StaticBool = 8,
	FunctionInput_MaterialAttributes = 9,
	FunctionInput_TextureExternal = 10,
	FunctionInput_MAX = 11
};

// Object: Enum Engine.ENoiseFunction
enum class ENoiseFunction : uint8_t
{
	NOISEFUNCTION_SimplexTex = 0,
	NOISEFUNCTION_GradientTex = 1,
	NOISEFUNCTION_GradientTex3D = 2,
	NOISEFUNCTION_GradientALU = 3,
	NOISEFUNCTION_ValueALU = 4,
	NOISEFUNCTION_VoronoiALU = 5,
	NOISEFUNCTION_MAX = 6
};

// Object: Enum Engine.ERuntimeVirtualTextureMipValueMode
enum class ERuntimeVirtualTextureMipValueMode : uint8_t
{
	RVTMVM_None = 0,
	RVTMVM_MipLevel = 1,
	RVTMVM_MipBias = 2,
	RVTMVM_MAX = 3
};

// Object: Enum Engine.EMaterialSceneAttributeInputMode
enum class EMaterialSceneAttributeInputMode : uint8_t
{
	Coordinates = 0,
	OffsetFraction = 1,
	EMaterialSceneAttributeInputMode_MAX = 2
};

// Object: Enum Engine.ESpeedTreeLODType
enum class ESpeedTreeLODType : uint8_t
{
	STLOD_Pop = 0,
	STLOD_Smooth = 1,
	STLOD_MAX = 2
};

// Object: Enum Engine.ESpeedTreeWindType
enum class ESpeedTreeWindType : uint8_t
{
	STW_None = 0,
	STW_Fastest = 1,
	STW_Fast = 2,
	STW_Better = 3,
	STW_Best = 4,
	STW_Palm = 5,
	STW_BestPlus = 6,
	STW_MAX = 7
};

// Object: Enum Engine.ESpeedTreeGeometryType
enum class ESpeedTreeGeometryType : uint8_t
{
	STG_Branch = 0,
	STG_Frond = 1,
	STG_Leaf = 2,
	STG_FacingLeaf = 3,
	STG_Billboard = 4,
	STG_MAX = 5
};

// Object: Enum Engine.EMaterialExposedTextureProperty
enum class EMaterialExposedTextureProperty : uint8_t
{
	TMTM_TextureSize = 0,
	TMTM_TexelSize = 1,
	TMTM_MAX = 2
};

// Object: Enum Engine.ETextureMipValueMode
enum class ETextureMipValueMode : uint8_t
{
	TMVM_None = 0,
	TMVM_MipLevel = 1,
	TMVM_MipBias = 2,
	TMVM_Derivative = 3,
	TMVM_ClampMipLevel = 4,
	TMVM_MAX = 5
};

// Object: Enum Engine.EMaterialVectorCoordTransform
enum class EMaterialVectorCoordTransform : uint8_t
{
	TRANSFORM_Tangent = 0,
	TRANSFORM_Local = 1,
	TRANSFORM_World = 2,
	TRANSFORM_View = 3,
	TRANSFORM_Camera = 4,
	TRANSFORM_ParticleWorld = 5,
	TRANSFORM_MAX = 6
};

// Object: Enum Engine.EMaterialVectorCoordTransformSource
enum class EMaterialVectorCoordTransformSource : uint8_t
{
	TRANSFORMSOURCE_Tangent = 0,
	TRANSFORMSOURCE_Local = 1,
	TRANSFORMSOURCE_World = 2,
	TRANSFORMSOURCE_View = 3,
	TRANSFORMSOURCE_Camera = 4,
	TRANSFORMSOURCE_ParticleWorld = 5,
	TRANSFORMSOURCE_MAX = 6
};

// Object: Enum Engine.EMaterialPositionTransformSource
enum class EMaterialPositionTransformSource : uint8_t
{
	TRANSFORMPOSSOURCE_Local = 0,
	TRANSFORMPOSSOURCE_World = 1,
	TRANSFORMPOSSOURCE_TranslatedWorld = 2,
	TRANSFORMPOSSOURCE_View = 3,
	TRANSFORMPOSSOURCE_Camera = 4,
	TRANSFORMPOSSOURCE_Particle = 5,
	TRANSFORMPOSSOURCE_MAX = 6
};

// Object: Enum Engine.EVectorNoiseFunction
enum class EVectorNoiseFunction : uint8_t
{
	VNF_CellnoiseALU = 0,
	VNF_VectorALU = 1,
	VNF_GradientALU = 2,
	VNF_CurlALU = 3,
	VNF_VoronoiALU = 4,
	VNF_MAX = 5
};

// Object: Enum Engine.EMaterialExposedViewProperty
enum class EMaterialExposedViewProperty : uint8_t
{
	MEVP_BufferSize = 0,
	MEVP_FieldOfView = 1,
	MEVP_TanHalfFieldOfView = 2,
	MEVP_ViewSize = 3,
	MEVP_WorldSpaceViewPosition = 4,
	MEVP_WorldSpaceCameraPosition = 5,
	MEVP_ViewportOffset = 6,
	MEVP_TemporalSampleCount = 7,
	MEVP_TemporalSampleIndex = 8,
	MEVP_TemporalSampleOffset = 9,
	MEVP_RuntimeVirtualTextureOutputLevel = 10,
	MEVP_RuntimeVirtualTextureOutputDerivative = 11,
	MEVP_PreExposure = 12,
	MEVP_WindParams = 13,
	MEVP_RotateAngle = 14,
	MEVP_UnscaledViewSize = 15,
	MEVP_MAX = 16
};

// Object: Enum Engine.EWorldPositionIncludedOffsets
enum class EWorldPositionIncludedOffsets : uint8_t
{
	WPT_Default = 0,
	WPT_ExcludeAllShaderOffsets = 1,
	WPT_CameraRelative = 2,
	WPT_CameraRelativeNoOffsets = 3,
	WPT_MAX = 4
};

// Object: Enum Engine.EMaterialFunctionUsage
enum class EMaterialFunctionUsage : uint8_t
{
	Default = 0,
	MaterialLayer = 1,
	MaterialLayerBlend = 2,
	EMaterialFunctionUsage_MAX = 3
};

// Object: Enum Engine.EMaterialCategory
enum class EMaterialCategory : uint8_t
{
	MC_PBR_Opaque = 0,
	MC_Weapon = 1,
	MC_Character = 2,
	MC_Terrain = 3,
	MC_Sky = 4,
	MC_Grass = 5,
	MC_Rock = 6,
	MC_Tree = 7,
	MC_Tree_Lod = 8,
	MC_Particle = 9,
	MC_Keep_Original = 10,
	MC_MAX = 11
};

// Object: Enum Engine.EMaterialUsage
enum class EMaterialUsage : uint8_t
{
	MATUSAGE_SkeletalMesh = 0,
	MATUSAGE_ParticleSprites = 1,
	MATUSAGE_BeamTrails = 2,
	MATUSAGE_MeshParticles = 3,
	MATUSAGE_StaticLighting = 4,
	MATUSAGE_MorphTargets = 5,
	MATUSAGE_SplineMesh = 6,
	MATUSAGE_InstancedStaticMeshes = 7,
	MATUSAGE_GeometryCollections = 8,
	MATUSAGE_Clothing = 9,
	MATUSAGE_NiagaraSprites = 10,
	MATUSAGE_NiagaraRibbons = 11,
	MATUSAGE_NiagaraMeshParticles = 12,
	MATUSAGE_GeometryCache = 13,
	MATUSAGE_Water = 14,
	MATUSAGE_WaterCaustics = 15,
	MATUSAGE_HairStrands = 16,
	MATUSAGE_MAX = 17
};

// Object: Enum Engine.EMaterialParameterAssociation
enum class EMaterialParameterAssociation : uint8_t
{
	LayerParameter = 0,
	BlendParameter = 1,
	GlobalParameter = 2,
	EMaterialParameterAssociation_MAX = 3
};

// Object: Enum Engine.EMaterialMergeType
enum class EMaterialMergeType : uint8_t
{
	MaterialMergeType_Default = 0,
	MaterialMergeType_Simplygon = 1,
	MaterialMergeType_MAX = 2
};

// Object: Enum Engine.ETextureSizingType
enum class ETextureSizingType : uint8_t
{
	TextureSizingType_UseSingleTextureSize = 0,
	TextureSizingType_UseAutomaticBiasedSizes = 1,
	TextureSizingType_UseManualOverrideTextureSize = 2,
	TextureSizingType_UseSimplygonAutomaticSizing = 3,
	TextureSizingType_MAX = 4
};

// Object: Enum Engine.ESceneTextureId
enum class ESceneTextureId : uint8_t
{
	PPI_SceneColor = 0,
	PPI_SceneDepth = 1,
	PPI_DiffuseColor = 2,
	PPI_SpecularColor = 3,
	PPI_SubsurfaceColor = 4,
	PPI_BaseColor = 5,
	PPI_Specular = 6,
	PPI_Metallic = 7,
	PPI_WorldNormal = 8,
	PPI_SeparateTranslucency = 9,
	PPI_Opacity = 10,
	PPI_Roughness = 11,
	PPI_MaterialAO = 12,
	PPI_CustomDepth = 13,
	PPI_PostProcessInput0 = 14,
	PPI_PostProcessInput1 = 15,
	PPI_PostProcessInput2 = 16,
	PPI_PostProcessInput3 = 17,
	PPI_PostProcessInput4 = 18,
	PPI_PostProcessInput5 = 19,
	PPI_PostProcessInput6 = 20,
	PPI_DecalMask = 21,
	PPI_ShadingModelColor = 22,
	PPI_ShadingModelID = 23,
	PPI_AmbientOcclusion = 24,
	PPI_CustomStencil = 25,
	PPI_StoredBaseColor = 26,
	PPI_StoredSpecular = 27,
	PPI_Velocity = 28,
	PPI_WorldTangent = 29,
	PPI_Anisotropy = 30,
	PPI_CustomData = 31,
	PPI_MAX = 32
};

// Object: Enum Engine.EMaterialDomain
enum class EMaterialDomain : uint8_t
{
	MD_Surface = 0,
	MD_DeferredDecal = 1,
	MD_LightFunction = 2,
	MD_Volume = 3,
	MD_PostProcess = 4,
	MD_UI = 5,
	MD_RuntimeVirtualTexture = 6,
	MD_Missing = 7,
	MD_MAX = 8
};

// Object: Enum Engine.EVertexPhase
enum class EVertexPhase : uint8_t
{
	VP_ViewResolving = 0,
	VP_PositionCalculation = 1,
	VP_VariantsCalculation = 2,
	VP_MAX = 3
};

// Object: Enum Engine.EShadingPhase
enum class EShadingPhase : uint8_t
{
	SP_V2F = 0,
	SP_DataPrepare = 1,
	SP_OutColorGenerate = 2,
	SP_Debug = 3,
	SP_MAX = 4
};

// Object: Enum Engine.EMeshInstancingReplacementMethod
enum class EMeshInstancingReplacementMethod : uint8_t
{
	RemoveOriginalActors = 0,
	KeepOriginalActorsAsEditorOnly = 1,
	EMeshInstancingReplacementMethod_MAX = 2
};

// Object: Enum Engine.EUVOutput
enum class EUVOutput : uint8_t
{
	DoNotOutputChannel = 0,
	OutputChannel = 1,
	EUVOutput_MAX = 2
};

// Object: Enum Engine.EMeshMergeType
enum class EMeshMergeType : uint8_t
{
	MeshMergeType_Default = 0,
	MeshMergeType_MergeActor = 1,
	MeshMergeType_MAX = 2
};

// Object: Enum Engine.EMeshLODSelectionType
enum class EMeshLODSelectionType : uint8_t
{
	AllLODs = 0,
	SpecificLOD = 1,
	CalculateLOD = 2,
	LowestDetailLOD = 3,
	EMeshLODSelectionType_MAX = 4
};

// Object: Enum Engine.EProxyNormalComputationMethod
enum class EProxyNormalComputationMethod : uint8_t
{
	AngleWeighted = 0,
	AreaWeighted = 1,
	EqualWeighted = 2,
	EProxyNormalComputationMethod_MAX = 3
};

// Object: Enum Engine.ELandscapeCullingPrecision
enum class ELandscapeCullingPrecision : uint8_t
{
	High = 0,
	Medium = 1,
	Low = 2,
	ELandscapeCullingPrecision_MAX = 3
};

// Object: Enum Engine.EStaticMeshReductionTerimationCriterion
enum class EStaticMeshReductionTerimationCriterion : uint8_t
{
	Triangles = 0,
	Vertices = 1,
	Any = 2,
	EStaticMeshReductionTerimationCriterion_MAX = 3
};

// Object: Enum Engine.EMeshFeatureImportance
enum class EMeshFeatureImportance : uint8_t
{
	Off = 0,
	Lowest = 1,
	Low = 2,
	Normal = 3,
	High = 4,
	Highest = 5,
	EMeshFeatureImportance_MAX = 6
};

// Object: Enum Engine.EVertexPaintAxis
enum class EVertexPaintAxis : uint8_t
{
	X = 0,
	Y = 1,
	Z = 2,
	EVertexPaintAxis_MAX = 3
};

// Object: Enum Engine.EMicroTransactionResult
enum class EMicroTransactionResult : uint8_t
{
	MTR_Succeeded = 0,
	MTR_Failed = 1,
	MTR_Canceled = 2,
	MTR_RestoredFromServer = 3,
	MTR_MAX = 4
};

// Object: Enum Engine.EMicroTransactionDelegate
enum class EMicroTransactionDelegate : uint8_t
{
	MTD_PurchaseQueryComplete = 0,
	MTD_PurchaseComplete = 1,
	MTD_MAX = 2
};

// Object: Enum Engine.FNavigationSystemRunMode
enum class EFNavigationSystemRunMode : uint8_t
{
	InvalidMode = 0,
	GameMode = 1,
	EditorMode = 2,
	SimulationMode = 3,
	PIEMode = 4,
	FNavigationSystemRunMode_MAX = 5
};

// Object: Enum Engine.ENavigationQueryResult
enum class ENavigationQueryResult : uint8_t
{
	Invalid = 0,
	Error = 1,
	Fail = 2,
	Success = 3,
	ENavigationQueryResult_MAX = 4
};

// Object: Enum Engine.ENavPathEvent
enum class ENavPathEvent : uint8_t
{
	Cleared = 0,
	NewPath = 1,
	UpdatedDueToGoalMoved = 2,
	UpdatedDueToNavigationChanged = 3,
	Invalidated = 4,
	RePathFailed = 5,
	MetaPathUpdate = 6,
	Custom = 7,
	ENavPathEvent_MAX = 8
};

// Object: Enum Engine.ENavDataGatheringModeConfig
enum class ENavDataGatheringModeConfig : uint8_t
{
	Invalid = 0,
	Instant = 1,
	Lazy = 2,
	ENavDataGatheringModeConfig_MAX = 3
};

// Object: Enum Engine.ENavDataGatheringMode
enum class ENavDataGatheringMode : uint8_t
{
	Default = 0,
	Instant = 1,
	Lazy = 2,
	ENavDataGatheringMode_MAX = 3
};

// Object: Enum Engine.ENavigationOptionFlag
enum class ENavigationOptionFlag : uint8_t
{
	Default = 0,
	Enable = 1,
	Disable = 2,
	MAX = 3
};

// Object: Enum Engine.ENavLinkDirection
enum class ENavLinkDirection : uint8_t
{
	BothWays = 0,
	LeftToRight = 1,
	RightToLeft = 2,
	ENavLinkDirection_MAX = 3
};

// Object: Enum Engine.EControllMode
enum class EControllMode : uint8_t
{
	ENone = 0,
	EExposureOnly = 1,
	EFullControll = 2,
	EControllMode_MAX = 3
};

// Object: Enum Engine.EEmitterRenderMode
enum class EEmitterRenderMode : uint8_t
{
	ERM_Normal = 0,
	ERM_Point = 1,
	ERM_Cross = 2,
	ERM_LightsOnly = 3,
	ERM_None = 4,
	ERM_MAX = 5
};

// Object: Enum Engine.EParticleSubUVInterpMethod
enum class EParticleSubUVInterpMethod : uint8_t
{
	PSUVIM_None = 0,
	PSUVIM_Linear = 1,
	PSUVIM_Linear_Blend = 2,
	PSUVIM_Random = 3,
	PSUVIM_Random_Blend = 4,
	PSUVIM_MAX = 5
};

// Object: Enum Engine.EParticleBurstMethod
enum class EParticleBurstMethod : uint8_t
{
	EPBM_Instant = 0,
	EPBM_Interpolated = 1,
	EPBM_MAX = 2
};

// Object: Enum Engine.EParticleSystemInsignificanceReaction
enum class EParticleSystemInsignificanceReaction : uint8_t
{
	Auto = 0,
	Complete = 1,
	DisableTick = 2,
	DisableTickAndKill = 3,
	Num = 4,
	EParticleSystemInsignificanceReaction_MAX = 5
};

// Object: Enum Engine.EParticleSignificanceLevel
enum class EParticleSignificanceLevel : uint8_t
{
	Low = 0,
	Medium = 1,
	High = 2,
	Critical = 3,
	Num = 4,
	EParticleSignificanceLevel_MAX = 5
};

// Object: Enum Engine.EParticleDetailMode
enum class EParticleDetailMode : uint8_t
{
	PDM_Low = 0,
	PDM_Medium = 1,
	PDM_High = 2,
	PDM_MAX = 3
};

// Object: Enum Engine.EParticleSourceSelectionMethod
enum class EParticleSourceSelectionMethod : uint8_t
{
	EPSSM_Random = 0,
	EPSSM_Sequential = 1,
	EPSSM_MAX = 2
};

// Object: Enum Engine.EModuleType
enum class EModuleType : uint8_t
{
	EPMT_General = 0,
	EPMT_TypeData = 1,
	EPMT_Beam = 2,
	EPMT_Trail = 3,
	EPMT_Spawn = 4,
	EPMT_Required = 5,
	EPMT_Event = 6,
	EPMT_Light = 7,
	EPMT_SubUV = 8,
	EPMT_MAX = 9
};

// Object: Enum Engine.EAttractorParticleSelectionMethod
enum class EAttractorParticleSelectionMethod : uint8_t
{
	EAPSM_Random = 0,
	EAPSM_Sequential = 1,
	EAPSM_MAX = 2
};

// Object: Enum Engine.Beam2SourceTargetTangentMethod
enum class EBeam2SourceTargetTangentMethod : uint8_t
{
	PEB2STTM_Direct = 0,
	PEB2STTM_UserSet = 1,
	PEB2STTM_Distribution = 2,
	PEB2STTM_Emitter = 3,
	PEB2STTM_MAX = 4
};

// Object: Enum Engine.Beam2SourceTargetMethod
enum class EBeam2SourceTargetMethod : uint8_t
{
	PEB2STM_Default = 0,
	PEB2STM_UserSet = 1,
	PEB2STM_Emitter = 2,
	PEB2STM_Particle = 3,
	PEB2STM_Actor = 4,
	PEB2STM_MAX = 5
};

// Object: Enum Engine.BeamModifierType
enum class EBeamModifierType : uint8_t
{
	PEB2MT_Source = 0,
	PEB2MT_Target = 1,
	PEB2MT_MAX = 2
};

// Object: Enum Engine.EParticleCameraOffsetUpdateMethod
enum class EParticleCameraOffsetUpdateMethod : uint8_t
{
	EPCOUM_DirectSet = 0,
	EPCOUM_Additive = 1,
	EPCOUM_Scalar = 2,
	EPCOUM_MAX = 3
};

// Object: Enum Engine.EParticleCollisionComplete
enum class EParticleCollisionComplete : uint8_t
{
	EPCC_Kill = 0,
	EPCC_Freeze = 1,
	EPCC_HaltCollisions = 2,
	EPCC_FreezeTranslation = 3,
	EPCC_FreezeRotation = 4,
	EPCC_FreezeMovement = 5,
	EPCC_MAX = 6
};

// Object: Enum Engine.EParticleControlAxis
enum class EParticleControlAxis : uint8_t
{
	EPCA_None = 0,
	EPCA_XY = 1,
	EPCA_XZ = 2,
	EPCA_YZ = 3,
	EPCA_XYZ = 4,
	EPCA_MAX = 5
};

// Object: Enum Engine.EParticleCollisionResponse
enum class EParticleCollisionResponse : uint8_t
{
	Bounce = 0,
	Stop = 1,
	Kill = 2,
	EParticleCollisionResponse_MAX = 3
};

// Object: Enum Engine.ELocationBoneSocketSelectionMethod
enum class ELocationBoneSocketSelectionMethod : uint8_t
{
	BONESOCKETSEL_Sequential = 0,
	BONESOCKETSEL_Random = 1,
	BONESOCKETSEL_MAX = 2
};

// Object: Enum Engine.ELocationBoneSocketSource
enum class ELocationBoneSocketSource : uint8_t
{
	BONESOCKETSOURCE_Bones = 0,
	BONESOCKETSOURCE_Sockets = 1,
	BONESOCKETSOURCE_MAX = 2
};

// Object: Enum Engine.ELocationEmitterSelectionMethod
enum class ELocationEmitterSelectionMethod : uint8_t
{
	ELESM_Random = 0,
	ELESM_Sequential = 1,
	ELESM_MAX = 2
};

// Object: Enum Engine.CylinderHeightAxis
enum class ECylinderHeightAxis : uint8_t
{
	PMLPC_HEIGHTAXIS_X = 0,
	PMLPC_HEIGHTAXIS_Y = 1,
	PMLPC_HEIGHTAXIS_Z = 2,
	PMLPC_HEIGHTAXIS_MAX = 3
};

// Object: Enum Engine.ELocationSkelVertSurfaceSource
enum class ELocationSkelVertSurfaceSource : uint8_t
{
	VERTSURFACESOURCE_Vert = 0,
	VERTSURFACESOURCE_Surface = 1,
	VERTSURFACESOURCE_MAX = 2
};

// Object: Enum Engine.ELocationStaticMeshVertSurfaceSource
enum class ELocationStaticMeshVertSurfaceSource : uint8_t
{
	STATICVERTSURFACESOURCE_Vert = 0,
	STATICVERTSURFACESOURCE_Surface = 1,
	STATICVERTSURFACESOURCE_MAX = 2
};

// Object: Enum Engine.EOrbitChainMode
enum class EOrbitChainMode : uint8_t
{
	EOChainMode_Add = 0,
	EOChainMode_Scale = 1,
	EOChainMode_Link = 2,
	EOChainMode_MAX = 3
};

// Object: Enum Engine.EParticleAxisLock
enum class EParticleAxisLock : uint8_t
{
	EPAL_NONE = 0,
	EPAL_X = 1,
	EPAL_Y = 2,
	EPAL_Z = 3,
	EPAL_NEGATIVE_X = 4,
	EPAL_NEGATIVE_Y = 5,
	EPAL_NEGATIVE_Z = 6,
	EPAL_ROTATE_X = 7,
	EPAL_ROTATE_Y = 8,
	EPAL_ROTATE_Z = 9,
	EPAL_MAX = 10
};

// Object: Enum Engine.EEmitterDynamicParameterValue
enum class EEmitterDynamicParameterValue : uint8_t
{
	EDPV_UserSet = 0,
	EDPV_AutoSet = 1,
	EDPV_VelocityX = 2,
	EDPV_VelocityY = 3,
	EDPV_VelocityZ = 4,
	EDPV_VelocityMag = 5,
	EDPV_MAX = 6
};

// Object: Enum Engine.EEmitterNormalsMode
enum class EEmitterNormalsMode : uint8_t
{
	ENM_CameraFacing = 0,
	ENM_Spherical = 1,
	ENM_Cylindrical = 2,
	ENM_MAX = 3
};

// Object: Enum Engine.EParticleSortMode
enum class EParticleSortMode : uint8_t
{
	PSORTMODE_None = 0,
	PSORTMODE_ViewProjDepth = 1,
	PSORTMODE_DistanceToView = 2,
	PSORTMODE_Age_OldestFirst = 3,
	PSORTMODE_Age_NewestFirst = 4,
	PSORTMODE_MAX = 5
};

// Object: Enum Engine.EParticleUVFlipMode
enum class EParticleUVFlipMode : uint8_t
{
	None = 0,
	FlipUV = 1,
	FlipUOnly = 2,
	FlipVOnly = 3,
	RandomFlipUV = 4,
	RandomFlipUOnly = 5,
	RandomFlipVOnly = 6,
	RandomFlipUVIndependent = 7,
	EParticleUVFlipMode_MAX = 8
};

// Object: Enum Engine.ETrail2SourceMethod
enum class ETrail2SourceMethod : uint8_t
{
	PET2SRCM_Default = 0,
	PET2SRCM_Particle = 1,
	PET2SRCM_Actor = 2,
	PET2SRCM_MAX = 3
};

// Object: Enum Engine.EBeamTaperMethod
enum class EBeamTaperMethod : uint8_t
{
	PEBTM_None = 0,
	PEBTM_Full = 1,
	PEBTM_Partial = 2,
	PEBTM_MAX = 3
};

// Object: Enum Engine.EBeam2Method
enum class EBeam2Method : uint8_t
{
	PEB2M_Distance = 0,
	PEB2M_Target = 1,
	PEB2M_Branch = 2,
	PEB2M_MAX = 3
};

// Object: Enum Engine.EMeshCameraFacingOptions
enum class EMeshCameraFacingOptions : uint8_t
{
	XAxisFacing_NoUp = 0,
	XAxisFacing_ZUp = 1,
	XAxisFacing_NegativeZUp = 2,
	XAxisFacing_YUp = 3,
	XAxisFacing_NegativeYUp = 4,
	LockedAxis_ZAxisFacing = 5,
	LockedAxis_NegativeZAxisFacing = 6,
	LockedAxis_YAxisFacing = 7,
	LockedAxis_NegativeYAxisFacing = 8,
	VelocityAligned_ZAxisFacing = 9,
	VelocityAligned_NegativeZAxisFacing = 10,
	VelocityAligned_YAxisFacing = 11,
	VelocityAligned_NegativeYAxisFacing = 12,
	EMeshCameraFacingOptions_MAX = 13
};

// Object: Enum Engine.EMeshCameraFacingUpAxis
enum class EMeshCameraFacingUpAxis : uint8_t
{
	CameraFacing_NoneUP = 0,
	CameraFacing_ZUp = 1,
	CameraFacing_NegativeZUp = 2,
	CameraFacing_YUp = 3,
	CameraFacing_NegativeYUp = 4,
	CameraFacing_MAX = 5
};

// Object: Enum Engine.EMeshScreenAlignment
enum class EMeshScreenAlignment : uint8_t
{
	PSMA_MeshFaceCameraWithRoll = 0,
	PSMA_MeshFaceCameraWithSpin = 1,
	PSMA_MeshFaceCameraWithLockedAxis = 2,
	PSMA_MAX = 3
};

// Object: Enum Engine.ETrailsRenderAxisOption
enum class ETrailsRenderAxisOption : uint8_t
{
	Trails_CameraUp = 0,
	Trails_SourceUp = 1,
	Trails_WorldUp = 2,
	Trails_MAX = 3
};

// Object: Enum Engine.EParticleScreenAlignment
enum class EParticleScreenAlignment : uint8_t
{
	PSA_FacingCameraPosition = 0,
	PSA_Square = 1,
	PSA_Rectangle = 2,
	PSA_Velocity = 3,
	PSA_AwayFromCenter = 4,
	PSA_TypeSpecific = 5,
	PSA_FacingCameraDistanceBlend = 6,
	PSA_MAX = 7
};

// Object: Enum Engine.EParticleSystemOcclusionBoundsMethod
enum class EParticleSystemOcclusionBoundsMethod : uint8_t
{
	EPSOBM_None = 0,
	EPSOBM_ParticleBounds = 1,
	EPSOBM_CustomBounds = 2,
	EPSOBM_MAX = 3
};

// Object: Enum Engine.ParticleSystemLODMethod
enum class EParticleSystemLODMethod : uint8_t
{
	PARTICLESYSTEMLODMETHOD_Automatic = 0,
	PARTICLESYSTEMLODMETHOD_DirectSet = 1,
	PARTICLESYSTEMLODMETHOD_ActivateAutomatic = 2,
	PARTICLESYSTEMLODMETHOD_MAX = 3
};

// Object: Enum Engine.EParticleSystemUpdateMode
enum class EParticleSystemUpdateMode : uint8_t
{
	EPSUM_RealTime = 0,
	EPSUM_FixedTime = 1,
	EPSUM_MAX = 2
};

// Object: Enum Engine.EParticleEventType
enum class EParticleEventType : uint8_t
{
	EPET_Any = 0,
	EPET_Spawn = 1,
	EPET_Death = 2,
	EPET_Collision = 3,
	EPET_Burst = 4,
	EPET_Blueprint = 5,
	EPET_MAX = 6
};

// Object: Enum Engine.ParticleReplayState
enum class EParticleReplayState : uint8_t
{
	PRS_Disabled = 0,
	PRS_Capturing = 1,
	PRS_Replaying = 2,
	PRS_MAX = 3
};

// Object: Enum Engine.EParticleSysParamType
enum class EParticleSysParamType : uint8_t
{
	PSPT_None = 0,
	PSPT_Scalar = 1,
	PSPT_ScalarRand = 2,
	PSPT_Vector = 3,
	PSPT_VectorRand = 4,
	PSPT_Color = 5,
	PSPT_Actor = 6,
	PSPT_Material = 7,
	PSPT_VectorUnitRand = 8,
	PSPT_MAX = 9
};

// Object: Enum Engine.ESettingsLockedAxis
enum class ESettingsLockedAxis : uint8_t
{
	None = 0,
	X = 1,
	Y = 2,
	Z = 3,
	Invalid = 4,
	ESettingsLockedAxis_MAX = 5
};

// Object: Enum Engine.ESettingsDOF
enum class ESettingsDOF : uint8_t
{
	Full3D = 0,
	YZPlane = 1,
	XZPlane = 2,
	XYPlane = 3,
	ESettingsDOF_MAX = 4
};

// Object: Enum Engine.EFrictionCombineMode
enum class EFrictionCombineMode : uint8_t
{
	Average = 0,
	Min = 1,
	Multiply = 2,
	Max = 3
};

// Object: Enum Engine.EPhysicsAsyncAddMode
enum class EPhysicsAsyncAddMode : uint8_t
{
	OnceOverlapSwitchToAdd = 0,
	OnceOverlapAdditiveToAdd = 1,
	OnceOverLapByPhysicsTree = 2,
	EPhysicsAsyncAddMode_MAX = 3
};

// Object: Enum Engine.EDynamicForceFeedbackAction
enum class EDynamicForceFeedbackAction : uint8_t
{
	Start = 0,
	Update = 1,
	Stop = 2,
	EDynamicForceFeedbackAction_MAX = 3
};

// Object: Enum Engine.EPreferredWorldScaleType
enum class EPreferredWorldScaleType : uint8_t
{
	EPWS_MiniWorld = 0,
	EPWS_MidWorld = 1,
	EPWS_BigWorld = 2,
	EPWS_Num = 3,
	EPWS_MAX = 4
};

// Object: Enum Engine.ERenderMatrixMode
enum class ERenderMatrixMode : uint8_t
{
	ERMM_Default = 0,
	ERMM_IndependentFovFromCameraManager = 1,
	ERMM_MAX = 2
};

// Object: Enum Engine.ERendererStencilMask
enum class ERendererStencilMask : uint8_t
{
	ERSM_Default = 0,
	ERSM_255 = 1,
	ERSM_1 = 2,
	ERSM_2 = 3,
	ERSM_4 = 4,
	ERSM_8 = 5,
	ERSM_16 = 6,
	ERSM_32 = 7,
	ERSM_64 = 8,
	ERSM_128 = 9,
	ERSM_MAX = 10
};

// Object: Enum Engine.EHasCustomNavigableGeometry
enum class EHasCustomNavigableGeometry : uint8_t
{
	No = 0,
	Yes = 1,
	EvenIfNotCollidable = 2,
	DontExport = 3,
	EHasCustomNavigableGeometry_MAX = 4
};

// Object: Enum Engine.ECanBeCharacterBase
enum class ECanBeCharacterBase : uint8_t
{
	ECB_No = 0,
	ECB_Yes = 1,
	ECB_Owner = 2,
	ECB_MAX = 3
};

// Object: Enum Engine.EReflectionInfluencePrimitiveType
enum class EReflectionInfluencePrimitiveType : uint8_t
{
	BothStaticAndMovable = 0,
	StaticOnly = 1,
	MovableOnly = 2,
	EReflectionInfluencePrimitiveType_MAX = 3
};

// Object: Enum Engine.EReflectionSourceType
enum class EReflectionSourceType : uint8_t
{
	CapturedScene = 0,
	SpecifiedCubemap = 1,
	EReflectionSourceType_MAX = 2
};

// Object: Enum Engine.EReflectionRangeShape
enum class EReflectionRangeShape : uint8_t
{
	Sphere = 0,
	Box = 1,
	EReflectionRangeShape_MAX = 2
};

// Object: Enum Engine.EDefaultBackBufferPixelFormat
enum class EDefaultBackBufferPixelFormat : uint8_t
{
	DBBPF_B8G8R8A8 = 0,
	DBBPF_A16B16G16R16_DEPRECATED = 1,
	DBBPF_FloatRGB_DEPRECATED = 2,
	DBBPF_FloatRGBA = 3,
	DBBPF_A2B10G10R10 = 4,
	DBBPF_MAX = 5
};

// Object: Enum Engine.EAutoExposureMethodUI
enum class EAutoExposureMethodUI : uint8_t
{
	AEM_Histogram = 0,
	AEM_Basic = 1,
	AEM_Manual = 2,
	AEM_MAX = 3
};

// Object: Enum Engine.EAlphaChannelMode
enum class EAlphaChannelMode : uint8_t
{
	Disabled = 0,
	LinearColorSpaceOnly = 1,
	AllowThroughTonemapper = 2,
	EAlphaChannelMode_MAX = 3
};

// Object: Enum Engine.EVelocityOutputPass
enum class EVelocityOutputPass : uint8_t
{
	DepthPass = 0,
	BasePass = 1,
	AfterBasePass = 2,
	EVelocityOutputPass_MAX = 3
};

// Object: Enum Engine.EEarlyZPass
enum class EEarlyZPass : uint8_t
{
	None = 0,
	OpaqueOnly = 1,
	OpaqueAndMasked = 2,
	Auto = 3,
	EEarlyZPass_MAX = 4
};

// Object: Enum Engine.ECustomDepthStencil
enum class ECustomDepthStencil : uint8_t
{
	Disabled = 0,
	Enabled = 1,
	EnabledOnDemand = 2,
	EnabledWithStencil = 3,
	ECustomDepthStencil_MAX = 4
};

// Object: Enum Engine.EMobileMSAASampleCount
enum class EMobileMSAASampleCount : uint8_t
{
	One = 1,
	Two = 2,
	Four = 4,
	Eight = 8,
	EMobileMSAASampleCount_MAX = 9
};

// Object: Enum Engine.ECompositingSampleCount
enum class ECompositingSampleCount : uint8_t
{
	One = 1,
	Two = 2,
	Four = 4,
	Eight = 8,
	ECompositingSampleCount_MAX = 9
};

// Object: Enum Engine.EClearSceneOptions
enum class EClearSceneOptions : uint8_t
{
	NoClear = 0,
	HardwareClear = 1,
	QuadAtMaxZ = 2,
	EClearSceneOptions_MAX = 3
};

// Object: Enum Engine.EReporterLineStyle
enum class EReporterLineStyle : uint8_t
{
	Line = 0,
	Dash = 1,
	EReporterLineStyle_MAX = 2
};

// Object: Enum Engine.ELegendPosition
enum class ELegendPosition : uint8_t
{
	Outside = 0,
	Inside = 1,
	ELegendPosition_MAX = 2
};

// Object: Enum Engine.EGraphDataStyle
enum class EGraphDataStyle : uint8_t
{
	Lines = 0,
	Filled = 1,
	EGraphDataStyle_MAX = 2
};

// Object: Enum Engine.EGraphAxisStyle
enum class EGraphAxisStyle : uint8_t
{
	Lines = 0,
	Notches = 1,
	Grid = 2,
	EGraphAxisStyle_MAX = 3
};

// Object: Enum Engine.ERichCurveKeyTimeCompressionFormat
enum class ERichCurveKeyTimeCompressionFormat : uint8_t
{
	RCKTCF_uint16 = 0,
	RCKTCF_float32 = 1,
	RCKTCF_MAX = 2
};

// Object: Enum Engine.ERichCurveCompressionFormat
enum class ERichCurveCompressionFormat : uint8_t
{
	RCCF_Empty = 0,
	RCCF_Constant = 1,
	RCCF_Linear = 2,
	RCCF_Cubic = 3,
	RCCF_Mixed = 4,
	RCCF_MAX = 5
};

// Object: Enum Engine.EConstraintTransform
enum class EConstraintTransform : uint8_t
{
	Absolute = 0,
	Relative = 1,
	EConstraintTransform_MAX = 2
};

// Object: Enum Engine.EControlConstraint
enum class EControlConstraint : uint8_t
{
	Orientation = 0,
	Translation = 1,
	MAX = 2
};

// Object: Enum Engine.ERootMotionFinishVelocityMode
enum class ERootMotionFinishVelocityMode : uint8_t
{
	MaintainLastRootMotionVelocity = 0,
	SetVelocity = 1,
	ClampVelocity = 2,
	ERootMotionFinishVelocityMode_MAX = 3
};

// Object: Enum Engine.ERootMotionSourceSettingsFlags
enum class ERootMotionSourceSettingsFlags : uint8_t
{
	UseSensitiveLiftoffCheck = 1,
	DisablePartialEndTick = 2,
	ERootMotionSourceSettingsFlags_MAX = 3
};

// Object: Enum Engine.ERootMotionSourceStatusFlags
enum class ERootMotionSourceStatusFlags : uint8_t
{
	Prepared = 1,
	Finished = 2,
	MarkedForRemoval = 4,
	ERootMotionSourceStatusFlags_MAX = 5
};

// Object: Enum Engine.ERootMotionAccumulateMode
enum class ERootMotionAccumulateMode : uint8_t
{
	Override = 0,
	Additive = 1,
	ERootMotionAccumulateMode_MAX = 2
};

// Object: Enum Engine.ERTCChannelPlane
enum class ERTCChannelPlane : uint8_t
{
	Default = 0,
	R = 1,
	RG = 2,
	RG_B = 3,
	RGB = 4,
	RGBA = 5,
	RGB_A = 6,
	RG_A = 7,
	Count = 8,
	ERTCChannelPlane_MAX = 9
};

// Object: Enum Engine.ERTCColorSpace
enum class ERTCColorSpace : uint8_t
{
	Default = 0,
	LDR = 1,
	Count = 2,
	ERTCColorSpace_MAX = 3
};

// Object: Enum Engine.ERTCQuality
enum class ERTCQuality : uint8_t
{
	Default = 0,
	Fastest = 1,
	Normal = 2,
	High = 3,
	Count = 4,
	ERTCQuality_MAX = 5
};

// Object: Enum Engine.ERTCFormat
enum class ERTCFormat : uint8_t
{
	Default = 0,
	UE4Ori = 1,
	None = 2,
	ASTC_Family = 3,
	ETC_Family = 4,
	DXT_Family = 5,
	Count = 6,
	ERTCFormat_MAX = 7
};

// Object: Enum Engine.ERuntimeVirtualTextureLayerType
enum class ERuntimeVirtualTextureLayerType : uint8_t
{
	Detail = 0,
	Base = 1,
	Backup = 2,
	Count = 3,
	ERuntimeVirtualTextureLayerType_MAX = 4
};

// Object: Enum Engine.ERuntimeVirtualTextureMainPassType
enum class ERuntimeVirtualTextureMainPassType : uint8_t
{
	Never = 0,
	Exclusive = 1,
	Always = 2,
	ERuntimeVirtualTextureMainPassType_MAX = 3
};

// Object: Enum Engine.ERuntimeVirtualTextureMaterialType
enum class ERuntimeVirtualTextureMaterialType : uint8_t
{
	BaseColor = 0,
	BaseColor_Normal_DEPRECATED = 1,
	BaseColor_Normal_Specular = 2,
	BaseColor_Normal_Roughness_Specular_Mask_Height = 3,
	BaseColor_Normal_Specular_YCoCg = 4,
	BaseColor_Normal_Specular_Mask_YCoCg = 5,
	WorldHeight = 6,
	Count = 7,
	ERuntimeVirtualTextureMaterialType_MAX = 8
};

// Object: Enum Engine.ERayTracingWaterCausticsBufferScale
enum class ERayTracingWaterCausticsBufferScale : uint8_t
{
	FULL = 0,
	HALF = 1,
	QUATER = 2,
	ERayTracingWaterCausticsBufferScale_MAX = 3
};

// Object: Enum Engine.ERayTracingWaterCausticsType
enum class ERayTracingWaterCausticsType : uint8_t
{
	Disable = 0,
	SurfelBasedRendering = 1,
	ProceduralMeshes = 2,
	ERayTracingWaterCausticsType_MAX = 3
};

// Object: Enum Engine.EMobilePixelProjectedReflectionQuality
enum class EMobilePixelProjectedReflectionQuality : uint8_t
{
	Disabled = 0,
	BestPerformance = 1,
	BetterQuality = 2,
	BestQuality = 3,
	EMobilePixelProjectedReflectionQuality_MAX = 4
};

// Object: Enum Engine.EMobilePlanarReflectionMode
enum class EMobilePlanarReflectionMode : uint8_t
{
	Usual = 0,
	MobilePPRExclusive = 1,
	MobilePPR = 2,
	EMobilePlanarReflectionMode_MAX = 3
};

// Object: Enum Engine.ERayTracingMeshCausticsDebugScreenData
enum class ERayTracingMeshCausticsDebugScreenData : uint8_t
{
	Debug_None = 0,
	Debug_Photon = 1,
	Debug_CausticsVariance = 2,
	Debug_MAX = 3
};

// Object: Enum Engine.ERayTracingMeshCausticsDebugLightData
enum class ERayTracingMeshCausticsDebugLightData : uint8_t
{
	Debug_None = 0,
	Debug_Normal = 1,
	Debug_ScreenArea = 2,
	Debug_CausticsVariance = 3,
	Debug_RayDensity = 4,
	Debug_RayDensityMip = 5,
	Debug_LightID = 6,
	Debug_PhotonCount = 7,
	Debug_MAX = 8
};

// Object: Enum Engine.ERayTracingMeshCausticsTranslucentReflectionMode
enum class ERayTracingMeshCausticsTranslucentReflectionMode : uint8_t
{
	TranslucentReflectionMode_NoReflection = 0,
	TranslucentReflectionMode_AlwaysReflection = 1,
	TranslucentReflectionMode_RandomReflection = 2,
	TranslucentReflectionMode_MAX = 3
};

// Object: Enum Engine.ERayTracingMeshCausticsBufferScale
enum class ERayTracingMeshCausticsBufferScale : uint8_t
{
	BufferScale_Full = 0,
	BufferScale_Half = 1,
	BufferScale_Quarter = 2,
	BufferScale_MAX = 3
};

// Object: Enum Engine.ERayTracingMeshCausticsResolutionOverride
enum class ERayTracingMeshCausticsResolutionOverride : uint8_t
{
	Resolution_None = 0,
	Resolution_64 = 1,
	Resolution_128 = 2,
	Resolution_256 = 3,
	Resolution_512 = 4,
	Resolution_1024 = 5,
	Resolution_2048 = 6,
	Resolution_MAX = 7
};

// Object: Enum Engine.ERayTracingMeshCausticsResolution
enum class ERayTracingMeshCausticsResolution : uint8_t
{
	Resolution_64 = 0,
	Resolution_128 = 1,
	Resolution_256 = 2,
	Resolution_512 = 3,
	Resolution_1024 = 4,
	Resolution_2048 = 5,
	Resolution_MAX = 6
};

// Object: Enum Engine.EReflectedAndRefractedRayTracedShadows
enum class EReflectedAndRefractedRayTracedShadows : uint8_t
{
	Disabled = 0,
	Hard_shadows = 1,
	Area_shadows = 2,
	EReflectedAndRefractedRayTracedShadows_MAX = 3
};

// Object: Enum Engine.ERayTracingGIDenoiseDebugType
enum class ERayTracingGIDenoiseDebugType : uint8_t
{
	Disabled = 0,
	Variance = 1,
	FirstMoment = 2,
	SecondMoment = 3,
	HistoryLength = 4,
	MotionVector = 5,
	HitDistance = 6,
	RawOutput = 7,
	ERayTracingGIDenoiseDebugType_MAX = 8
};

// Object: Enum Engine.ERayTracingGIDenoiseSpatialFilterType
enum class ERayTracingGIDenoiseSpatialFilterType : uint8_t
{
	ATrous = 0,
	Gaussian = 1,
	ERayTracingGIDenoiseSpatialFilterType_MAX = 2
};

// Object: Enum Engine.ERayTracingGIDenoiseType
enum class ERayTracingGIDenoiseType : uint8_t
{
	Disabled = 0,
	UE4 = 1,
	New = 2,
	ERayTracingGIDenoiseType_MAX = 3
};

// Object: Enum Engine.ERayTracingGlobalIlluminationType
enum class ERayTracingGlobalIlluminationType : uint8_t
{
	Disabled = 0,
	BruteForce = 1,
	FinalGather = 2,
	ERayTracingGlobalIlluminationType_MAX = 3
};

// Object: Enum Engine.ETranslucencyType
enum class ETranslucencyType : uint8_t
{
	Raster = 0,
	RayTracing = 1,
	HybridTranslucency = 2,
	EnhancedRayTracing = 3,
	ETranslucencyType_MAX = 4
};

// Object: Enum Engine.EReflectionsType
enum class EReflectionsType : uint8_t
{
	ScreenSpace = 0,
	RayTracing = 1,
	EReflectionsType_MAX = 2
};

// Object: Enum Engine.ELightUnits
enum class ELightUnits : uint8_t
{
	Unitless = 0,
	Candelas = 1,
	Lumens = 2,
	ELightUnits_MAX = 3
};

// Object: Enum Engine.EPPEdgeDetectMethod
enum class EPPEdgeDetectMethod : uint8_t
{
	DD_NONE = 0,
	DD_Sobel = 1,
	DD_IRoberts = 2,
	DD_MAX = 3
};

// Object: Enum Engine.EPPBlurMethod
enum class EPPBlurMethod : uint8_t
{
	BB_NONE = 0,
	BB_GB = 1,
	BB_IB = 2,
	BB_MAX = 3
};

// Object: Enum Engine.ELensFlareMethod
enum class ELensFlareMethod : uint8_t
{
	LFM_UE = 0,
	LFM_OPTIMIZED = 1,
	LFM_CUSTOM = 2,
	LFM_MAX = 3
};

// Object: Enum Engine.EBloomMethod
enum class EBloomMethod : uint8_t
{
	BM_SOG = 0,
	BM_FFT = 1,
	BM_MAX = 2
};

// Object: Enum Engine.EAutoExposureMethod
enum class EAutoExposureMethod : uint8_t
{
	AEM_Histogram = 0,
	AEM_Basic = 1,
	AEM_Manual = 2,
	AEM_MAX = 3
};

// Object: Enum Engine.EDepthOfFieldMethod
enum class EDepthOfFieldMethod : uint8_t
{
	DOFM_BokehDOF = 0,
	DOFM_Gaussian = 1,
	DOFM_CircleDOF = 2,
	DOFM_MAX = 3
};

// Object: Enum Engine.ELiteRendererUsage
enum class ELiteRendererUsage : uint8_t
{
	Default = 0,
	OnlyTranslucent = 1,
	Scope = 2,
	ELiteRendererUsage_MAX = 3
};

// Object: Enum Engine.ESceneCapturePrimitiveRenderMode
enum class ESceneCapturePrimitiveRenderMode : uint8_t
{
	PRM_LegacySceneCapture = 0,
	PRM_RenderScenePrimitives = 1,
	PRM_UseShowOnlyList = 2,
	PRM_MAX = 3
};

// Object: Enum Engine.ESSAA
enum class ESSAA : uint8_t
{
	SSAA_None = 0,
	SSAA_2X = 2,
	SSAA_3X = 3,
	SSAA_4X = 4,
	SSAA_MAX = 5
};

// Object: Enum Engine.EMaterialProperty
enum class EMaterialProperty : uint8_t
{
	MP_EmissiveColor = 0,
	MP_Opacity = 1,
	MP_OpacityMask = 2,
	MP_DiffuseColor = 3,
	MP_SpecularColor = 4,
	MP_BaseColor = 5,
	MP_Metallic = 6,
	MP_Specular = 7,
	MP_Roughness = 8,
	MP_Anisotropy = 9,
	MP_Normal = 10,
	MP_Tangent = 11,
	MP_WorldPositionOffset = 12,
	MP_WorldDisplacement = 13,
	MP_TessellationMultiplier = 14,
	MP_SubsurfaceColor = 15,
	MP_CustomData0 = 16,
	MP_CustomData1 = 17,
	MP_AmbientOcclusion = 18,
	MP_Refraction = 19,
	MP_CustomizedUVs0 = 20,
	MP_CustomizedUVs1 = 21,
	MP_CustomizedUVs2 = 22,
	MP_CustomizedUVs3 = 23,
	MP_CustomizedUVs4 = 24,
	MP_CustomizedUVs5 = 25,
	MP_CustomizedUVs6 = 26,
	MP_CustomizedUVs7 = 27,
	MP_PixelDepthOffset = 28,
	MP_ShadingModel = 29,
	MP_WetnessMask = 30,
	MP_Porosity = 31,
	MP_PuddleMask = 32,
	MP_MaterialAttributes = 33,
	MP_CustomOutput = 34,
	MP_MAX = 35
};

// Object: Enum Engine.EAntiAliasingMethod
enum class EAntiAliasingMethod : uint8_t
{
	AAM_None = 0,
	AAM_FXAA = 1,
	AAM_TemporalAA = 2,
	AAM_MSAA = 3,
	AAM_TSR = 4,
	AAM_SMAA = 5,
	AAM_LWTAA = 6,
	AAM_MAX = 7
};

// Object: Enum Engine.EPhysicsTransformUpdateMode
enum class EPhysicsTransformUpdateMode : uint8_t
{
	SimulationUpatesComponentTransform = 0,
	ComponentTransformIsKinematic = 1,
	EPhysicsTransformUpdateMode_MAX = 2
};

// Object: Enum Engine.EAnimationMode
enum class EAnimationMode : uint8_t
{
	AnimationBlueprint = 0,
	AnimationSingleNode = 1,
	AnimationCustomMode = 2,
	EAnimationMode_MAX = 3
};

// Object: Enum Engine.EKinematicBonesUpdateToPhysics
enum class EKinematicBonesUpdateToPhysics : uint8_t
{
	SkipSimulatingBones = 0,
	SkipAllBones = 1,
	EKinematicBonesUpdateToPhysics_MAX = 2
};

// Object: Enum Engine.EClothMassMode
enum class EClothMassMode : uint8_t
{
	UniformMass = 0,
	TotalMass = 1,
	Density = 2,
	MaxClothMassMode = 3,
	EClothMassMode_MAX = 4
};

// Object: Enum Engine.EAnimCurveType
enum class EAnimCurveType : uint8_t
{
	AttributeCurve = 0,
	MaterialCurve = 1,
	MorphTargetCurve = 2,
	MaxAnimCurveType = 3,
	EAnimCurveType_MAX = 4
};

// Object: Enum Engine.ESkeletalMeshSkinningImportVersions
enum class ESkeletalMeshSkinningImportVersions : uint8_t
{
	Before_Versionning = 0,
	SkeletalMeshBuildRefactor = 1,
	VersionPlusOne = 2,
	LatestVersion = 3,
	ESkeletalMeshSkinningImportVersions_MAX = 4
};

// Object: Enum Engine.ESkeletalMeshGeoImportVersions
enum class ESkeletalMeshGeoImportVersions : uint8_t
{
	Before_Versionning = 0,
	SkeletalMeshBuildRefactor = 1,
	VersionPlusOne = 2,
	LatestVersion = 3,
	ESkeletalMeshGeoImportVersions_MAX = 4
};

// Object: Enum Engine.EBoneFilterActionOption
enum class EBoneFilterActionOption : uint8_t
{
	Remove = 0,
	Keep = 1,
	Invalid = 2,
	EBoneFilterActionOption_MAX = 3
};

// Object: Enum Engine.SkeletalMeshOptimizationImportance
enum class ESkeletalMeshOptimizationImportance : uint8_t
{
	SMOI_Off = 0,
	SMOI_Lowest = 1,
	SMOI_Low = 2,
	SMOI_Normal = 3,
	SMOI_High = 4,
	SMOI_Highest = 5,
	SMOI_MAX = 6
};

// Object: Enum Engine.SkeletalMeshOptimizationType
enum class ESkeletalMeshOptimizationType : uint8_t
{
	SMOT_NumOfTriangles = 0,
	SMOT_MaxDeviation = 1,
	SMOT_TriangleOrDeviation = 2,
	SMOT_MAX = 3
};

// Object: Enum Engine.SkeletalMeshTerminationCriterion
enum class ESkeletalMeshTerminationCriterion : uint8_t
{
	SMTC_NumOfTriangles = 0,
	SMTC_NumOfVerts = 1,
	SMTC_TriangleOrVert = 2,
	SMTC_AbsNumOfTriangles = 3,
	SMTC_AbsNumOfVerts = 4,
	SMTC_AbsTriangleOrVert = 5,
	SMTC_MAX = 6
};

// Object: Enum Engine.EBoneTranslationRetargetingMode
enum class EBoneTranslationRetargetingMode : uint8_t
{
	Animation = 0,
	Skeleton = 1,
	AnimationScaled = 2,
	AnimationRelative = 3,
	OrientAndScale = 4,
	EBoneTranslationRetargetingMode_MAX = 5
};

// Object: Enum Engine.EBoneSpaces
enum class EBoneSpaces : uint8_t
{
	WorldSpace = 0,
	ComponentSpace = 1,
	EBoneSpaces_MAX = 2
};

// Object: Enum Engine.EVisibilityBasedAnimTickOption
enum class EVisibilityBasedAnimTickOption : uint8_t
{
	AlwaysTickPoseAndRefreshBones = 0,
	AlwaysTickPose = 1,
	OnlyTickMontagesWhenNotRendered = 2,
	OnlyTickPoseWhenRendered = 3,
	EVisibilityBasedAnimTickOption_MAX = 4
};

// Object: Enum Engine.EPhysBodyOp
enum class EPhysBodyOp : uint8_t
{
	PBO_None = 0,
	PBO_Term = 1,
	PBO_MAX = 2
};

// Object: Enum Engine.EBoneVisibilityStatus
enum class EBoneVisibilityStatus : uint8_t
{
	BVS_HiddenByParent = 0,
	BVS_Visible = 1,
	BVS_ExplicitlyHidden = 2,
	BVS_MAX = 3
};

// Object: Enum Engine.ESkyLightSourceType
enum class ESkyLightSourceType : uint8_t
{
	SLS_CapturedScene = 0,
	SLS_SpecifiedCubemap = 1,
	SLS_MAX = 2
};

// Object: Enum Engine.EReverbSendMethod
enum class EReverbSendMethod : uint8_t
{
	Linear = 0,
	CustomCurve = 1,
	Manual = 2,
	EReverbSendMethod_MAX = 3
};

// Object: Enum Engine.EAirAbsorptionMethod
enum class EAirAbsorptionMethod : uint8_t
{
	Linear = 0,
	CustomCurve = 1,
	EAirAbsorptionMethod_MAX = 2
};

// Object: Enum Engine.ESoundSpatializationAlgorithm
enum class ESoundSpatializationAlgorithm : uint8_t
{
	SPATIALIZATION_Default = 0,
	SPATIALIZATION_HRTF = 1,
	SPATIALIZATION_MAX = 2
};

// Object: Enum Engine.ESoundDistanceCalc
enum class ESoundDistanceCalc : uint8_t
{
	SOUNDDISTANCE_Normal = 0,
	SOUNDDISTANCE_InfiniteXYPlane = 1,
	SOUNDDISTANCE_InfiniteXZPlane = 2,
	SOUNDDISTANCE_InfiniteYZPlane = 3,
	SOUNDDISTANCE_MAX = 4
};

// Object: Enum Engine.EVirtualizationMode
enum class EVirtualizationMode : uint8_t
{
	Disabled = 0,
	PlayWhenSilent = 1,
	Restart = 2,
	EVirtualizationMode_MAX = 3
};

// Object: Enum Engine.ESoundWaveLoadingBehavior
enum class ESoundWaveLoadingBehavior : uint16_t
{
	Inherited = 0,
	RetainOnLoad = 1,
	PrimeOnLoad = 2,
	LoadOnDemand = 3,
	ForceInline = 4,
	Uninitialized = 255,
	ESoundWaveLoadingBehavior_MAX = 256
};

// Object: Enum Engine.EAudioOutputTarget
enum class EAudioOutputTarget : uint8_t
{
	Speaker = 0,
	Controller = 1,
	ControllerFallbackToSpeaker = 2,
	EAudioOutputTarget_MAX = 3
};

// Object: Enum Engine.EMaxConcurrentResolutionRule
enum class EMaxConcurrentResolutionRule : uint8_t
{
	PreventNew = 0,
	StopOldest = 1,
	StopFarthestThenPreventNew = 2,
	StopFarthestThenOldest = 3,
	StopLowestPriority = 4,
	StopQuietest = 5,
	StopLowestPriorityThenPreventNew = 6,
	EMaxConcurrentResolutionRule_MAX = 7
};

// Object: Enum Engine.ESoundGroup
enum class ESoundGroup : uint8_t
{
	SOUNDGROUP_Default = 0,
	SOUNDGROUP_Effects = 1,
	SOUNDGROUP_UI = 2,
	SOUNDGROUP_Music = 3,
	SOUNDGROUP_Voice = 4,
	SOUNDGROUP_GameSoundGroup1 = 5,
	SOUNDGROUP_GameSoundGroup2 = 6,
	SOUNDGROUP_GameSoundGroup3 = 7,
	SOUNDGROUP_GameSoundGroup4 = 8,
	SOUNDGROUP_GameSoundGroup5 = 9,
	SOUNDGROUP_GameSoundGroup6 = 10,
	SOUNDGROUP_GameSoundGroup7 = 11,
	SOUNDGROUP_GameSoundGroup8 = 12,
	SOUNDGROUP_GameSoundGroup9 = 13,
	SOUNDGROUP_GameSoundGroup10 = 14,
	SOUNDGROUP_GameSoundGroup11 = 15,
	SOUNDGROUP_GameSoundGroup12 = 16,
	SOUNDGROUP_GameSoundGroup13 = 17,
	SOUNDGROUP_GameSoundGroup14 = 18,
	SOUNDGROUP_GameSoundGroup15 = 19,
	SOUNDGROUP_GameSoundGroup16 = 20,
	SOUNDGROUP_GameSoundGroup17 = 21,
	SOUNDGROUP_GameSoundGroup18 = 22,
	SOUNDGROUP_GameSoundGroup19 = 23,
	SOUNDGROUP_GameSoundGroup20 = 24,
	SOUNDGROUP_MAX = 25
};

// Object: Enum Engine.ModulationParamMode
enum class EModulationParamMode : uint8_t
{
	MPM_Normal = 0,
	MPM_Abs = 1,
	MPM_Direct = 2,
	MPM_MAX = 3
};

// Object: Enum Engine.ESourceBusChannels
enum class ESourceBusChannels : uint8_t
{
	Mono = 0,
	Stereo = 1,
	ESourceBusChannels_MAX = 2
};

// Object: Enum Engine.ESourceBusSendLevelControlMethod
enum class ESourceBusSendLevelControlMethod : uint8_t
{
	Linear = 0,
	CustomCurve = 1,
	Manual = 2,
	ESourceBusSendLevelControlMethod_MAX = 3
};

// Object: Enum Engine.ESubmixChannelFormat
enum class ESubmixChannelFormat : uint8_t
{
	Device = 0,
	Stereo = 1,
	Quad = 2,
	FiveDotOne = 3,
	SevenDotOne = 4,
	Ambisonics = 5,
	Count = 6,
	ESubmixChannelFormat_MAX = 7
};

// Object: Enum Engine.ESendLevelControlMethod
enum class ESendLevelControlMethod : uint8_t
{
	Linear = 0,
	CustomCurve = 1,
	Manual = 2,
	ESendLevelControlMethod_MAX = 3
};

// Object: Enum Engine.EAudioRecordingExportType
enum class EAudioRecordingExportType : uint8_t
{
	SoundWave = 0,
	WavFile = 1,
	EAudioRecordingExportType_MAX = 2
};

// Object: Enum Engine.ESoundWaveFFTSize
enum class ESoundWaveFFTSize : uint8_t
{
	VerySmall_64 = 0,
	Small_256 = 1,
	Medium_512 = 2,
	Large_1024 = 3,
	VeryLarge_2048 = 4,
	ESoundWaveFFTSize_MAX = 5
};

// Object: Enum Engine.EDecompressionType
enum class EDecompressionType : uint8_t
{
	DTYPE_Setup = 0,
	DTYPE_Invalid = 1,
	DTYPE_Preview = 2,
	DTYPE_Native = 3,
	DTYPE_RealTime = 4,
	DTYPE_Procedural = 5,
	DTYPE_Xenon = 6,
	DTYPE_Streaming = 7,
	DTYPE_MAX = 8
};

// Object: Enum Engine.ESplineCoordinateSpace
enum class ESplineCoordinateSpace : uint8_t
{
	Local = 0,
	World = 1,
	ESplineCoordinateSpace_MAX = 2
};

// Object: Enum Engine.ESplinePointType
enum class ESplinePointType : uint8_t
{
	Linear = 0,
	Curve = 1,
	Constant = 2,
	CurveClamped = 3,
	CurveCustomTangent = 4,
	ESplinePointType_MAX = 5
};

// Object: Enum Engine.ESplineMeshAxis
enum class ESplineMeshAxis : uint8_t
{
	X = 0,
	Y = 1,
	Z = 2,
	ESplineMeshAxis_MAX = 3
};

// Object: Enum Engine.EMaterialErrorType
enum class EMaterialErrorType : uint8_t
{
	None = 0,
	WIP = 1,
	Warning = 2,
	Error = 3,
	EMaterialErrorType_MAX = 4
};

// Object: Enum Engine.EOptimizationType
enum class EOptimizationType : uint8_t
{
	OT_NumOfTriangles = 0,
	OT_MaxDeviation = 1,
	OT_MAX = 2
};

// Object: Enum Engine.EImportanceLevel
enum class EImportanceLevel : uint8_t
{
	IL_Off = 0,
	IL_Lowest = 1,
	IL_Low = 2,
	IL_Normal = 3,
	IL_High = 4,
	IL_Highest = 5,
	TEMP_BROKEN2 = 6,
	EImportanceLevel_MAX = 7
};

// Object: Enum Engine.ENormalMode
enum class ENormalMode : uint8_t
{
	NM_PreserveSmoothingGroups = 0,
	NM_RecalculateNormals = 1,
	NM_RecalculateNormalsSmooth = 2,
	NM_RecalculateNormalsHard = 3,
	TEMP_BROKEN = 4,
	ENormalMode_MAX = 5
};

// Object: Enum Engine.EReflectionCachePolicy
enum class EReflectionCachePolicy : uint8_t
{
	CacheRuntime = 0,
	ManuallySpecify = 1,
	EReflectionCachePolicy_MAX = 2
};

// Object: Enum Engine.EStereoLayerShape
enum class EStereoLayerShape : uint8_t
{
	SLSH_QuadLayer = 0,
	SLSH_CylinderLayer = 1,
	SLSH_CubemapLayer = 2,
	SLSH_EquirectLayer = 3,
	SLSH_MAX = 4
};

// Object: Enum Engine.EStereoLayerType
enum class EStereoLayerType : uint8_t
{
	SLT_WorldLocked = 0,
	SLT_TrackerLocked = 1,
	SLT_FaceLocked = 2,
	SLT_MAX = 3
};

// Object: Enum Engine.EOpacitySourceMode
enum class EOpacitySourceMode : uint8_t
{
	OSM_Alpha = 0,
	OSM_ColorBrightness = 1,
	OSM_RedChannel = 2,
	OSM_GreenChannel = 3,
	OSM_BlueChannel = 4,
	OSM_MAX = 5
};

// Object: Enum Engine.ESubUVBoundingVertexCount
enum class ESubUVBoundingVertexCount : uint8_t
{
	BVC_FourVertices = 0,
	BVC_EightVertices = 1,
	BVC_MAX = 2
};

// Object: Enum Engine.EABCDirection
enum class EABCDirection : uint8_t
{
	Up = 0,
	Down = 1,
	Right = 2,
	Left = 3,
	Forward = 4,
	Backward = 5,
	EABCDirection_MAX = 6
};

// Object: Enum Engine.EVerticalTextAligment
enum class EVerticalTextAligment : uint8_t
{
	EVRTA_TextTop = 0,
	EVRTA_TextCenter = 1,
	EVRTA_TextBottom = 2,
	EVRTA_QuadTop = 3,
	EVRTA_MAX = 4
};

// Object: Enum Engine.EHorizTextAligment
enum class EHorizTextAligment : uint8_t
{
	EHTA_Left = 0,
	EHTA_Center = 1,
	EHTA_Right = 2,
	EHTA_MAX = 3
};

// Object: Enum Engine.ETextureCompressionQuality
enum class ETextureCompressionQuality : uint8_t
{
	TCQ_Default = 0,
	TCQ_Lowest = 1,
	TCQ_Low = 2,
	TCQ_Medium = 3,
	TCQ_High = 4,
	TCQ_Highest = 5,
	TCQ_MAX = 6
};

// Object: Enum Engine.ETextureSourceFormat
enum class ETextureSourceFormat : uint8_t
{
	TSF_Invalid = 0,
	TSF_G8 = 1,
	TSF_BGRA8 = 2,
	TSF_BGRE8 = 3,
	TSF_RGBA16 = 4,
	TSF_RGBA16F = 5,
	TSF_RGBA8 = 6,
	TSF_RGBE8 = 7,
	TSF_G16 = 8,
	TSF_MAX = 9
};

// Object: Enum Engine.ETextureSourceArtType
enum class ETextureSourceArtType : uint8_t
{
	TSAT_Uncompressed = 0,
	TSAT_PNGCompressed = 1,
	TSAT_DDSFile = 2,
	TSAT_MAX = 3
};

// Object: Enum Engine.ETextureMipCount
enum class ETextureMipCount : uint8_t
{
	TMC_ResidentMips = 0,
	TMC_AllMips = 1,
	TMC_AllMipsBiased = 2,
	TMC_MAX = 3
};

// Object: Enum Engine.EBlendChannel
enum class EBlendChannel : uint8_t
{
	BC_BlendToRed = 0,
	BC_BlendToGreen = 1,
	BC_BlendToBlue = 2,
	BC_BlendToAlpha = 3,
	BC_MAX = 4
};

// Object: Enum Engine.ECompositeTextureMode
enum class ECompositeTextureMode : uint8_t
{
	CTM_Disabled = 0,
	CTM_NormalRoughnessToRed = 1,
	CTM_NormalRoughnessToGreen = 2,
	CTM_NormalRoughnessToBlue = 3,
	CTM_NormalRoughnessToAlpha = 4,
	CTM_MAX = 5
};

// Object: Enum Engine.ECompositeChannelType
enum class ECompositeChannelType : uint8_t
{
	CCT_None = 0,
	CCT_RG_As_Normalized_Normal = 1,
	CCT_MAX = 2
};

// Object: Enum Engine.TextureAddress
enum class ETextureAddress : uint8_t
{
	TA_Wrap = 0,
	TA_Clamp = 1,
	TA_Mirror = 2,
	TA_MAX = 3
};

// Object: Enum Engine.TextureFilter
enum class ETextureFilter : uint8_t
{
	TF_Nearest = 0,
	TF_Bilinear = 1,
	TF_Trilinear = 2,
	TF_Default = 3,
	TF_MAX = 4
};

// Object: Enum Engine.TextureCompressionSettings
enum class ETextureCompressionSettings : uint8_t
{
	TC_Default = 0,
	TC_Normalmap = 1,
	TC_Masks = 2,
	TC_Grayscale = 3,
	TC_Displacementmap = 4,
	TC_VectorDisplacementmap = 5,
	TC_HDR = 6,
	TC_EditorIcon = 7,
	TC_Alpha = 8,
	TC_DistanceFieldFont = 9,
	TC_HDR_Compressed = 10,
	TC_BC7 = 11,
	TC_HDR_RGBM = 12,
	TC_HDR_RGBM_NoCompressed = 13,
	TC_MAX = 14
};

// Object: Enum Engine.ETextureDownscaleOptions
enum class ETextureDownscaleOptions : uint8_t
{
	Legacy = 0,
	Default = 1,
	Unfiltered = 2,
	SimpleAverage = 3,
	Sharpen0 = 4,
	Sharpen1 = 5,
	Sharpen2 = 6,
	Sharpen3 = 7,
	Sharpen4 = 8,
	Sharpen5 = 9,
	Sharpen6 = 10,
	Sharpen7 = 11,
	Sharpen8 = 12,
	Sharpen9 = 13,
	Sharpen10 = 14,
	ETextureDownscaleOptions_MAX = 15
};

// Object: Enum Engine.ETextureDownSampleAmount
enum class ETextureDownSampleAmount : uint8_t
{
	TDSA_FromTextureGroup = 0,
	TDSA_None = 1,
	TDSA_Low = 2,
	TDSA_Medium = 3,
	TDSA_High = 4,
	TDSA_MAX = 5
};

// Object: Enum Engine.ETextureLossyCompressionAmount
enum class ETextureLossyCompressionAmount : uint8_t
{
	TLCA_Default = 0,
	TLCA_None = 1,
	TLCA_Lowest = 2,
	TLCA_Low = 3,
	TLCA_Medium = 4,
	TLCA_High = 5,
	TLCA_Highest = 6,
	TLCA_MAX = 7
};

// Object: Enum Engine.ETextureMipLoadOptions
enum class ETextureMipLoadOptions : uint8_t
{
	Default = 0,
	AllMips = 1,
	OnlyFirstMip = 2,
	ETextureMipLoadOptions_MAX = 3
};

// Object: Enum Engine.ETextureSamplerFilter
enum class ETextureSamplerFilter : uint8_t
{
	Point = 0,
	Bilinear = 1,
	Trilinear = 2,
	AnisotropicPoint = 3,
	AnisotropicLinear = 4,
	ETextureSamplerFilter_MAX = 5
};

// Object: Enum Engine.ETexturePowerOfTwoSetting
enum class ETexturePowerOfTwoSetting : uint8_t
{
	None = 0,
	PadToPowerOfTwo = 1,
	PadToSquarePowerOfTwo = 2,
	ETexturePowerOfTwoSetting_MAX = 3
};

// Object: Enum Engine.TextureMipGenSettings
enum class ETextureMipGenSettings : uint8_t
{
	TMGS_FromTextureGroup = 0,
	TMGS_SimpleAverage = 1,
	TMGS_Sharpen0 = 2,
	TMGS_Sharpen1 = 3,
	TMGS_Sharpen2 = 4,
	TMGS_Sharpen3 = 5,
	TMGS_Sharpen4 = 6,
	TMGS_Sharpen5 = 7,
	TMGS_Sharpen6 = 8,
	TMGS_Sharpen7 = 9,
	TMGS_Sharpen8 = 10,
	TMGS_Sharpen9 = 11,
	TMGS_Sharpen10 = 12,
	TMGS_NoMipmaps = 13,
	TMGS_LeaveExistingMips = 14,
	TMGS_Blur1 = 15,
	TMGS_Blur2 = 16,
	TMGS_Blur3 = 17,
	TMGS_Blur4 = 18,
	TMGS_Blur5 = 19,
	TMGS_Unfiltered = 20,
	TMGS_MAX = 21
};

// Object: Enum Engine.ETextureAstcPreferCompressor
enum class ETextureAstcPreferCompressor : uint8_t
{
	TAPC_Default = 0,
	TAPC_Arm = 1,
	TAPC_IntelISPC = 2,
	TAPC_MAX = 3
};

// Object: Enum Engine.ETextureAstcCompressionQuality
enum class ETextureAstcCompressionQuality : uint8_t
{
	TCQ_ASTC_Default = 0,
	TCQ_ASTC_4x4 = 1,
	TCQ_ASTC_5x4 = 2,
	TCQ_ASTC_5x5 = 3,
	TCQ_ASTC_6x5 = 4,
	TCQ_ASTC_6x6 = 5,
	TCQ_ASTC_8x5 = 6,
	TCQ_ASTC_8x6 = 7,
	TCQ_ASTC_10x5 = 8,
	TCQ_ASTC_10x6 = 9,
	TCQ_ASTC_8x8 = 10,
	TCQ_ASTC_10x8 = 11,
	TCQ_ASTC_10x10 = 12,
	TCQ_ASTC_12x10 = 13,
	TCQ_ASTC_12x12 = 14,
	TCQ_ASTC_Max = 15
};

// Object: Enum Engine.ETextureRenderTargetFormat
enum class ETextureRenderTargetFormat : uint8_t
{
	RTF_R8 = 0,
	RTF_RG8 = 1,
	RTF_RGBA8 = 2,
	RTF_RGBA8_SRGB = 3,
	RTF_R16f = 4,
	RTF_RG16f = 5,
	RTF_RGBA16f = 6,
	RTF_R32f = 7,
	RTF_RG32f = 8,
	RTF_RGBA32f = 9,
	RTF_RGB10A2 = 10,
	RTF_MAX = 11
};

// Object: Enum Engine.ETimecodeProviderSynchronizationState
enum class ETimecodeProviderSynchronizationState : uint8_t
{
	Closed = 0,
	Error = 1,
	Synchronized = 2,
	Synchronizing = 3,
	ETimecodeProviderSynchronizationState_MAX = 4
};

// Object: Enum Engine.ETimelineDirection
enum class ETimelineDirection : uint8_t
{
	Forward = 0,
	Backward = 1,
	ETimelineDirection_MAX = 2
};

// Object: Enum Engine.ETimelineLengthMode
enum class ETimelineLengthMode : uint8_t
{
	TL_TimelineLength = 0,
	TL_LastKeyFrame = 1,
	TL_MAX = 2
};

// Object: Enum Engine.ETimeStretchCurveMapping
enum class ETimeStretchCurveMapping : uint8_t
{
	T_Original = 0,
	T_TargetMin = 1,
	T_TargetMax = 2,
	MAX = 3
};

// Object: Enum Engine.ETwitterIntegrationDelegate
enum class ETwitterIntegrationDelegate : uint8_t
{
	TID_AuthorizeComplete = 0,
	TID_TweetUIComplete = 1,
	TID_RequestComplete = 2,
	TID_MAX = 3
};

// Object: Enum Engine.ETwitterRequestMethod
enum class ETwitterRequestMethod : uint8_t
{
	TRM_Get = 0,
	TRM_Post = 1,
	TRM_Delete = 2,
	TRM_MAX = 3
};

// Object: Enum Engine.EUserDefinedStructureStatus
enum class EUserDefinedStructureStatus : uint8_t
{
	UDSS_UpToDate = 0,
	UDSS_Dirty = 1,
	UDSS_Error = 2,
	UDSS_Duplicate = 3,
	UDSS_MAX = 4
};

// Object: Enum Engine.EUIScalingRule
enum class EUIScalingRule : uint8_t
{
	ShortestSide = 0,
	LongestSide = 1,
	Horizontal = 2,
	Vertical = 3,
	Custom = 4,
	EUIScalingRule_MAX = 5
};

// Object: Enum Engine.ERenderFocusRule
enum class ERenderFocusRule : uint8_t
{
	Always = 0,
	NonPointer = 1,
	NavigationOnly = 2,
	Never = 3,
	ERenderFocusRule_MAX = 4
};

// Object: Enum Engine.EVectorFieldConstructionOp
enum class EVectorFieldConstructionOp : uint8_t
{
	VFCO_Extrude = 0,
	VFCO_Revolve = 1,
	VFCO_MAX = 2
};

// Object: Enum Engine.EWindSourceType
enum class EWindSourceType : uint8_t
{
	Directional = 0,
	Point = 1,
	EWindSourceType_MAX = 2
};

// Object: Enum Engine.EPSCPoolMethod
enum class EPSCPoolMethod : uint8_t
{
	None = 0,
	AutoRelease = 1,
	ManualRelease = 2,
	ManualRelease_OnComplete = 3,
	FreeInPool = 4,
	EPSCPoolMethod_MAX = 5
};

// Object: Enum Engine.EVolumeLightingMethod
enum class EVolumeLightingMethod : uint8_t
{
	VLM_VolumetricLightmap = 0,
	VLM_SparseVolumeLightingSamples = 1,
	VLM_MAX = 2
};

// Object: Enum Engine.EVisibilityAggressiveness
enum class EVisibilityAggressiveness : uint8_t
{
	VIS_LeastAggressive = 0,
	VIS_ModeratelyAggressive = 1,
	VIS_MostAggressive = 2,
	VIS_Max = 3
};

// Object: Enum Engine.EStaticShadowmapScale
enum class EStaticShadowmapScale : uint8_t
{
	StaticShadowmapScale_Complete = 0,
	StaticShadowmapScale_Half = 1,
	StaticShadowmapScale_Quarter = 2,
	StaticShadowmapScale_Max = 3
};

// Object: ScriptStruct Engine.DistributionLookupTable
// Size: 0x20 (Inherited: 0x0)
struct FDistributionLookupTable
{
	float TimeScale; // 0x0(0x4)
	float TimeBias; // 0x4(0x4)
	struct TArray<float> Values; // 0x8(0x10)
	uint8_t Op; // 0x18(0x1)
	uint8_t EntryCount; // 0x19(0x1)
	uint8_t EntryStride; // 0x1A(0x1)
	uint8_t SubEntryStride; // 0x1B(0x1)
	uint8_t LockFlag; // 0x1C(0x1)
	uint8_t Pad_0x1D[0x3]; // 0x1D(0x3)
};

// Object: ScriptStruct Engine.RawDistribution
// Size: 0x20 (Inherited: 0x0)
struct FRawDistribution
{
	struct FDistributionLookupTable Table; // 0x0(0x20)
};

// Object: ScriptStruct Engine.FloatDistribution
// Size: 0x20 (Inherited: 0x0)
struct FFloatDistribution
{
	struct FDistributionLookupTable Table; // 0x0(0x20)
};

// Object: ScriptStruct Engine.VectorDistribution
// Size: 0x20 (Inherited: 0x0)
struct FVectorDistribution
{
	struct FDistributionLookupTable Table; // 0x0(0x20)
};

// Object: ScriptStruct Engine.Vector4Distribution
// Size: 0x20 (Inherited: 0x0)
struct FVector4Distribution
{
	struct FDistributionLookupTable Table; // 0x0(0x20)
};

// Object: ScriptStruct Engine.FloatRK4SpringInterpolator
// Size: 0x8 (Inherited: 0x0)
struct FFloatRK4SpringInterpolator
{
	float StiffnessConstant; // 0x0(0x4)
	float DampeningRatio; // 0x4(0x4)
};

// Object: ScriptStruct Engine.VectorRK4SpringInterpolator
// Size: 0x8 (Inherited: 0x0)
struct FVectorRK4SpringInterpolator
{
	float StiffnessConstant; // 0x0(0x4)
	float DampeningRatio; // 0x4(0x4)
};

// Object: ScriptStruct Engine.FormatArgumentData
// Size: 0x40 (Inherited: 0x0)
struct FFormatArgumentData
{
	struct FString ArgumentName; // 0x0(0x10)
	EFormatArgumentType ArgumentValueType; // 0x10(0x1)
	uint8_t Pad_0x11[0x7]; // 0x11(0x7)
	struct FText ArgumentValue; // 0x18(0x18)
	int32_t ArgumentValueInt; // 0x30(0x4)
	float ArgumentValueFloat; // 0x34(0x4)
	ETextGender ArgumentValueGender; // 0x38(0x1)
	uint8_t Pad_0x39[0x7]; // 0x39(0x7)
};

// Object: ScriptStruct Engine.ExpressionInput
// Size: 0xC (Inherited: 0x0)
struct FExpressionInput
{
	int32_t OutputIndex; // 0x0(0x4)
	struct FName ExpressionName; // 0x4(0x8)
};

// Object: ScriptStruct Engine.MaterialAttributesInput
// Size: 0x10 (Inherited: 0xC)
struct FMaterialAttributesInput : FExpressionInput
{
	int32_t PropertyConnectedBitmask; // 0xC(0x4)
};

// Object: ScriptStruct Engine.ExpressionOutput
// Size: 0x8 (Inherited: 0x0)
struct FExpressionOutput
{
	struct FName OutputName; // 0x0(0x8)
};

// Object: ScriptStruct Engine.MaterialInput
// Size: 0xC (Inherited: 0x0)
struct FMaterialInput
{
	int32_t OutputIndex; // 0x0(0x4)
	struct FName ExpressionName; // 0x4(0x8)
};

// Object: ScriptStruct Engine.ColorMaterialInput
// Size: 0xC (Inherited: 0xC)
struct FColorMaterialInput : FMaterialInput
{
};

// Object: ScriptStruct Engine.ScalarMaterialInput
// Size: 0xC (Inherited: 0xC)
struct FScalarMaterialInput : FMaterialInput
{
};

// Object: ScriptStruct Engine.ShadingModelMaterialInput
// Size: 0xC (Inherited: 0xC)
struct FShadingModelMaterialInput : FMaterialInput
{
};

// Object: ScriptStruct Engine.VectorMaterialInput
// Size: 0xC (Inherited: 0xC)
struct FVectorMaterialInput : FMaterialInput
{
};

// Object: ScriptStruct Engine.Vector2MaterialInput
// Size: 0xC (Inherited: 0xC)
struct FVector2MaterialInput : FMaterialInput
{
};

// Object: ScriptStruct Engine.TimerHandle
// Size: 0x8 (Inherited: 0x0)
struct FTimerHandle
{
	uint64_t Handle; // 0x0(0x8)
};

// Object: ScriptStruct Engine.Vector_NetQuantize
// Size: 0xC (Inherited: 0xC)
struct FVector_NetQuantize : FVector
{
};

// Object: ScriptStruct Engine.Vector_NetQuantizeNormal
// Size: 0xC (Inherited: 0xC)
struct FVector_NetQuantizeNormal : FVector
{
};

// Object: ScriptStruct Engine.HitResult
// Size: 0x88 (Inherited: 0x0)
struct FHitResult
{
	uint8_t bBlockingHit : 1; // 0x0(0x1), Mask(0x1)
	uint8_t bStartPenetrating : 1; // 0x0(0x1), Mask(0x2)
	uint8_t BitPad_0x0_2 : 6; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	int32_t FaceIndex; // 0x4(0x4)
	float Time; // 0x8(0x4)
	float Distance; // 0xC(0x4)
	struct FVector_NetQuantize Location; // 0x10(0xC)
	struct FVector_NetQuantize ImpactPoint; // 0x1C(0xC)
	struct FVector_NetQuantizeNormal Normal; // 0x28(0xC)
	struct FVector_NetQuantizeNormal ImpactNormal; // 0x34(0xC)
	struct FVector_NetQuantize TraceStart; // 0x40(0xC)
	struct FVector_NetQuantize TraceEnd; // 0x4C(0xC)
	float PenetrationDepth; // 0x58(0x4)
	int32_t Item; // 0x5C(0x4)
	struct TWeakObjectPtr<struct UPhysicalMaterial> PhysMaterial; // 0x60(0x8)
	struct TWeakObjectPtr<struct AActor> Actor; // 0x68(0x8)
	struct TWeakObjectPtr<struct UPrimitiveComponent> Component; // 0x70(0x8)
	struct FName BoneName; // 0x78(0x8)
	struct FName MyBoneName; // 0x80(0x8)
};

// Object: ScriptStruct Engine.BranchingPointNotifyPayload
// Size: 0x20 (Inherited: 0x0)
struct FBranchingPointNotifyPayload
{
	uint8_t Pad_0x0[0x20]; // 0x0(0x20)
};

// Object: ScriptStruct Engine.SimpleMemberReference
// Size: 0x20 (Inherited: 0x0)
struct FSimpleMemberReference
{
	struct UObject* MemberParent; // 0x0(0x8)
	struct FName MemberName; // 0x8(0x8)
	struct FGuid MemberGuid; // 0x10(0x10)
};

// Object: ScriptStruct Engine.TickFunction
// Size: 0x60 (Inherited: 0x0)
struct FTickFunction
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	ETickingGroup TickGroup; // 0x8(0x1)
	ETickingGroup EndTickGroup; // 0x9(0x1)
	uint8_t bTickEvenWhenPaused : 1; // 0xA(0x1), Mask(0x1)
	uint8_t bCanEverTick : 1; // 0xA(0x1), Mask(0x2)
	uint8_t bStartWithTickEnabled : 1; // 0xA(0x1), Mask(0x4)
	uint8_t bAllowTickOnDedicatedServer : 1; // 0xA(0x1), Mask(0x8)
	uint8_t BitPad_0xA_4 : 4; // 0xA(0x1)
	uint8_t bEnableLightweightTick : 1; // 0xB(0x1), Mask(0x1)
	uint8_t BitPad_0xB_1 : 7; // 0xB(0x1)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	float TickInterval; // 0x10(0x4)
	uint8_t Pad_0x14[0xC]; // 0x14(0xC)
	struct UObject* AggregateClass; // 0x20(0x8)
	struct ULevel* OwnerLevel; // 0x28(0x8)
	uint8_t Pad_0x30[0x30]; // 0x30(0x30)
};

// Object: ScriptStruct Engine.ActorComponentTickFunction
// Size: 0x68 (Inherited: 0x60)
struct FActorComponentTickFunction : FTickFunction
{
	uint8_t Pad_0x60[0x8]; // 0x60(0x8)
};

// Object: ScriptStruct Engine.SubtitleCue
// Size: 0x20 (Inherited: 0x0)
struct FSubtitleCue
{
	struct FText Text; // 0x0(0x18)
	float Time; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct Engine.InterpControlPoint
// Size: 0x1C (Inherited: 0x0)
struct FInterpControlPoint
{
	struct FVector PositionControlPoint; // 0x0(0xC)
	uint8_t bPositionIsRelative : 1; // 0xC(0x1), Mask(0x1)
	uint8_t BitPad_0xC_1 : 7; // 0xC(0x1)
	uint8_t Pad_0xD[0xF]; // 0xD(0xF)
};

// Object: ScriptStruct Engine.PlatformInterfaceData
// Size: 0x30 (Inherited: 0x0)
struct FPlatformInterfaceData
{
	struct FName DataName; // 0x0(0x8)
	EPlatformInterfaceDataType Type; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	int32_t IntValue; // 0xC(0x4)
	float FloatValue; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct FString StringValue; // 0x18(0x10)
	struct UObject* ObjectValue; // 0x28(0x8)
};

// Object: ScriptStruct Engine.PlatformInterfaceDelegateResult
// Size: 0x38 (Inherited: 0x0)
struct FPlatformInterfaceDelegateResult
{
	uint8_t bSuccessful : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct FPlatformInterfaceData Data; // 0x8(0x30)
};

// Object: ScriptStruct Engine.DebugFloatHistory
// Size: 0x20 (Inherited: 0x0)
struct FDebugFloatHistory
{
	struct TArray<float> Samples; // 0x0(0x10)
	float MaxSamples; // 0x10(0x4)
	float MinValue; // 0x14(0x4)
	float MaxValue; // 0x18(0x4)
	uint8_t bAutoAdjustMinMax : 1; // 0x1C(0x1), Mask(0x1)
	uint8_t BitPad_0x1C_1 : 7; // 0x1C(0x1)
	uint8_t Pad_0x1D[0x3]; // 0x1D(0x3)
};

// Object: ScriptStruct Engine.LatentActionInfo
// Size: 0x18 (Inherited: 0x0)
struct FLatentActionInfo
{
	int32_t Linkage; // 0x0(0x4)
	int32_t UUID; // 0x4(0x4)
	struct FName ExecutionFunction; // 0x8(0x8)
	struct UObject* CallbackTarget; // 0x10(0x8)
};

// Object: ScriptStruct Engine.WindParametersStruct
// Size: 0x1C (Inherited: 0x0)
struct FWindParametersStruct
{
	struct FVector Direction; // 0x0(0xC)
	float Speed; // 0xC(0x4)
	float SpeedForFX; // 0x10(0x4)
	float MinGustAmt; // 0x14(0x4)
	float MaxGustAmt; // 0x18(0x4)
};

// Object: ScriptStruct Engine.CollisionProfileName
// Size: 0x8 (Inherited: 0x0)
struct FCollisionProfileName
{
	struct FName Name; // 0x0(0x8)
};

// Object: ScriptStruct Engine.GenericStruct
// Size: 0x4 (Inherited: 0x0)
struct FGenericStruct
{
	int32_t Data; // 0x0(0x4)
};

// Object: ScriptStruct Engine.UserActivity
// Size: 0x18 (Inherited: 0x0)
struct FUserActivity
{
	struct FString ActionName; // 0x0(0x10)
	uint8_t Pad_0x10[0x8]; // 0x10(0x8)
};

// Object: ScriptStruct Engine.TableRowBase
// Size: 0x8 (Inherited: 0x0)
struct FTableRowBase
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
};

// Object: ScriptStruct Engine.FastArraySerializerItem
// Size: 0xC (Inherited: 0x0)
struct FFastArraySerializerItem
{
	int32_t ReplicationID; // 0x0(0x4)
	int32_t ReplicationKey; // 0x4(0x4)
	int32_t MostRecentArrayReplicationKey; // 0x8(0x4)
};

// Object: ScriptStruct Engine.CurveTableRowHandle
// Size: 0x10 (Inherited: 0x0)
struct FCurveTableRowHandle
{
	struct UCurveTable* CurveTable; // 0x0(0x8)
	struct FName RowName; // 0x8(0x8)
};

// Object: ScriptStruct Engine.Vector_NetQuantize10
// Size: 0xC (Inherited: 0xC)
struct FVector_NetQuantize10 : FVector
{
};

// Object: ScriptStruct Engine.Vector_NetQuantize100
// Size: 0xC (Inherited: 0xC)
struct FVector_NetQuantize100 : FVector
{
};

// Object: ScriptStruct Engine.FastArraySerializer
// Size: 0x108 (Inherited: 0x0)
struct FFastArraySerializer
{
	uint8_t Pad_0x0[0x54]; // 0x0(0x54)
	int32_t ArrayReplicationKey; // 0x54(0x4)
	uint8_t Pad_0x58[0xA8]; // 0x58(0xA8)
	EFastArraySerializerDeltaFlags DeltaFlags; // 0x100(0x1)
	uint8_t Pad_0x101[0x7]; // 0x101(0x7)
};

// Object: ScriptStruct Engine.RepAttachment
// Size: 0x40 (Inherited: 0x0)
struct FRepAttachment
{
	struct AActor* AttachParent; // 0x0(0x8)
	struct FVector_NetQuantize100 LocationOffset; // 0x8(0xC)
	struct FVector_NetQuantize100 RelativeScale3D; // 0x14(0xC)
	struct FRotator RotationOffset; // 0x20(0xC)
	struct FName AttachSocket; // 0x2C(0x8)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
	struct USceneComponent* AttachComponent; // 0x38(0x8)
};

// Object: ScriptStruct Engine.RepMovement
// Size: 0x38 (Inherited: 0x0)
struct FRepMovement
{
	struct FVector LinearVelocity; // 0x0(0xC)
	struct FVector AngularVelocity; // 0xC(0xC)
	struct FEncVector Location; // 0x18(0x10)
	struct FRotator Rotation; // 0x28(0xC)
	uint8_t bSimulatedPhysicSleep : 1; // 0x34(0x1), Mask(0x1)
	uint8_t bRepPhysics : 1; // 0x34(0x1), Mask(0x2)
	uint8_t BitPad_0x34_2 : 6; // 0x34(0x1)
	EVectorQuantization LocationQuantizationLevel; // 0x35(0x1)
	EVectorQuantization VelocityQuantizationLevel; // 0x36(0x1)
	ERotatorQuantization RotationQuantizationLevel; // 0x37(0x1)
};

// Object: ScriptStruct Engine.ActorTickFunction
// Size: 0x68 (Inherited: 0x60)
struct FActorTickFunction : FTickFunction
{
	uint8_t Pad_0x60[0x8]; // 0x60(0x8)
};

// Object: ScriptStruct Engine.ViewTargetTransitionParams
// Size: 0x10 (Inherited: 0x0)
struct FViewTargetTransitionParams
{
	float BlendTime; // 0x0(0x4)
	EViewTargetBlendFunction BlendFunction; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
	float BlendExp; // 0x8(0x4)
	uint8_t bLockOutgoing : 1; // 0xC(0x1), Mask(0x1)
	uint8_t BitPad_0xC_1 : 7; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
};

// Object: ScriptStruct Engine.RigidBodyState
// Size: 0x40 (Inherited: 0x0)
struct FRigidBodyState
{
	struct FVector_NetQuantize100 Position; // 0x0(0xC)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct FQuat Quaternion; // 0x10(0x10)
	struct FVector_NetQuantize100 LinVel; // 0x20(0xC)
	struct FVector_NetQuantize100 AngVel; // 0x2C(0xC)
	float Timestamp; // 0x38(0x4)
	uint8_t Flags; // 0x3C(0x1)
	uint8_t Pad_0x3D[0x3]; // 0x3D(0x3)
};

// Object: ScriptStruct Engine.DebugDisplayProperty
// Size: 0x20 (Inherited: 0x0)
struct FDebugDisplayProperty
{
	struct UObject* obj; // 0x0(0x8)
	struct UObject* WithinClass; // 0x8(0x8)
	uint8_t Pad_0x10[0x10]; // 0x10(0x10)
};

// Object: ScriptStruct Engine.RootMotionSourceSettings
// Size: 0x1 (Inherited: 0x0)
struct FRootMotionSourceSettings
{
	uint8_t Flags; // 0x0(0x1)
};

// Object: ScriptStruct Engine.RootMotionSourceGroup
// Size: 0xF8 (Inherited: 0x0)
struct FRootMotionSourceGroup
{
	uint8_t Pad_0x0[0xE8]; // 0x0(0xE8)
	uint8_t bHasAdditiveSources : 1; // 0xE8(0x1), Mask(0x1)
	uint8_t bHasOverrideSources : 1; // 0xE8(0x1), Mask(0x2)
	uint8_t bIsAdditiveVelocityApplied : 1; // 0xE8(0x1), Mask(0x4)
	uint8_t BitPad_0xE8_3 : 5; // 0xE8(0x1)
	struct FRootMotionSourceSettings LastAccumulatedSettings; // 0xE9(0x1)
	uint8_t Pad_0xEA[0x2]; // 0xEA(0x2)
	struct FVector_NetQuantize10 LastPreAdditiveVelocity; // 0xEC(0xC)
};

// Object: ScriptStruct Engine.RepRootMotionMontage
// Size: 0x158 (Inherited: 0x0)
struct FRepRootMotionMontage
{
	uint8_t bIsActive : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct UAnimMontage* AnimMontage; // 0x8(0x8)
	float Position; // 0x10(0x4)
	struct FVector_NetQuantize100 Location; // 0x14(0xC)
	struct FRotator Rotation; // 0x20(0xC)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
	struct UPrimitiveComponent* MovementBase; // 0x30(0x8)
	struct FName MovementBaseBoneName; // 0x38(0x8)
	uint8_t bRelativePosition : 1; // 0x40(0x1), Mask(0x1)
	uint8_t BitPad_0x40_1 : 7; // 0x40(0x1)
	uint8_t bRelativeRotation : 1; // 0x41(0x1), Mask(0x1)
	uint8_t BitPad_0x41_1 : 7; // 0x41(0x1)
	uint8_t Pad_0x42[0x6]; // 0x42(0x6)
	struct FRootMotionSourceGroup AuthoritativeRootMotion; // 0x48(0xF8)
	struct FVector_NetQuantize10 Acceleration; // 0x140(0xC)
	struct FVector_NetQuantize10 LinearVelocity; // 0x14C(0xC)
};

// Object: ScriptStruct Engine.SimulatedRootMotionReplicatedMove
// Size: 0x160 (Inherited: 0x0)
struct FSimulatedRootMotionReplicatedMove
{
	float Time; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct FRepRootMotionMontage RootMotion; // 0x8(0x158)
};

// Object: ScriptStruct Engine.RootMotionMovementParams
// Size: 0x40 (Inherited: 0x0)
struct FRootMotionMovementParams
{
	uint8_t bHasRootMotion : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float BlendWeight; // 0x4(0x4)
	uint8_t Pad_0x8[0x8]; // 0x8(0x8)
	struct FTransform RootMotionTransform; // 0x10(0x30)
};

// Object: ScriptStruct Engine.BasedMovementInfo
// Size: 0x30 (Inherited: 0x0)
struct FBasedMovementInfo
{
	struct UPrimitiveComponent* MovementBase; // 0x0(0x8)
	struct FName BoneName; // 0x8(0x8)
	struct FVector_NetQuantize100 Location; // 0x10(0xC)
	struct FRotator Rotation; // 0x1C(0xC)
	uint8_t bServerHasBaseComponent : 1; // 0x28(0x1), Mask(0x1)
	uint8_t BitPad_0x28_1 : 7; // 0x28(0x1)
	uint8_t bRelativeRotation : 1; // 0x29(0x1), Mask(0x1)
	uint8_t BitPad_0x29_1 : 7; // 0x29(0x1)
	uint8_t bServerHasVelocity : 1; // 0x2A(0x1), Mask(0x1)
	uint8_t BitPad_0x2A_1 : 7; // 0x2A(0x1)
	uint8_t Pad_0x2B[0x5]; // 0x2B(0x5)
};

// Object: ScriptStruct Engine.PerPlatformBool
// Size: 0x1 (Inherited: 0x0)
struct FPerPlatformBool
{
	uint8_t Default : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
};

// Object: ScriptStruct Engine.CollisionResponseContainer
// Size: 0x20 (Inherited: 0x0)
struct FCollisionResponseContainer
{
	ECollisionResponse WorldStatic; // 0x0(0x1)
	ECollisionResponse WorldDynamic; // 0x1(0x1)
	ECollisionResponse Pawn; // 0x2(0x1)
	ECollisionResponse Visibility; // 0x3(0x1)
	ECollisionResponse Camera; // 0x4(0x1)
	ECollisionResponse PhysicsBody; // 0x5(0x1)
	ECollisionResponse Vehicle; // 0x6(0x1)
	ECollisionResponse Destructible; // 0x7(0x1)
	ECollisionResponse EngineTraceChannel1; // 0x8(0x1)
	ECollisionResponse EngineTraceChannel2; // 0x9(0x1)
	ECollisionResponse EngineTraceChannel3; // 0xA(0x1)
	ECollisionResponse EngineTraceChannel4; // 0xB(0x1)
	ECollisionResponse EngineTraceChannel5; // 0xC(0x1)
	ECollisionResponse EngineTraceChannel6; // 0xD(0x1)
	ECollisionResponse GameTraceChannel1; // 0xE(0x1)
	ECollisionResponse GameTraceChannel2; // 0xF(0x1)
	ECollisionResponse GameTraceChannel3; // 0x10(0x1)
	ECollisionResponse GameTraceChannel4; // 0x11(0x1)
	ECollisionResponse GameTraceChannel5; // 0x12(0x1)
	ECollisionResponse GameTraceChannel6; // 0x13(0x1)
	ECollisionResponse GameTraceChannel7; // 0x14(0x1)
	ECollisionResponse GameTraceChannel8; // 0x15(0x1)
	ECollisionResponse GameTraceChannel9; // 0x16(0x1)
	ECollisionResponse GameTraceChannel10; // 0x17(0x1)
	ECollisionResponse GameTraceChannel11; // 0x18(0x1)
	ECollisionResponse GameTraceChannel12; // 0x19(0x1)
	ECollisionResponse GameTraceChannel13; // 0x1A(0x1)
	ECollisionResponse GameTraceChannel14; // 0x1B(0x1)
	ECollisionResponse GameTraceChannel15; // 0x1C(0x1)
	ECollisionResponse GameTraceChannel16; // 0x1D(0x1)
	ECollisionResponse GameTraceChannel17; // 0x1E(0x1)
	ECollisionResponse GameTraceChannel18; // 0x1F(0x1)
};

// Object: ScriptStruct Engine.KeyHandleMap
// Size: 0x60 (Inherited: 0x0)
struct FKeyHandleMap
{
	uint8_t Pad_0x0[0x60]; // 0x0(0x60)
};

// Object: ScriptStruct Engine.IndexedCurve
// Size: 0x68 (Inherited: 0x0)
struct FIndexedCurve
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct FKeyHandleMap KeyHandlesToIndices; // 0x8(0x60)
};

// Object: ScriptStruct Engine.RealCurve
// Size: 0x70 (Inherited: 0x68)
struct FRealCurve : FIndexedCurve
{
	float DefaultValue; // 0x68(0x4)
	ERichCurveExtrapolation PreInfinityExtrap; // 0x6C(0x1)
	ERichCurveExtrapolation PostInfinityExtrap; // 0x6D(0x1)
	uint8_t Pad_0x6E[0x2]; // 0x6E(0x2)
};

// Object: ScriptStruct Engine.RichCurve
// Size: 0x98 (Inherited: 0x70)
struct FRichCurve : FRealCurve
{
	struct TArray<struct FRichCurveKey> Keys; // 0x70(0x10)
	struct TArray<int32_t> Orders; // 0x80(0x10)
	uint8_t Pad_0x90[0x8]; // 0x90(0x8)
};

// Object: ScriptStruct Engine.RuntimeFloatCurve
// Size: 0xA0 (Inherited: 0x0)
struct FRuntimeFloatCurve
{
	struct FRichCurve EditorCurveData; // 0x0(0x98)
	struct UCurveFloat* ExternalCurve; // 0x98(0x8)
};

// Object: ScriptStruct Engine.RichCurveKey
// Size: 0x1C (Inherited: 0x0)
struct FRichCurveKey
{
	ERichCurveInterpMode InterpMode; // 0x0(0x1)
	ERichCurveTangentMode TangentMode; // 0x1(0x1)
	ERichCurveTangentWeightMode TangentWeightMode; // 0x2(0x1)
	uint8_t Pad_0x3[0x1]; // 0x3(0x1)
	float Time; // 0x4(0x4)
	float Value; // 0x8(0x4)
	float ArriveTangent; // 0xC(0x4)
	float ArriveTangentWeight; // 0x10(0x4)
	float LeaveTangent; // 0x14(0x4)
	float LeaveTangentWeight; // 0x18(0x4)
};

// Object: ScriptStruct Engine.AnimLinkableElement
// Size: 0x30 (Inherited: 0x0)
struct FAnimLinkableElement
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct UAnimMontage* LinkedMontage; // 0x8(0x8)
	int32_t SlotIndex; // 0x10(0x4)
	int32_t SegmentIndex; // 0x14(0x4)
	EAnimLinkMethod LinkMethod; // 0x18(0x1)
	EAnimLinkMethod CachedLinkMethod; // 0x19(0x1)
	uint8_t Pad_0x1A[0x2]; // 0x1A(0x2)
	float SegmentBeginTime; // 0x1C(0x4)
	float SegmentLength; // 0x20(0x4)
	float LinkValue; // 0x24(0x4)
	struct UAnimSequenceBase* LinkedSequence; // 0x28(0x8)
};

// Object: ScriptStruct Engine.AnimNotifyEvent
// Size: 0xB8 (Inherited: 0x30)
struct FAnimNotifyEvent : FAnimLinkableElement
{
	float DisplayTime; // 0x30(0x4)
	float TriggerTimeOffset; // 0x34(0x4)
	float EndTriggerTimeOffset; // 0x38(0x4)
	float TriggerWeightThreshold; // 0x3C(0x4)
	struct FName NotifyName; // 0x40(0x8)
	struct UAnimNotify* Notify; // 0x48(0x8)
	struct UAnimNotifyState* NotifyStateClass; // 0x50(0x8)
	float Duration; // 0x58(0x4)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
	struct FAnimLinkableElement EndLink; // 0x60(0x30)
	uint8_t bConvertedFromBranchingPoint : 1; // 0x90(0x1), Mask(0x1)
	uint8_t BitPad_0x90_1 : 7; // 0x90(0x1)
	EMontageNotifyTickType MontageTickType; // 0x91(0x1)
	uint8_t Pad_0x92[0x2]; // 0x92(0x2)
	float NotifyTriggerChance; // 0x94(0x4)
	ENotifyFilterType NotifyFilterType; // 0x98(0x1)
	uint8_t Pad_0x99[0x3]; // 0x99(0x3)
	int32_t NotifyFilterLOD; // 0x9C(0x4)
	uint8_t bTriggerOnDedicatedServer : 1; // 0xA0(0x1), Mask(0x1)
	uint8_t BitPad_0xA0_1 : 7; // 0xA0(0x1)
	uint8_t bTriggerOnFollower : 1; // 0xA1(0x1), Mask(0x1)
	uint8_t BitPad_0xA1_1 : 7; // 0xA1(0x1)
	uint8_t Pad_0xA2[0x2]; // 0xA2(0x2)
	int32_t TrackIndex; // 0xA4(0x4)
	uint8_t Pad_0xA8[0x10]; // 0xA8(0x10)
};

// Object: ScriptStruct Engine.AnimNotifyEventReference
// Size: 0x10 (Inherited: 0x0)
struct FAnimNotifyEventReference
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct UObject* NotifySource; // 0x8(0x8)
};

// Object: ScriptStruct Engine.WalkableSlopeOverride
// Size: 0x10 (Inherited: 0x0)
struct FWalkableSlopeOverride
{
	EWalkableSlopeBehavior WalkableSlopeBehavior; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float WalkableSlopeAngle; // 0x4(0x4)
	uint8_t Pad_0x8[0x8]; // 0x8(0x8)
};

// Object: ScriptStruct Engine.TetCachedABC
// Size: 0xB0 (Inherited: 0x0)
struct FTetCachedABC
{
	struct FVector4 SkyABC[0x6]; // 0x0(0x60)
	struct FVector AtfABC[0x6]; // 0x60(0x48)
	uint8_t Pad_0xA8[0x8]; // 0xA8(0x8)
};

// Object: ScriptStruct Engine.CollisionResponse
// Size: 0x30 (Inherited: 0x0)
struct FCollisionResponse
{
	struct FCollisionResponseContainer ResponseToChannels; // 0x0(0x20)
	struct TArray<struct FResponseChannel> ResponseArray; // 0x20(0x10)
};

// Object: ScriptStruct Engine.BodyInstance
// Size: 0x120 (Inherited: 0x0)
struct FBodyInstance
{
	uint8_t Pad_0x0[0x6]; // 0x0(0x6)
	ECollisionChannel ObjectType; // 0x6(0x1)
	uint8_t Pad_0x7[0x1]; // 0x7(0x1)
	ECollisionEnabled CollisionEnabled; // 0x8(0x1)
	uint8_t BindedTraceMaskFilter; // 0x9(0x1)
	uint8_t Pad_0xA[0x1]; // 0xA(0x1)
	ESleepFamily SleepFamily; // 0xB(0x1)
	EDOFMode DOFMode; // 0xC(0x1)
	uint8_t bUseCCD : 1; // 0xD(0x1), Mask(0x1)
	uint8_t bNotifyRigidBodyCollision : 1; // 0xD(0x1), Mask(0x2)
	uint8_t BitPad_0xD_2 : 1; // 0xD(0x1)
	uint8_t bSimulatePhysics : 1; // 0xD(0x1), Mask(0x8)
	uint8_t bOverrideMass : 1; // 0xD(0x1), Mask(0x10)
	uint8_t bEnableGravity : 1; // 0xD(0x1), Mask(0x20)
	uint8_t bAutoWeld : 1; // 0xD(0x1), Mask(0x40)
	uint8_t bStartAwake : 1; // 0xD(0x1), Mask(0x80)
	uint8_t bGenerateWakeEvents : 1; // 0xE(0x1), Mask(0x1)
	uint8_t bUpdateMassWhenScaleChanges : 1; // 0xE(0x1), Mask(0x2)
	uint8_t bLockTranslation : 1; // 0xE(0x1), Mask(0x4)
	uint8_t bLockRotation : 1; // 0xE(0x1), Mask(0x8)
	uint8_t bLockXTranslation : 1; // 0xE(0x1), Mask(0x10)
	uint8_t bLockYTranslation : 1; // 0xE(0x1), Mask(0x20)
	uint8_t bLockZTranslation : 1; // 0xE(0x1), Mask(0x40)
	uint8_t bLockXRotation : 1; // 0xE(0x1), Mask(0x80)
	uint8_t bLockYRotation : 1; // 0xF(0x1), Mask(0x1)
	uint8_t bLockZRotation : 1; // 0xF(0x1), Mask(0x2)
	uint8_t bOverrideMaxAngularVelocity : 1; // 0xF(0x1), Mask(0x4)
	uint8_t BitPad_0xF_3 : 2; // 0xF(0x1)
	uint8_t bOverrideMaxDepenetrationVelocity : 1; // 0xF(0x1), Mask(0x20)
	uint8_t bOverrideWalkableSlopeOnInstance : 1; // 0xF(0x1), Mask(0x40)
	uint8_t bInterpolateWhenSubStepping : 1; // 0xF(0x1), Mask(0x80)
	uint8_t Pad_0x10[0x10]; // 0x10(0x10)
	struct FName CollisionProfileName; // 0x20(0x8)
	uint8_t PositionSolverIterationCount; // 0x28(0x1)
	uint8_t VelocitySolverIterationCount; // 0x29(0x1)
	uint8_t Pad_0x2A[0x6]; // 0x2A(0x6)
	struct FCollisionResponse CollisionResponses; // 0x30(0x30)
	float MaxDepenetrationVelocity; // 0x60(0x4)
	float MassInKgOverride; // 0x64(0x4)
	uint8_t Pad_0x68[0x8]; // 0x68(0x8)
	float LinearDamping; // 0x70(0x4)
	float AngularDamping; // 0x74(0x4)
	struct FVector CustomDOFPlaneNormal; // 0x78(0xC)
	struct FVector COMNudge; // 0x84(0xC)
	float MassScale; // 0x90(0x4)
	struct FVector InertiaTensorScale; // 0x94(0xC)
	uint8_t Pad_0xA0[0x10]; // 0xA0(0x10)
	struct FWalkableSlopeOverride WalkableSlopeOverride; // 0xB0(0x10)
	struct UPhysicalMaterial* PhysMaterialOverride; // 0xC0(0x8)
	float MaxAngularVelocity; // 0xC8(0x4)
	float CustomSleepThresholdMultiplier; // 0xCC(0x4)
	float StabilizationThresholdMultiplier; // 0xD0(0x4)
	float PhysicsBlendWeight; // 0xD4(0x4)
	uint8_t Pad_0xD8[0x48]; // 0xD8(0x48)
};

// Object: ScriptStruct Engine.ResponseChannel
// Size: 0xC (Inherited: 0x0)
struct FResponseChannel
{
	struct FName Channel; // 0x0(0x8)
	ECollisionResponse Response; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
};

// Object: ScriptStruct Engine.CustomPrimitiveData
// Size: 0x10 (Inherited: 0x0)
struct FCustomPrimitiveData
{
	struct TArray<float> Data; // 0x0(0x10)
};

// Object: ScriptStruct Engine.LightingChannels
// Size: 0x1 (Inherited: 0x0)
struct FLightingChannels
{
	uint8_t bChannel0 : 1; // 0x0(0x1), Mask(0x1)
	uint8_t bChannel1 : 1; // 0x0(0x1), Mask(0x2)
	uint8_t bChannel2 : 1; // 0x0(0x1), Mask(0x4)
	uint8_t bChannel3 : 1; // 0x0(0x1), Mask(0x8)
	uint8_t BitPad_0x0_4 : 4; // 0x0(0x1)
};

// Object: ScriptStruct Engine.ActorComponentInstanceData
// Size: 0x58 (Inherited: 0x0)
struct FActorComponentInstanceData
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct UObject* SourceComponentTemplate; // 0x8(0x8)
	EComponentCreationMethod SourceComponentCreationMethod; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	int32_t SourceComponentTypeSerializedIndex; // 0x14(0x4)
	struct TArray<uint8_t> SavedProperties; // 0x18(0x10)
	struct TArray<struct FActorComponentDuplicatedObjectData> DuplicatedObjects; // 0x28(0x10)
	struct TArray<struct UObject*> ReferencedObjects; // 0x38(0x10)
	struct TArray<struct FName> ReferencedNames; // 0x48(0x10)
};

// Object: ScriptStruct Engine.ActorComponentDuplicatedObjectData
// Size: 0x10 (Inherited: 0x0)
struct FActorComponentDuplicatedObjectData
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct Engine.SceneComponentInstanceData
// Size: 0xA8 (Inherited: 0x58)
struct FSceneComponentInstanceData : FActorComponentInstanceData
{
	struct TMap<struct USceneComponent*, struct FTransform> AttachedInstanceComponents; // 0x58(0x50)
};

// Object: ScriptStruct Engine.SplineCurves
// Size: 0x68 (Inherited: 0x0)
struct FSplineCurves
{
	struct FInterpCurveVector Position; // 0x0(0x18)
	struct FInterpCurveQuat Rotation; // 0x18(0x18)
	struct FInterpCurveVector Scale; // 0x30(0x18)
	struct FInterpCurveFloat ReparamTable; // 0x48(0x18)
	struct USplineMetadata* MetaData; // 0x60(0x8)
};

// Object: ScriptStruct Engine.SplineInstanceData
// Size: 0x188 (Inherited: 0xA8)
struct FSplineInstanceData : FSceneComponentInstanceData
{
	uint8_t bSplineHasBeenEdited : 1; // 0xA8(0x1), Mask(0x1)
	uint8_t BitPad_0xA8_1 : 7; // 0xA8(0x1)
	uint8_t Pad_0xA9[0x7]; // 0xA9(0x7)
	struct FSplineCurves SplineCurves; // 0xB0(0x68)
	struct FSplineCurves SplineCurvesPreUCS; // 0x118(0x68)
	uint8_t bClosedLoop : 1; // 0x180(0x1), Mask(0x1)
	uint8_t BitPad_0x180_1 : 7; // 0x180(0x1)
	uint8_t bClosedLoopPreUCS : 1; // 0x181(0x1), Mask(0x1)
	uint8_t BitPad_0x181_1 : 7; // 0x181(0x1)
	uint8_t Pad_0x182[0x6]; // 0x182(0x6)
};

// Object: ScriptStruct Engine.MemberReference
// Size: 0x38 (Inherited: 0x0)
struct FMemberReference
{
	struct UObject* MemberParent; // 0x0(0x8)
	struct FString MemberScope; // 0x8(0x10)
	struct FName MemberName; // 0x18(0x8)
	struct FGuid MemberGuid; // 0x20(0x10)
	uint8_t bSelfContext : 1; // 0x30(0x1), Mask(0x1)
	uint8_t BitPad_0x30_1 : 7; // 0x30(0x1)
	uint8_t bWasDeprecated : 1; // 0x31(0x1), Mask(0x1)
	uint8_t BitPad_0x31_1 : 7; // 0x31(0x1)
	uint8_t Pad_0x32[0x6]; // 0x32(0x6)
};

// Object: ScriptStruct Engine.EdGraphTerminalType
// Size: 0x1C (Inherited: 0x0)
struct FEdGraphTerminalType
{
	struct FName TerminalCategory; // 0x0(0x8)
	struct FName TerminalSubCategory; // 0x8(0x8)
	struct TWeakObjectPtr<struct UObject> TerminalSubCategoryObject; // 0x10(0x8)
	uint8_t bTerminalIsConst : 1; // 0x18(0x1), Mask(0x1)
	uint8_t BitPad_0x18_1 : 7; // 0x18(0x1)
	uint8_t bTerminalIsWeakPointer : 1; // 0x19(0x1), Mask(0x1)
	uint8_t BitPad_0x19_1 : 7; // 0x19(0x1)
	uint8_t Pad_0x1A[0x2]; // 0x1A(0x2)
};

// Object: ScriptStruct Engine.EdGraphPinType
// Size: 0x58 (Inherited: 0x0)
struct FEdGraphPinType
{
	struct FName PinCategory; // 0x0(0x8)
	struct FName PinSubCategory; // 0x8(0x8)
	struct TWeakObjectPtr<struct UObject> PinSubCategoryObject; // 0x10(0x8)
	struct FSimpleMemberReference PinSubCategoryMemberReference; // 0x18(0x20)
	struct FEdGraphTerminalType PinValueType; // 0x38(0x1C)
	EPinContainerType ContainerType; // 0x54(0x1)
	uint8_t bIsArray : 1; // 0x55(0x1), Mask(0x1)
	uint8_t bIsReference : 1; // 0x55(0x1), Mask(0x2)
	uint8_t bIsConst : 1; // 0x55(0x1), Mask(0x4)
	uint8_t bIsWeakPointer : 1; // 0x55(0x1), Mask(0x8)
	uint8_t BitPad_0x55_4 : 4; // 0x55(0x1)
	uint8_t Pad_0x56[0x2]; // 0x56(0x2)
};

// Object: ScriptStruct Engine.StaticParameterSet
// Size: 0x40 (Inherited: 0x0)
struct FStaticParameterSet
{
	struct TArray<struct FStaticSwitchParameter> StaticSwitchParameters; // 0x0(0x10)
	struct TArray<struct FStaticComponentMaskParameter> StaticComponentMaskParameters; // 0x10(0x10)
	struct TArray<struct FStaticTerrainLayerWeightParameter> TerrainLayerWeightParameters; // 0x20(0x10)
	struct TArray<struct FStaticMaterialLayersParameter> MaterialLayersParameters; // 0x30(0x10)
};

// Object: ScriptStruct Engine.MaterialParameterInfo
// Size: 0x10 (Inherited: 0x0)
struct FMaterialParameterInfo
{
	struct FName Name; // 0x0(0x8)
	EMaterialParameterAssociation Association; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	int32_t Index; // 0xC(0x4)
};

// Object: ScriptStruct Engine.StaticParameterBase
// Size: 0x24 (Inherited: 0x0)
struct FStaticParameterBase
{
	struct FMaterialParameterInfo ParameterInfo; // 0x0(0x10)
	uint8_t bOverride : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	struct FGuid ExpressionGUID; // 0x14(0x10)
};

// Object: ScriptStruct Engine.MaterialLayersFunctions
// Size: 0x40 (Inherited: 0x0)
struct FMaterialLayersFunctions
{
	struct TArray<struct UMaterialFunctionInterface*> Layers; // 0x0(0x10)
	struct TArray<struct UMaterialFunctionInterface*> Blends; // 0x10(0x10)
	struct TArray<uint8_t> LayerStates; // 0x20(0x10)
	struct FString KeyString; // 0x30(0x10)
};

// Object: ScriptStruct Engine.StaticMaterialLayersParameter
// Size: 0x68 (Inherited: 0x24)
struct FStaticMaterialLayersParameter : FStaticParameterBase
{
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct FMaterialLayersFunctions Value; // 0x28(0x40)
};

// Object: ScriptStruct Engine.StaticTerrainLayerWeightParameter
// Size: 0x2C (Inherited: 0x24)
struct FStaticTerrainLayerWeightParameter : FStaticParameterBase
{
	int32_t WeightmapIndex; // 0x24(0x4)
	uint8_t bWeightBasedBlend : 1; // 0x28(0x1), Mask(0x1)
	uint8_t BitPad_0x28_1 : 7; // 0x28(0x1)
	uint8_t Pad_0x29[0x3]; // 0x29(0x3)
};

// Object: ScriptStruct Engine.StaticComponentMaskParameter
// Size: 0x28 (Inherited: 0x24)
struct FStaticComponentMaskParameter : FStaticParameterBase
{
	uint8_t R : 1; // 0x24(0x1), Mask(0x1)
	uint8_t BitPad_0x24_1 : 7; // 0x24(0x1)
	uint8_t G : 1; // 0x25(0x1), Mask(0x1)
	uint8_t BitPad_0x25_1 : 7; // 0x25(0x1)
	uint8_t B : 1; // 0x26(0x1), Mask(0x1)
	uint8_t BitPad_0x26_1 : 7; // 0x26(0x1)
	uint8_t A : 1; // 0x27(0x1), Mask(0x1)
	uint8_t BitPad_0x27_1 : 7; // 0x27(0x1)
};

// Object: ScriptStruct Engine.StaticSwitchParameter
// Size: 0x28 (Inherited: 0x24)
struct FStaticSwitchParameter : FStaticParameterBase
{
	uint8_t Value : 1; // 0x24(0x1), Mask(0x1)
	uint8_t BitPad_0x24_1 : 7; // 0x24(0x1)
	uint8_t Pad_0x25[0x3]; // 0x25(0x3)
};

// Object: ScriptStruct Engine.MaterialInstanceBasePropertyOverrides
// Size: 0x28 (Inherited: 0x0)
struct FMaterialInstanceBasePropertyOverrides
{
	uint8_t bOverride_OpacityMaskClipValue : 1; // 0x0(0x1), Mask(0x1)
	uint8_t bOverride_SoftDepthOffsetValue : 1; // 0x0(0x1), Mask(0x2)
	uint8_t bOverride_TranslucentFogDensity : 1; // 0x0(0x1), Mask(0x4)
	uint8_t bOverride_BlendMode : 1; // 0x0(0x1), Mask(0x8)
	uint8_t bOverride_WetnessMode : 1; // 0x0(0x1), Mask(0x10)
	uint8_t bOverride_ShadingRate : 1; // 0x0(0x1), Mask(0x20)
	uint8_t bOverride_ShadingModel : 1; // 0x0(0x1), Mask(0x40)
	uint8_t bOverride_LightingChannelMask : 1; // 0x0(0x1), Mask(0x80)
	uint8_t bOverride_RenderAfterDOF : 1; // 0x1(0x1), Mask(0x1)
	uint8_t bOverride_DitheredLODTransition : 1; // 0x1(0x1), Mask(0x2)
	uint8_t bOverride_CastDynamicShadowAsMasked : 1; // 0x1(0x1), Mask(0x4)
	uint8_t bOverride_TwoSided : 1; // 0x1(0x1), Mask(0x8)
	uint8_t bOverride_DisableDepthTest : 1; // 0x1(0x1), Mask(0x10)
	uint8_t TwoSided : 1; // 0x1(0x1), Mask(0x20)
	uint8_t bDisableDepthTest : 1; // 0x1(0x1), Mask(0x40)
	uint8_t bOverride_UseLandscapeShadowmask : 1; // 0x1(0x1), Mask(0x80)
	uint8_t UseLandscapeShadowmask : 1; // 0x2(0x1), Mask(0x1)
	uint8_t bOverride_UseGBufferCustomDataAlphaSaveDepthOffset : 1; // 0x2(0x1), Mask(0x2)
	uint8_t UseGBufferCustomDataAlphaSaveDepthOffset : 1; // 0x2(0x1), Mask(0x4)
	uint8_t bOverride_UseLandscapeLocalHeightmap : 1; // 0x2(0x1), Mask(0x8)
	uint8_t UseLandscapeLocalHeightmap : 1; // 0x2(0x1), Mask(0x10)
	uint8_t bOverride_TranslucencyRenderLast : 1; // 0x2(0x1), Mask(0x20)
	uint8_t bOverride_OutputsVelocity : 1; // 0x2(0x1), Mask(0x40)
	uint8_t DitheredLODTransition : 1; // 0x2(0x1), Mask(0x80)
	uint8_t bOverride_ToForceFlattenGI : 1; // 0x3(0x1), Mask(0x1)
	uint8_t ToForceFlattenGI : 1; // 0x3(0x1), Mask(0x2)
	uint8_t bOverride_ToForceTranslucentFramePredict : 1; // 0x3(0x1), Mask(0x4)
	uint8_t ToForceTranslucentFramePredict : 1; // 0x3(0x1), Mask(0x8)
	uint8_t bCastDynamicShadowAsMasked : 1; // 0x3(0x1), Mask(0x10)
	uint8_t bOverride_MaterialDeprecated : 1; // 0x3(0x1), Mask(0x20)
	uint8_t bOverride_MaterialDebugModeColorType : 1; // 0x3(0x1), Mask(0x40)
	uint8_t bOverride_EnablePostProcessDifferentMI : 1; // 0x3(0x1), Mask(0x80)
	uint8_t bEnablePostProcessDifferentMI : 1; // 0x4(0x1), Mask(0x1)
	uint8_t bOverride_MiniWorldShadingType : 1; // 0x4(0x1), Mask(0x2)
	uint8_t bMiniWorldShadingType : 1; // 0x4(0x1), Mask(0x4)
	uint8_t bOverride_TranslucencyWriteCustomData : 1; // 0x4(0x1), Mask(0x8)
	uint8_t bTranslucencyWriteCustomData : 1; // 0x4(0x1), Mask(0x10)
	uint8_t bOverride_TranslucencyRenderFullPercentageLast : 1; // 0x4(0x1), Mask(0x20)
	uint8_t bTranslucencyRenderFullPercentageLast : 1; // 0x4(0x1), Mask(0x40)
	uint8_t bOverride_UsedWith3DUI : 1; // 0x4(0x1), Mask(0x80)
	uint8_t bUsedWith3DUI : 1; // 0x5(0x1), Mask(0x1)
	uint8_t bOverride_IsNeedExtraBone : 1; // 0x5(0x1), Mask(0x2)
	uint8_t bIsNeedExtraBone : 1; // 0x5(0x1), Mask(0x4)
	uint8_t bOverride_UsedWithLightMap : 1; // 0x5(0x1), Mask(0x8)
	uint8_t bUsedWithLightMap : 1; // 0x5(0x1), Mask(0x10)
	uint8_t bOverride_MobileMaskPreZRender : 1; // 0x5(0x1), Mask(0x20)
	uint8_t bMobileMaskPreZRender : 1; // 0x5(0x1), Mask(0x40)
	uint8_t bOverride_EnableFoliageBillboardBatch : 1; // 0x5(0x1), Mask(0x80)
	uint8_t bEnableFoliageBillboardBatch : 1; // 0x6(0x1), Mask(0x1)
	uint8_t bOverride_IsBatchedFoliageBillboard : 1; // 0x6(0x1), Mask(0x2)
	uint8_t bIsBatchedFoliageBillboard : 1; // 0x6(0x1), Mask(0x4)
	uint8_t bOverride_IsSimpleEFXLit : 1; // 0x6(0x1), Mask(0x8)
	uint8_t bIsSimpleEFXLit : 1; // 0x6(0x1), Mask(0x10)
	uint8_t bOverride_SimpleEFXLitSubShadingModels : 1; // 0x6(0x1), Mask(0x20)
	uint8_t BitPad_0x6_6 : 2; // 0x6(0x1)
	uint8_t Pad_0x7[0x1]; // 0x7(0x1)
	int32_t SimpleEFXLitSubShadingModels; // 0x8(0x4)
	uint8_t bIsDisableWritingToSceneDepthAux : 1; // 0xC(0x1), Mask(0x1)
	uint8_t bOverride_IsDisableWritingToSceneDepthAux : 1; // 0xC(0x1), Mask(0x2)
	uint8_t bOverride_IsSkippingTetLight : 1; // 0xC(0x1), Mask(0x4)
	uint8_t bIsSkippingTetLight : 1; // 0xC(0x1), Mask(0x8)
	uint8_t BitPad_0xC_4 : 4; // 0xC(0x1)
	EBlendMode BlendMode; // 0xD(0x1)
	EMaterialWetnessMode WetnessMode; // 0xE(0x1)
	EMaterialShadingRate ShadingRate; // 0xF(0x1)
	EMaterialShadingModel ShadingModel; // 0x10(0x1)
	EMaterialLightingChannelMask LightingChannelMask; // 0x11(0x1)
	uint8_t bEnableSeparateTranslucency : 1; // 0x12(0x1), Mask(0x1)
	uint8_t BitPad_0x12_1 : 7; // 0x12(0x1)
	uint8_t Pad_0x13[0x1]; // 0x13(0x1)
	float SoftDepthOffsetValue; // 0x14(0x4)
	float OpacityMaskClipValue; // 0x18(0x4)
	uint32_t MaterialDebugModeColorType; // 0x1C(0x4)
	uint8_t bTranslucencyRenderLast : 1; // 0x20(0x1), Mask(0x1)
	uint8_t bOutputsVelocity : 1; // 0x20(0x1), Mask(0x2)
	uint8_t bMaterialDeprecated : 1; // 0x20(0x1), Mask(0x4)
	uint8_t BitPad_0x20_3 : 5; // 0x20(0x1)
	uint8_t Pad_0x21[0x3]; // 0x21(0x3)
	float TranslucentFogDensity; // 0x24(0x4)
};

// Object: ScriptStruct Engine.TextureMergingInfo
// Size: 0x18 (Inherited: 0x0)
struct FTextureMergingInfo
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct TArray<struct FRegion> Regions; // 0x8(0x10)
};

// Object: ScriptStruct Engine.Region
// Size: 0x30 (Inherited: 0x0)
struct FRegion
{
	struct UTexture2D* Texture; // 0x0(0x8)
	uint8_t Pad_0x8[0x28]; // 0x8(0x28)
};

// Object: ScriptStruct Engine.RuntimeCurveLinearColor
// Size: 0x268 (Inherited: 0x0)
struct FRuntimeCurveLinearColor
{
	struct FRichCurve ColorCurves[0x4]; // 0x0(0x260)
	struct UCurveLinearColor* ExternalCurve; // 0x260(0x8)
};

// Object: ScriptStruct Engine.RuntimeVectorCurve
// Size: 0x1D0 (Inherited: 0x0)
struct FRuntimeVectorCurve
{
	struct FRichCurve VectorCurves[0x3]; // 0x0(0x1C8)
	struct UCurveVector* ExternalCurve; // 0x1C8(0x8)
};

// Object: ScriptStruct Engine.MaterialTextureInfo
// Size: 0x10 (Inherited: 0x0)
struct FMaterialTextureInfo
{
	float SamplingScale; // 0x0(0x4)
	int32_t UVChannelIndex; // 0x4(0x4)
	struct FName TextureName; // 0x8(0x8)
};

// Object: ScriptStruct Engine.VectorParameterValue
// Size: 0x30 (Inherited: 0x0)
struct FVectorParameterValue
{
	struct FMaterialParameterInfo ParameterInfo; // 0x0(0x10)
	struct FLinearColor ParameterValue; // 0x10(0x10)
	struct FGuid ExpressionGUID; // 0x20(0x10)
};

// Object: ScriptStruct Engine.ScalarParameterValue
// Size: 0x24 (Inherited: 0x0)
struct FScalarParameterValue
{
	struct FMaterialParameterInfo ParameterInfo; // 0x0(0x10)
	float ParameterValue; // 0x10(0x4)
	struct FGuid ExpressionGUID; // 0x14(0x10)
};

// Object: ScriptStruct Engine.BroadphaseSettings
// Size: 0x40 (Inherited: 0x0)
struct FBroadphaseSettings
{
	uint8_t bUseMBPOnClient : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bUseMBPOnServer : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t bUseMBPOuterBounds : 1; // 0x2(0x1), Mask(0x1)
	uint8_t BitPad_0x2_1 : 7; // 0x2(0x1)
	uint8_t Pad_0x3[0x1]; // 0x3(0x1)
	struct FBox MBPBounds; // 0x4(0x1C)
	struct FBox MBPOuterBounds; // 0x20(0x1C)
	uint32_t MBPNumSubdivs; // 0x3C(0x4)
};

// Object: ScriptStruct Engine.DirectoryPath
// Size: 0x10 (Inherited: 0x0)
struct FDirectoryPath
{
	struct FString Path; // 0x0(0x10)
};

// Object: ScriptStruct Engine.PredictProjectilePathParams
// Size: 0x60 (Inherited: 0x0)
struct FPredictProjectilePathParams
{
	struct FVector StartLocation; // 0x0(0xC)
	struct FVector LaunchVelocity; // 0xC(0xC)
	uint8_t bTraceWithCollision : 1; // 0x18(0x1), Mask(0x1)
	uint8_t BitPad_0x18_1 : 7; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
	float ProjectileRadius; // 0x1C(0x4)
	float MaxSimTime; // 0x20(0x4)
	uint8_t bTraceWithChannel : 1; // 0x24(0x1), Mask(0x1)
	uint8_t BitPad_0x24_1 : 7; // 0x24(0x1)
	ECollisionChannel TraceChannel; // 0x25(0x1)
	uint8_t Pad_0x26[0x2]; // 0x26(0x2)
	struct TArray<EObjectTypeQuery> ObjectTypes; // 0x28(0x10)
	struct TArray<struct AActor*> ActorsToIgnore; // 0x38(0x10)
	float SimFrequency; // 0x48(0x4)
	float OverrideGravityZ; // 0x4C(0x4)
	EDrawDebugTrace DrawDebugType; // 0x50(0x1)
	uint8_t Pad_0x51[0x3]; // 0x51(0x3)
	float DrawDebugTime; // 0x54(0x4)
	uint8_t bTraceComplex : 1; // 0x58(0x1), Mask(0x1)
	uint8_t BitPad_0x58_1 : 7; // 0x58(0x1)
	uint8_t Pad_0x59[0x7]; // 0x59(0x7)
};

// Object: ScriptStruct Engine.FilePath
// Size: 0x10 (Inherited: 0x0)
struct FFilePath
{
	struct FString FilePath; // 0x0(0x10)
};

// Object: ScriptStruct Engine.ParticleSysParam
// Size: 0x80 (Inherited: 0x0)
struct FParticleSysParam
{
	struct FName Name; // 0x0(0x8)
	EParticleSysParamType ParamType; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	float Scalar; // 0xC(0x4)
	float Scalar_Low; // 0x10(0x4)
	struct FVector Vector; // 0x14(0xC)
	struct FVector Vector_Low; // 0x20(0xC)
	struct FColor Color; // 0x2C(0x4)
	struct AActor* Actor; // 0x30(0x8)
	struct UMaterialInterface* Material; // 0x38(0x8)
	uint8_t Pad_0x40[0x40]; // 0x40(0x40)
};

// Object: ScriptStruct Engine.AnimNode_Base
// Size: 0x48 (Inherited: 0x0)
struct FAnimNode_Base
{
	uint8_t Pad_0x0[0x48]; // 0x0(0x48)
};

// Object: ScriptStruct Engine.InputRange
// Size: 0x8 (Inherited: 0x0)
struct FInputRange
{
	float Min; // 0x0(0x4)
	float Max; // 0x4(0x4)
};

// Object: ScriptStruct Engine.InputScaleBiasClamp
// Size: 0x30 (Inherited: 0x0)
struct FInputScaleBiasClamp
{
	uint8_t bMapRange : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bClampResult : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t bInterpResult : 1; // 0x2(0x1), Mask(0x1)
	uint8_t BitPad_0x2_1 : 7; // 0x2(0x1)
	uint8_t Pad_0x3[0x1]; // 0x3(0x1)
	struct FInputRange InRange; // 0x4(0x8)
	struct FInputRange OutRange; // 0xC(0x8)
	float Scale; // 0x14(0x4)
	float Bias; // 0x18(0x4)
	float ClampMin; // 0x1C(0x4)
	float ClampMax; // 0x20(0x4)
	float InterpSpeedIncreasing; // 0x24(0x4)
	float InterpSpeedDecreasing; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct Engine.AlphaBlend
// Size: 0x30 (Inherited: 0x0)
struct FAlphaBlend
{
	struct UCurveFloat* CustomCurve; // 0x0(0x8)
	float BlendTime; // 0x8(0x4)
	uint8_t Pad_0xC[0x18]; // 0xC(0x18)
	EAlphaBlendOption BlendOption; // 0x24(0x1)
	uint8_t Pad_0x25[0xB]; // 0x25(0xB)
};

// Object: ScriptStruct Engine.InputAlphaBoolBlend
// Size: 0x48 (Inherited: 0x0)
struct FInputAlphaBoolBlend
{
	float BlendInTime; // 0x0(0x4)
	float BlendOutTime; // 0x4(0x4)
	EAlphaBlendOption BlendOption; // 0x8(0x1)
	uint8_t bInitialized : 1; // 0x9(0x1), Mask(0x1)
	uint8_t BitPad_0x9_1 : 7; // 0x9(0x1)
	uint8_t Pad_0xA[0x6]; // 0xA(0x6)
	struct UCurveFloat* CustomCurve; // 0x10(0x8)
	struct FAlphaBlend AlphaBlend; // 0x18(0x30)
};

// Object: ScriptStruct Engine.InputScaleBias
// Size: 0x8 (Inherited: 0x0)
struct FInputScaleBias
{
	float Scale; // 0x0(0x4)
	float Bias; // 0x4(0x4)
};

// Object: ScriptStruct Engine.PoseLinkBase
// Size: 0x18 (Inherited: 0x0)
struct FPoseLinkBase
{
	int32_t LinkID; // 0x0(0x4)
	uint8_t Pad_0x4[0x14]; // 0x4(0x14)
};

// Object: ScriptStruct Engine.ComponentSpacePoseLink
// Size: 0x18 (Inherited: 0x18)
struct FComponentSpacePoseLink : FPoseLinkBase
{
};

// Object: ScriptStruct Engine.BoneReference
// Size: 0x10 (Inherited: 0x0)
struct FBoneReference
{
	struct FName BoneName; // 0x0(0x8)
	uint8_t Pad_0x8[0x8]; // 0x8(0x8)
};

// Object: ScriptStruct Engine.UniqueNetIdRepl
// Size: 0x28 (Inherited: 0x1)
struct FUniqueNetIdRepl : FUniqueNetIdWrapper
{
	uint8_t Pad_0x1[0x17]; // 0x1(0x17)
	struct TArray<uint8_t> ReplicationBytes; // 0x18(0x10)
};

// Object: ScriptStruct Engine.PoseLink
// Size: 0x18 (Inherited: 0x18)
struct FPoseLink : FPoseLinkBase
{
};

// Object: ScriptStruct Engine.PerBoneBlendWeight
// Size: 0x8 (Inherited: 0x0)
struct FPerBoneBlendWeight
{
	int32_t SourceIndex; // 0x0(0x4)
	float BlendWeight; // 0x4(0x4)
};

// Object: ScriptStruct Engine.InputBlendPose
// Size: 0x10 (Inherited: 0x0)
struct FInputBlendPose
{
	struct TArray<struct FBranchFilter> BranchFilters; // 0x0(0x10)
};

// Object: ScriptStruct Engine.BranchFilter
// Size: 0xC (Inherited: 0x0)
struct FBranchFilter
{
	struct FName BoneName; // 0x0(0x8)
	int32_t BlendDepth; // 0x8(0x4)
};

// Object: ScriptStruct Engine.AnimNode_AssetPlayerBase
// Size: 0x68 (Inherited: 0x48)
struct FAnimNode_AssetPlayerBase : FAnimNode_Base
{
	int32_t GroupIndex; // 0x48(0x4)
	EAnimGroupRole GroupRole; // 0x4C(0x1)
	uint8_t bIgnoreForRelevancyTest : 1; // 0x4D(0x1), Mask(0x1)
	uint8_t BitPad_0x4D_1 : 7; // 0x4D(0x1)
	uint8_t Pad_0x4E[0x2]; // 0x4E(0x2)
	float BlendWeight; // 0x50(0x4)
	float InternalTimeAccumulator; // 0x54(0x4)
	uint8_t Pad_0x58[0x10]; // 0x58(0x10)
};

// Object: ScriptStruct Engine.AnimNode_SequencePlayer
// Size: 0x108 (Inherited: 0x68)
struct FAnimNode_SequencePlayer : FAnimNode_AssetPlayerBase
{
	struct UAnimSequenceBase* Sequence; // 0x68(0x8)
	float PlayRateBasis; // 0x70(0x4)
	float PlayRate; // 0x74(0x4)
	uint8_t bUseCachePose : 1; // 0x78(0x1), Mask(0x1)
	uint8_t BitPad_0x78_1 : 7; // 0x78(0x1)
	uint8_t Pad_0x79[0x3]; // 0x79(0x3)
	int32_t UseRawPoseLODThreshold; // 0x7C(0x4)
	struct FInputScaleBiasClamp PlayRateScaleBiasClamp; // 0x80(0x30)
	float StartPosition; // 0xB0(0x4)
	uint8_t bLoopAnimation : 1; // 0xB4(0x1), Mask(0x1)
	uint8_t BitPad_0xB4_1 : 7; // 0xB4(0x1)
	uint8_t Pad_0xB5[0x3]; // 0xB5(0x3)
	struct FName AssetMapKey; // 0xB8(0x8)
	struct UAnimSequenceBase* PreviousSequence; // 0xC0(0x8)
	uint8_t Pad_0xC8[0x40]; // 0xC8(0x40)
};

// Object: ScriptStruct Engine.AnimInstanceProxy
// Size: 0x7A0 (Inherited: 0x0)
struct FAnimInstanceProxy
{
	uint8_t Pad_0x0[0xB8]; // 0x0(0xB8)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0xB8(0x8)
	uint8_t Pad_0xC0[0x6E0]; // 0xC0(0x6E0)
};

// Object: ScriptStruct Engine.SmartName
// Size: 0xC (Inherited: 0x0)
struct FSmartName
{
	struct FName DisplayName; // 0x0(0x8)
	uint8_t Pad_0x8[0x4]; // 0x8(0x4)
};

// Object: ScriptStruct Engine.AnimCurveBase
// Size: 0x18 (Inherited: 0x0)
struct FAnimCurveBase
{
	struct FName LastObservedName; // 0x0(0x8)
	struct FSmartName Name; // 0x8(0xC)
	int32_t CurveTypeFlags; // 0x14(0x4)
};

// Object: ScriptStruct Engine.FloatCurve
// Size: 0xB0 (Inherited: 0x18)
struct FFloatCurve : FAnimCurveBase
{
	struct FRichCurve FloatCurve; // 0x18(0x98)
};

// Object: ScriptStruct Engine.PoseSnapshot
// Size: 0x38 (Inherited: 0x0)
struct FPoseSnapshot
{
	struct TArray<struct FTransform> LocalTransforms; // 0x0(0x10)
	struct TArray<struct FName> BoneNames; // 0x10(0x10)
	struct FName SkeletalMeshName; // 0x20(0x8)
	struct FName SnapshotName; // 0x28(0x8)
	uint8_t bIsValid : 1; // 0x30(0x1), Mask(0x1)
	uint8_t BitPad_0x30_1 : 7; // 0x30(0x1)
	uint8_t Pad_0x31[0x7]; // 0x31(0x7)
};

// Object: ScriptStruct Engine.DataTableRowHandle
// Size: 0x10 (Inherited: 0x0)
struct FDataTableRowHandle
{
	struct UDataTable* DataTable; // 0x0(0x8)
	struct FName RowName; // 0x8(0x8)
};

// Object: ScriptStruct Engine.NavAvoidanceMask
// Size: 0x4 (Inherited: 0x0)
struct FNavAvoidanceMask
{
	uint8_t bGroup0 : 1; // 0x0(0x1), Mask(0x1)
	uint8_t bGroup1 : 1; // 0x0(0x1), Mask(0x2)
	uint8_t bGroup2 : 1; // 0x0(0x1), Mask(0x4)
	uint8_t bGroup3 : 1; // 0x0(0x1), Mask(0x8)
	uint8_t bGroup4 : 1; // 0x0(0x1), Mask(0x10)
	uint8_t bGroup5 : 1; // 0x0(0x1), Mask(0x20)
	uint8_t bGroup6 : 1; // 0x0(0x1), Mask(0x40)
	uint8_t bGroup7 : 1; // 0x0(0x1), Mask(0x80)
	uint8_t bGroup8 : 1; // 0x1(0x1), Mask(0x1)
	uint8_t bGroup9 : 1; // 0x1(0x1), Mask(0x2)
	uint8_t bGroup10 : 1; // 0x1(0x1), Mask(0x4)
	uint8_t bGroup11 : 1; // 0x1(0x1), Mask(0x8)
	uint8_t bGroup12 : 1; // 0x1(0x1), Mask(0x10)
	uint8_t bGroup13 : 1; // 0x1(0x1), Mask(0x20)
	uint8_t bGroup14 : 1; // 0x1(0x1), Mask(0x40)
	uint8_t bGroup15 : 1; // 0x1(0x1), Mask(0x80)
	uint8_t bGroup16 : 1; // 0x2(0x1), Mask(0x1)
	uint8_t bGroup17 : 1; // 0x2(0x1), Mask(0x2)
	uint8_t bGroup18 : 1; // 0x2(0x1), Mask(0x4)
	uint8_t bGroup19 : 1; // 0x2(0x1), Mask(0x8)
	uint8_t bGroup20 : 1; // 0x2(0x1), Mask(0x10)
	uint8_t bGroup21 : 1; // 0x2(0x1), Mask(0x20)
	uint8_t bGroup22 : 1; // 0x2(0x1), Mask(0x40)
	uint8_t bGroup23 : 1; // 0x2(0x1), Mask(0x80)
	uint8_t bGroup24 : 1; // 0x3(0x1), Mask(0x1)
	uint8_t bGroup25 : 1; // 0x3(0x1), Mask(0x2)
	uint8_t bGroup26 : 1; // 0x3(0x1), Mask(0x4)
	uint8_t bGroup27 : 1; // 0x3(0x1), Mask(0x8)
	uint8_t bGroup28 : 1; // 0x3(0x1), Mask(0x10)
	uint8_t bGroup29 : 1; // 0x3(0x1), Mask(0x20)
	uint8_t bGroup30 : 1; // 0x3(0x1), Mask(0x40)
	uint8_t bGroup31 : 1; // 0x3(0x1), Mask(0x80)
};

// Object: ScriptStruct Engine.PerPlatformInt
// Size: 0x4 (Inherited: 0x0)
struct FPerPlatformInt
{
	int32_t Default; // 0x0(0x4)
};

// Object: ScriptStruct Engine.PerPlatformFloat
// Size: 0x4 (Inherited: 0x0)
struct FPerPlatformFloat
{
	float Default; // 0x0(0x4)
};

// Object: ScriptStruct Engine.KeyHandleLookupTable
// Size: 0x60 (Inherited: 0x0)
struct FKeyHandleLookupTable
{
	uint8_t Pad_0x0[0x60]; // 0x0(0x60)
};

// Object: ScriptStruct Engine.AnimNode_Root
// Size: 0x70 (Inherited: 0x48)
struct FAnimNode_Root : FAnimNode_Base
{
	struct FPoseLink Result; // 0x48(0x18)
	struct FName Name; // 0x60(0x8)
	struct FName Group; // 0x68(0x8)
};

// Object: ScriptStruct Engine.AnimCurveParam
// Size: 0xC (Inherited: 0x0)
struct FAnimCurveParam
{
	struct FName Name; // 0x0(0x8)
	uint8_t Pad_0x8[0x4]; // 0x8(0x4)
};

// Object: ScriptStruct Engine.ObjectPool
// Size: 0x40 (Inherited: 0x0)
struct FObjectPool
{
	uint8_t Pad_0x0[0x40]; // 0x0(0x40)
};

// Object: ScriptStruct Engine.ActorObjectPool
// Size: 0x40 (Inherited: 0x40)
struct FActorObjectPool : FObjectPool
{
	uint8_t ReinitializeInstances : 1; // 0x3C(0x1), Mask(0x1)
	uint8_t InstantiateOnDemand : 1; // 0x3D(0x1), Mask(0x1)
	uint8_t KeepOrphanActorsAlive : 1; // 0x3E(0x1), Mask(0x1)
};

// Object: ScriptStruct Engine.KAggregateGeom
// Size: 0x58 (Inherited: 0x0)
struct FKAggregateGeom
{
	struct TArray<struct FKSphereElem> SphereElems; // 0x0(0x10)
	struct TArray<struct FKBoxElem> BoxElems; // 0x10(0x10)
	struct TArray<struct FKSphylElem> SphylElems; // 0x20(0x10)
	struct TArray<struct FKConvexElem> ConvexElems; // 0x30(0x10)
	struct TArray<struct FKTaperedCapsuleElem> TaperedCapsuleElems; // 0x40(0x10)
	uint8_t Pad_0x50[0x8]; // 0x50(0x8)
};

// Object: ScriptStruct Engine.KShapeElem
// Size: 0x30 (Inherited: 0x0)
struct FKShapeElem
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	float RestOffset; // 0x8(0x4)
	struct FName Name; // 0xC(0x8)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	uint8_t bContributeToMass : 1; // 0x18(0x1), Mask(0x1)
	uint8_t BitPad_0x18_1 : 7; // 0x18(0x1)
	uint8_t Pad_0x19[0x17]; // 0x19(0x17)
};

// Object: ScriptStruct Engine.KTaperedCapsuleElem
// Size: 0x58 (Inherited: 0x30)
struct FKTaperedCapsuleElem : FKShapeElem
{
	struct FVector Center; // 0x30(0xC)
	struct FRotator Rotation; // 0x3C(0xC)
	float Radius0; // 0x48(0x4)
	float Radius1; // 0x4C(0x4)
	float Length; // 0x50(0x4)
	uint8_t Pad_0x54[0x4]; // 0x54(0x4)
};

// Object: ScriptStruct Engine.KConvexElem
// Size: 0xB0 (Inherited: 0x30)
struct FKConvexElem : FKShapeElem
{
	struct TArray<struct FVector> VertexData; // 0x30(0x10)
	struct TArray<int32_t> IndexData; // 0x40(0x10)
	struct FBox ElemBox; // 0x50(0x1C)
	uint8_t Pad_0x6C[0x4]; // 0x6C(0x4)
	struct FTransform Transform; // 0x70(0x30)
	uint8_t Pad_0xA0[0x10]; // 0xA0(0x10)
};

// Object: ScriptStruct Engine.KSphylElem
// Size: 0x50 (Inherited: 0x30)
struct FKSphylElem : FKShapeElem
{
	struct FVector Center; // 0x30(0xC)
	struct FRotator Rotation; // 0x3C(0xC)
	float radius; // 0x48(0x4)
	float Length; // 0x4C(0x4)
};

// Object: ScriptStruct Engine.KBoxElem
// Size: 0x58 (Inherited: 0x30)
struct FKBoxElem : FKShapeElem
{
	struct FVector Center; // 0x30(0xC)
	struct FRotator Rotation; // 0x3C(0xC)
	float X; // 0x48(0x4)
	float Y; // 0x4C(0x4)
	float Z; // 0x50(0x4)
	uint8_t Pad_0x54[0x4]; // 0x54(0x4)
};

// Object: ScriptStruct Engine.KSphereElem
// Size: 0x40 (Inherited: 0x30)
struct FKSphereElem : FKShapeElem
{
	struct FVector Center; // 0x30(0xC)
	float radius; // 0x3C(0x4)
};

// Object: ScriptStruct Engine.AnimationGroupReference
// Size: 0xC (Inherited: 0x0)
struct FAnimationGroupReference
{
	struct FName GroupName; // 0x0(0x8)
	EAnimGroupRole GroupRole; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
};

// Object: ScriptStruct Engine.AnimGroupInstance
// Size: 0x70 (Inherited: 0x0)
struct FAnimGroupInstance
{
	uint8_t Pad_0x0[0x70]; // 0x0(0x70)
};

// Object: ScriptStruct Engine.AnimTickRecord
// Size: 0x48 (Inherited: 0x0)
struct FAnimTickRecord
{
	struct UAnimationAsset* SourceAsset; // 0x0(0x8)
	uint8_t Pad_0x8[0x40]; // 0x8(0x40)
};

// Object: ScriptStruct Engine.MarkerSyncAnimPosition
// Size: 0x14 (Inherited: 0x0)
struct FMarkerSyncAnimPosition
{
	struct FName PreviousMarkerName; // 0x0(0x8)
	struct FName NextMarkerName; // 0x8(0x8)
	float PositionBetweenMarkers; // 0x10(0x4)
};

// Object: ScriptStruct Engine.BlendFilter
// Size: 0x78 (Inherited: 0x0)
struct FBlendFilter
{
	uint8_t Pad_0x0[0x78]; // 0x0(0x78)
};

// Object: ScriptStruct Engine.BlendSampleData
// Size: 0x40 (Inherited: 0x0)
struct FBlendSampleData
{
	int32_t SampleDataIndex; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct UAnimSequence* Animation; // 0x8(0x8)
	float TotalWeight; // 0x10(0x4)
	float Time; // 0x14(0x4)
	float PreviousTime; // 0x18(0x4)
	float SamplePlayRate; // 0x1C(0x4)
	uint8_t Pad_0x20[0x20]; // 0x20(0x20)
};

// Object: ScriptStruct Engine.AnimationSampleResult
// Size: 0x38 (Inherited: 0x0)
struct FAnimationSampleResult
{
	uint8_t Pad_0x0[0x38]; // 0x0(0x38)
};

// Object: ScriptStruct Engine.AnimationSampleParams
// Size: 0x160 (Inherited: 0x0)
struct FAnimationSampleParams
{
	uint8_t Pad_0x0[0x160]; // 0x0(0x160)
};

// Object: ScriptStruct Engine.AnimationRecordingSettings
// Size: 0x10 (Inherited: 0x0)
struct FAnimationRecordingSettings
{
	uint8_t bRecordInWorldSpace : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bRemoveRootAnimation : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t bAutoSaveAsset : 1; // 0x2(0x1), Mask(0x1)
	uint8_t BitPad_0x2_1 : 7; // 0x2(0x1)
	uint8_t Pad_0x3[0x1]; // 0x3(0x1)
	float SampleRate; // 0x4(0x4)
	float Length; // 0x8(0x4)
	ERichCurveInterpMode InterpMode; // 0xC(0x1)
	ERichCurveTangentMode TangentMode; // 0xD(0x1)
	uint8_t Pad_0xE[0x2]; // 0xE(0x2)
};

// Object: ScriptStruct Engine.ComponentSpacePose
// Size: 0x20 (Inherited: 0x0)
struct FComponentSpacePose
{
	struct TArray<struct FTransform> Transforms; // 0x0(0x10)
	struct TArray<struct FName> names; // 0x10(0x10)
};

// Object: ScriptStruct Engine.LocalSpacePose
// Size: 0x20 (Inherited: 0x0)
struct FLocalSpacePose
{
	struct TArray<struct FTransform> Transforms; // 0x0(0x10)
	struct TArray<struct FName> names; // 0x10(0x10)
};

// Object: ScriptStruct Engine.NamedTransform
// Size: 0x40 (Inherited: 0x0)
struct FNamedTransform
{
	struct FTransform Value; // 0x0(0x30)
	struct FName Name; // 0x30(0x8)
	uint8_t Pad_0x38[0x8]; // 0x38(0x8)
};

// Object: ScriptStruct Engine.NamedColor
// Size: 0xC (Inherited: 0x0)
struct FNamedColor
{
	struct FColor Value; // 0x0(0x4)
	struct FName Name; // 0x4(0x8)
};

// Object: ScriptStruct Engine.NamedVector
// Size: 0x14 (Inherited: 0x0)
struct FNamedVector
{
	struct FVector Value; // 0x0(0xC)
	struct FName Name; // 0xC(0x8)
};

// Object: ScriptStruct Engine.NamedFloat
// Size: 0xC (Inherited: 0x0)
struct FNamedFloat
{
	float Value; // 0x0(0x4)
	struct FName Name; // 0x4(0x8)
};

// Object: ScriptStruct Engine.AnimParentNodeAssetOverride
// Size: 0x18 (Inherited: 0x0)
struct FAnimParentNodeAssetOverride
{
	struct UAnimationAsset* NewAsset; // 0x0(0x8)
	struct FGuid ParentNodeGuid; // 0x8(0x10)
};

// Object: ScriptStruct Engine.AnimGroupInfo
// Size: 0x18 (Inherited: 0x0)
struct FAnimGroupInfo
{
	struct FName Name; // 0x0(0x8)
	struct FLinearColor Color; // 0x8(0x10)
};

// Object: ScriptStruct Engine.AnimBlueprintDebugData
// Size: 0x1 (Inherited: 0x0)
struct FAnimBlueprintDebugData
{
	uint8_t Pad_0x0[0x1]; // 0x0(0x1)
};

// Object: ScriptStruct Engine.AnimationFrameSnapshot
// Size: 0x1 (Inherited: 0x0)
struct FAnimationFrameSnapshot
{
	uint8_t Pad_0x0[0x1]; // 0x0(0x1)
};

// Object: ScriptStruct Engine.StateMachineDebugData
// Size: 0xB0 (Inherited: 0x0)
struct FStateMachineDebugData
{
	uint8_t Pad_0x0[0xB0]; // 0x0(0xB0)
};

// Object: ScriptStruct Engine.StateMachineStateDebugData
// Size: 0x10 (Inherited: 0x0)
struct FStateMachineStateDebugData
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct Engine.AnimGraphBlendOptions
// Size: 0x8 (Inherited: 0x0)
struct FAnimGraphBlendOptions
{
	float BlendInTime; // 0x0(0x4)
	float BlendOutTime; // 0x4(0x4)
};

// Object: ScriptStruct Engine.GraphAssetPlayerInformation
// Size: 0x10 (Inherited: 0x0)
struct FGraphAssetPlayerInformation
{
	struct TArray<int32_t> PlayerNodeIndices; // 0x0(0x10)
};

// Object: ScriptStruct Engine.CachedPoseIndices
// Size: 0x10 (Inherited: 0x0)
struct FCachedPoseIndices
{
	struct TArray<int32_t> OrderedSavedPoseNodeIndices; // 0x0(0x10)
};

// Object: ScriptStruct Engine.AnimBlueprintFunction
// Size: 0x68 (Inherited: 0x0)
struct FAnimBlueprintFunction
{
	struct FName Name; // 0x0(0x8)
	struct FName Group; // 0x8(0x8)
	int32_t OutputPoseNodeIndex; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct TArray<struct FName> InputPoseNames; // 0x18(0x10)
	struct TArray<int32_t> InputPoseNodeIndices; // 0x28(0x10)
	uint8_t Pad_0x38[0x28]; // 0x38(0x28)
	uint8_t bImplemented : 1; // 0x60(0x1), Mask(0x1)
	uint8_t BitPad_0x60_1 : 7; // 0x60(0x1)
	uint8_t Pad_0x61[0x7]; // 0x61(0x7)
};

// Object: ScriptStruct Engine.AnimTrack
// Size: 0x10 (Inherited: 0x0)
struct FAnimTrack
{
	struct TArray<struct FAnimSegment> AnimSegments; // 0x0(0x10)
};

// Object: ScriptStruct Engine.AnimSegment
// Size: 0x20 (Inherited: 0x0)
struct FAnimSegment
{
	struct UAnimSequenceBase* AnimReference; // 0x0(0x8)
	float StartPos; // 0x8(0x4)
	float AnimStartTime; // 0xC(0x4)
	float AnimEndTime; // 0x10(0x4)
	float AnimPlayRate; // 0x14(0x4)
	int32_t LoopingCount; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct Engine.RootMotionExtractionStep
// Size: 0x10 (Inherited: 0x0)
struct FRootMotionExtractionStep
{
	struct UAnimSequence* AnimSequence; // 0x0(0x8)
	float StartPosition; // 0x8(0x4)
	float EndPosition; // 0xC(0x4)
};

// Object: ScriptStruct Engine.AnimationErrorStats
// Size: 0x10 (Inherited: 0x0)
struct FAnimationErrorStats
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct Engine.RawCurveTracks
// Size: 0x10 (Inherited: 0x0)
struct FRawCurveTracks
{
	struct TArray<struct FFloatCurve> FloatCurves; // 0x0(0x10)
};

// Object: ScriptStruct Engine.VectorCurve
// Size: 0x1E0 (Inherited: 0x18)
struct FVectorCurve : FAnimCurveBase
{
	struct FRichCurve FloatCurves[0x3]; // 0x18(0x1C8)
};

// Object: ScriptStruct Engine.TransformCurve
// Size: 0x5B8 (Inherited: 0x18)
struct FTransformCurve : FAnimCurveBase
{
	struct FVectorCurve TranslationCurve; // 0x18(0x1E0)
	struct FVectorCurve RotationCurve; // 0x1F8(0x1E0)
	struct FVectorCurve ScaleCurve; // 0x3D8(0x1E0)
};

// Object: ScriptStruct Engine.SlotEvaluationPose
// Size: 0x40 (Inherited: 0x0)
struct FSlotEvaluationPose
{
	EAdditiveAnimationType AdditiveType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float Weight; // 0x4(0x4)
	uint8_t Pad_0x8[0x38]; // 0x8(0x38)
};

// Object: ScriptStruct Engine.A2Pose
// Size: 0x10 (Inherited: 0x0)
struct FA2Pose
{
	struct TArray<struct FTransform> Bones; // 0x0(0x10)
};

// Object: ScriptStruct Engine.A2CSPose
// Size: 0x28 (Inherited: 0x10)
struct FA2CSPose : FA2Pose
{
	uint8_t Pad_0x10[0x8]; // 0x10(0x8)
	struct TArray<uint8_t> ComponentSpaceFlags; // 0x18(0x10)
};

// Object: ScriptStruct Engine.QueuedDrawDebugItem
// Size: 0x68 (Inherited: 0x0)
struct FQueuedDrawDebugItem
{
	EDrawDebugItemType ItemType; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct FVector StartLoc; // 0x4(0xC)
	struct FVector EndLoc; // 0x10(0xC)
	struct FVector Center; // 0x1C(0xC)
	struct FRotator Rotation; // 0x28(0xC)
	float radius; // 0x34(0x4)
	float size; // 0x38(0x4)
	int32_t Segments; // 0x3C(0x4)
	struct FColor Color; // 0x40(0x4)
	uint8_t bPersistentLines : 1; // 0x44(0x1), Mask(0x1)
	uint8_t BitPad_0x44_1 : 7; // 0x44(0x1)
	uint8_t Pad_0x45[0x3]; // 0x45(0x3)
	float Lifetime; // 0x48(0x4)
	float Thickness; // 0x4C(0x4)
	struct FString Message; // 0x50(0x10)
	struct FVector2D TextScale; // 0x60(0x8)
};

// Object: ScriptStruct Engine.AnimMontageInstance
// Size: 0x1B0 (Inherited: 0x0)
struct FAnimMontageInstance
{
	struct UAnimMontage* Montage; // 0x0(0x8)
	uint8_t Pad_0x8[0x20]; // 0x8(0x20)
	uint8_t bPlaying : 1; // 0x28(0x1), Mask(0x1)
	uint8_t BitPad_0x28_1 : 7; // 0x28(0x1)
	uint8_t Pad_0x29[0x3]; // 0x29(0x3)
	float DefaultBlendTimeMultiplier; // 0x2C(0x4)
	uint8_t Pad_0x30[0xB8]; // 0x30(0xB8)
	struct TArray<int32_t> NextSections; // 0xE8(0x10)
	struct TArray<int32_t> PrevSections; // 0xF8(0x10)
	uint8_t Pad_0x108[0x10]; // 0x108(0x10)
	struct TArray<struct FAnimNotifyEvent> ActiveStateBranchingPoints; // 0x118(0x10)
	float Position; // 0x128(0x4)
	float PlayRate; // 0x12C(0x4)
	struct FAlphaBlend Blend; // 0x130(0x30)
	uint8_t Pad_0x160[0x28]; // 0x160(0x28)
	int32_t DisableRootMotionCount; // 0x188(0x4)
	uint8_t Pad_0x18C[0x24]; // 0x18C(0x24)
};

// Object: ScriptStruct Engine.BranchingPointMarker
// Size: 0xC (Inherited: 0x0)
struct FBranchingPointMarker
{
	int32_t NotifyIndex; // 0x0(0x4)
	float TriggerTime; // 0x4(0x4)
	EAnimNotifyEventType NotifyEventType; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
};

// Object: ScriptStruct Engine.BranchingPoint
// Size: 0x40 (Inherited: 0x30)
struct FBranchingPoint : FAnimLinkableElement
{
	struct FName EventName; // 0x30(0x8)
	float DisplayTime; // 0x38(0x4)
	float TriggerTimeOffset; // 0x3C(0x4)
};

// Object: ScriptStruct Engine.SlotAnimationTrack
// Size: 0x18 (Inherited: 0x0)
struct FSlotAnimationTrack
{
	struct FName SlotName; // 0x0(0x8)
	struct FAnimTrack AnimTrack; // 0x8(0x10)
};

// Object: ScriptStruct Engine.CompositeSection
// Size: 0x58 (Inherited: 0x30)
struct FCompositeSection : FAnimLinkableElement
{
	struct FName SectionName; // 0x30(0x8)
	float StartTime; // 0x38(0x4)
	struct FName NextSectionName; // 0x3C(0x8)
	uint8_t Pad_0x44[0x4]; // 0x44(0x4)
	struct TArray<struct UAnimMetaData*> MetaData; // 0x48(0x10)
};

// Object: ScriptStruct Engine.AnimNode_ApplyMeshSpaceAdditive
// Size: 0x90 (Inherited: 0x48)
struct FAnimNode_ApplyMeshSpaceAdditive : FAnimNode_Base
{
	struct FPoseLink Base; // 0x48(0x18)
	struct FPoseLink Additive; // 0x60(0x18)
	float Alpha; // 0x78(0x4)
	struct FInputScaleBias AlphaScaleBias; // 0x7C(0x8)
	int32_t LODThreshold; // 0x84(0x4)
	uint8_t Pad_0x88[0x8]; // 0x88(0x8)
};

// Object: ScriptStruct Engine.AnimNode_CustomProperty
// Size: 0x90 (Inherited: 0x48)
struct FAnimNode_CustomProperty : FAnimNode_Base
{
	struct TArray<struct FName> SourcePropertyNames; // 0x48(0x10)
	struct TArray<struct FName> DestPropertyNames; // 0x58(0x10)
	struct UObject* TargetInstance; // 0x68(0x8)
	uint8_t Pad_0x70[0x20]; // 0x70(0x20)
};

// Object: ScriptStruct Engine.AnimNode_Inertialization
// Size: 0x1F0 (Inherited: 0x48)
struct FAnimNode_Inertialization : FAnimNode_Base
{
	struct FPoseLink Source; // 0x48(0x18)
	uint8_t bUseLocalSpace : 1; // 0x60(0x1), Mask(0x1)
	uint8_t BitPad_0x60_1 : 7; // 0x60(0x1)
	uint8_t bDefendNan : 1; // 0x61(0x1), Mask(0x1)
	uint8_t BitPad_0x61_1 : 7; // 0x61(0x1)
	uint8_t Pad_0x62[0x18E]; // 0x62(0x18E)
};

// Object: ScriptStruct Engine.InertializationPoseDiff
// Size: 0x28 (Inherited: 0x0)
struct FInertializationPoseDiff
{
	uint8_t Pad_0x0[0x28]; // 0x0(0x28)
};

// Object: ScriptStruct Engine.InertializationCurveDiff
// Size: 0x8 (Inherited: 0x0)
struct FInertializationCurveDiff
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
};

// Object: ScriptStruct Engine.InertializationBoneDiff
// Size: 0x3C (Inherited: 0x0)
struct FInertializationBoneDiff
{
	uint8_t Pad_0x0[0x3C]; // 0x0(0x3C)
};

// Object: ScriptStruct Engine.InertializationPose
// Size: 0x90 (Inherited: 0x0)
struct FInertializationPose
{
	uint8_t Pad_0x0[0x90]; // 0x0(0x90)
};

// Object: ScriptStruct Engine.AnimNode_LinkedAnimGraph
// Size: 0xD0 (Inherited: 0x90)
struct FAnimNode_LinkedAnimGraph : FAnimNode_CustomProperty
{
	struct TArray<struct FPoseLink> InputPoses; // 0x90(0x10)
	struct TArray<struct FName> InputPoseNames; // 0xA0(0x10)
	struct UAnimInstance* InstanceClass; // 0xB0(0x8)
	struct FName Tag; // 0xB8(0x8)
	uint8_t Pad_0xC0[0x10]; // 0xC0(0x10)
};

// Object: ScriptStruct Engine.AnimNode_LinkedAnimLayer
// Size: 0xE0 (Inherited: 0xD0)
struct FAnimNode_LinkedAnimLayer : FAnimNode_LinkedAnimGraph
{
	struct IAnimLayerInterface* Interface; // 0xD0(0x8)
	struct FName Layer; // 0xD8(0x8)
};

// Object: ScriptStruct Engine.AnimNode_LinkedInputPose
// Size: 0xB0 (Inherited: 0x48)
struct FAnimNode_LinkedInputPose : FAnimNode_Base
{
	struct FName Name; // 0x48(0x8)
	struct FName Graph; // 0x50(0x8)
	struct FPoseLink InputPose; // 0x58(0x18)
	uint8_t Pad_0x70[0x40]; // 0x70(0x40)
};

// Object: ScriptStruct Engine.AnimNode_SaveCachedPose
// Size: 0x100 (Inherited: 0x48)
struct FAnimNode_SaveCachedPose : FAnimNode_Base
{
	struct FPoseLink Pose; // 0x48(0x18)
	struct FName CachePoseName; // 0x60(0x8)
	uint8_t Pad_0x68[0x98]; // 0x68(0x98)
};

// Object: ScriptStruct Engine.SimpleAnimTransition
// Size: 0x8 (Inherited: 0x0)
struct FSimpleAnimTransition
{
	float Duration; // 0x0(0x4)
	EAlphaBlendOption Mode; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
};

// Object: ScriptStruct Engine.AnimNode_StateMachine
// Size: 0x1B0 (Inherited: 0x48)
struct FAnimNode_StateMachine : FAnimNode_Base
{
	int32_t StateMachineIndexInClass; // 0x48(0x4)
	int32_t MaxTransitionsPerFrame; // 0x4C(0x4)
	uint8_t bSkipFirstUpdateTransition : 1; // 0x50(0x1), Mask(0x1)
	uint8_t BitPad_0x50_1 : 7; // 0x50(0x1)
	uint8_t bReinitializeOnBecomingRelevant : 1; // 0x51(0x1), Mask(0x1)
	uint8_t BitPad_0x51_1 : 7; // 0x51(0x1)
	uint8_t bEnableForceSwitchState : 1; // 0x52(0x1), Mask(0x1)
	uint8_t BitPad_0x52_1 : 7; // 0x52(0x1)
	uint8_t Pad_0x53[0x1]; // 0x53(0x1)
	struct FName StateNameToBeSwitched; // 0x54(0x8)
	struct FSimpleAnimTransition DefaultTransitionConfig; // 0x5C(0x8)
	uint8_t bActiveSleep : 1; // 0x64(0x1), Mask(0x1)
	uint8_t BitPad_0x64_1 : 7; // 0x64(0x1)
	uint8_t bEnableRawPtr : 1; // 0x65(0x1), Mask(0x1)
	uint8_t BitPad_0x65_1 : 7; // 0x65(0x1)
	uint8_t Pad_0x66[0xA]; // 0x66(0xA)
	uint8_t bEnableTransitionOpt : 1; // 0x70(0x1), Mask(0x1)
	uint8_t BitPad_0x70_1 : 7; // 0x70(0x1)
	uint8_t Pad_0x71[0x13F]; // 0x71(0x13F)
};

// Object: ScriptStruct Engine.AnimationPotentialTransition
// Size: 0x30 (Inherited: 0x0)
struct FAnimationPotentialTransition
{
	uint8_t Pad_0x0[0x30]; // 0x0(0x30)
};

// Object: ScriptStruct Engine.AnimationActiveTransitionEntry
// Size: 0xE8 (Inherited: 0x0)
struct FAnimationActiveTransitionEntry
{
	uint8_t Pad_0x0[0xC0]; // 0x0(0xC0)
	struct UBlendProfile* BlendProfile; // 0xC0(0x8)
	uint8_t Pad_0xC8[0x8]; // 0xC8(0x8)
	struct TArray<struct FAnimCurveValueBlendCurve> CustomizedAnimCurveBlendCurve; // 0xD0(0x10)
	uint8_t Pad_0xE0[0x8]; // 0xE0(0x8)
};

// Object: ScriptStruct Engine.AnimCurveValueBlendCurve
// Size: 0x10 (Inherited: 0x0)
struct FAnimCurveValueBlendCurve
{
	struct FName CurveName; // 0x0(0x8)
	struct UCurveFloat* Curve; // 0x8(0x8)
};

// Object: ScriptStruct Engine.AnimNode_TransitionPoseEvaluator
// Size: 0x90 (Inherited: 0x48)
struct FAnimNode_TransitionPoseEvaluator : FAnimNode_Base
{
	uint8_t Pad_0x48[0x38]; // 0x48(0x38)
	int32_t FramesToCachePose; // 0x80(0x4)
	uint8_t Pad_0x84[0x4]; // 0x84(0x4)
	EEvaluatorDataSource DataSource; // 0x88(0x1)
	EEvaluatorMode EvaluatorMode; // 0x89(0x1)
	uint8_t Pad_0x8A[0x6]; // 0x8A(0x6)
};

// Object: ScriptStruct Engine.AnimNode_TransitionResult
// Size: 0x70 (Inherited: 0x48)
struct FAnimNode_TransitionResult : FAnimNode_Base
{
	uint8_t bCanEnterTransition : 1; // 0x48(0x1), Mask(0x1)
	uint8_t BitPad_0x48_1 : 7; // 0x48(0x1)
	uint8_t bEnableRawPtr : 1; // 0x49(0x1), Mask(0x1)
	uint8_t BitPad_0x49_1 : 7; // 0x49(0x1)
	uint8_t Pad_0x4A[0x26]; // 0x4A(0x26)
};

// Object: ScriptStruct Engine.AnimNode_UseCachedPose
// Size: 0x68 (Inherited: 0x48)
struct FAnimNode_UseCachedPose : FAnimNode_Base
{
	struct FPoseLink LinkToCachingNode; // 0x48(0x18)
	struct FName CachePoseName; // 0x60(0x8)
};

// Object: ScriptStruct Engine.ExposedValueHandler
// Size: 0x48 (Inherited: 0x0)
struct FExposedValueHandler
{
	struct FName BoundFunction; // 0x0(0x8)
	struct TArray<struct FExposedValueCopyRecord> CopyRecords; // 0x8(0x10)
	struct UFunction* Function; // 0x18(0x8)
	struct TFieldPath<FStructProperty> ValueHandlerNodeProperty; // 0x20(0x20)
	uint8_t Pad_0x40[0x8]; // 0x40(0x8)
};

// Object: ScriptStruct Engine.ExposedValueCopyRecord
// Size: 0x80 (Inherited: 0x0)
struct FExposedValueCopyRecord
{
	struct FName SourcePropertyName; // 0x0(0x8)
	struct FName SourceSubPropertyName; // 0x8(0x8)
	int32_t SourceArrayIndex; // 0x10(0x4)
	uint8_t bInstanceIsTarget : 1; // 0x14(0x1), Mask(0x1)
	uint8_t BitPad_0x14_1 : 7; // 0x14(0x1)
	EPostCopyOperation PostCopyOperation; // 0x15(0x1)
	ECopyType CopyType; // 0x16(0x1)
	uint8_t Pad_0x17[0x1]; // 0x17(0x1)
	struct TFieldPath<FProperty> DestProperty; // 0x18(0x20)
	int32_t DestArrayIndex; // 0x38(0x4)
	int32_t size; // 0x3C(0x4)
	struct TFieldPath<FProperty> CachedSourceProperty; // 0x40(0x20)
	struct TFieldPath<FProperty> CachedSourceStructSubProperty; // 0x60(0x20)
};

// Object: ScriptStruct Engine.AnimNode_ConvertLocalToComponentSpace
// Size: 0x60 (Inherited: 0x48)
struct FAnimNode_ConvertLocalToComponentSpace : FAnimNode_Base
{
	struct FPoseLink LocalPose; // 0x48(0x18)
};

// Object: ScriptStruct Engine.AnimNode_ConvertComponentToLocalSpace
// Size: 0x60 (Inherited: 0x48)
struct FAnimNode_ConvertComponentToLocalSpace : FAnimNode_Base
{
	struct FComponentSpacePoseLink ComponentPose; // 0x48(0x18)
};

// Object: ScriptStruct Engine.AnimNotifyArray
// Size: 0x10 (Inherited: 0x0)
struct FAnimNotifyArray
{
	struct TArray<struct FAnimNotifyEventReference> Notifies; // 0x0(0x10)
};

// Object: ScriptStruct Engine.AnimNotifyQueue
// Size: 0x70 (Inherited: 0x0)
struct FAnimNotifyQueue
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
	struct TArray<struct FAnimNotifyEventReference> AnimNotifies; // 0x10(0x10)
	struct TMap<struct FName, struct FAnimNotifyArray> UnfilteredMontageAnimNotifies; // 0x20(0x50)
};

// Object: ScriptStruct Engine.CompressedTrack
// Size: 0x38 (Inherited: 0x0)
struct FCompressedTrack
{
	struct TArray<uint8_t> ByteStream; // 0x0(0x10)
	struct TArray<float> Times; // 0x10(0x10)
	float Mins[0x3]; // 0x20(0xC)
	float Ranges[0x3]; // 0x2C(0xC)
};

// Object: ScriptStruct Engine.CurveTrack
// Size: 0x18 (Inherited: 0x0)
struct FCurveTrack
{
	struct FName CurveName; // 0x0(0x8)
	struct TArray<float> CurveWeights; // 0x8(0x10)
};

// Object: ScriptStruct Engine.ScaleTrack
// Size: 0x20 (Inherited: 0x0)
struct FScaleTrack
{
	struct TArray<struct FVector> ScaleKeys; // 0x0(0x10)
	struct TArray<float> Times; // 0x10(0x10)
};

// Object: ScriptStruct Engine.RotationTrack
// Size: 0x20 (Inherited: 0x0)
struct FRotationTrack
{
	struct TArray<struct FQuat> RotKeys; // 0x0(0x10)
	struct TArray<float> Times; // 0x10(0x10)
};

// Object: ScriptStruct Engine.TranslationTrack
// Size: 0x20 (Inherited: 0x0)
struct FTranslationTrack
{
	struct TArray<struct FVector> PosKeys; // 0x0(0x10)
	struct TArray<float> Times; // 0x10(0x10)
};

// Object: ScriptStruct Engine.AnimSequenceTrackContainer
// Size: 0x20 (Inherited: 0x0)
struct FAnimSequenceTrackContainer
{
	struct TArray<struct FRawAnimSequenceTrack> AnimationTracks; // 0x0(0x10)
	struct TArray<struct FName> TrackNames; // 0x10(0x10)
};

// Object: ScriptStruct Engine.RawAnimSequenceTrack
// Size: 0x30 (Inherited: 0x0)
struct FRawAnimSequenceTrack
{
	struct TArray<struct FVector> PosKeys; // 0x0(0x10)
	struct TArray<struct FQuat> RotKeys; // 0x10(0x10)
	struct TArray<struct FVector> ScaleKeys; // 0x20(0x10)
};

// Object: ScriptStruct Engine.AnimSetMeshLinkup
// Size: 0x10 (Inherited: 0x0)
struct FAnimSetMeshLinkup
{
	struct TArray<int32_t> BoneToTrackTable; // 0x0(0x10)
};

// Object: ScriptStruct Engine.AnimSingleNodeInstanceProxy
// Size: 0x920 (Inherited: 0x7A0)
struct FAnimSingleNodeInstanceProxy : FAnimInstanceProxy
{
	uint8_t Pad_0x7A0[0x180]; // 0x7A0(0x180)
};

// Object: ScriptStruct Engine.AnimNode_SingleNode
// Size: 0x70 (Inherited: 0x48)
struct FAnimNode_SingleNode : FAnimNode_Base
{
	struct FPoseLink SourcePose; // 0x48(0x18)
	uint8_t Pad_0x60[0x10]; // 0x60(0x10)
};

// Object: ScriptStruct Engine.BakedAnimationStateMachine
// Size: 0x30 (Inherited: 0x0)
struct FBakedAnimationStateMachine
{
	struct FName MachineName; // 0x0(0x8)
	int32_t InitialState; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TArray<struct FBakedAnimationState> States; // 0x10(0x10)
	struct TArray<struct FAnimationTransitionBetweenStates> Transitions; // 0x20(0x10)
};

// Object: ScriptStruct Engine.AnimationStateBase
// Size: 0x8 (Inherited: 0x0)
struct FAnimationStateBase
{
	struct FName StateName; // 0x0(0x8)
};

// Object: ScriptStruct Engine.AnimationTransitionBetweenStates
// Size: 0x50 (Inherited: 0x8)
struct FAnimationTransitionBetweenStates : FAnimationStateBase
{
	int32_t PreviousState; // 0x8(0x4)
	int32_t NextState; // 0xC(0x4)
	float CrossfadeDuration; // 0x10(0x4)
	int32_t StartNotify; // 0x14(0x4)
	int32_t EndNotify; // 0x18(0x4)
	int32_t InterruptNotify; // 0x1C(0x4)
	EAlphaBlendOption BlendMode; // 0x20(0x1)
	uint8_t Pad_0x21[0x7]; // 0x21(0x7)
	struct UCurveFloat* CustomCurve; // 0x28(0x8)
	struct UBlendProfile* BlendProfile; // 0x30(0x8)
	ETransitionLogicType LogicType; // 0x38(0x1)
	uint8_t Pad_0x39[0x7]; // 0x39(0x7)
	struct TArray<struct FAnimCurveValueBlendCurve> AnimCurveBlendCurves; // 0x40(0x10)
};

// Object: ScriptStruct Engine.BakedAnimationState
// Size: 0x58 (Inherited: 0x0)
struct FBakedAnimationState
{
	struct FName StateName; // 0x0(0x8)
	struct TArray<struct FBakedStateExitTransition> Transitions; // 0x8(0x10)
	int32_t StateRootNodeIndex; // 0x18(0x4)
	int32_t StartNotify; // 0x1C(0x4)
	int32_t EndNotify; // 0x20(0x4)
	int32_t FullyBlendedNotify; // 0x24(0x4)
	uint8_t bIsAConduit : 1; // 0x28(0x1), Mask(0x1)
	uint8_t BitPad_0x28_1 : 7; // 0x28(0x1)
	uint8_t Pad_0x29[0x3]; // 0x29(0x3)
	int32_t EntryRuleNodeIndex; // 0x2C(0x4)
	struct TArray<int32_t> PlayerNodeIndices; // 0x30(0x10)
	struct TArray<int32_t> LayerNodeIndices; // 0x40(0x10)
	uint8_t bAlwaysResetOnEntry : 1; // 0x50(0x1), Mask(0x1)
	uint8_t BitPad_0x50_1 : 7; // 0x50(0x1)
	uint8_t bLoopState : 1; // 0x51(0x1), Mask(0x1)
	uint8_t BitPad_0x51_1 : 7; // 0x51(0x1)
	uint8_t Pad_0x52[0x6]; // 0x52(0x6)
};

// Object: ScriptStruct Engine.BakedStateExitTransition
// Size: 0x20 (Inherited: 0x0)
struct FBakedStateExitTransition
{
	int32_t CanTakeDelegateIndex; // 0x0(0x4)
	int32_t CustomResultNodeIndex; // 0x4(0x4)
	int32_t TransitionIndex; // 0x8(0x4)
	uint8_t bDesiredTransitionReturnValue : 1; // 0xC(0x1), Mask(0x1)
	uint8_t BitPad_0xC_1 : 7; // 0xC(0x1)
	uint8_t bAutomaticRemainingTimeRule : 1; // 0xD(0x1), Mask(0x1)
	uint8_t BitPad_0xD_1 : 7; // 0xD(0x1)
	uint8_t Pad_0xE[0x2]; // 0xE(0x2)
	struct TArray<int32_t> PoseEvaluatorLinks; // 0x10(0x10)
};

// Object: ScriptStruct Engine.AnimationState
// Size: 0x28 (Inherited: 0x8)
struct FAnimationState : FAnimationStateBase
{
	struct TArray<struct FAnimationTransitionRule> Transitions; // 0x8(0x10)
	int32_t StateRootNodeIndex; // 0x18(0x4)
	int32_t StartNotify; // 0x1C(0x4)
	int32_t EndNotify; // 0x20(0x4)
	int32_t FullyBlendedNotify; // 0x24(0x4)
};

// Object: ScriptStruct Engine.AnimationTransitionRule
// Size: 0x10 (Inherited: 0x0)
struct FAnimationTransitionRule
{
	struct FName RuleToExecute; // 0x0(0x8)
	uint8_t TransitionReturnVal : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	int32_t TransitionIndex; // 0xC(0x4)
};

// Object: ScriptStruct Engine.TrackToSkeletonMap
// Size: 0x4 (Inherited: 0x0)
struct FTrackToSkeletonMap
{
	int32_t BoneTreeIndex; // 0x0(0x4)
};

// Object: ScriptStruct Engine.MarkerSyncData
// Size: 0x20 (Inherited: 0x0)
struct FMarkerSyncData
{
	struct TArray<struct FAnimSyncMarker> AuthoredSyncMarkers; // 0x0(0x10)
	uint8_t Pad_0x10[0x10]; // 0x10(0x10)
};

// Object: ScriptStruct Engine.AnimSyncMarker
// Size: 0xC (Inherited: 0x0)
struct FAnimSyncMarker
{
	struct FName MarkerName; // 0x0(0x8)
	float Time; // 0x8(0x4)
};

// Object: ScriptStruct Engine.AnimNotifyTrack
// Size: 0x38 (Inherited: 0x0)
struct FAnimNotifyTrack
{
	struct FName TrackName; // 0x0(0x8)
	struct FLinearColor TrackColor; // 0x8(0x10)
	uint8_t Pad_0x18[0x20]; // 0x18(0x20)
};

// Object: ScriptStruct Engine.PerBoneBlendWeights
// Size: 0x10 (Inherited: 0x0)
struct FPerBoneBlendWeights
{
	struct TArray<struct FPerBoneBlendWeight> BoneBlendWeights; // 0x0(0x10)
};

// Object: ScriptStruct Engine.DestructionStateMapWrapper
// Size: 0x58 (Inherited: 0x0)
struct FDestructionStateMapWrapper
{
	uint8_t Pad_0x0[0x58]; // 0x0(0x58)
};

// Object: ScriptStruct Engine.RuntimeSectionState
// Size: 0x8 (Inherited: 0x0)
struct FRuntimeSectionState
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
};

// Object: ScriptStruct Engine.AOReplacingSourcePrimitiveData
// Size: 0x40 (Inherited: 0x0)
struct FAOReplacingSourcePrimitiveData
{
	struct TSoftObjectPtr<UPrimitiveComponent> Primitive; // 0x0(0x28)
	struct TArray<struct FAOReplacingSourceSection> Sections; // 0x28(0x10)
	float PrimitiveWeight; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
};

// Object: ScriptStruct Engine.AOReplacingSourceSection
// Size: 0x8 (Inherited: 0x0)
struct FAOReplacingSourceSection
{
	int32_t ItemIndex; // 0x0(0x4)
	float Weight; // 0x4(0x4)
};

// Object: ScriptStruct Engine.AssetImportInfo
// Size: 0x1 (Inherited: 0x0)
struct FAssetImportInfo
{
	uint8_t Pad_0x0[0x1]; // 0x0(0x1)
};

// Object: ScriptStruct Engine.PrimaryAssetRules
// Size: 0xC (Inherited: 0x0)
struct FPrimaryAssetRules
{
	int32_t Priority; // 0x0(0x4)
	int32_t ChunkID; // 0x4(0x4)
	uint8_t bApplyRecursively : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	EPrimaryAssetCookRule CookRule; // 0x9(0x1)
	uint8_t Pad_0xA[0x2]; // 0xA(0x2)
};

// Object: ScriptStruct Engine.PrimaryAssetRulesCustomOverride
// Size: 0x38 (Inherited: 0x0)
struct FPrimaryAssetRulesCustomOverride
{
	struct FPrimaryAssetType PrimaryAssetType; // 0x0(0x8)
	struct FDirectoryPath FilterDirectory; // 0x8(0x10)
	struct FString FilterString; // 0x18(0x10)
	struct FPrimaryAssetRules Rules; // 0x28(0xC)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
};

// Object: ScriptStruct Engine.PrimaryAssetRulesOverride
// Size: 0x1C (Inherited: 0x0)
struct FPrimaryAssetRulesOverride
{
	struct FPrimaryAssetId PrimaryAssetId; // 0x0(0x10)
	struct FPrimaryAssetRules Rules; // 0x10(0xC)
};

// Object: ScriptStruct Engine.AssetManagerRedirect
// Size: 0x20 (Inherited: 0x0)
struct FAssetManagerRedirect
{
	struct FString old; // 0x0(0x10)
	struct FString New; // 0x10(0x10)
};

// Object: ScriptStruct Engine.PrimaryAssetTypeInfo
// Size: 0x88 (Inherited: 0x0)
struct FPrimaryAssetTypeInfo
{
	struct FName PrimaryAssetType; // 0x0(0x8)
	struct TSoftClassPtr<struct UObject*> AssetBaseClass; // 0x8(0x28)
	struct UObject* AssetBaseClassLoaded; // 0x30(0x8)
	uint8_t bHasBlueprintClasses : 1; // 0x38(0x1), Mask(0x1)
	uint8_t BitPad_0x38_1 : 7; // 0x38(0x1)
	uint8_t bIsEditorOnly : 1; // 0x39(0x1), Mask(0x1)
	uint8_t BitPad_0x39_1 : 7; // 0x39(0x1)
	uint8_t Pad_0x3A[0x6]; // 0x3A(0x6)
	struct TArray<struct FDirectoryPath> Directories; // 0x40(0x10)
	struct TArray<struct FSoftObjectPath> SpecificAssets; // 0x50(0x10)
	struct FPrimaryAssetRules Rules; // 0x60(0xC)
	uint8_t Pad_0x6C[0x4]; // 0x6C(0x4)
	struct TArray<struct FString> AssetScanPaths; // 0x70(0x10)
	uint8_t bIsDynamicAsset : 1; // 0x80(0x1), Mask(0x1)
	uint8_t BitPad_0x80_1 : 7; // 0x80(0x1)
	uint8_t Pad_0x81[0x3]; // 0x81(0x3)
	int32_t NumberOfAssets; // 0x84(0x4)
};

// Object: ScriptStruct Engine.AssetMapping
// Size: 0x10 (Inherited: 0x0)
struct FAssetMapping
{
	struct UAnimationAsset* SourceAsset; // 0x0(0x8)
	struct UAnimationAsset* TargetAsset; // 0x8(0x8)
};

// Object: ScriptStruct Engine.AtmospherePrecomputeInstanceData
// Size: 0x2A0 (Inherited: 0xA8)
struct FAtmospherePrecomputeInstanceData : FSceneComponentInstanceData
{
	uint8_t Pad_0xA8[0x1F8]; // 0xA8(0x1F8)
};

// Object: ScriptStruct Engine.AtmospherePrecomputeParameters
// Size: 0x2C (Inherited: 0x0)
struct FAtmospherePrecomputeParameters
{
	float DensityHeight; // 0x0(0x4)
	float DecayHeight; // 0x4(0x4)
	int32_t MaxScatteringOrder; // 0x8(0x4)
	int32_t TransmittanceTexWidth; // 0xC(0x4)
	int32_t TransmittanceTexHeight; // 0x10(0x4)
	int32_t IrradianceTexWidth; // 0x14(0x4)
	int32_t IrradianceTexHeight; // 0x18(0x4)
	int32_t InscatterAltitudeSampleNum; // 0x1C(0x4)
	int32_t InscatterMuNum; // 0x20(0x4)
	int32_t InscatterMuSNum; // 0x24(0x4)
	int32_t InscatterNuNum; // 0x28(0x4)
};

// Object: ScriptStruct Engine.BaseAttenuationSettings
// Size: 0xC8 (Inherited: 0x0)
struct FBaseAttenuationSettings
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	EAttenuationDistanceModel DistanceAlgorithm; // 0x8(0x1)
	EAttenuationShape AttenuationShape; // 0x9(0x1)
	uint8_t Pad_0xA[0x2]; // 0xA(0x2)
	float dBAttenuationAtMax; // 0xC(0x4)
	struct FVector AttenuationShapeExtents; // 0x10(0xC)
	float ConeOffset; // 0x1C(0x4)
	float FalloffDistance; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct FRuntimeFloatCurve CustomAttenuationCurve; // 0x28(0xA0)
};

// Object: ScriptStruct Engine.AudioComponentParam
// Size: 0x20 (Inherited: 0x0)
struct FAudioComponentParam
{
	struct FName ParamName; // 0x0(0x8)
	float FloatParam; // 0x8(0x4)
	uint8_t BoolParam : 1; // 0xC(0x1), Mask(0x1)
	uint8_t BitPad_0xC_1 : 7; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
	int32_t IntParam; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct USoundWave* SoundWaveParam; // 0x18(0x8)
};

// Object: ScriptStruct Engine.AudioQualitySettings
// Size: 0x20 (Inherited: 0x0)
struct FAudioQualitySettings
{
	struct FText DisplayName; // 0x0(0x18)
	int32_t MaxChannels; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct Engine.InteriorSettings
// Size: 0x24 (Inherited: 0x0)
struct FInteriorSettings
{
	uint8_t bIsWorldSettings : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float ExteriorVolume; // 0x4(0x4)
	float ExteriorTime; // 0x8(0x4)
	float ExteriorLPF; // 0xC(0x4)
	float ExteriorLPFTime; // 0x10(0x4)
	float InteriorVolume; // 0x14(0x4)
	float InteriorTime; // 0x18(0x4)
	float InteriorLPF; // 0x1C(0x4)
	float InteriorLPFTime; // 0x20(0x4)
};

// Object: ScriptStruct Engine.ReverbSettings
// Size: 0x20 (Inherited: 0x0)
struct FReverbSettings
{
	uint8_t bApplyReverb : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct UReverbEffect* ReverbEffect; // 0x8(0x8)
	struct USoundEffectSubmixPreset* ReverbPluginEffect; // 0x10(0x8)
	float Volume; // 0x18(0x4)
	float FadeTime; // 0x1C(0x4)
};

// Object: ScriptStruct Engine.LaunchOnTestSettings
// Size: 0x20 (Inherited: 0x0)
struct FLaunchOnTestSettings
{
	struct FFilePath LaunchOnTestmap; // 0x0(0x10)
	struct FString DeviceID; // 0x10(0x10)
};

// Object: ScriptStruct Engine.EditorMapPerformanceTestDefinition
// Size: 0x20 (Inherited: 0x0)
struct FEditorMapPerformanceTestDefinition
{
	struct FSoftObjectPath PerformanceTestmap; // 0x0(0x18)
	int32_t TestTimer; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct Engine.EditorImportWorkflowDefinition
// Size: 0x20 (Inherited: 0x0)
struct FEditorImportWorkflowDefinition
{
	struct FFilePath ImportFilePath; // 0x0(0x10)
	struct TArray<struct FImportFactorySettingValues> FactorySettings; // 0x10(0x10)
};

// Object: ScriptStruct Engine.BuildPromotionImportWorkflowSettings
// Size: 0x150 (Inherited: 0x0)
struct FBuildPromotionImportWorkflowSettings
{
	struct FEditorImportWorkflowDefinition Diffuse; // 0x0(0x20)
	struct FEditorImportWorkflowDefinition Normal; // 0x20(0x20)
	struct FEditorImportWorkflowDefinition StaticMesh; // 0x40(0x20)
	struct FEditorImportWorkflowDefinition ReimportStaticMesh; // 0x60(0x20)
	struct FEditorImportWorkflowDefinition BlendShapeMesh; // 0x80(0x20)
	struct FEditorImportWorkflowDefinition MorphMesh; // 0xA0(0x20)
	struct FEditorImportWorkflowDefinition SkeletalMesh; // 0xC0(0x20)
	struct FEditorImportWorkflowDefinition Animation; // 0xE0(0x20)
	struct FEditorImportWorkflowDefinition Sound; // 0x100(0x20)
	struct FEditorImportWorkflowDefinition SurroundSound; // 0x120(0x20)
	struct TArray<struct FEditorImportWorkflowDefinition> OtherAssetsToImport; // 0x140(0x10)
};

// Object: ScriptStruct Engine.BuildPromotionNewProjectSettings
// Size: 0x20 (Inherited: 0x0)
struct FBuildPromotionNewProjectSettings
{
	struct FDirectoryPath NewProjectFolderOverride; // 0x0(0x10)
	struct FString NewProjectNameOverride; // 0x10(0x10)
};

// Object: ScriptStruct Engine.BuildPromotionOpenAssetSettings
// Size: 0x60 (Inherited: 0x0)
struct FBuildPromotionOpenAssetSettings
{
	struct FFilePath BlueprintAsset; // 0x0(0x10)
	struct FFilePath MaterialAsset; // 0x10(0x10)
	struct FFilePath ParticleSystemAsset; // 0x20(0x10)
	struct FFilePath SkeletalMeshAsset; // 0x30(0x10)
	struct FFilePath StaticMeshAsset; // 0x40(0x10)
	struct FFilePath TextureAsset; // 0x50(0x10)
};

// Object: ScriptStruct Engine.BuildPromotionTestSettings
// Size: 0x1F0 (Inherited: 0x0)
struct FBuildPromotionTestSettings
{
	struct FFilePath DefaultStaticMeshAsset; // 0x0(0x10)
	struct FBuildPromotionImportWorkflowSettings ImportWorkflow; // 0x10(0x150)
	struct FBuildPromotionOpenAssetSettings OpenAssets; // 0x160(0x60)
	struct FBuildPromotionNewProjectSettings NewProjectSettings; // 0x1C0(0x20)
	struct FFilePath SourceControlMaterial; // 0x1E0(0x10)
};

// Object: ScriptStruct Engine.ImportFactorySettingValues
// Size: 0x20 (Inherited: 0x0)
struct FImportFactorySettingValues
{
	struct FString SettingName; // 0x0(0x10)
	struct FString Value; // 0x10(0x10)
};

// Object: ScriptStruct Engine.BlueprintEditorPromotionSettings
// Size: 0x30 (Inherited: 0x0)
struct FBlueprintEditorPromotionSettings
{
	struct FFilePath FirstMeshPath; // 0x0(0x10)
	struct FFilePath SecondMeshPath; // 0x10(0x10)
	struct FFilePath DefaultParticleAsset; // 0x20(0x10)
};

// Object: ScriptStruct Engine.ParticleEditorPromotionSettings
// Size: 0x10 (Inherited: 0x0)
struct FParticleEditorPromotionSettings
{
	struct FFilePath DefaultParticleAsset; // 0x0(0x10)
};

// Object: ScriptStruct Engine.MaterialEditorPromotionSettings
// Size: 0x30 (Inherited: 0x0)
struct FMaterialEditorPromotionSettings
{
	struct FFilePath DefaultMaterialAsset; // 0x0(0x10)
	struct FFilePath DefaultDiffuseTexture; // 0x10(0x10)
	struct FFilePath DefaultNormalTexture; // 0x20(0x10)
};

// Object: ScriptStruct Engine.EditorImportExportTestDefinition
// Size: 0x38 (Inherited: 0x0)
struct FEditorImportExportTestDefinition
{
	struct FFilePath ImportFilePath; // 0x0(0x10)
	struct FString ExportFileExtension; // 0x10(0x10)
	uint8_t bSkipExport : 1; // 0x20(0x1), Mask(0x1)
	uint8_t BitPad_0x20_1 : 7; // 0x20(0x1)
	uint8_t Pad_0x21[0x7]; // 0x21(0x7)
	struct TArray<struct FImportFactorySettingValues> FactorySettings; // 0x28(0x10)
};

// Object: ScriptStruct Engine.ExternalToolDefinition
// Size: 0x60 (Inherited: 0x0)
struct FExternalToolDefinition
{
	struct FString ToolName; // 0x0(0x10)
	struct FFilePath ExecutablePath; // 0x10(0x10)
	struct FString CommandLineOptions; // 0x20(0x10)
	struct FDirectoryPath WorkingDirectory; // 0x30(0x10)
	struct FString ScriptExtension; // 0x40(0x10)
	struct FDirectoryPath ScriptDirectory; // 0x50(0x10)
};

// Object: ScriptStruct Engine.NavAvoidanceData
// Size: 0x3C (Inherited: 0x0)
struct FNavAvoidanceData
{
	uint8_t Pad_0x0[0x3C]; // 0x0(0x3C)
};

// Object: ScriptStruct Engine.BandwidthTestGenerator
// Size: 0x20 (Inherited: 0x0)
struct FBandwidthTestGenerator
{
	struct TArray<struct FBandwidthTestItem> ReplicatedBuffers; // 0x0(0x10)
	uint8_t Pad_0x10[0x10]; // 0x10(0x10)
};

// Object: ScriptStruct Engine.BandwidthTestItem
// Size: 0x10 (Inherited: 0x0)
struct FBandwidthTestItem
{
	struct TArray<uint8_t> Kilobyte; // 0x0(0x10)
};

// Object: ScriptStruct Engine.BlendProfileBoneEntry
// Size: 0x14 (Inherited: 0x0)
struct FBlendProfileBoneEntry
{
	struct FBoneReference BoneReference; // 0x0(0x10)
	float BlendScale; // 0x10(0x4)
};

// Object: ScriptStruct Engine.PerBoneInterpolation
// Size: 0x14 (Inherited: 0x0)
struct FPerBoneInterpolation
{
	struct FBoneReference BoneReference; // 0x0(0x10)
	float InterpolationSpeedPerSec; // 0x10(0x4)
};

// Object: ScriptStruct Engine.EditorElement
// Size: 0x18 (Inherited: 0x0)
struct FEditorElement
{
	int32_t Indices[0x3]; // 0x0(0xC)
	float Weights[0x3]; // 0xC(0xC)
};

// Object: ScriptStruct Engine.GridBlendSample
// Size: 0x1C (Inherited: 0x0)
struct FGridBlendSample
{
	struct FEditorElement GridElement; // 0x0(0x18)
	float BlendWeight; // 0x18(0x4)
};

// Object: ScriptStruct Engine.BlendSample
// Size: 0x18 (Inherited: 0x0)
struct FBlendSample
{
	struct UAnimSequence* Animation; // 0x0(0x8)
	struct FVector SampleValue; // 0x8(0xC)
	float RateScale; // 0x14(0x4)
};

// Object: ScriptStruct Engine.BlendParameter
// Size: 0x20 (Inherited: 0x0)
struct FBlendParameter
{
	struct FString DisplayName; // 0x0(0x10)
	float Min; // 0x10(0x4)
	float Max; // 0x14(0x4)
	int32_t GridNum; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
};

// Object: ScriptStruct Engine.InterpolationParameter
// Size: 0x8 (Inherited: 0x0)
struct FInterpolationParameter
{
	float InterpolationTime; // 0x0(0x4)
	EFilterInterpolationType InterpolationType; // 0x4(0x1)
	uint8_t Pad_0x5[0x3]; // 0x5(0x3)
};

// Object: ScriptStruct Engine.BPEditorBookmarkNode
// Size: 0x38 (Inherited: 0x0)
struct FBPEditorBookmarkNode
{
	struct FGuid NodeGuid; // 0x0(0x10)
	struct FGuid ParentGuid; // 0x10(0x10)
	struct FText DisplayName; // 0x20(0x18)
};

// Object: ScriptStruct Engine.EditedDocumentInfo
// Size: 0x30 (Inherited: 0x0)
struct FEditedDocumentInfo
{
	struct FSoftObjectPath EditedObjectPath; // 0x0(0x18)
	struct FVector2D SavedViewOffset; // 0x18(0x8)
	float SavedZoomAmount; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
	struct UObject* EditedObject; // 0x28(0x8)
};

// Object: ScriptStruct Engine.BPInterfaceDescription
// Size: 0x18 (Inherited: 0x0)
struct FBPInterfaceDescription
{
	struct IInterface* Interface; // 0x0(0x8)
	struct TArray<struct UEdGraph*> Graphs; // 0x8(0x10)
};

// Object: ScriptStruct Engine.BPVariableDescription
// Size: 0xD0 (Inherited: 0x0)
struct FBPVariableDescription
{
	struct FName VarName; // 0x0(0x8)
	struct FGuid VarGuid; // 0x8(0x10)
	struct FEdGraphPinType VarType; // 0x18(0x58)
	struct FString FriendlyName; // 0x70(0x10)
	struct FText Category; // 0x80(0x18)
	uint64_t PropertyFlags; // 0x98(0x8)
	struct FName RepNotifyFunc; // 0xA0(0x8)
	ELifetimeCondition ReplicationCondition; // 0xA8(0x1)
	uint8_t Pad_0xA9[0x7]; // 0xA9(0x7)
	struct TArray<struct FBPVariableMetaDataEntry> MetaDataArray; // 0xB0(0x10)
	struct FString DefaultValue; // 0xC0(0x10)
};

// Object: ScriptStruct Engine.BPVariableMetaDataEntry
// Size: 0x18 (Inherited: 0x0)
struct FBPVariableMetaDataEntry
{
	struct FName DataKey; // 0x0(0x8)
	struct FString DataValue; // 0x8(0x10)
};

// Object: ScriptStruct Engine.BlueprintMacroCosmeticInfo
// Size: 0x1 (Inherited: 0x0)
struct FBlueprintMacroCosmeticInfo
{
	uint8_t Pad_0x0[0x1]; // 0x0(0x1)
};

// Object: ScriptStruct Engine.CompilerNativizationOptions
// Size: 0x80 (Inherited: 0x0)
struct FCompilerNativizationOptions
{
	struct FName PlatformName; // 0x0(0x8)
	uint8_t ServerOnlyPlatform : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t ClientOnlyPlatform : 1; // 0x9(0x1), Mask(0x1)
	uint8_t BitPad_0x9_1 : 7; // 0x9(0x1)
	uint8_t bExcludeMonolithicHeaders : 1; // 0xA(0x1), Mask(0x1)
	uint8_t BitPad_0xA_1 : 7; // 0xA(0x1)
	uint8_t Pad_0xB[0x5]; // 0xB(0x5)
	struct TArray<struct FName> ExcludedModules; // 0x10(0x10)
	struct TSet<struct FSoftObjectPath> ExcludedAssets; // 0x20(0x50)
	struct TArray<struct FString> ExcludedFolderPaths; // 0x70(0x10)
};

// Object: ScriptStruct Engine.BPComponentClassOverride
// Size: 0x10 (Inherited: 0x0)
struct FBPComponentClassOverride
{
	struct FName ComponentName; // 0x0(0x8)
	struct UObject* ComponentClass; // 0x8(0x8)
};

// Object: ScriptStruct Engine.BlueprintCookedComponentInstancingData
// Size: 0x48 (Inherited: 0x0)
struct FBlueprintCookedComponentInstancingData
{
	struct TArray<struct FBlueprintComponentChangedPropertyInfo> ChangedPropertyList; // 0x0(0x10)
	uint8_t Pad_0x10[0x11]; // 0x10(0x11)
	uint8_t bHasValidCookedData : 1; // 0x21(0x1), Mask(0x1)
	uint8_t BitPad_0x21_1 : 7; // 0x21(0x1)
	uint8_t Pad_0x22[0x26]; // 0x22(0x26)
};

// Object: ScriptStruct Engine.BlueprintComponentChangedPropertyInfo
// Size: 0x18 (Inherited: 0x0)
struct FBlueprintComponentChangedPropertyInfo
{
	struct FName PropertyName; // 0x0(0x8)
	int32_t ArrayIndex; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct UStruct* PropertyScope; // 0x10(0x8)
};

// Object: ScriptStruct Engine.EventGraphFastCallPair
// Size: 0x10 (Inherited: 0x0)
struct FEventGraphFastCallPair
{
	struct UFunction* FunctionToPatch; // 0x0(0x8)
	int32_t EventGraphCallOffset; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
};

// Object: ScriptStruct Engine.BlueprintDebugData
// Size: 0x1 (Inherited: 0x0)
struct FBlueprintDebugData
{
	uint8_t Pad_0x0[0x1]; // 0x0(0x1)
};

// Object: ScriptStruct Engine.PointerToUberGraphFrame
// Size: 0x8 (Inherited: 0x0)
struct FPointerToUberGraphFrame
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
};

// Object: ScriptStruct Engine.DebuggingInfoForSingleFunction
// Size: 0x190 (Inherited: 0x0)
struct FDebuggingInfoForSingleFunction
{
	uint8_t Pad_0x0[0x190]; // 0x0(0x190)
};

// Object: ScriptStruct Engine.NodeToCodeAssociation
// Size: 0x14 (Inherited: 0x0)
struct FNodeToCodeAssociation
{
	uint8_t Pad_0x0[0x14]; // 0x0(0x14)
};

// Object: ScriptStruct Engine.AnimCurveType
// Size: 0x2 (Inherited: 0x0)
struct FAnimCurveType
{
	uint8_t Pad_0x0[0x2]; // 0x0(0x2)
};

// Object: ScriptStruct Engine.BookmarkBaseJumpToSettings
// Size: 0x1 (Inherited: 0x0)
struct FBookmarkBaseJumpToSettings
{
	uint8_t Pad_0x0[0x1]; // 0x0(0x1)
};

// Object: ScriptStruct Engine.BookmarkJumpToSettings
// Size: 0x1 (Inherited: 0x1)
struct FBookmarkJumpToSettings : FBookmarkBaseJumpToSettings
{
};

// Object: ScriptStruct Engine.Bookmark2DJumpToSettings
// Size: 0x1 (Inherited: 0x0)
struct FBookmark2DJumpToSettings
{
	uint8_t Pad_0x0[0x1]; // 0x0(0x1)
};

// Object: ScriptStruct Engine.GeomSelection
// Size: 0xC (Inherited: 0x0)
struct FGeomSelection
{
	int32_t Type; // 0x0(0x4)
	int32_t Index; // 0x4(0x4)
	int32_t SelectionIndex; // 0x8(0x4)
};

// Object: ScriptStruct Engine.BuilderPoly
// Size: 0x20 (Inherited: 0x0)
struct FBuilderPoly
{
	struct TArray<int32_t> VertexIndices; // 0x0(0x10)
	int32_t Direction; // 0x10(0x4)
	struct FName ItemName; // 0x14(0x8)
	int32_t PolyFlags; // 0x1C(0x4)
};

// Object: ScriptStruct Engine.CachedAnimTransitionData
// Size: 0x24 (Inherited: 0x0)
struct FCachedAnimTransitionData
{
	struct FName StateMachineName; // 0x0(0x8)
	struct FName FromStateName; // 0x8(0x8)
	struct FName ToStateName; // 0x10(0x8)
	uint8_t Pad_0x18[0xC]; // 0x18(0xC)
};

// Object: ScriptStruct Engine.CachedAnimRelevancyData
// Size: 0x1C (Inherited: 0x0)
struct FCachedAnimRelevancyData
{
	struct FName StateMachineName; // 0x0(0x8)
	struct FName StateName; // 0x8(0x8)
	uint8_t Pad_0x10[0xC]; // 0x10(0xC)
};

// Object: ScriptStruct Engine.CachedAnimAssetPlayerData
// Size: 0x18 (Inherited: 0x0)
struct FCachedAnimAssetPlayerData
{
	struct FName StateMachineName; // 0x0(0x8)
	struct FName StateName; // 0x8(0x8)
	uint8_t Pad_0x10[0x8]; // 0x10(0x8)
};

// Object: ScriptStruct Engine.CachedAnimStateArray
// Size: 0x18 (Inherited: 0x0)
struct FCachedAnimStateArray
{
	struct TArray<struct FCachedAnimStateData> States; // 0x0(0x10)
	uint8_t Pad_0x10[0x8]; // 0x10(0x8)
};

// Object: ScriptStruct Engine.CachedAnimStateData
// Size: 0x1C (Inherited: 0x0)
struct FCachedAnimStateData
{
	struct FName StateMachineName; // 0x0(0x8)
	struct FName StateName; // 0x8(0x8)
	uint8_t Pad_0x10[0xC]; // 0x10(0xC)
};

// Object: ScriptStruct Engine.PooledCameraShakes
// Size: 0x10 (Inherited: 0x0)
struct FPooledCameraShakes
{
	struct TArray<struct UCameraShake*> PooledShakes; // 0x0(0x10)
};

// Object: ScriptStruct Engine.FOscillator
// Size: 0xC (Inherited: 0x0)
struct FFOscillator
{
	float Amplitude; // 0x0(0x4)
	float frequency; // 0x4(0x4)
	EInitialOscillatorOffset InitialOffset; // 0x8(0x1)
	EOscillatorWaveform Waveform; // 0x9(0x1)
	uint8_t Pad_0xA[0x2]; // 0xA(0x2)
};

// Object: ScriptStruct Engine.VOscillator
// Size: 0x24 (Inherited: 0x0)
struct FVOscillator
{
	struct FFOscillator X; // 0x0(0xC)
	struct FFOscillator Y; // 0xC(0xC)
	struct FFOscillator Z; // 0x18(0xC)
};

// Object: ScriptStruct Engine.ROscillator
// Size: 0x24 (Inherited: 0x0)
struct FROscillator
{
	struct FFOscillator Pitch; // 0x0(0xC)
	struct FFOscillator Yaw; // 0xC(0xC)
	struct FFOscillator Roll; // 0x18(0xC)
};

// Object: ScriptStruct Engine.DummySpacerCameraTypes
// Size: 0x1 (Inherited: 0x0)
struct FDummySpacerCameraTypes
{
	uint8_t Pad_0x0[0x1]; // 0x0(0x1)
};

// Object: ScriptStruct Engine.WeightedBlendables
// Size: 0x10 (Inherited: 0x0)
struct FWeightedBlendables
{
	struct TArray<struct FWeightedBlendable> array; // 0x0(0x10)
};

// Object: ScriptStruct Engine.PostProcessSettings
// Size: 0x930 (Inherited: 0x0)
struct FPostProcessSettings
{
	uint8_t bOverride_WhiteTemp : 1; // 0x0(0x1), Mask(0x1)
	uint8_t bOverride_WhiteTint : 1; // 0x0(0x1), Mask(0x2)
	uint8_t bOverride_ColorSaturation : 1; // 0x0(0x1), Mask(0x4)
	uint8_t bOverride_ColorContrast : 1; // 0x0(0x1), Mask(0x8)
	uint8_t bOverride_ColorGamma : 1; // 0x0(0x1), Mask(0x10)
	uint8_t bOverride_ColorGain : 1; // 0x0(0x1), Mask(0x20)
	uint8_t bOverride_ColorOffset : 1; // 0x0(0x1), Mask(0x40)
	uint8_t bOverride_ColorSaturationShadows : 1; // 0x0(0x1), Mask(0x80)
	uint8_t bOverride_ColorContrastShadows : 1; // 0x1(0x1), Mask(0x1)
	uint8_t bOverride_ColorGammaShadows : 1; // 0x1(0x1), Mask(0x2)
	uint8_t bOverride_ColorGainShadows : 1; // 0x1(0x1), Mask(0x4)
	uint8_t bOverride_ColorOffsetShadows : 1; // 0x1(0x1), Mask(0x8)
	uint8_t bOverride_ColorSaturationMidtones : 1; // 0x1(0x1), Mask(0x10)
	uint8_t bOverride_ColorContrastMidtones : 1; // 0x1(0x1), Mask(0x20)
	uint8_t bOverride_ColorGammaMidtones : 1; // 0x1(0x1), Mask(0x40)
	uint8_t bOverride_ColorGainMidtones : 1; // 0x1(0x1), Mask(0x80)
	uint8_t bOverride_ColorOffsetMidtones : 1; // 0x2(0x1), Mask(0x1)
	uint8_t bOverride_ColorSaturationHighlights : 1; // 0x2(0x1), Mask(0x2)
	uint8_t bOverride_ColorContrastHighlights : 1; // 0x2(0x1), Mask(0x4)
	uint8_t bOverride_ColorGammaHighlights : 1; // 0x2(0x1), Mask(0x8)
	uint8_t bOverride_ColorGainHighlights : 1; // 0x2(0x1), Mask(0x10)
	uint8_t bOverride_ColorOffsetHighlights : 1; // 0x2(0x1), Mask(0x20)
	uint8_t bOverride_ColorCorrectionShadowsMax : 1; // 0x2(0x1), Mask(0x40)
	uint8_t bOverride_ColorCorrectionHighlightsMin : 1; // 0x2(0x1), Mask(0x80)
	uint8_t bOverride_BlueCorrection : 1; // 0x3(0x1), Mask(0x1)
	uint8_t bOverride_DarknessCorrection : 1; // 0x3(0x1), Mask(0x2)
	uint8_t bOverride_ExpandGamut : 1; // 0x3(0x1), Mask(0x4)
	uint8_t bOverride_FilmWhitePoint : 1; // 0x3(0x1), Mask(0x8)
	uint8_t bOverride_FilmSaturation : 1; // 0x3(0x1), Mask(0x10)
	uint8_t bOverride_FilmChannelMixerRed : 1; // 0x3(0x1), Mask(0x20)
	uint8_t bOverride_FilmChannelMixerGreen : 1; // 0x3(0x1), Mask(0x40)
	uint8_t bOverride_FilmChannelMixerBlue : 1; // 0x3(0x1), Mask(0x80)
	uint8_t bOverride_FilmContrast : 1; // 0x4(0x1), Mask(0x1)
	uint8_t bOverride_FilmDynamicRange : 1; // 0x4(0x1), Mask(0x2)
	uint8_t bOverride_FilmHealAmount : 1; // 0x4(0x1), Mask(0x4)
	uint8_t bOverride_FilmToeAmount : 1; // 0x4(0x1), Mask(0x8)
	uint8_t bOverride_FilmShadowTint : 1; // 0x4(0x1), Mask(0x10)
	uint8_t bOverride_FilmShadowTintBlend : 1; // 0x4(0x1), Mask(0x20)
	uint8_t bOverride_FilmShadowTintAmount : 1; // 0x4(0x1), Mask(0x40)
	uint8_t bOverride_FilmSlope : 1; // 0x4(0x1), Mask(0x80)
	uint8_t bOverride_FilmToe : 1; // 0x5(0x1), Mask(0x1)
	uint8_t bOverride_FilmShoulder : 1; // 0x5(0x1), Mask(0x2)
	uint8_t bOverride_FilmBlackClip : 1; // 0x5(0x1), Mask(0x4)
	uint8_t bOverride_FilmWhiteClip : 1; // 0x5(0x1), Mask(0x8)
	uint8_t bOverride_Mobile_ACES_A : 1; // 0x5(0x1), Mask(0x10)
	uint8_t bOverride_Mobile_ACES_B : 1; // 0x5(0x1), Mask(0x20)
	uint8_t bOverride_Mobile_ACES_C : 1; // 0x5(0x1), Mask(0x40)
	uint8_t bOverride_Mobile_ACES_D : 1; // 0x5(0x1), Mask(0x80)
	uint8_t bOverride_Mobile_ACES_E : 1; // 0x6(0x1), Mask(0x1)
	uint8_t bOverride_Mobile_LDR_ACES_A : 1; // 0x6(0x1), Mask(0x2)
	uint8_t bOverride_Mobile_LDR_ACES_B : 1; // 0x6(0x1), Mask(0x4)
	uint8_t bOverride_Mobile_LDR_ACES_C : 1; // 0x6(0x1), Mask(0x8)
	uint8_t bOverride_Mobile_LDR_ACES_D : 1; // 0x6(0x1), Mask(0x10)
	uint8_t bOverride_Mobile_LDR_ACES_E : 1; // 0x6(0x1), Mask(0x20)
	uint8_t bOverride_Mobile_CG_Exposure : 1; // 0x6(0x1), Mask(0x40)
	uint8_t bOverride_Mobile_CG_HdrScale : 1; // 0x6(0x1), Mask(0x80)
	uint8_t bOverride_Mobile_CG_MasterSaturation : 1; // 0x7(0x1), Mask(0x1)
	uint8_t bOverride_Mobile_CG_MasterTint : 1; // 0x7(0x1), Mask(0x2)
	uint8_t bOverride_Mobile_CG_Saturation_K0 : 1; // 0x7(0x1), Mask(0x4)
	uint8_t bOverride_Mobile_CG_Exposure_K0 : 1; // 0x7(0x1), Mask(0x8)
	uint8_t bOverride_Mobile_CG_Tint_K0 : 1; // 0x7(0x1), Mask(0x10)
	uint8_t bOverride_Mobile_CG_Saturation_K1 : 1; // 0x7(0x1), Mask(0x20)
	uint8_t bOverride_Mobile_CG_Exposure_K1 : 1; // 0x7(0x1), Mask(0x40)
	uint8_t bOverride_Mobile_CG_Tint_K1 : 1; // 0x7(0x1), Mask(0x80)
	uint8_t bOverride_Mobile_CG_Saturation_K2 : 1; // 0x8(0x1), Mask(0x1)
	uint8_t bOverride_Mobile_CG_Exposure_K2 : 1; // 0x8(0x1), Mask(0x2)
	uint8_t bOverride_Mobile_CG_Tint_K2 : 1; // 0x8(0x1), Mask(0x4)
	uint8_t bOverride_MobileColorGradingLUT : 1; // 0x8(0x1), Mask(0x8)
	uint8_t bOverride_MobileColorGradingLUTWeight : 1; // 0x8(0x1), Mask(0x10)
	uint8_t bOverride_SceneColorTint : 1; // 0x8(0x1), Mask(0x20)
	uint8_t bOverride_SceneFringeIntensity : 1; // 0x8(0x1), Mask(0x40)
	uint8_t bOverride_ChromaticAberrationStartOffset : 1; // 0x8(0x1), Mask(0x80)
	uint8_t bOverride_ChromaticAberrationSCaleR : 1; // 0x9(0x1), Mask(0x1)
	uint8_t bOverride_ChromaticAberrationSCaleG : 1; // 0x9(0x1), Mask(0x2)
	uint8_t bOverride_AmbientCubemapTint : 1; // 0x9(0x1), Mask(0x4)
	uint8_t bOverride_AmbientCubemapIntensity : 1; // 0x9(0x1), Mask(0x8)
	uint8_t bOverride_BloomMethod : 1; // 0x9(0x1), Mask(0x10)
	uint8_t bOverride_PPBlurMethod : 1; // 0x9(0x1), Mask(0x20)
	uint8_t bOverride_PPEdgeDetectMethod : 1; // 0x9(0x1), Mask(0x40)
	uint8_t bOverride_BloomIntensity : 1; // 0x9(0x1), Mask(0x80)
	uint8_t bOverride_BloomMaxLuminance : 1; // 0xA(0x1), Mask(0x1)
	uint8_t bOverride_MobileBloomMaxLuminance : 1; // 0xA(0x1), Mask(0x2)
	uint8_t bOverride_BloomThreshold : 1; // 0xA(0x1), Mask(0x4)
	uint8_t bOverride_Bloom1Tint : 1; // 0xA(0x1), Mask(0x8)
	uint8_t bOverride_Bloom1Size : 1; // 0xA(0x1), Mask(0x10)
	uint8_t bOverride_Bloom2Size : 1; // 0xA(0x1), Mask(0x20)
	uint8_t bOverride_Bloom2Tint : 1; // 0xA(0x1), Mask(0x40)
	uint8_t bOverride_Bloom3Tint : 1; // 0xA(0x1), Mask(0x80)
	uint8_t bOverride_Bloom3Size : 1; // 0xB(0x1), Mask(0x1)
	uint8_t bOverride_Bloom4Tint : 1; // 0xB(0x1), Mask(0x2)
	uint8_t bOverride_Bloom4Size : 1; // 0xB(0x1), Mask(0x4)
	uint8_t bOverride_Bloom5Tint : 1; // 0xB(0x1), Mask(0x8)
	uint8_t bOverride_Bloom5Size : 1; // 0xB(0x1), Mask(0x10)
	uint8_t bOverride_Bloom6Tint : 1; // 0xB(0x1), Mask(0x20)
	uint8_t bOverride_Bloom6Size : 1; // 0xB(0x1), Mask(0x40)
	uint8_t bOverride_BloomSizeScale : 1; // 0xB(0x1), Mask(0x80)
	uint8_t bOverride_MobileBloomTint : 1; // 0xC(0x1), Mask(0x1)
	uint8_t bOverride_MobileBloomThreshold : 1; // 0xC(0x1), Mask(0x2)
	uint8_t bOverride_BloomConvolutionTexture : 1; // 0xC(0x1), Mask(0x4)
	uint8_t bOverride_BloomConvolutionSize : 1; // 0xC(0x1), Mask(0x8)
	uint8_t bOverride_BloomConvolutionCenterUV : 1; // 0xC(0x1), Mask(0x10)
	uint8_t bOverride_BloomConvolutionPreFilter : 1; // 0xC(0x1), Mask(0x20)
	uint8_t bOverride_BloomConvolutionPreFilterMin : 1; // 0xC(0x1), Mask(0x40)
	uint8_t bOverride_BloomConvolutionPreFilterMax : 1; // 0xC(0x1), Mask(0x80)
	uint8_t bOverride_BloomConvolutionPreFilterMult : 1; // 0xD(0x1), Mask(0x1)
	uint8_t bOverride_BloomConvolutionBufferScale : 1; // 0xD(0x1), Mask(0x2)
	uint8_t bOverride_BloomDirtMaskIntensity : 1; // 0xD(0x1), Mask(0x4)
	uint8_t bOverride_BloomDirtMaskTint : 1; // 0xD(0x1), Mask(0x8)
	uint8_t bOverride_BloomDirtMask : 1; // 0xD(0x1), Mask(0x10)
	uint8_t bOverride_CameraShutterSpeed : 1; // 0xD(0x1), Mask(0x20)
	uint8_t bOverride_CameraISO : 1; // 0xD(0x1), Mask(0x40)
	uint8_t bOverride_AutoExposureMethod : 1; // 0xD(0x1), Mask(0x80)
	uint8_t bOverride_AutoExposureLowPercent : 1; // 0xE(0x1), Mask(0x1)
	uint8_t bOverride_AutoExposureHighPercent : 1; // 0xE(0x1), Mask(0x2)
	uint8_t bOverride_AutoExposureMinBrightness : 1; // 0xE(0x1), Mask(0x4)
	uint8_t bOverride_AutoExposureMaxBrightness : 1; // 0xE(0x1), Mask(0x8)
	uint8_t bOverride_AutoExposureCalibrationConstant : 1; // 0xE(0x1), Mask(0x10)
	uint8_t bOverride_AutoExposureSpeedUp : 1; // 0xE(0x1), Mask(0x20)
	uint8_t bOverride_AutoExposureSpeedDown : 1; // 0xE(0x1), Mask(0x40)
	uint8_t bOverride_AutoExposureBias : 1; // 0xE(0x1), Mask(0x80)
	uint8_t bOverride_AutoExposureBiasCurve : 1; // 0xF(0x1), Mask(0x1)
	uint8_t bOverride_AutoExposureMeterMask : 1; // 0xF(0x1), Mask(0x2)
	uint8_t bOverride_AutoExposureApplyPhysicalCameraExposure : 1; // 0xF(0x1), Mask(0x4)
	uint8_t bOverride_HistogramLogMin : 1; // 0xF(0x1), Mask(0x8)
	uint8_t bOverride_HistogramLogMax : 1; // 0xF(0x1), Mask(0x10)
	uint8_t bOverride_LocalExposureHighlightContrastScale : 1; // 0xF(0x1), Mask(0x20)
	uint8_t bOverride_LocalExposureShadowContrastScale : 1; // 0xF(0x1), Mask(0x40)
	uint8_t bOverride_LocalExposureHighlightContrastCurve : 1; // 0xF(0x1), Mask(0x80)
	uint8_t bOverride_LocalExposureShadowContrastCurve : 1; // 0x10(0x1), Mask(0x1)
	uint8_t bOverride_LocalExposureHighlightThreshold : 1; // 0x10(0x1), Mask(0x2)
	uint8_t bOverride_LocalExposureShadowThreshold : 1; // 0x10(0x1), Mask(0x4)
	uint8_t bOverride_LocalExposureDetailStrength : 1; // 0x10(0x1), Mask(0x8)
	uint8_t bOverride_LocalExposureBlurredLuminanceBlend : 1; // 0x10(0x1), Mask(0x10)
	uint8_t bOverride_LocalExposureBlurredLuminanceKernelSizePercent : 1; // 0x10(0x1), Mask(0x20)
	uint8_t bOverride_LocalExposureMiddleGreyBias : 1; // 0x10(0x1), Mask(0x40)
	uint8_t bOverride_MiddleGreyBiasCompensation : 1; // 0x10(0x1), Mask(0x80)
	uint8_t bOverride_LensFlareMethod : 1; // 0x11(0x1), Mask(0x1)
	uint8_t bOverride_LensFlareIntensity : 1; // 0x11(0x1), Mask(0x2)
	uint8_t bOverride_LensFlareTint : 1; // 0x11(0x1), Mask(0x4)
	uint8_t bOverride_LensFlareBokehSize : 1; // 0x11(0x1), Mask(0x8)
	uint8_t bOverride_LensFlareThreshold : 1; // 0x11(0x1), Mask(0x10)
	uint8_t bOverride_LensFlareBokehShape : 1; // 0x11(0x1), Mask(0x20)
	uint8_t bOverride_LensFlareLineWidth : 1; // 0x11(0x1), Mask(0x40)
	uint8_t bOverride_LensFlareLineLength : 1; // 0x11(0x1), Mask(0x80)
	uint8_t bOverride_LensFlareLineIntensity : 1; // 0x12(0x1), Mask(0x1)
	uint8_t bOverride_LensFlareLineTint : 1; // 0x12(0x1), Mask(0x2)
	uint8_t bOverride_LensFlareHalo : 1; // 0x12(0x1), Mask(0x4)
	uint8_t bOverride_LensFlareHaloScaleMin : 1; // 0x12(0x1), Mask(0x8)
	uint8_t bOverride_LensFlareHaloScaleMax : 1; // 0x12(0x1), Mask(0x10)
	uint8_t bOverride_LensFlareTints_1 : 1; // 0x12(0x1), Mask(0x20)
	uint8_t bOverride_LensFlareLocation_1 : 1; // 0x12(0x1), Mask(0x40)
	uint8_t bOverride_LensFlareTints_2 : 1; // 0x12(0x1), Mask(0x80)
	uint8_t bOverride_LensFlareLocation_2 : 1; // 0x13(0x1), Mask(0x1)
	uint8_t bOverride_LensFlareTints_3 : 1; // 0x13(0x1), Mask(0x2)
	uint8_t bOverride_LensFlareLocation_3 : 1; // 0x13(0x1), Mask(0x4)
	uint8_t bOverride_LensFlareTints_4 : 1; // 0x13(0x1), Mask(0x8)
	uint8_t bOverride_LensFlareLocation_4 : 1; // 0x13(0x1), Mask(0x10)
	uint8_t bOverride_LensFlareTints_5 : 1; // 0x13(0x1), Mask(0x20)
	uint8_t bOverride_LensFlareLocation_5 : 1; // 0x13(0x1), Mask(0x40)
	uint8_t bOverride_LensFlareTints_6 : 1; // 0x13(0x1), Mask(0x80)
	uint8_t bOverride_LensFlareTints_7 : 1; // 0x14(0x1), Mask(0x1)
	uint8_t bOverride_LensFlareTints_8 : 1; // 0x14(0x1), Mask(0x2)
	uint8_t bOverride_bUseMobileLensFlare : 1; // 0x14(0x1), Mask(0x4)
	uint8_t bOverride_MobileLensFlareIntensity : 1; // 0x14(0x1), Mask(0x8)
	uint8_t bOverride_MobileLensFlareTint : 1; // 0x14(0x1), Mask(0x10)
	uint8_t bOverride_MobileLensFlareBokehSize : 1; // 0x14(0x1), Mask(0x20)
	uint8_t bOverride_LensFlareRandomSeed : 1; // 0x14(0x1), Mask(0x40)
	uint8_t bOverride_LensFlareFlareCount : 1; // 0x14(0x1), Mask(0x80)
	uint8_t bOverride_LensFlareMinPositionScale : 1; // 0x15(0x1), Mask(0x1)
	uint8_t bOverride_LensFlareMaxPositionScale : 1; // 0x15(0x1), Mask(0x2)
	uint8_t bOverride_MobileLensFlareBokehShape : 1; // 0x15(0x1), Mask(0x4)
	uint8_t bOverride_LensFlareIntensity2 : 1; // 0x15(0x1), Mask(0x8)
	uint8_t bOverride_LensFlareTint2 : 1; // 0x15(0x1), Mask(0x10)
	uint8_t bOverride_LensFlareBokehSize2 : 1; // 0x15(0x1), Mask(0x20)
	uint8_t bOverride_LensFlareRandomSeed2 : 1; // 0x15(0x1), Mask(0x40)
	uint8_t bOverride_LensFlareFlareCount2 : 1; // 0x15(0x1), Mask(0x80)
	uint8_t bOverride_LensFlareMinPositionScale2 : 1; // 0x16(0x1), Mask(0x1)
	uint8_t bOverride_LensFlareMaxPositionScale2 : 1; // 0x16(0x1), Mask(0x2)
	uint8_t bOverride_LensFlareBokehShape2 : 1; // 0x16(0x1), Mask(0x4)
	uint8_t bOverride_LensFlareRayTint : 1; // 0x16(0x1), Mask(0x8)
	uint8_t bOverride_LensFlareRaySliceCount : 1; // 0x16(0x1), Mask(0x10)
	uint8_t bOverride_LensFlareRayThreshold : 1; // 0x16(0x1), Mask(0x20)
	uint8_t bOverride_LensFlareRayRandomSeed : 1; // 0x16(0x1), Mask(0x40)
	uint8_t bOverride_LensFlareRaySize : 1; // 0x16(0x1), Mask(0x80)
	uint8_t bOverride_LensFlareRayWidth : 1; // 0x17(0x1), Mask(0x1)
	uint8_t bOverride_LensFlareRayIntensity : 1; // 0x17(0x1), Mask(0x2)
	uint8_t bOverride_VignetteIntensity : 1; // 0x17(0x1), Mask(0x4)
	uint8_t bOverride_GrainIntensity : 1; // 0x17(0x1), Mask(0x8)
	uint8_t bOverride_GrainJitter : 1; // 0x17(0x1), Mask(0x10)
	uint8_t bOverride_AmbientOcclusionIntensity : 1; // 0x17(0x1), Mask(0x20)
	uint8_t bOverride_AmbientOcclusionStaticFraction : 1; // 0x17(0x1), Mask(0x40)
	uint8_t bOverride_AmbientOcclusionRadius : 1; // 0x17(0x1), Mask(0x80)
	uint8_t bOverride_AmbientOcclusionFadeDistance : 1; // 0x18(0x1), Mask(0x1)
	uint8_t bOverride_AmbientOcclusionFadeRadius : 1; // 0x18(0x1), Mask(0x2)
	uint8_t bOverride_AmbientOcclusionDistance : 1; // 0x18(0x1), Mask(0x4)
	uint8_t bOverride_AmbientOcclusionRadiusInWS : 1; // 0x18(0x1), Mask(0x8)
	uint8_t bOverride_AmbientOcclusionPower : 1; // 0x18(0x1), Mask(0x10)
	uint8_t bOverride_AmbientOcclusionBias : 1; // 0x18(0x1), Mask(0x20)
	uint8_t bOverride_AmbientOcclusionQuality : 1; // 0x18(0x1), Mask(0x40)
	uint8_t bOverride_AmbientOcclusionMipBlend : 1; // 0x18(0x1), Mask(0x80)
	uint8_t bOverride_AmbientOcclusionMipScale : 1; // 0x19(0x1), Mask(0x1)
	uint8_t bOverride_AmbientOcclusionMipThreshold : 1; // 0x19(0x1), Mask(0x2)
	uint8_t bOverride_AmbientOcclusionTemporalBlendWeight : 1; // 0x19(0x1), Mask(0x4)
	uint8_t bOverride_SSRTAOThreshold : 1; // 0x19(0x1), Mask(0x8)
	uint8_t bOverride_SSRTAOTwoSidedFoliageThreshold : 1; // 0x19(0x1), Mask(0x10)
	uint8_t bOverride_SSRTAOBentNormalThreshold : 1; // 0x19(0x1), Mask(0x20)
	uint8_t bOverride_SSRTAONoiseStep : 1; // 0x19(0x1), Mask(0x40)
	uint8_t bOverride_SSRTAOStepSize : 1; // 0x19(0x1), Mask(0x80)
	uint8_t bOverride_SSRTAOFirstPersonStepSize : 1; // 0x1A(0x1), Mask(0x1)
	uint8_t bOverride_SSRTAOFoliageStepSize : 1; // 0x1A(0x1), Mask(0x2)
	uint8_t bOverride_SSRTAOFoliageNormalAdjust : 1; // 0x1A(0x1), Mask(0x4)
	uint8_t bOverride_SSRTAODenoiseTemporalBlendWeight : 1; // 0x1A(0x1), Mask(0x8)
	uint8_t bOverride_SSRTAODenoiseTemporalMomentBlendWeight : 1; // 0x1A(0x1), Mask(0x10)
	uint8_t bOverride_SSRTAODenoiseTemporalNormalTolerance : 1; // 0x1A(0x1), Mask(0x20)
	uint8_t bOverride_SSRTAODenoiseTemporalDepthTolerance : 1; // 0x1A(0x1), Mask(0x40)
	uint8_t bOverride_SSRTAODenoiseTemporalHistoryLength : 1; // 0x1A(0x1), Mask(0x80)
	uint8_t bOverride_SSRTAODenoiseSpatialAOSigma : 1; // 0x1B(0x1), Mask(0x1)
	uint8_t bOverride_SSRTAODenoiseSpatialDepthSigma : 1; // 0x1B(0x1), Mask(0x2)
	uint8_t bOverride_SSRTAODenoiseSpatialNormalSigma : 1; // 0x1B(0x1), Mask(0x4)
	uint8_t bOverride_SSRTAODenoiseATrousIteration : 1; // 0x1B(0x1), Mask(0x8)
	uint8_t bOverride_SSRTAODenoiseATrousCopyIterationIndex : 1; // 0x1B(0x1), Mask(0x10)
	uint8_t bOverride_SSRTAODenoiseATrousIterationStartKernelStep : 1; // 0x1B(0x1), Mask(0x20)
	uint8_t bOverride_SSRTAODenoiseATrousAOSigma : 1; // 0x1B(0x1), Mask(0x40)
	uint8_t bOverride_SSRTAODenoiseATrousDepthSigma : 1; // 0x1B(0x1), Mask(0x80)
	uint8_t bOverride_SSRTAODenoiseATrousDepthWeightCutoff : 1; // 0x1C(0x1), Mask(0x1)
	uint8_t bOverride_SSRTAODenoiseATrousNormalSigma : 1; // 0x1C(0x1), Mask(0x2)
	uint8_t bOverride_SSRTAODenoiseATrousMinVarianceToDenoise : 1; // 0x1C(0x1), Mask(0x4)
	uint8_t bOverride_RayTracingAO : 1; // 0x1C(0x1), Mask(0x8)
	uint8_t bOverride_RayTracingAOSamplesPerPixel : 1; // 0x1C(0x1), Mask(0x10)
	uint8_t bOverride_LPVIntensity : 1; // 0x1C(0x1), Mask(0x20)
	uint8_t bOverride_LPVDirectionalOcclusionIntensity : 1; // 0x1C(0x1), Mask(0x40)
	uint8_t bOverride_LPVDirectionalOcclusionRadius : 1; // 0x1C(0x1), Mask(0x80)
	uint8_t bOverride_LPVDiffuseOcclusionExponent : 1; // 0x1D(0x1), Mask(0x1)
	uint8_t bOverride_LPVSpecularOcclusionExponent : 1; // 0x1D(0x1), Mask(0x2)
	uint8_t bOverride_LPVDiffuseOcclusionIntensity : 1; // 0x1D(0x1), Mask(0x4)
	uint8_t bOverride_LPVSpecularOcclusionIntensity : 1; // 0x1D(0x1), Mask(0x8)
	uint8_t bOverride_LPVSize : 1; // 0x1D(0x1), Mask(0x10)
	uint8_t bOverride_LPVSecondaryOcclusionIntensity : 1; // 0x1D(0x1), Mask(0x20)
	uint8_t bOverride_LPVSecondaryBounceIntensity : 1; // 0x1D(0x1), Mask(0x40)
	uint8_t bOverride_LPVGeometryVolumeBias : 1; // 0x1D(0x1), Mask(0x80)
	uint8_t bOverride_LPVVplInjectionBias : 1; // 0x1E(0x1), Mask(0x1)
	uint8_t bOverride_LPVEmissiveInjectionIntensity : 1; // 0x1E(0x1), Mask(0x2)
	uint8_t bOverride_LPVFadeRange : 1; // 0x1E(0x1), Mask(0x4)
	uint8_t bOverride_LPVDirectionalOcclusionFadeRange : 1; // 0x1E(0x1), Mask(0x8)
	uint8_t bOverride_IndirectLightingColor : 1; // 0x1E(0x1), Mask(0x10)
	uint8_t bOverride_IndirectLightingIntensity : 1; // 0x1E(0x1), Mask(0x20)
	uint8_t bOverride_ColorGradingIntensity : 1; // 0x1E(0x1), Mask(0x40)
	uint8_t bOverride_ColorGradingLUT : 1; // 0x1E(0x1), Mask(0x80)
	uint8_t bOverride_UseACEScc : 1; // 0x1F(0x1), Mask(0x1)
	uint8_t bOverride_PCHighPrecisionLMT : 1; // 0x1F(0x1), Mask(0x2)
	uint8_t bOverride_LMT_LUTIntensity : 1; // 0x1F(0x1), Mask(0x4)
	uint8_t bOverride_LMT_LUT : 1; // 0x1F(0x1), Mask(0x8)
	uint8_t bOverride_DepthOfFieldFocalDistance : 1; // 0x1F(0x1), Mask(0x10)
	uint8_t bOverride_MobileDepthOfFieldFocalDistance : 1; // 0x1F(0x1), Mask(0x20)
	uint8_t bOverride_DepthOfFieldFstop : 1; // 0x1F(0x1), Mask(0x40)
	uint8_t bOverride_DepthOfFieldMinFstop : 1; // 0x1F(0x1), Mask(0x80)
	uint8_t bOverride_DepthOfFieldBladeCount : 1; // 0x20(0x1), Mask(0x1)
	uint8_t bOverride_DepthOfFieldSensorWidth : 1; // 0x20(0x1), Mask(0x2)
	uint8_t bOverride_DepthOfFieldSqueezeFactor : 1; // 0x20(0x1), Mask(0x4)
	uint8_t bOverride_DepthOfFieldDepthBlurRadius : 1; // 0x20(0x1), Mask(0x8)
	uint8_t bOverride_DepthOfFieldDepthBlurAmount : 1; // 0x20(0x1), Mask(0x10)
	uint8_t bOverride_DepthOfFieldFocalRegion : 1; // 0x20(0x1), Mask(0x20)
	uint8_t bOverride_DepthOfFieldNearTransitionRegion : 1; // 0x20(0x1), Mask(0x40)
	uint8_t bOverride_DepthOfFieldFarTransitionRegion : 1; // 0x20(0x1), Mask(0x80)
	uint8_t bOverride_DepthOfFieldScale : 1; // 0x21(0x1), Mask(0x1)
	uint8_t bOverride_DepthOfFieldNearBlurSize : 1; // 0x21(0x1), Mask(0x2)
	uint8_t bOverride_DepthOfFieldFarBlurSize : 1; // 0x21(0x1), Mask(0x4)
	uint8_t bOverride_MobileHQGaussian : 1; // 0x21(0x1), Mask(0x8)
	uint8_t bOverride_MobileDefaultUEHQGaussian : 1; // 0x21(0x1), Mask(0x10)
	uint8_t bOverride_MobileRadialBlur : 1; // 0x21(0x1), Mask(0x20)
	uint8_t bOverride_MobileGhostEffect : 1; // 0x21(0x1), Mask(0x40)
	uint8_t bOverride_DepthOfFieldOcclusion : 1; // 0x21(0x1), Mask(0x80)
	uint8_t bOverride_DepthOfFieldSkyFocusDistance : 1; // 0x22(0x1), Mask(0x1)
	uint8_t bOverride_DepthOfFieldVignetteSize : 1; // 0x22(0x1), Mask(0x2)
	uint8_t bOverride_MotionBlurAmount : 1; // 0x22(0x1), Mask(0x4)
	uint8_t bOverride_MotionBlurMax : 1; // 0x22(0x1), Mask(0x8)
	uint8_t bOverride_MotionBlurTargetFPS : 1; // 0x22(0x1), Mask(0x10)
	uint8_t bOverride_MotionBlurPerObjectSize : 1; // 0x22(0x1), Mask(0x20)
	uint8_t bOverride_EnableMobileMotionBlur : 1; // 0x22(0x1), Mask(0x40)
	uint8_t bOverride_MobileMotionBlurMaxSampleCount : 1; // 0x22(0x1), Mask(0x80)
	uint8_t bOverride_MobileMotionBlurVelocityScale : 1; // 0x23(0x1), Mask(0x1)
	uint8_t bOverride_MobileMotionBlurMaxVelocity : 1; // 0x23(0x1), Mask(0x2)
	uint8_t bOverride_MobileMotionBlurUseAABBMask : 1; // 0x23(0x1), Mask(0x4)
	uint8_t bOverride_MobileMotionBlurDepthMask : 1; // 0x23(0x1), Mask(0x8)
	uint8_t bOverride_MobileMotionBlurDepthMaskTransition : 1; // 0x23(0x1), Mask(0x10)
	uint8_t bOverride_MobileMotionBlurAABBMaskCenter : 1; // 0x23(0x1), Mask(0x20)
	uint8_t bOverride_MobileMotionBlurAABBMaskExtent : 1; // 0x23(0x1), Mask(0x40)
	uint8_t bOverride_MobileMotionBlurAABBMaskTransition : 1; // 0x23(0x1), Mask(0x80)
	uint8_t bOverride_MobileMotionBlurDisplayIntensity : 1; // 0x24(0x1), Mask(0x1)
	uint8_t bOverride_MobileMotionBlurUseVSVelocity : 1; // 0x24(0x1), Mask(0x2)
	uint8_t bOverride_MobileMotionBlurDownSampleFactor : 1; // 0x24(0x1), Mask(0x4)
	uint8_t bOverride_MobileMotionBlurAssumedDepth : 1; // 0x24(0x1), Mask(0x8)
	uint8_t bOverride_ScreenPercentage : 1; // 0x24(0x1), Mask(0x10)
	uint8_t bOverride_ScreenSpaceReflectionIntensity : 1; // 0x24(0x1), Mask(0x20)
	uint8_t bOverride_ScreenSpaceReflectionQuality : 1; // 0x24(0x1), Mask(0x40)
	uint8_t bOverride_ScreenSpaceReflectionMaxRoughness : 1; // 0x24(0x1), Mask(0x80)
	uint8_t bOverride_ScreenSpaceReflectionRoughnessScale : 1; // 0x25(0x1), Mask(0x1)
	uint8_t bOverride_ScreenRainDropBlurStrength : 1; // 0x25(0x1), Mask(0x2)
	uint8_t bOverride_ScreenRainDropBlurCullRadius : 1; // 0x25(0x1), Mask(0x4)
	uint8_t bOverride_ScreenRainDropBlurStaticSplit : 1; // 0x25(0x1), Mask(0x8)
	uint8_t bOverride_ScreenRainDropBlurStaticDropDensity : 1; // 0x25(0x1), Mask(0x10)
	uint8_t bOverride_ScreenRainDropBlurDynamicXSplit : 1; // 0x25(0x1), Mask(0x20)
	uint8_t bOverride_ScreenRainDropBlurDynamicYSplit : 1; // 0x25(0x1), Mask(0x40)
	uint8_t bOverride_ScreenRainDropBlurDynamicDropDensity : 1; // 0x25(0x1), Mask(0x80)
	uint8_t bOverride_ScreenRainDropBlurTest : 1; // 0x26(0x1), Mask(0x1)
	uint8_t bOverride_ReflectionsType : 1; // 0x26(0x1), Mask(0x2)
	uint8_t bOverride_RayTracingReflectionsMaxRoughness : 1; // 0x26(0x1), Mask(0x4)
	uint8_t bOverride_RayTracingReflectionsMaxBounces : 1; // 0x26(0x1), Mask(0x8)
	uint8_t bOverride_RayTracingReflectionsSamplesPerPixel : 1; // 0x26(0x1), Mask(0x10)
	uint8_t bOverride_RayTracingReflectionsShadows : 1; // 0x26(0x1), Mask(0x20)
	uint8_t bOverride_RayTracingReflectionsTranslucency : 1; // 0x26(0x1), Mask(0x40)
	uint8_t bOverride_TranslucencyType : 1; // 0x26(0x1), Mask(0x80)
	uint8_t bOverride_RayTracingTranslucencyMaxRoughness : 1; // 0x27(0x1), Mask(0x1)
	uint8_t bOverride_RayTracingTranslucencyMinReflectionThroughput : 1; // 0x27(0x1), Mask(0x2)
	uint8_t bOverride_RayTracingTranslucencyMinRefractionThroughput : 1; // 0x27(0x1), Mask(0x4)
	uint8_t bOverride_RayTracingTranslucencyEnableAbsorption : 1; // 0x27(0x1), Mask(0x8)
	uint8_t bOverride_RayTracingTranslucencyRefractionRays : 1; // 0x27(0x1), Mask(0x10)
	uint8_t bOverride_RayTracingTranslucencySamplesPerPixel : 1; // 0x27(0x1), Mask(0x20)
	uint8_t bOverride_RayTracingTranslucencyShadows : 1; // 0x27(0x1), Mask(0x40)
	uint8_t bOverride_RayTracingTranslucencyRefraction : 1; // 0x27(0x1), Mask(0x80)
	uint8_t bOverride_RayTracingGI : 1; // 0x28(0x1), Mask(0x1)
	uint8_t bOverride_RayTracingGIMaxBounces : 1; // 0x28(0x1), Mask(0x2)
	uint8_t bOverride_RayTracingGISamplesPerPixel : 1; // 0x28(0x1), Mask(0x4)
	uint8_t bOverride_GIDenoiseApplyAO : 1; // 0x28(0x1), Mask(0x8)
	uint8_t bOverride_GIDenoiseEnableTemporal : 1; // 0x28(0x1), Mask(0x10)
	uint8_t bOverride_GIDenoiseTemporalBlendWeight : 1; // 0x28(0x1), Mask(0x20)
	uint8_t bOverride_GIDenoiseTemporalMomentBlendWeight : 1; // 0x28(0x1), Mask(0x40)
	uint8_t bOverride_GIDenoiseTemporalNormalTolerance : 1; // 0x28(0x1), Mask(0x80)
	uint8_t bOverride_GIDenoiseTemporalDepthTolerance : 1; // 0x29(0x1), Mask(0x1)
	uint8_t bOverride_GIDenoiseColorClamp : 1; // 0x29(0x1), Mask(0x2)
	uint8_t bOverride_GIDenoiseHistoryLength : 1; // 0x29(0x1), Mask(0x4)
	uint8_t bOverride_GIDenoiseEnableATrous : 1; // 0x29(0x1), Mask(0x8)
	uint8_t bOverride_GIDenoiseATrousIteration : 1; // 0x29(0x1), Mask(0x10)
	uint8_t bOverride_GIDenoiseATrousCopyIteration : 1; // 0x29(0x1), Mask(0x20)
	uint8_t bOverride_GIDenoiseATrousSampleDepthAsNormal : 1; // 0x29(0x1), Mask(0x40)
	uint8_t bOverride_GIDenoiseATrousFilterWidth : 1; // 0x29(0x1), Mask(0x80)
	uint8_t bOverride_GIDenoiseATrousVarianceGain : 1; // 0x2A(0x1), Mask(0x1)
	uint8_t bOverride_GIDenoiseATrousNormalTolerance : 1; // 0x2A(0x1), Mask(0x2)
	uint8_t bOverride_GIDenoiseATrousDepthTolerance : 1; // 0x2A(0x1), Mask(0x4)
	uint8_t bOverride_GIDenoiseATrousAOTolerance : 1; // 0x2A(0x1), Mask(0x8)
	uint8_t bOverride_GIDenoiseSpatialFilterType : 1; // 0x2A(0x1), Mask(0x10)
	uint8_t bOverride_GIDenoiseType : 1; // 0x2A(0x1), Mask(0x20)
	uint8_t bOverride_GIDenoiseDebugType : 1; // 0x2A(0x1), Mask(0x40)
	uint8_t bOverride_PathTracingMaxBounces : 1; // 0x2A(0x1), Mask(0x80)
	uint8_t bOverride_PathTracingSamplesPerPixel : 1; // 0x2B(0x1), Mask(0x1)
	uint8_t bOverride_RayTracingCausticsEnable : 1; // 0x2B(0x1), Mask(0x2)
	uint8_t bOverride_RayTracingCausticsResolution : 1; // 0x2B(0x1), Mask(0x4)
	uint8_t bOverride_RayTracingCausticsIntensity : 1; // 0x2B(0x1), Mask(0x8)
	uint8_t bOverride_RayTracingCausticsMaxIntensity : 1; // 0x2B(0x1), Mask(0x10)
	uint8_t bOverride_RayTracingCausticsMaxTraceDepth : 1; // 0x2B(0x1), Mask(0x20)
	uint8_t bOverride_RayTracingCausticsFinalCullColorThreshold : 1; // 0x2B(0x1), Mask(0x40)
	uint8_t bOverride_RayTracingCausticsMidCullColorThreshold : 1; // 0x2B(0x1), Mask(0x80)
	uint8_t bOverride_RayTracingCausticsTranslucentReflectionMode : 1; // 0x2C(0x1), Mask(0x1)
	uint8_t bOverride_RayTracingCausticsMaxScreenRadius : 1; // 0x2C(0x1), Mask(0x2)
	uint8_t bOverride_RayTracingCausticsBufferScale : 1; // 0x2C(0x1), Mask(0x4)
	uint8_t bOverride_RayTracingCausticsScatterDepthTolerance : 1; // 0x2C(0x1), Mask(0x8)
	uint8_t bOverride_RayTracingCausticsSplatSize : 1; // 0x2C(0x1), Mask(0x10)
	uint8_t bOverride_RayTracingCausticsEnableDispersion : 1; // 0x2C(0x1), Mask(0x20)
	uint8_t bOverride_RayTracingCausticsDispersionSamples : 1; // 0x2C(0x1), Mask(0x40)
	uint8_t bOverride_RayTracingCausticsAdaptivePhotonSize : 1; // 0x2C(0x1), Mask(0x80)
	uint8_t bOverride_RayTracingCausticsAdaptiveVarianceGain : 1; // 0x2D(0x1), Mask(0x1)
	uint8_t bOverride_RayTracingCausticsAdaptiveSmooth : 1; // 0x2D(0x1), Mask(0x2)
	uint8_t bOverride_RayTracingCausticsAdaptiveMaxSample : 1; // 0x2D(0x1), Mask(0x4)
	uint8_t bOverride_RayTracingCausticsAdaptiveUpdateSpeed : 1; // 0x2D(0x1), Mask(0x8)
	uint8_t bOverride_RayTracingCausticsEnableTemporalFilter : 1; // 0x2D(0x1), Mask(0x10)
	uint8_t bOverride_RayTracingCausticsJitter : 1; // 0x2D(0x1), Mask(0x20)
	uint8_t bOverride_RayTracingCausticsTemporalStrength : 1; // 0x2D(0x1), Mask(0x40)
	uint8_t bOverride_RayTracingCausticsTemporalColorTolerance : 1; // 0x2D(0x1), Mask(0x80)
	uint8_t bOverride_RayTracingCausticsDebugLightData : 1; // 0x2E(0x1), Mask(0x1)
	uint8_t bOverride_RayTracingCausticsDebugScreenData : 1; // 0x2E(0x1), Mask(0x2)
	uint8_t bOverride_RayTracingCausticsDebugMaxPixelValue : 1; // 0x2E(0x1), Mask(0x4)
	uint8_t bOverride_RayTracingCausticsDebugMapScale : 1; // 0x2E(0x1), Mask(0x8)
	uint8_t bOverride_RayTracingCausticsDebugMaxPhotonCount : 1; // 0x2E(0x1), Mask(0x10)
	uint8_t bOverride_RayTracingCausticsDebugMip : 1; // 0x2E(0x1), Mask(0x20)
	uint8_t bOverride_RayTracingWaterCausticsType : 1; // 0x2E(0x1), Mask(0x40)
	uint8_t bOverride_RayTracingWaterCausticsBufferScale : 1; // 0x2E(0x1), Mask(0x80)
	uint8_t bOverride_RayTracingWaterCausticsFollowCamera : 1; // 0x2F(0x1), Mask(0x1)
	uint8_t bOverride_RayTracingWaterCausticsLookAt : 1; // 0x2F(0x1), Mask(0x2)
	uint8_t bOverride_RayTracingWaterCausticsRange : 1; // 0x2F(0x1), Mask(0x4)
	uint8_t bOverride_RayTracingWaterCausticsColor : 1; // 0x2F(0x1), Mask(0x8)
	uint8_t bOverride_RayTracingWaterCausticsNumDenoisePasses : 1; // 0x2F(0x1), Mask(0x10)
	uint8_t bOverride_RayTracingWaterCausticsDispersionIntensity : 1; // 0x2F(0x1), Mask(0x20)
	uint8_t bOverride_RayTracingWaterCausticsDispersionOffset : 1; // 0x2F(0x1), Mask(0x40)
	uint8_t bOverride_RayTracingWaterCausticsReflectiveIntensity : 1; // 0x2F(0x1), Mask(0x80)
	uint8_t bOverride_RayTracingWaterCausticsReflectedRayTMax : 1; // 0x30(0x1), Mask(0x1)
	uint8_t bOverride_RayTracingWaterCausticsReflectedRayTMin : 1; // 0x30(0x1), Mask(0x2)
	uint8_t bOverride_RayTracingWaterCausticsRefractiveIntensity : 1; // 0x30(0x1), Mask(0x4)
	uint8_t bOverride_RayTracingWaterCausticsRefractedRayTMax : 1; // 0x30(0x1), Mask(0x8)
	uint8_t bOverride_RayTracingWaterCausticsRefractedRayTMin : 1; // 0x30(0x1), Mask(0x10)
	uint8_t bOverride_RayTracingWaterCausticsFresnelBaseReflectFraction : 1; // 0x30(0x1), Mask(0x20)
	uint8_t bOverride_RayTracingWaterCausticsReflectBackFaceCullingThreshold : 1; // 0x30(0x1), Mask(0x40)
	uint8_t bOverride_RayTracingWaterCausticsRefractBackFaceCullingThreshold : 1; // 0x30(0x1), Mask(0x80)
	EAutoExposureMethod AutoExposureMethod; // 0x31(0x1)
	uint8_t bMobileHQGaussian : 1; // 0x32(0x1), Mask(0x1)
	uint8_t bMobileDefaultUEHQGaussian : 1; // 0x32(0x1), Mask(0x2)
	uint8_t BitPad_0x32_2 : 6; // 0x32(0x1)
	EBloomMethod BloomMethod; // 0x33(0x1)
	EPPBlurMethod PPBlurMethod; // 0x34(0x1)
	EPPEdgeDetectMethod PPEdgeDetectMethod; // 0x35(0x1)
	uint8_t bMobileRadialBlur : 1; // 0x36(0x1), Mask(0x1)
	uint8_t BitPad_0x36_1 : 7; // 0x36(0x1)
	uint8_t Pad_0x37[0x1]; // 0x37(0x1)
	float mobileradialtint; // 0x38(0x4)
	float mobileradialstrength; // 0x3C(0x4)
	struct FVector2D mobileradialcenter; // 0x40(0x8)
	struct FVector2D mobileghostspeed; // 0x48(0x8)
	float mobileghostblurtint; // 0x50(0x4)
	uint8_t bMobileGhostEffect : 1; // 0x54(0x1), Mask(0x1)
	uint8_t BitPad_0x54_1 : 7; // 0x54(0x1)
	uint8_t Pad_0x55[0x3]; // 0x55(0x3)
	float WhiteTemp; // 0x58(0x4)
	float WhiteTint; // 0x5C(0x4)
	struct FVector4 ColorSaturation; // 0x60(0x10)
	struct FVector4 ColorContrast; // 0x70(0x10)
	struct FVector4 ColorGamma; // 0x80(0x10)
	struct FVector4 ColorGain; // 0x90(0x10)
	struct FVector4 ColorOffset; // 0xA0(0x10)
	struct FVector4 ColorSaturationShadows; // 0xB0(0x10)
	struct FVector4 ColorContrastShadows; // 0xC0(0x10)
	struct FVector4 ColorGammaShadows; // 0xD0(0x10)
	struct FVector4 ColorGainShadows; // 0xE0(0x10)
	struct FVector4 ColorOffsetShadows; // 0xF0(0x10)
	struct FVector4 ColorSaturationMidtones; // 0x100(0x10)
	struct FVector4 ColorContrastMidtones; // 0x110(0x10)
	struct FVector4 ColorGammaMidtones; // 0x120(0x10)
	struct FVector4 ColorGainMidtones; // 0x130(0x10)
	struct FVector4 ColorOffsetMidtones; // 0x140(0x10)
	struct FVector4 ColorSaturationHighlights; // 0x150(0x10)
	struct FVector4 ColorContrastHighlights; // 0x160(0x10)
	struct FVector4 ColorGammaHighlights; // 0x170(0x10)
	struct FVector4 ColorGainHighlights; // 0x180(0x10)
	struct FVector4 ColorOffsetHighlights; // 0x190(0x10)
	float ColorCorrectionHighlightsMin; // 0x1A0(0x4)
	float ColorCorrectionShadowsMax; // 0x1A4(0x4)
	float BlueCorrection; // 0x1A8(0x4)
	float DarknessCorrection; // 0x1AC(0x4)
	float ExpandGamut; // 0x1B0(0x4)
	float FilmSlope; // 0x1B4(0x4)
	float FilmToe; // 0x1B8(0x4)
	float FilmShoulder; // 0x1BC(0x4)
	float FilmBlackClip; // 0x1C0(0x4)
	float FilmWhiteClip; // 0x1C4(0x4)
	float Mobile_ACES_A; // 0x1C8(0x4)
	float Mobile_ACES_B; // 0x1CC(0x4)
	float Mobile_ACES_C; // 0x1D0(0x4)
	float Mobile_ACES_D; // 0x1D4(0x4)
	float Mobile_ACES_E; // 0x1D8(0x4)
	float Mobile_LDR_ACES_A; // 0x1DC(0x4)
	float Mobile_LDR_ACES_B; // 0x1E0(0x4)
	float Mobile_LDR_ACES_C; // 0x1E4(0x4)
	float Mobile_LDR_ACES_D; // 0x1E8(0x4)
	float Mobile_LDR_ACES_E; // 0x1EC(0x4)
	struct FLinearColor Mobile_CG_MasterTint; // 0x1F0(0x10)
	float Mobile_CG_MasterSaturation; // 0x200(0x4)
	float Mobile_CG_Exposure; // 0x204(0x4)
	float Mobile_CG_HdrScale; // 0x208(0x4)
	struct FLinearColor Mobile_CG_Tint_K0; // 0x20C(0x10)
	float Mobile_CG_Saturation_K0; // 0x21C(0x4)
	float Mobile_CG_Exposure_K0; // 0x220(0x4)
	struct FLinearColor Mobile_CG_Tint_K1; // 0x224(0x10)
	float Mobile_CG_Saturation_K1; // 0x234(0x4)
	float Mobile_CG_Exposure_K1; // 0x238(0x4)
	struct FLinearColor Mobile_CG_Tint_K2; // 0x23C(0x10)
	float Mobile_CG_Saturation_K2; // 0x24C(0x4)
	float Mobile_CG_Exposure_K2; // 0x250(0x4)
	uint8_t Pad_0x254[0x4]; // 0x254(0x4)
	struct UTexture* MobileColorGradingLUT; // 0x258(0x8)
	float MobileColorGradingLUTWeight; // 0x260(0x4)
	struct FLinearColor FilmWhitePoint; // 0x264(0x10)
	struct FLinearColor FilmShadowTint; // 0x274(0x10)
	float FilmShadowTintBlend; // 0x284(0x4)
	float FilmShadowTintAmount; // 0x288(0x4)
	float FilmSaturation; // 0x28C(0x4)
	struct FLinearColor FilmChannelMixerRed; // 0x290(0x10)
	struct FLinearColor FilmChannelMixerGreen; // 0x2A0(0x10)
	struct FLinearColor FilmChannelMixerBlue; // 0x2B0(0x10)
	float FilmContrast; // 0x2C0(0x4)
	float FilmToeAmount; // 0x2C4(0x4)
	float FilmHealAmount; // 0x2C8(0x4)
	float FilmDynamicRange; // 0x2CC(0x4)
	struct FLinearColor SceneColorTint; // 0x2D0(0x10)
	float SceneFringeIntensity; // 0x2E0(0x4)
	float ChromaticAberrationStartOffset; // 0x2E4(0x4)
	float ChromaticAberrationSCaleR; // 0x2E8(0x4)
	float ChromaticAberrationSCaleG; // 0x2EC(0x4)
	float BloomIntensity; // 0x2F0(0x4)
	float BloomMaxLuminance; // 0x2F4(0x4)
	float MobileBloomMaxLuminance; // 0x2F8(0x4)
	float BloomThreshold; // 0x2FC(0x4)
	float BloomSizeScale; // 0x300(0x4)
	float Bloom1Size; // 0x304(0x4)
	float Bloom2Size; // 0x308(0x4)
	float Bloom3Size; // 0x30C(0x4)
	float Bloom4Size; // 0x310(0x4)
	float Bloom5Size; // 0x314(0x4)
	float Bloom6Size; // 0x318(0x4)
	struct FLinearColor Bloom1Tint; // 0x31C(0x10)
	struct FLinearColor Bloom2Tint; // 0x32C(0x10)
	struct FLinearColor Bloom3Tint; // 0x33C(0x10)
	struct FLinearColor Bloom4Tint; // 0x34C(0x10)
	struct FLinearColor Bloom5Tint; // 0x35C(0x10)
	struct FLinearColor Bloom6Tint; // 0x36C(0x10)
	struct FLinearColor MobileBloomTint; // 0x37C(0x10)
	float MobileBloomThreshold; // 0x38C(0x4)
	float BloomConvolutionSize; // 0x390(0x4)
	uint8_t Pad_0x394[0x4]; // 0x394(0x4)
	struct UTexture2D* BloomConvolutionTexture; // 0x398(0x8)
	struct FVector2D BloomConvolutionCenterUV; // 0x3A0(0x8)
	float BloomConvolutionPreFilterMin; // 0x3A8(0x4)
	float BloomConvolutionPreFilterMax; // 0x3AC(0x4)
	float BloomConvolutionPreFilterMult; // 0x3B0(0x4)
	float BloomConvolutionBufferScale; // 0x3B4(0x4)
	struct UTexture* BloomDirtMask; // 0x3B8(0x8)
	float BloomDirtMaskIntensity; // 0x3C0(0x4)
	struct FLinearColor BloomDirtMaskTint; // 0x3C4(0x10)
	struct FLinearColor AmbientCubemapTint; // 0x3D4(0x10)
	float AmbientCubemapIntensity; // 0x3E4(0x4)
	struct UTextureCube* AmbientCubemap; // 0x3E8(0x8)
	float CameraShutterSpeed; // 0x3F0(0x4)
	float CameraISO; // 0x3F4(0x4)
	float DepthOfFieldFstop; // 0x3F8(0x4)
	float DepthOfFieldMinFstop; // 0x3FC(0x4)
	int32_t DepthOfFieldBladeCount; // 0x400(0x4)
	float AutoExposureBias; // 0x404(0x4)
	float AutoExposureBiasBackup; // 0x408(0x4)
	uint8_t bOverride_AutoExposureBiasBackup : 1; // 0x40C(0x1), Mask(0x1)
	uint8_t AutoExposureApplyPhysicalCameraExposure : 1; // 0x40C(0x1), Mask(0x2)
	uint8_t BitPad_0x40C_2 : 6; // 0x40C(0x1)
	uint8_t Pad_0x40D[0x3]; // 0x40D(0x3)
	struct UCurveFloat* AutoExposureBiasCurve; // 0x410(0x8)
	struct UTexture* AutoExposureMeterMask; // 0x418(0x8)
	float AutoExposureLowPercent; // 0x420(0x4)
	float AutoExposureHighPercent; // 0x424(0x4)
	float AutoExposureMinBrightness; // 0x428(0x4)
	float AutoExposureMaxBrightness; // 0x42C(0x4)
	float AutoExposureSpeedUp; // 0x430(0x4)
	float AutoExposureSpeedDown; // 0x434(0x4)
	float HistogramLogMin; // 0x438(0x4)
	float HistogramLogMax; // 0x43C(0x4)
	float AutoExposureCalibrationConstant; // 0x440(0x4)
	float LocalExposureHighlightContrastScale; // 0x444(0x4)
	float LocalExposureShadowContrastScale; // 0x448(0x4)
	uint8_t Pad_0x44C[0x4]; // 0x44C(0x4)
	struct UCurveFloat* LocalExposureHighlightContrastCurve; // 0x450(0x8)
	struct UCurveFloat* LocalExposureShadowContrastCurve; // 0x458(0x8)
	float LocalExposureHighlightThreshold; // 0x460(0x4)
	float LocalExposureShadowThreshold; // 0x464(0x4)
	float LocalExposureDetailStrength; // 0x468(0x4)
	float LocalExposureBlurredLuminanceBlend; // 0x46C(0x4)
	float LocalExposureBlurredLuminanceKernelSizePercent; // 0x470(0x4)
	float LocalExposureMiddleGreyBias; // 0x474(0x4)
	uint8_t MiddleGreyBiasCompensation : 1; // 0x478(0x1), Mask(0x1)
	uint8_t BitPad_0x478_1 : 7; // 0x478(0x1)
	uint8_t Pad_0x479[0x3]; // 0x479(0x3)
	int32_t BlurRadius; // 0x47C(0x4)
	ELensFlareMethod LensFlareMethod; // 0x480(0x1)
	uint8_t Pad_0x481[0x3]; // 0x481(0x3)
	float LensFlareIntensity; // 0x484(0x4)
	struct FLinearColor LensFlareTint; // 0x488(0x10)
	float LensFlareBokehSize; // 0x498(0x4)
	float LensFlareThreshold; // 0x49C(0x4)
	struct UTexture* LensFlareBokehShape; // 0x4A0(0x8)
	float LensFlareLineWidth; // 0x4A8(0x4)
	float LensFlareLineLength; // 0x4AC(0x4)
	float LensFlareLineIntensity; // 0x4B0(0x4)
	struct FLinearColor LensFlareLineTint; // 0x4B4(0x10)
	uint8_t Pad_0x4C4[0x4]; // 0x4C4(0x4)
	struct UTexture* LensFlareHalo; // 0x4C8(0x8)
	float LensFlareHaloScaleMin; // 0x4D0(0x4)
	float LensFlareHaloScaleMax; // 0x4D4(0x4)
	struct FLinearColor LensFlareTints_1; // 0x4D8(0x10)
	float LensFlareLocation_1; // 0x4E8(0x4)
	struct FLinearColor LensFlareTints_2; // 0x4EC(0x10)
	float LensFlareLocation_2; // 0x4FC(0x4)
	struct FLinearColor LensFlareTints_3; // 0x500(0x10)
	float LensFlareLocation_3; // 0x510(0x4)
	struct FLinearColor LensFlareTints_4; // 0x514(0x10)
	float LensFlareLocation_4; // 0x524(0x4)
	struct FLinearColor LensFlareTints_5; // 0x528(0x10)
	float LensFlareLocation_5; // 0x538(0x4)
	struct FLinearColor LensFlareTints_6; // 0x53C(0x10)
	struct FLinearColor LensFlareTints_7; // 0x54C(0x10)
	struct FLinearColor LensFlareTints_8; // 0x55C(0x10)
	uint8_t bUseMobileLensFlare : 1; // 0x56C(0x1), Mask(0x1)
	uint8_t BitPad_0x56C_1 : 7; // 0x56C(0x1)
	uint8_t Pad_0x56D[0x3]; // 0x56D(0x3)
	float MobileLensFlareIntensity; // 0x570(0x4)
	struct FLinearColor MobileLensFlareTint; // 0x574(0x10)
	float MobileLensFlareBokehSize; // 0x584(0x4)
	int32_t LensFlareRandomSeed; // 0x588(0x4)
	int32_t LensFlareFlareCount; // 0x58C(0x4)
	float LensFlareMinPositionScale; // 0x590(0x4)
	float LensFlareMaxPositionScale; // 0x594(0x4)
	struct UTexture* MobileLensFlareBokehShape; // 0x598(0x8)
	float LensFlareIntensity2; // 0x5A0(0x4)
	struct FLinearColor LensFlareTint2; // 0x5A4(0x10)
	float LensFlareBokehSize2; // 0x5B4(0x4)
	int32_t LensFlareRandomSeed2; // 0x5B8(0x4)
	int32_t LensFlareFlareCount2; // 0x5BC(0x4)
	float LensFlareMinPositionScale2; // 0x5C0(0x4)
	float LensFlareMaxPositionScale2; // 0x5C4(0x4)
	struct UTexture* LensFlareBokehShape2; // 0x5C8(0x8)
	struct FLinearColor LensFlareRayTint; // 0x5D0(0x10)
	int32_t LensFlareRaySliceCount; // 0x5E0(0x4)
	float LensFlareRayThreshold; // 0x5E4(0x4)
	int32_t LensFlareRayRandomSeed; // 0x5E8(0x4)
	float LensFlareRaySize; // 0x5EC(0x4)
	float LensFlareRayWidth; // 0x5F0(0x4)
	float LensFlareRayIntensity; // 0x5F4(0x4)
	float VignetteIntensity; // 0x5F8(0x4)
	float GrainJitter; // 0x5FC(0x4)
	float GrainIntensity; // 0x600(0x4)
	float AmbientOcclusionIntensity; // 0x604(0x4)
	float AmbientOcclusionStaticFraction; // 0x608(0x4)
	float AmbientOcclusionRadius; // 0x60C(0x4)
	uint8_t AmbientOcclusionRadiusInWS : 1; // 0x610(0x1), Mask(0x1)
	uint8_t BitPad_0x610_1 : 7; // 0x610(0x1)
	uint8_t Pad_0x611[0x3]; // 0x611(0x3)
	float AmbientOcclusionFadeDistance; // 0x614(0x4)
	float AmbientOcclusionFadeRadius; // 0x618(0x4)
	float AmbientOcclusionDistance; // 0x61C(0x4)
	float AmbientOcclusionPower; // 0x620(0x4)
	float AmbientOcclusionBias; // 0x624(0x4)
	float AmbientOcclusionQuality; // 0x628(0x4)
	float AmbientOcclusionMipBlend; // 0x62C(0x4)
	float AmbientOcclusionMipScale; // 0x630(0x4)
	float AmbientOcclusionMipThreshold; // 0x634(0x4)
	float AmbientOcclusionTemporalBlendWeight; // 0x638(0x4)
	float SSRTAOThreshold; // 0x63C(0x4)
	float SSRTAOTwoSidedFoliageThreshold; // 0x640(0x4)
	float SSRTAOBentNormalThreshold; // 0x644(0x4)
	float SSRTAONoiseStep; // 0x648(0x4)
	float SSRTAOStepSize; // 0x64C(0x4)
	float SSRTAOFirstPersonStepSize; // 0x650(0x4)
	float SSRTAOFoliageStepSize; // 0x654(0x4)
	float SSRTAOFoliageNormalAdjust; // 0x658(0x4)
	float SSRTAODenoiseTemporalBlendWeight; // 0x65C(0x4)
	float SSRTAODenoiseTemporalMomentBlendWeight; // 0x660(0x4)
	float SSRTAODenoiseTemporalNormalTolerance; // 0x664(0x4)
	float SSRTAODenoiseTemporalDepthTolerance; // 0x668(0x4)
	int32_t SSRTAODenoiseTemporalHistoryLength; // 0x66C(0x4)
	float SSRTAODenoiseSpatialAOSigma; // 0x670(0x4)
	float SSRTAODenoiseSpatialDepthSigma; // 0x674(0x4)
	float SSRTAODenoiseSpatialNormalSigma; // 0x678(0x4)
	int32_t SSRTAODenoiseATrousIteration; // 0x67C(0x4)
	int32_t SSRTAODenoiseATrousCopyIterationIndex; // 0x680(0x4)
	int32_t SSRTAODenoiseATrousIterationStartKernelStep; // 0x684(0x4)
	float SSRTAODenoiseATrousAOSigma; // 0x688(0x4)
	float SSRTAODenoiseATrousDepthSigma; // 0x68C(0x4)
	float SSRTAODenoiseATrousDepthWeightCutoff; // 0x690(0x4)
	float SSRTAODenoiseATrousNormalSigma; // 0x694(0x4)
	float SSRTAODenoiseATrousMinVarianceToDenoise; // 0x698(0x4)
	uint8_t RayTracingAO : 1; // 0x69C(0x1), Mask(0x1)
	uint8_t BitPad_0x69C_1 : 7; // 0x69C(0x1)
	uint8_t Pad_0x69D[0x3]; // 0x69D(0x3)
	int32_t RayTracingAOSamplesPerPixel; // 0x6A0(0x4)
	struct FLinearColor IndirectLightingColor; // 0x6A4(0x10)
	float IndirectLightingIntensity; // 0x6B4(0x4)
	ERayTracingGlobalIlluminationType RayTracingGIType; // 0x6B8(0x1)
	uint8_t Pad_0x6B9[0x3]; // 0x6B9(0x3)
	int32_t RayTracingGIMaxBounces; // 0x6BC(0x4)
	int32_t RayTracingGISamplesPerPixel; // 0x6C0(0x4)
	uint8_t RayTracingCausticsEnable : 1; // 0x6C4(0x1), Mask(0x1)
	uint8_t BitPad_0x6C4_1 : 7; // 0x6C4(0x1)
	ERayTracingMeshCausticsResolutionOverride RayTracingCausticsResolution; // 0x6C5(0x1)
	uint8_t Pad_0x6C6[0x2]; // 0x6C6(0x2)
	float RayTracingCausticsIntensity; // 0x6C8(0x4)
	float RayTracingCausticsMaxIntensity; // 0x6CC(0x4)
	int32_t RayTracingCausticsMaxTraceDepth; // 0x6D0(0x4)
	float RayTracingCausticsFinalCullColorThreshold; // 0x6D4(0x4)
	float RayTracingCausticsMidCullColorThreshold; // 0x6D8(0x4)
	ERayTracingMeshCausticsTranslucentReflectionMode RayTracingCausticsTranslucentReflectionMode; // 0x6DC(0x1)
	uint8_t Pad_0x6DD[0x3]; // 0x6DD(0x3)
	float RayTracingCausticsMaxScreenRadius; // 0x6E0(0x4)
	ERayTracingMeshCausticsBufferScale RayTracingCausticsBufferScale; // 0x6E4(0x1)
	uint8_t Pad_0x6E5[0x3]; // 0x6E5(0x3)
	float RayTracingCausticsScatterDepthTolerance; // 0x6E8(0x4)
	float RayTracingCausticsSplatSize; // 0x6EC(0x4)
	uint8_t RayTracingCausticsEnableDispersion : 1; // 0x6F0(0x1), Mask(0x1)
	uint8_t BitPad_0x6F0_1 : 7; // 0x6F0(0x1)
	uint8_t Pad_0x6F1[0x3]; // 0x6F1(0x3)
	int32_t RayTracingCausticsDispersionSamples; // 0x6F4(0x4)
	float RayTracingCausticsAdaptivePhotonSize; // 0x6F8(0x4)
	float RayTracingCausticsAdaptiveVarianceGain; // 0x6FC(0x4)
	float RayTracingCausticsAdaptiveSmooth; // 0x700(0x4)
	int32_t RayTracingCausticsAdaptiveMaxSample; // 0x704(0x4)
	float RayTracingCausticsAdaptiveUpdateSpeed; // 0x708(0x4)
	uint8_t RayTracingCausticsEnableTemporalFilter : 1; // 0x70C(0x1), Mask(0x1)
	uint8_t BitPad_0x70C_1 : 7; // 0x70C(0x1)
	uint8_t Pad_0x70D[0x3]; // 0x70D(0x3)
	float RayTracingCausticsJitter; // 0x710(0x4)
	float RayTracingCausticsTemporalStrength; // 0x714(0x4)
	float RayTracingCausticsTemporalColorTolerance; // 0x718(0x4)
	ERayTracingMeshCausticsDebugLightData RayTracingCausticsDebugLightData; // 0x71C(0x1)
	ERayTracingMeshCausticsDebugScreenData RayTracingCausticsDebugScreenData; // 0x71D(0x1)
	uint8_t Pad_0x71E[0x2]; // 0x71E(0x2)
	float RayTracingCausticsDebugMaxPixelValue; // 0x720(0x4)
	float RayTracingCausticsDebugMapScale; // 0x724(0x4)
	int32_t RayTracingCausticsDebugMaxPhotonCount; // 0x728(0x4)
	int32_t RayTracingCausticsDebugMip; // 0x72C(0x4)
	uint8_t GIDenoiseApplyAO : 1; // 0x730(0x1), Mask(0x1)
	uint8_t GIDenoiseEnableTemporal : 1; // 0x730(0x1), Mask(0x2)
	uint8_t BitPad_0x730_2 : 6; // 0x730(0x1)
	uint8_t Pad_0x731[0x3]; // 0x731(0x3)
	float GIDenoiseTemporalBlendWeight; // 0x734(0x4)
	float GIDenoiseTemporalMomentBlendWeight; // 0x738(0x4)
	float GIDenoiseTemporalNormalTolerance; // 0x73C(0x4)
	float GIDenoiseTemporalDepthTolerance; // 0x740(0x4)
	int32_t GIDenoiseColorClamp; // 0x744(0x4)
	int32_t GIDenoiseHistoryLength; // 0x748(0x4)
	uint8_t GIDenoiseEnableATrous : 1; // 0x74C(0x1), Mask(0x1)
	uint8_t BitPad_0x74C_1 : 7; // 0x74C(0x1)
	uint8_t Pad_0x74D[0x3]; // 0x74D(0x3)
	int32_t GIDenoiseATrousIteration; // 0x750(0x4)
	int32_t GIDenoiseATrousCopyIteration; // 0x754(0x4)
	uint8_t GIDenoiseATrousSampleDepthAsNormal : 1; // 0x758(0x1), Mask(0x1)
	uint8_t BitPad_0x758_1 : 7; // 0x758(0x1)
	uint8_t Pad_0x759[0x3]; // 0x759(0x3)
	float GIDenoiseATrousFilterWidth; // 0x75C(0x4)
	float GIDenoiseATrousVarianceGain; // 0x760(0x4)
	float GIDenoiseATrousNormalTolerance; // 0x764(0x4)
	float GIDenoiseATrousDepthTolerance; // 0x768(0x4)
	float GIDenoiseATrousAOTolerance; // 0x76C(0x4)
	ERayTracingGIDenoiseSpatialFilterType GIDenoiseSpatialFilterType; // 0x770(0x1)
	ERayTracingGIDenoiseType GIDenoiseType; // 0x771(0x1)
	ERayTracingGIDenoiseDebugType GIDenoiseDebugType; // 0x772(0x1)
	ERayTracingWaterCausticsType RayTracingWaterCausticsType; // 0x773(0x1)
	ERayTracingWaterCausticsBufferScale RayTracingWaterCausticsBufferScale; // 0x774(0x1)
	uint8_t RayTracingWaterCausticsFollowCamera : 1; // 0x775(0x1), Mask(0x1)
	uint8_t BitPad_0x775_1 : 7; // 0x775(0x1)
	uint8_t Pad_0x776[0x2]; // 0x776(0x2)
	struct FVector RayTracingWaterCausticsLookAt; // 0x778(0xC)
	struct FVector RayTracingWaterCausticsRange; // 0x784(0xC)
	struct FLinearColor RayTracingWaterCausticsColor; // 0x790(0x10)
	int32_t RayTracingWaterCausticsNumDenoisePasses; // 0x7A0(0x4)
	float RayTracingWaterCausticsDispersionIntensity; // 0x7A4(0x4)
	float RayTracingWaterCausticsDispersionOffset; // 0x7A8(0x4)
	float RayTracingWaterCausticsReflectiveIntensity; // 0x7AC(0x4)
	float RayTracingWaterCausticsReflectedRayTMax; // 0x7B0(0x4)
	float RayTracingWaterCausticsReflectedRayTMin; // 0x7B4(0x4)
	float RayTracingWaterCausticsRefractiveIntensity; // 0x7B8(0x4)
	float RayTracingWaterCausticsRefractedRayTMax; // 0x7BC(0x4)
	float RayTracingWaterCausticsRefractedRayTMin; // 0x7C0(0x4)
	float RayTracingWaterCausticsFresnelBaseReflectFraction; // 0x7C4(0x4)
	float RayTracingWaterCausticsReflectBackFaceCullingThreshold; // 0x7C8(0x4)
	float RayTracingWaterCausticsRefractBackFaceCullingThreshold; // 0x7CC(0x4)
	float ColorGradingIntensity; // 0x7D0(0x4)
	uint8_t Pad_0x7D4[0x4]; // 0x7D4(0x4)
	struct UTexture* ColorGradingLUT; // 0x7D8(0x8)
	uint8_t UseACEScc : 1; // 0x7E0(0x1), Mask(0x1)
	uint8_t BitPad_0x7E0_1 : 7; // 0x7E0(0x1)
	uint8_t PCHighPrecisionLMT : 1; // 0x7E1(0x1), Mask(0x1)
	uint8_t BitPad_0x7E1_1 : 7; // 0x7E1(0x1)
	uint8_t Pad_0x7E2[0x2]; // 0x7E2(0x2)
	float LMT_LUTIntensity; // 0x7E4(0x4)
	struct UTexture* LMT_LUT; // 0x7E8(0x8)
	float DepthOfFieldSensorWidth; // 0x7F0(0x4)
	float DepthOfFieldSqueezeFactor; // 0x7F4(0x4)
	float DepthOfFieldFocalDistance; // 0x7F8(0x4)
	float DepthOfFieldDepthBlurAmount; // 0x7FC(0x4)
	float DepthOfFieldDepthBlurRadius; // 0x800(0x4)
	float DepthOfFieldFocalRegion; // 0x804(0x4)
	float MobileDepthOfFieldFocalDistance; // 0x808(0x4)
	float DepthOfFieldNearTransitionRegion; // 0x80C(0x4)
	float DepthOfFieldFarTransitionRegion; // 0x810(0x4)
	float DepthOfFieldScale; // 0x814(0x4)
	float DepthOfFieldNearBlurSize; // 0x818(0x4)
	float DepthOfFieldFarBlurSize; // 0x81C(0x4)
	float DepthOfFieldOcclusion; // 0x820(0x4)
	float DepthOfFieldSkyFocusDistance; // 0x824(0x4)
	float DepthOfFieldVignetteSize; // 0x828(0x4)
	float ScreenRainDropBlurStrength; // 0x82C(0x4)
	float ScreenRainDropBlurCullRadius; // 0x830(0x4)
	float ScreenRainDropBlurStaticSplit; // 0x834(0x4)
	float ScreenRainDropBlurStaticDropDensity; // 0x838(0x4)
	float ScreenRainDropBlurDynamicXSplit; // 0x83C(0x4)
	float ScreenRainDropBlurDynamicYSplit; // 0x840(0x4)
	float ScreenRainDropBlurDynamicDropDensity; // 0x844(0x4)
	float ScreenRainDropBlurTest; // 0x848(0x4)
	float MotionBlurAmount; // 0x84C(0x4)
	float MotionBlurMax; // 0x850(0x4)
	int32_t MotionBlurTargetFPS; // 0x854(0x4)
	float MotionBlurPerObjectSize; // 0x858(0x4)
	uint8_t bEnableMobileMotionBlur : 1; // 0x85C(0x1), Mask(0x1)
	uint8_t BitPad_0x85C_1 : 7; // 0x85C(0x1)
	uint8_t Pad_0x85D[0x3]; // 0x85D(0x3)
	int32_t MobileMotionBlurMaxSampleCount; // 0x860(0x4)
	float MobileMotionBlurVelocityScale; // 0x864(0x4)
	float MobileMotionBlurMaxVelocity; // 0x868(0x4)
	uint8_t bMobileMotionBlurUseAABBMask : 1; // 0x86C(0x1), Mask(0x1)
	uint8_t BitPad_0x86C_1 : 7; // 0x86C(0x1)
	uint8_t Pad_0x86D[0x3]; // 0x86D(0x3)
	float MobileMotionBlurDepthMask; // 0x870(0x4)
	float MobileMotionBlurDepthMaskTransition; // 0x874(0x4)
	struct FVector2D MobileMotionBlurAABBMaskCenter; // 0x878(0x8)
	struct FVector2D MobileMotionBlurAABBMaskExtent; // 0x880(0x8)
	float MobileMotionBlurAABBMaskTransition; // 0x888(0x4)
	uint8_t bMobileMotionBlurDisplayIntensity : 1; // 0x88C(0x1), Mask(0x1)
	uint8_t bMobileMotionBlurUseVSVelocity : 1; // 0x88C(0x1), Mask(0x2)
	uint8_t BitPad_0x88C_2 : 6; // 0x88C(0x1)
	uint8_t Pad_0x88D[0x3]; // 0x88D(0x3)
	int32_t MobileMotionBlurDownSampleFactor; // 0x890(0x4)
	float MobileMotionBlurAssumedDepth; // 0x894(0x4)
	float LPVIntensity; // 0x898(0x4)
	float LPVVplInjectionBias; // 0x89C(0x4)
	float LPVSize; // 0x8A0(0x4)
	float LPVSecondaryOcclusionIntensity; // 0x8A4(0x4)
	float LPVSecondaryBounceIntensity; // 0x8A8(0x4)
	float LPVGeometryVolumeBias; // 0x8AC(0x4)
	float LPVEmissiveInjectionIntensity; // 0x8B0(0x4)
	float LPVDirectionalOcclusionIntensity; // 0x8B4(0x4)
	float LPVDirectionalOcclusionRadius; // 0x8B8(0x4)
	float LPVDiffuseOcclusionExponent; // 0x8BC(0x4)
	float LPVSpecularOcclusionExponent; // 0x8C0(0x4)
	float LPVDiffuseOcclusionIntensity; // 0x8C4(0x4)
	float LPVSpecularOcclusionIntensity; // 0x8C8(0x4)
	EReflectionsType ReflectionsType; // 0x8CC(0x1)
	uint8_t Pad_0x8CD[0x3]; // 0x8CD(0x3)
	float ScreenSpaceReflectionIntensity; // 0x8D0(0x4)
	float ScreenSpaceReflectionQuality; // 0x8D4(0x4)
	float ScreenSpaceReflectionMaxRoughness; // 0x8D8(0x4)
	float RayTracingReflectionsMaxRoughness; // 0x8DC(0x4)
	int32_t RayTracingReflectionsMaxBounces; // 0x8E0(0x4)
	int32_t RayTracingReflectionsSamplesPerPixel; // 0x8E4(0x4)
	EReflectedAndRefractedRayTracedShadows RayTracingReflectionsShadows; // 0x8E8(0x1)
	uint8_t RayTracingReflectionsTranslucency : 1; // 0x8E9(0x1), Mask(0x1)
	uint8_t BitPad_0x8E9_1 : 7; // 0x8E9(0x1)
	ETranslucencyType TranslucencyType; // 0x8EA(0x1)
	uint8_t Pad_0x8EB[0x1]; // 0x8EB(0x1)
	float RayTracingTranslucencyMaxRoughness; // 0x8EC(0x4)
	float RayTracingTranslucencyMinReflectionThroughput; // 0x8F0(0x4)
	float RayTracingTranslucencyMinRefractionThroughput; // 0x8F4(0x4)
	uint8_t RayTracingTranslucencyEnableAbsorption : 1; // 0x8F8(0x1), Mask(0x1)
	uint8_t BitPad_0x8F8_1 : 7; // 0x8F8(0x1)
	uint8_t Pad_0x8F9[0x3]; // 0x8F9(0x3)
	int32_t RayTracingTranslucencyRefractionRays; // 0x8FC(0x4)
	int32_t RayTracingTranslucencySamplesPerPixel; // 0x900(0x4)
	EReflectedAndRefractedRayTracedShadows RayTracingTranslucencyShadows; // 0x904(0x1)
	uint8_t RayTracingTranslucencyRefraction : 1; // 0x905(0x1), Mask(0x1)
	uint8_t BitPad_0x905_1 : 7; // 0x905(0x1)
	uint8_t Pad_0x906[0x2]; // 0x906(0x2)
	int32_t PathTracingMaxBounces; // 0x908(0x4)
	int32_t PathTracingSamplesPerPixel; // 0x90C(0x4)
	float LPVFadeRange; // 0x910(0x4)
	float LPVDirectionalOcclusionFadeRange; // 0x914(0x4)
	float ScreenPercentage; // 0x918(0x4)
	uint8_t Pad_0x91C[0x4]; // 0x91C(0x4)
	struct FWeightedBlendables WeightedBlendables; // 0x920(0x10)
};

// Object: ScriptStruct Engine.MinimalViewInfo
// Size: 0x9C0 (Inherited: 0x0)
struct FMinimalViewInfo
{
	struct FEncVector Location; // 0x0(0x10)
	struct FRotator Rotation; // 0x10(0xC)
	float FOV; // 0x1C(0x4)
	float DesiredFOV; // 0x20(0x4)
	float OrthoWidth; // 0x24(0x4)
	float OrthoNearClipPlane; // 0x28(0x4)
	float OrthoFarClipPlane; // 0x2C(0x4)
	float AspectRatio; // 0x30(0x4)
	uint8_t bConstrainAspectRatio : 1; // 0x34(0x1), Mask(0x1)
	uint8_t bUseFieldOfViewForLOD : 1; // 0x34(0x1), Mask(0x2)
	uint8_t BitPad_0x34_2 : 6; // 0x34(0x1)
	ECameraProjectionMode ProjectionMode; // 0x35(0x1)
	uint8_t Pad_0x36[0x2]; // 0x36(0x2)
	float PostProcessBlendWeight; // 0x38(0x4)
	uint8_t Pad_0x3C[0x4]; // 0x3C(0x4)
	struct FPostProcessSettings PostProcessSettings; // 0x40(0x930)
	struct FVector2D OffCenterProjectionOffset; // 0x970(0x8)
	uint8_t Pad_0x978[0x48]; // 0x978(0x48)
};

// Object: ScriptStruct Engine.WeightedBlendable
// Size: 0x20 (Inherited: 0x0)
struct FWeightedBlendable
{
	float Weight; // 0x0(0x4)
	struct FVector2D CustomViewportLeftTop; // 0x4(0x8)
	struct FVector2D CustomViewportSize; // 0xC(0x8)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	struct UObject* Object; // 0x18(0x8)
};

// Object: ScriptStruct Engine.CanvasIcon
// Size: 0x18 (Inherited: 0x0)
struct FCanvasIcon
{
	struct UTexture* Texture; // 0x0(0x8)
	float U; // 0x8(0x4)
	float V; // 0xC(0x4)
	float UL; // 0x10(0x4)
	float VL; // 0x14(0x4)
};

// Object: ScriptStruct Engine.WrappedStringElement
// Size: 0x18 (Inherited: 0x0)
struct FWrappedStringElement
{
	struct FString Value; // 0x0(0x10)
	struct FVector2D LineExtent; // 0x10(0x8)
};

// Object: ScriptStruct Engine.TextSizingParameters
// Size: 0x28 (Inherited: 0x0)
struct FTextSizingParameters
{
	float DrawX; // 0x0(0x4)
	float DrawY; // 0x4(0x4)
	float DrawXL; // 0x8(0x4)
	float DrawYL; // 0xC(0x4)
	struct FVector2D Scaling; // 0x10(0x8)
	struct UFont* DrawFont; // 0x18(0x8)
	struct FVector2D SpacingAdjust; // 0x20(0x8)
};

// Object: ScriptStruct Engine.CharacterMovementComponentPostPhysicsTickFunction
// Size: 0x68 (Inherited: 0x60)
struct FCharacterMovementComponentPostPhysicsTickFunction : FTickFunction
{
	uint8_t Pad_0x60[0x8]; // 0x60(0x8)
};

// Object: ScriptStruct Engine.FindFloorResult
// Size: 0x94 (Inherited: 0x0)
struct FFindFloorResult
{
	uint8_t bBlockingHit : 1; // 0x0(0x1), Mask(0x1)
	uint8_t bWalkableFloor : 1; // 0x0(0x1), Mask(0x2)
	uint8_t bLineTrace : 1; // 0x0(0x1), Mask(0x4)
	uint8_t BitPad_0x0_3 : 5; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float FloorDist; // 0x4(0x4)
	float LineDist; // 0x8(0x4)
	struct FHitResult HitResult; // 0xC(0x88)
};

// Object: ScriptStruct Engine.ChildActorComponentInstanceData
// Size: 0xD0 (Inherited: 0xA8)
struct FChildActorComponentInstanceData : FSceneComponentInstanceData
{
	struct FName ChildActorName; // 0xA8(0x8)
	struct TArray<struct FChildActorAttachedActorInfo> AttachedActors; // 0xB0(0x10)
	uint8_t Pad_0xC0[0x10]; // 0xC0(0x10)
};

// Object: ScriptStruct Engine.ChildActorAttachedActorInfo
// Size: 0x40 (Inherited: 0x0)
struct FChildActorAttachedActorInfo
{
	struct TWeakObjectPtr<struct AActor> Actor; // 0x0(0x8)
	struct FName SocketName; // 0x8(0x8)
	struct FTransform RelativeTransform; // 0x10(0x30)
};

// Object: ScriptStruct Engine.CustomTraceMaskFilterName
// Size: 0xC (Inherited: 0x0)
struct FCustomTraceMaskFilterName
{
	struct FName Name; // 0x0(0x8)
	ETraceMaskFilter FilterType; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
};

// Object: ScriptStruct Engine.CustomProfile
// Size: 0x18 (Inherited: 0x0)
struct FCustomProfile
{
	struct FName Name; // 0x0(0x8)
	struct TArray<struct FResponseChannel> CustomResponses; // 0x8(0x10)
};

// Object: ScriptStruct Engine.CustomChannelSetup
// Size: 0xC (Inherited: 0x0)
struct FCustomChannelSetup
{
	ECollisionChannel Channel; // 0x0(0x1)
	ECollisionResponse DefaultResponse; // 0x1(0x1)
	uint8_t bTraceType : 1; // 0x2(0x1), Mask(0x1)
	uint8_t BitPad_0x2_1 : 7; // 0x2(0x1)
	uint8_t bStaticObject : 1; // 0x3(0x1), Mask(0x1)
	uint8_t BitPad_0x3_1 : 7; // 0x3(0x1)
	struct FName Name; // 0x4(0x8)
};

// Object: ScriptStruct Engine.CollisionResponseTemplate
// Size: 0x48 (Inherited: 0x0)
struct FCollisionResponseTemplate
{
	struct FName Name; // 0x0(0x8)
	ECollisionEnabled CollisionEnabled; // 0x8(0x1)
	uint8_t Pad_0x9[0x1]; // 0x9(0x1)
	uint8_t bCanModify : 1; // 0xA(0x1), Mask(0x1)
	uint8_t BitPad_0xA_1 : 7; // 0xA(0x1)
	uint8_t Pad_0xB[0x21]; // 0xB(0x21)
	struct FName ObjectTypeName; // 0x2C(0x8)
	uint8_t Pad_0x34[0x4]; // 0x34(0x4)
	struct TArray<struct FResponseChannel> CustomResponses; // 0x38(0x10)
};

// Object: ScriptStruct Engine.BlueprintComponentDelegateBinding
// Size: 0x18 (Inherited: 0x0)
struct FBlueprintComponentDelegateBinding
{
	struct FName ComponentPropertyName; // 0x0(0x8)
	struct FName DelegatePropertyName; // 0x8(0x8)
	struct FName FunctionNameToBind; // 0x10(0x8)
};

// Object: ScriptStruct Engine.MeshUVChannelInfo
// Size: 0x14 (Inherited: 0x0)
struct FMeshUVChannelInfo
{
	uint8_t bInitialized : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t bOverrideDensities : 1; // 0x1(0x1), Mask(0x1)
	uint8_t BitPad_0x1_1 : 7; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	float LocalUVDensities[0x4]; // 0x4(0x10)
};

// Object: ScriptStruct Engine.AutoCompleteNode
// Size: 0x28 (Inherited: 0x0)
struct FAutoCompleteNode
{
	int32_t IndexChar; // 0x0(0x4)
	uint8_t Pad_0x4[0x4]; // 0x4(0x4)
	struct TArray<int32_t> AutoCompleteListIndices; // 0x8(0x10)
	uint8_t Pad_0x18[0x10]; // 0x18(0x10)
};

// Object: ScriptStruct Engine.ConstraintDrive
// Size: 0x10 (Inherited: 0x0)
struct FConstraintDrive
{
	float Stiffness; // 0x0(0x4)
	float damping; // 0x4(0x4)
	float MaxForce; // 0x8(0x4)
	uint8_t bEnablePositionDrive : 1; // 0xC(0x1), Mask(0x1)
	uint8_t bEnableVelocityDrive : 1; // 0xC(0x1), Mask(0x2)
	uint8_t BitPad_0xC_2 : 6; // 0xC(0x1)
	uint8_t Pad_0xD[0x3]; // 0xD(0x3)
};

// Object: ScriptStruct Engine.AngularDriveConstraint
// Size: 0x4C (Inherited: 0x0)
struct FAngularDriveConstraint
{
	struct FConstraintDrive TwistDrive; // 0x0(0x10)
	struct FConstraintDrive SwingDrive; // 0x10(0x10)
	struct FConstraintDrive SlerpDrive; // 0x20(0x10)
	struct FRotator OrientationTarget; // 0x30(0xC)
	struct FVector AngularVelocityTarget; // 0x3C(0xC)
	EAngularDriveMode AngularDriveMode; // 0x48(0x1)
	uint8_t Pad_0x49[0x3]; // 0x49(0x3)
};

// Object: ScriptStruct Engine.LinearDriveConstraint
// Size: 0x4C (Inherited: 0x0)
struct FLinearDriveConstraint
{
	struct FVector PositionTarget; // 0x0(0xC)
	struct FVector VelocityTarget; // 0xC(0xC)
	struct FConstraintDrive XDrive; // 0x18(0x10)
	struct FConstraintDrive YDrive; // 0x28(0x10)
	struct FConstraintDrive ZDrive; // 0x38(0x10)
	uint8_t bEnablePositionDrive : 1; // 0x48(0x1), Mask(0x1)
	uint8_t BitPad_0x48_1 : 7; // 0x48(0x1)
	uint8_t Pad_0x49[0x3]; // 0x49(0x3)
};

// Object: ScriptStruct Engine.ConstraintBaseParams
// Size: 0x14 (Inherited: 0x0)
struct FConstraintBaseParams
{
	float Stiffness; // 0x0(0x4)
	float damping; // 0x4(0x4)
	float Restitution; // 0x8(0x4)
	float ContactDistance; // 0xC(0x4)
	uint8_t bSoftConstraint : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
};

// Object: ScriptStruct Engine.ConeConstraint
// Size: 0x20 (Inherited: 0x14)
struct FConeConstraint : FConstraintBaseParams
{
	float Swing1LimitDegrees; // 0x14(0x4)
	float Swing2LimitDegrees; // 0x18(0x4)
	EAngularConstraintMotion Swing1Motion; // 0x1C(0x1)
	EAngularConstraintMotion Swing2Motion; // 0x1D(0x1)
	uint8_t Pad_0x1E[0x2]; // 0x1E(0x2)
};

// Object: ScriptStruct Engine.LinearConstraint
// Size: 0x1C (Inherited: 0x14)
struct FLinearConstraint : FConstraintBaseParams
{
	float Limit; // 0x14(0x4)
	ELinearConstraintMotion XMotion; // 0x18(0x1)
	ELinearConstraintMotion YMotion; // 0x19(0x1)
	ELinearConstraintMotion ZMotion; // 0x1A(0x1)
	uint8_t Pad_0x1B[0x1]; // 0x1B(0x1)
};

// Object: ScriptStruct Engine.TwistConstraint
// Size: 0x1C (Inherited: 0x14)
struct FTwistConstraint : FConstraintBaseParams
{
	float TwistLimitDegrees; // 0x14(0x4)
	EAngularConstraintMotion TwistMotion; // 0x18(0x1)
	uint8_t Pad_0x19[0x3]; // 0x19(0x3)
};

// Object: ScriptStruct Engine.ConstraintProfileProperties
// Size: 0x104 (Inherited: 0x0)
struct FConstraintProfileProperties
{
	float ProjectionLinearTolerance; // 0x0(0x4)
	float ProjectionAngularTolerance; // 0x4(0x4)
	float LinearBreakThreshold; // 0x8(0x4)
	float AngularBreakThreshold; // 0xC(0x4)
	struct FLinearConstraint LinearLimit; // 0x10(0x1C)
	struct FConeConstraint ConeLimit; // 0x2C(0x20)
	struct FTwistConstraint TwistLimit; // 0x4C(0x1C)
	struct FLinearDriveConstraint LinearDrive; // 0x68(0x4C)
	struct FAngularDriveConstraint AngularDrive; // 0xB4(0x4C)
	uint8_t bDisableCollision : 1; // 0x100(0x1), Mask(0x1)
	uint8_t bParentDominates : 1; // 0x100(0x1), Mask(0x2)
	uint8_t bEnableProjection : 1; // 0x100(0x1), Mask(0x4)
	uint8_t bAngularBreakable : 1; // 0x100(0x1), Mask(0x8)
	uint8_t bLinearBreakable : 1; // 0x100(0x1), Mask(0x10)
	uint8_t BitPad_0x100_5 : 3; // 0x100(0x1)
	uint8_t Pad_0x101[0x3]; // 0x101(0x3)
};

// Object: ScriptStruct Engine.ConstraintInstance
// Size: 0x1B8 (Inherited: 0x0)
struct FConstraintInstance
{
	uint8_t Pad_0x0[0x18]; // 0x0(0x18)
	struct FName JointName; // 0x18(0x8)
	struct FName ConstraintBone1; // 0x20(0x8)
	struct FName ConstraintBone2; // 0x28(0x8)
	struct FVector Pos1; // 0x30(0xC)
	struct FVector PriAxis1; // 0x3C(0xC)
	struct FVector SecAxis1; // 0x48(0xC)
	struct FVector Pos2; // 0x54(0xC)
	struct FVector PriAxis2; // 0x60(0xC)
	struct FVector SecAxis2; // 0x6C(0xC)
	struct FRotator AngularRotationOffset; // 0x78(0xC)
	uint8_t bScaleLinearLimits : 1; // 0x84(0x1), Mask(0x1)
	uint8_t BitPad_0x84_1 : 7; // 0x84(0x1)
	uint8_t Pad_0x85[0x7]; // 0x85(0x7)
	struct FConstraintProfileProperties ProfileInstance; // 0x8C(0x104)
	uint8_t Pad_0x190[0x28]; // 0x190(0x28)
};

// Object: ScriptStruct Engine.CullDistanceSizePair
// Size: 0x8 (Inherited: 0x0)
struct FCullDistanceSizePair
{
	float size; // 0x0(0x4)
	float CullDistance; // 0x4(0x4)
};

// Object: ScriptStruct Engine.NamedCurveValue
// Size: 0xC (Inherited: 0x0)
struct FNamedCurveValue
{
	struct FName Name; // 0x0(0x8)
	float Value; // 0x8(0x4)
};

// Object: ScriptStruct Engine.DataTableCategoryHandle
// Size: 0x18 (Inherited: 0x0)
struct FDataTableCategoryHandle
{
	struct UDataTable* DataTable; // 0x0(0x8)
	struct FName ColumnName; // 0x8(0x8)
	struct FName RowContents; // 0x10(0x8)
};

// Object: ScriptStruct Engine.DebugCameraControllerSettingsViewModeIndex
// Size: 0x10 (Inherited: 0x0)
struct FDebugCameraControllerSettingsViewModeIndex
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	EViewModeIndex ViewModeIndex; // 0x8(0x1)
	uint8_t Pad_0x9[0x7]; // 0x9(0x7)
};

// Object: ScriptStruct Engine.DebugTextInfo
// Size: 0x60 (Inherited: 0x0)
struct FDebugTextInfo
{
	struct AActor* SrcActor; // 0x0(0x8)
	struct FVector SrcActorOffset; // 0x8(0xC)
	struct FVector SrcActorDesiredOffset; // 0x14(0xC)
	struct FString DebugText; // 0x20(0x10)
	float TimeRemaining; // 0x30(0x4)
	float Duration; // 0x34(0x4)
	struct FColor TextColor; // 0x38(0x4)
	uint8_t bAbsoluteLocation : 1; // 0x3C(0x1), Mask(0x1)
	uint8_t bKeepAttachedToActor : 1; // 0x3C(0x1), Mask(0x2)
	uint8_t bDrawShadow : 1; // 0x3C(0x1), Mask(0x4)
	uint8_t BitPad_0x3C_3 : 5; // 0x3C(0x1)
	uint8_t Pad_0x3D[0x3]; // 0x3D(0x3)
	struct FVector OrigActorLocation; // 0x40(0xC)
	uint8_t Pad_0x4C[0x4]; // 0x4C(0x4)
	struct UFont* Font; // 0x50(0x8)
	float FontScale; // 0x58(0x4)
	uint8_t Pad_0x5C[0x4]; // 0x5C(0x4)
};

// Object: ScriptStruct Engine.MulticastRecordOptions
// Size: 0x18 (Inherited: 0x0)
struct FMulticastRecordOptions
{
	struct FString FuncPathName; // 0x0(0x10)
	uint8_t bServerSkip : 1; // 0x10(0x1), Mask(0x1)
	uint8_t BitPad_0x10_1 : 7; // 0x10(0x1)
	uint8_t bClientSkip : 1; // 0x11(0x1), Mask(0x1)
	uint8_t BitPad_0x11_1 : 7; // 0x11(0x1)
	uint8_t Pad_0x12[0x6]; // 0x12(0x6)
};

// Object: ScriptStruct Engine.RollbackNetStartupActorInfo
// Size: 0xA0 (Inherited: 0x0)
struct FRollbackNetStartupActorInfo
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct UObject* Archetype; // 0x8(0x8)
	uint8_t Pad_0x10[0x18]; // 0x10(0x18)
	struct ULevel* Level; // 0x28(0x8)
	uint8_t Pad_0x30[0x60]; // 0x30(0x60)
	struct TArray<struct UObject*> ObjReferences; // 0x90(0x10)
};

// Object: ScriptStruct Engine.LevelNameAndTime
// Size: 0x18 (Inherited: 0x0)
struct FLevelNameAndTime
{
	struct FString LevelName; // 0x0(0x10)
	uint32_t LevelChangeTimeInMS; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct Engine.ComplexCollisionMaterialArray
// Size: 0x10 (Inherited: 0x0)
struct FComplexCollisionMaterialArray
{
	struct TArray<int32_t> IndexArray; // 0x0(0x10)
};

// Object: ScriptStruct Engine.DialogueContext
// Size: 0x18 (Inherited: 0x0)
struct FDialogueContext
{
	struct UDialogueVoice* Speaker; // 0x0(0x8)
	struct TArray<struct UDialogueVoice*> Targets; // 0x8(0x10)
};

// Object: ScriptStruct Engine.DialogueWaveParameter
// Size: 0x20 (Inherited: 0x0)
struct FDialogueWaveParameter
{
	struct UDialogueWave* DialogueWave; // 0x0(0x8)
	struct FDialogueContext Context; // 0x8(0x18)
};

// Object: ScriptStruct Engine.DialogueContextMapping
// Size: 0x38 (Inherited: 0x0)
struct FDialogueContextMapping
{
	struct FDialogueContext Context; // 0x0(0x18)
	struct USoundWave* SoundWave; // 0x18(0x8)
	struct FString LocalizationKeyFormat; // 0x20(0x10)
	struct UDialogueSoundWaveProxy* Proxy; // 0x30(0x8)
};

// Object: ScriptStruct Engine.DirectionalShadowUseSkylightAOParameters
// Size: 0x10 (Inherited: 0x0)
struct FDirectionalShadowUseSkylightAOParameters
{
	float FullShadowThreshold; // 0x0(0x4)
	float ShadowSharpness; // 0x4(0x4)
	float FadeAoDistance; // 0x8(0x4)
	float TransitionDistance; // 0xC(0x4)
};

// Object: ScriptStruct Engine.RawDistributionFloat
// Size: 0x30 (Inherited: 0x20)
struct FRawDistributionFloat : FRawDistribution
{
	float MinValue; // 0x20(0x4)
	float MaxValue; // 0x24(0x4)
	struct UDistributionFloat* Distribution; // 0x28(0x8)
};

// Object: ScriptStruct Engine.RawDistributionVector
// Size: 0x48 (Inherited: 0x20)
struct FRawDistributionVector : FRawDistribution
{
	float MinValue; // 0x20(0x4)
	float MaxValue; // 0x24(0x4)
	struct FVector MinValueVec; // 0x28(0xC)
	struct FVector MaxValueVec; // 0x34(0xC)
	struct UDistributionVector* Distribution; // 0x40(0x8)
};

// Object: ScriptStruct Engine.GraphReference
// Size: 0x20 (Inherited: 0x0)
struct FGraphReference
{
	struct UEdGraph* MacroGraph; // 0x0(0x8)
	struct UBlueprint* GraphBlueprint; // 0x8(0x8)
	struct FGuid GraphGuid; // 0x10(0x10)
};

// Object: ScriptStruct Engine.EdGraphPinReference
// Size: 0x18 (Inherited: 0x0)
struct FEdGraphPinReference
{
	struct TWeakObjectPtr<struct UEdGraphNode> OwningNode; // 0x0(0x8)
	struct FGuid PinId; // 0x8(0x10)
};

// Object: ScriptStruct Engine.EdGraphSchemaAction
// Size: 0x100 (Inherited: 0x0)
struct FEdGraphSchemaAction
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct FText MenuDescription; // 0x8(0x18)
	struct FText TooltipDescription; // 0x20(0x18)
	struct FText Category; // 0x38(0x18)
	struct FText Keywords; // 0x50(0x18)
	int32_t Grouping; // 0x68(0x4)
	int32_t SectionID; // 0x6C(0x4)
	struct TArray<struct FString> MenuDescriptionArray; // 0x70(0x10)
	struct TArray<struct FString> FullSearchTitlesArray; // 0x80(0x10)
	struct TArray<struct FString> FullSearchKeywordsArray; // 0x90(0x10)
	struct TArray<struct FString> FullSearchCategoryArray; // 0xA0(0x10)
	struct TArray<struct FString> LocalizedMenuDescriptionArray; // 0xB0(0x10)
	struct TArray<struct FString> LocalizedFullSearchTitlesArray; // 0xC0(0x10)
	struct TArray<struct FString> LocalizedFullSearchKeywordsArray; // 0xD0(0x10)
	struct TArray<struct FString> LocalizedFullSearchCategoryArray; // 0xE0(0x10)
	struct FString SearchText; // 0xF0(0x10)
};

// Object: ScriptStruct Engine.EdGraphSchemaAction_NewNode
// Size: 0x108 (Inherited: 0x100)
struct FEdGraphSchemaAction_NewNode : FEdGraphSchemaAction
{
	struct UEdGraphNode* NodeTemplate; // 0x100(0x8)
};

// Object: ScriptStruct Engine.PluginRedirect
// Size: 0x20 (Inherited: 0x0)
struct FPluginRedirect
{
	struct FString OldPluginName; // 0x0(0x10)
	struct FString NewPluginName; // 0x10(0x10)
};

// Object: ScriptStruct Engine.StructRedirect
// Size: 0x10 (Inherited: 0x0)
struct FStructRedirect
{
	struct FName OldStructName; // 0x0(0x8)
	struct FName NewStructName; // 0x8(0x8)
};

// Object: ScriptStruct Engine.ClassRedirect
// Size: 0x3C (Inherited: 0x0)
struct FClassRedirect
{
	struct FName ObjectName; // 0x0(0x8)
	struct FName OldClassName; // 0x8(0x8)
	struct FName NewClassName; // 0x10(0x8)
	struct FName OldSubobjName; // 0x18(0x8)
	struct FName NewSubobjName; // 0x20(0x8)
	struct FName NewClassClass; // 0x28(0x8)
	struct FName NewClassPackage; // 0x30(0x8)
	uint8_t InstanceOnly : 1; // 0x38(0x1), Mask(0x1)
	uint8_t BitPad_0x38_1 : 7; // 0x38(0x1)
	uint8_t Pad_0x39[0x3]; // 0x39(0x3)
};

// Object: ScriptStruct Engine.GameNameRedirect
// Size: 0x10 (Inherited: 0x0)
struct FGameNameRedirect
{
	struct FName OldGameName; // 0x0(0x8)
	struct FName NewGameName; // 0x8(0x8)
};

// Object: ScriptStruct Engine.ScreenMessageString
// Size: 0x30 (Inherited: 0x0)
struct FScreenMessageString
{
	uint64_t Key; // 0x0(0x8)
	struct FString ScreenMessage; // 0x8(0x10)
	struct FColor DisplayColor; // 0x18(0x4)
	float TimeToDisplay; // 0x1C(0x4)
	float CurrentTimeDisplayed; // 0x20(0x4)
	struct FVector2D TextScale; // 0x24(0x8)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct Engine.DropNoteInfo
// Size: 0x28 (Inherited: 0x0)
struct FDropNoteInfo
{
	struct FVector Location; // 0x0(0xC)
	struct FRotator Rotation; // 0xC(0xC)
	struct FString Comment; // 0x18(0x10)
};

// Object: ScriptStruct Engine.StatColorMapping
// Size: 0x28 (Inherited: 0x0)
struct FStatColorMapping
{
	struct FString StatName; // 0x0(0x10)
	struct TArray<struct FStatColorMapEntry> ColorMap; // 0x10(0x10)
	uint8_t DisableBlend : 1; // 0x20(0x1), Mask(0x1)
	uint8_t BitPad_0x20_1 : 7; // 0x20(0x1)
	uint8_t Pad_0x21[0x7]; // 0x21(0x7)
};

// Object: ScriptStruct Engine.StatColorMapEntry
// Size: 0x8 (Inherited: 0x0)
struct FStatColorMapEntry
{
	float In; // 0x0(0x4)
	struct FColor Out; // 0x4(0x4)
};

// Object: ScriptStruct Engine.URL
// Size: 0x68 (Inherited: 0x0)
struct FURL
{
	struct FString Protocol; // 0x0(0x10)
	struct FString Host; // 0x10(0x10)
	int32_t Port; // 0x20(0x4)
	int32_t Valid; // 0x24(0x4)
	struct FString Map; // 0x28(0x10)
	struct FString RedirectURL; // 0x38(0x10)
	struct TArray<struct FString> Op; // 0x48(0x10)
	struct FString Portal; // 0x58(0x10)
};

// Object: ScriptStruct Engine.WorldContext
// Size: 0x280 (Inherited: 0x0)
struct FWorldContext
{
	uint8_t Pad_0x0[0xB0]; // 0x0(0xB0)
	struct FName ContextHandle; // 0xB0(0x8)
	struct FString TravelURL; // 0xB8(0x10)
	uint8_t TravelType; // 0xC8(0x1)
	uint8_t Pad_0xC9[0x7]; // 0xC9(0x7)
	struct FURL LastURL; // 0xD0(0x68)
	struct FURL LastRemoteURL; // 0x138(0x68)
	struct UPendingNetGame* PendingNetGame; // 0x1A0(0x8)
	struct TArray<struct FFullyLoadedPackagesInfo> PackagesToFullyLoad; // 0x1A8(0x10)
	struct TArray<struct FName> LevelsToLoadForPendingMapChange; // 0x1B8(0x10)
	struct TArray<struct ULevel*> LoadedLevelsForPendingMapChange; // 0x1C8(0x10)
	struct FString PendingMapChangeFailureDescription; // 0x1D8(0x10)
	uint8_t bShouldCommitPendingMapChange : 1; // 0x1E8(0x1), Mask(0x1)
	uint8_t BitPad_0x1E8_1 : 7; // 0x1E8(0x1)
	uint8_t Pad_0x1E9[0x7]; // 0x1E9(0x7)
	struct TArray<struct UObjectReferencer*> ObjectReferencers; // 0x1F0(0x10)
	struct TArray<struct FLevelStreamingStatus> PendingLevelStreamingStatusUpdates; // 0x200(0x10)
	struct UGameViewportClient* GameViewport; // 0x210(0x8)
	struct UGameInstance* OwningGameInstance; // 0x218(0x8)
	struct TArray<struct FNamedNetDriver> ActiveNetDrivers; // 0x220(0x10)
	int32_t PIEInstance; // 0x230(0x4)
	uint8_t Pad_0x234[0x4]; // 0x234(0x4)
	struct FString PIEPrefix; // 0x238(0x10)
	uint8_t Pad_0x248[0x4]; // 0x248(0x4)
	uint8_t RunAsDedicated : 1; // 0x24C(0x1), Mask(0x1)
	uint8_t BitPad_0x24C_1 : 7; // 0x24C(0x1)
	uint8_t bWaitingOnOnlineSubsystem : 1; // 0x24D(0x1), Mask(0x1)
	uint8_t BitPad_0x24D_1 : 7; // 0x24D(0x1)
	uint8_t Pad_0x24E[0x2]; // 0x24E(0x2)
	uint32_t AudioDeviceHandle; // 0x250(0x4)
	uint8_t Pad_0x254[0x4]; // 0x254(0x4)
	struct FString CustomDescription; // 0x258(0x10)
	uint8_t Pad_0x268[0x18]; // 0x268(0x18)
};

// Object: ScriptStruct Engine.NamedNetDriver
// Size: 0x10 (Inherited: 0x0)
struct FNamedNetDriver
{
	struct UNetDriver* NetDriver; // 0x0(0x8)
	uint8_t Pad_0x8[0x8]; // 0x8(0x8)
};

// Object: ScriptStruct Engine.LevelStreamingStatus
// Size: 0x10 (Inherited: 0x0)
struct FLevelStreamingStatus
{
	struct FName PackageName; // 0x0(0x8)
	uint8_t bShouldBeLoaded : 1; // 0x8(0x1), Mask(0x1)
	uint8_t bShouldBeVisible : 1; // 0x8(0x1), Mask(0x2)
	uint8_t BitPad_0x8_2 : 6; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
	uint32_t LodIndex; // 0xC(0x4)
};

// Object: ScriptStruct Engine.FullyLoadedPackagesInfo
// Size: 0x38 (Inherited: 0x0)
struct FFullyLoadedPackagesInfo
{
	EFullyLoadPackageType FullyLoadType; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct FString Tag; // 0x8(0x10)
	struct TArray<struct FName> PackagesToLoad; // 0x18(0x10)
	struct TArray<struct UObject*> LoadedObjects; // 0x28(0x10)
};

// Object: ScriptStruct Engine.NetDriverDefinition
// Size: 0x18 (Inherited: 0x0)
struct FNetDriverDefinition
{
	struct FName DefName; // 0x0(0x8)
	struct FName DriverClassName; // 0x8(0x8)
	struct FName DriverClassNameFallback; // 0x10(0x8)
};

// Object: ScriptStruct Engine.ExposureSettings
// Size: 0xC (Inherited: 0x0)
struct FExposureSettings
{
	float FixedEV100; // 0x0(0x4)
	uint8_t bFixed : 1; // 0x4(0x1), Mask(0x1)
	uint8_t BitPad_0x4_1 : 7; // 0x4(0x1)
	uint8_t bUseLuminance : 1; // 0x5(0x1), Mask(0x1)
	uint8_t BitPad_0x5_1 : 7; // 0x5(0x1)
	uint8_t Pad_0x6[0x2]; // 0x6(0x2)
	float Fixedluminance; // 0x8(0x4)
};

// Object: ScriptStruct Engine.TickPrerequisite
// Size: 0x10 (Inherited: 0x0)
struct FTickPrerequisite
{
	uint8_t Pad_0x0[0x10]; // 0x0(0x10)
};

// Object: ScriptStruct Engine.LightMapAtlasPackingSettings
// Size: 0x20 (Inherited: 0x0)
struct FLightMapAtlasPackingSettings
{
	ELightMapGroupingPolicy LightMapGroupingPolicy; // 0x0(0x1)
	ELightMapAllocationPolicy LightMapAllocationPolicy; // 0x1(0x1)
	uint8_t bPackAndNoBaking : 1; // 0x2(0x1), Mask(0x1)
	uint8_t BitPad_0x2_1 : 7; // 0x2(0x1)
	uint8_t Pad_0x3[0x1]; // 0x3(0x1)
	int32_t TotalLightMapCount; // 0x4(0x4)
	float TexelPerMeter; // 0x8(0x4)
	float MinTexelPerTriangle; // 0xC(0x4)
	float GlobalLODLightMapScaleFactor; // 0x10(0x4)
	int32_t MaxLightMapResolution; // 0x14(0x4)
	int32_t AtlasPaddingPixels; // 0x18(0x4)
	int32_t LightMapMarginPixels; // 0x1C(0x4)
};

// Object: ScriptStruct Engine.CanvasUVTri
// Size: 0x60 (Inherited: 0x0)
struct FCanvasUVTri
{
	struct FVector2D V0_Pos; // 0x0(0x8)
	struct FVector2D V0_UV; // 0x8(0x8)
	struct FLinearColor V0_Color; // 0x10(0x10)
	struct FVector2D V1_Pos; // 0x20(0x8)
	struct FVector2D V1_UV; // 0x28(0x8)
	struct FLinearColor V1_Color; // 0x30(0x10)
	struct FVector2D V2_Pos; // 0x40(0x8)
	struct FVector2D V2_UV; // 0x48(0x8)
	struct FLinearColor V2_Color; // 0x50(0x10)
};

// Object: ScriptStruct Engine.DepthFieldGlowInfo
// Size: 0x24 (Inherited: 0x0)
struct FDepthFieldGlowInfo
{
	uint8_t bEnableGlow : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct FLinearColor GlowColor; // 0x4(0x10)
	struct FVector2D GlowOuterRadius; // 0x14(0x8)
	struct FVector2D GlowInnerRadius; // 0x1C(0x8)
};

// Object: ScriptStruct Engine.FontRenderInfo
// Size: 0x28 (Inherited: 0x0)
struct FFontRenderInfo
{
	uint8_t bClipText : 1; // 0x0(0x1), Mask(0x1)
	uint8_t bEnableShadow : 1; // 0x0(0x1), Mask(0x2)
	uint8_t BitPad_0x0_2 : 6; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	struct FDepthFieldGlowInfo GlowInfo; // 0x4(0x24)
};

// Object: ScriptStruct Engine.Redirector
// Size: 0x10 (Inherited: 0x0)
struct FRedirector
{
	struct FName OldName; // 0x0(0x8)
	struct FName NewName; // 0x8(0x8)
};

// Object: ScriptStruct Engine.CollectionReference
// Size: 0x8 (Inherited: 0x0)
struct FCollectionReference
{
	struct FName CollectionName; // 0x0(0x8)
};

// Object: ScriptStruct Engine.ComponentReference
// Size: 0x28 (Inherited: 0x0)
struct FComponentReference
{
	struct AActor* OtherActor; // 0x0(0x8)
	struct FName ComponentProperty; // 0x8(0x8)
	struct FString PathToComponent; // 0x10(0x10)
	uint8_t Pad_0x20[0x8]; // 0x20(0x8)
};

// Object: ScriptStruct Engine.ConstrainComponentPropName
// Size: 0x8 (Inherited: 0x0)
struct FConstrainComponentPropName
{
	struct FName ComponentName; // 0x0(0x8)
};

// Object: ScriptStruct Engine.DamageEvent
// Size: 0x10 (Inherited: 0x0)
struct FDamageEvent
{
	uint8_t Pad_0x0[0x8]; // 0x0(0x8)
	struct UDamageType* DamageTypeClass; // 0x8(0x8)
};

// Object: ScriptStruct Engine.RadialDamageParams
// Size: 0x14 (Inherited: 0x0)
struct FRadialDamageParams
{
	float BaseDamage; // 0x0(0x4)
	float MinimumDamage; // 0x4(0x4)
	float InnerRadius; // 0x8(0x4)
	float OuterRadius; // 0xC(0x4)
	float DamageFalloff; // 0x10(0x4)
};

// Object: ScriptStruct Engine.RadialDamageEvent
// Size: 0x40 (Inherited: 0x10)
struct FRadialDamageEvent : FDamageEvent
{
	struct FRadialDamageParams Params; // 0x10(0x14)
	struct FVector Origin; // 0x24(0xC)
	struct TArray<struct FHitResult> ComponentHits; // 0x30(0x10)
};

// Object: ScriptStruct Engine.PointDamageEvent
// Size: 0xA8 (Inherited: 0x10)
struct FPointDamageEvent : FDamageEvent
{
	float Damage; // 0x10(0x4)
	struct FVector_NetQuantizeNormal ShotDirection; // 0x14(0xC)
	struct FHitResult HitInfo; // 0x20(0x88)
};

// Object: ScriptStruct Engine.SkeletalMeshBuildSettings
// Size: 0x10 (Inherited: 0x0)
struct FSkeletalMeshBuildSettings
{
	uint8_t bRecomputeNormals : 1; // 0x0(0x1), Mask(0x1)
	uint8_t bRecomputeTangents : 1; // 0x0(0x1), Mask(0x2)
	uint8_t bUseMikkTSpace : 1; // 0x0(0x1), Mask(0x4)
	uint8_t bComputeWeightedNormals : 1; // 0x0(0x1), Mask(0x8)
	uint8_t bRemoveDegenerates : 1; // 0x0(0x1), Mask(0x10)
	uint8_t bUseHighPrecisionTangentBasis : 1; // 0x0(0x1), Mask(0x20)
	uint8_t bUseFullPrecisionUVs : 1; // 0x0(0x1), Mask(0x40)
	uint8_t bBuildAdjacencyBuffer : 1; // 0x0(0x1), Mask(0x80)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float ThresholdPosition; // 0x4(0x4)
	float ThresholdTangentNormal; // 0x8(0x4)
	float ThresholdUV; // 0xC(0x4)
};

// Object: ScriptStruct Engine.MeshBuildSettings
// Size: 0x30 (Inherited: 0x0)
struct FMeshBuildSettings
{
	uint8_t bUseMikkTSpace : 1; // 0x0(0x1), Mask(0x1)
	uint8_t bRecomputeNormals : 1; // 0x0(0x1), Mask(0x2)
	uint8_t bRecomputeTangents : 1; // 0x0(0x1), Mask(0x4)
	uint8_t bComputeWeightedNormals : 1; // 0x0(0x1), Mask(0x8)
	uint8_t bRemoveDegenerates : 1; // 0x0(0x1), Mask(0x10)
	uint8_t bBuildAdjacencyBuffer : 1; // 0x0(0x1), Mask(0x20)
	uint8_t bBuildReversedIndexBuffer : 1; // 0x0(0x1), Mask(0x40)
	uint8_t bUseHighPrecisionTangentBasis : 1; // 0x0(0x1), Mask(0x80)
	uint8_t bUseFullPrecisionUVs : 1; // 0x1(0x1), Mask(0x1)
	uint8_t bGenerateLightmapUVs : 1; // 0x1(0x1), Mask(0x2)
	uint8_t bGenerateDistanceFieldAsIfTwoSided : 1; // 0x1(0x1), Mask(0x4)
	uint8_t BitPad_0x1_3 : 5; // 0x1(0x1)
	uint8_t Pad_0x2[0x2]; // 0x2(0x2)
	int32_t UseNormalizedUVsBitMask; // 0x4(0x4)
	int32_t MinLightmapResolution; // 0x8(0x4)
	int32_t SrcLightmapIndex; // 0xC(0x4)
	int32_t DstLightmapIndex; // 0x10(0x4)
	float BuildScale; // 0x14(0x4)
	struct FVector BuildScale3D; // 0x18(0xC)
	float DistanceFieldResolutionScale; // 0x24(0x4)
	struct UStaticMesh* DistanceFieldReplacementMesh; // 0x28(0x8)
};

// Object: ScriptStruct Engine.POV
// Size: 0x1C (Inherited: 0x0)
struct FPOV
{
	struct FVector Location; // 0x0(0xC)
	struct FRotator Rotation; // 0xC(0xC)
	float FOV; // 0x18(0x4)
};

// Object: ScriptStruct Engine.AnimUpdateRateParameters
// Size: 0xA0 (Inherited: 0x0)
struct FAnimUpdateRateParameters
{
	uint8_t Pad_0x0[0x1]; // 0x0(0x1)
	EUpdateRateShiftBucket ShiftBucket; // 0x1(0x1)
	uint8_t bInterpolateSkippedFrames : 1; // 0x2(0x1), Mask(0x1)
	uint8_t bShouldUseLodMap : 1; // 0x2(0x1), Mask(0x2)
	uint8_t bShouldUseMinLod : 1; // 0x2(0x1), Mask(0x4)
	uint8_t bShouldUseMinURO : 1; // 0x2(0x1), Mask(0x8)
	uint8_t bSkipUpdate : 1; // 0x2(0x1), Mask(0x10)
	uint8_t bSkipEvaluation : 1; // 0x2(0x1), Mask(0x20)
	uint8_t BitPad_0x2_6 : 2; // 0x2(0x1)
	uint8_t Pad_0x3[0x1]; // 0x3(0x1)
	int32_t UpdateRate; // 0x4(0x4)
	int32_t EvaluationRate; // 0x8(0x4)
	float TickedPoseOffestTime; // 0xC(0x4)
	float AdditionalTime; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
	int32_t BaseNonRenderedUpdateRate; // 0x18(0x4)
	int32_t MaxEvalRateForInterpolation; // 0x1C(0x4)
	struct TArray<float> BaseVisibleDistanceFactorThesholds; // 0x20(0x10)
	struct TMap<int32_t, int32_t> LODToFrameSkipMap; // 0x30(0x50)
	struct TArray<struct FAnimThresholdRate> BaseVisibleDistanceFactorThesholdsRates; // 0x80(0x10)
	uint8_t Pad_0x90[0x8]; // 0x90(0x8)
	int32_t SkippedUpdateFrames; // 0x98(0x4)
	int32_t SkippedEvalFrames; // 0x9C(0x4)
};

// Object: ScriptStruct Engine.AnimThresholdRate
// Size: 0x8 (Inherited: 0x0)
struct FAnimThresholdRate
{
	float Threshold; // 0x0(0x4)
	int32_t Rate; // 0x4(0x4)
};

// Object: ScriptStruct Engine.AnimSlotDesc
// Size: 0xC (Inherited: 0x0)
struct FAnimSlotDesc
{
	struct FName SlotName; // 0x0(0x8)
	int32_t NumChannels; // 0x8(0x4)
};

// Object: ScriptStruct Engine.AnimSlotInfo
// Size: 0x18 (Inherited: 0x0)
struct FAnimSlotInfo
{
	struct FName SlotName; // 0x0(0x8)
	struct TArray<float> ChannelWeights; // 0x8(0x10)
};

// Object: ScriptStruct Engine.MTDResult
// Size: 0x10 (Inherited: 0x0)
struct FMTDResult
{
	struct FVector Direction; // 0x0(0xC)
	float Distance; // 0xC(0x4)
};

// Object: ScriptStruct Engine.OverlapResult
// Size: 0x20 (Inherited: 0x0)
struct FOverlapResult
{
	struct TWeakObjectPtr<struct AActor> Actor; // 0x0(0x8)
	struct TWeakObjectPtr<struct UPrimitiveComponent> Component; // 0x8(0x8)
	uint8_t Pad_0x10[0xC]; // 0x10(0xC)
	uint8_t bBlockingHit : 1; // 0x1C(0x1), Mask(0x1)
	uint8_t BitPad_0x1C_1 : 7; // 0x1C(0x1)
	uint8_t Pad_0x1D[0x3]; // 0x1D(0x3)
};

// Object: ScriptStruct Engine.PrimitiveMaterialRef
// Size: 0x18 (Inherited: 0x0)
struct FPrimitiveMaterialRef
{
	struct UPrimitiveComponent* Primitive; // 0x0(0x8)
	struct UDecalComponent* Decal; // 0x8(0x8)
	int32_t ElementIndex; // 0x10(0x4)
	uint8_t Pad_0x14[0x4]; // 0x14(0x4)
};

// Object: ScriptStruct Engine.SwarmDebugOptions
// Size: 0x4 (Inherited: 0x0)
struct FSwarmDebugOptions
{
	uint8_t bDistributionEnabled : 1; // 0x0(0x1), Mask(0x1)
	uint8_t bForceContentExport : 1; // 0x0(0x1), Mask(0x2)
	uint8_t bInitialized : 1; // 0x0(0x1), Mask(0x4)
	uint8_t BitPad_0x0_3 : 5; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
};

// Object: ScriptStruct Engine.LightmassDebugOptions
// Size: 0x10 (Inherited: 0x0)
struct FLightmassDebugOptions
{
	uint8_t bDebugMode : 1; // 0x0(0x1), Mask(0x1)
	uint8_t bStatsEnabled : 1; // 0x0(0x1), Mask(0x2)
	uint8_t bGatherBSPSurfacesAcrossComponents : 1; // 0x0(0x1), Mask(0x4)
	uint8_t BitPad_0x0_3 : 5; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float CoplanarTolerance; // 0x4(0x4)
	uint8_t bUseImmediateImport : 1; // 0x8(0x1), Mask(0x1)
	uint8_t bImmediateProcessMappings : 1; // 0x8(0x1), Mask(0x2)
	uint8_t bSortMappings : 1; // 0x8(0x1), Mask(0x4)
	uint8_t bDumpBinaryFiles : 1; // 0x8(0x1), Mask(0x8)
	uint8_t bDebugMaterials : 1; // 0x8(0x1), Mask(0x10)
	uint8_t bPadMappings : 1; // 0x8(0x1), Mask(0x20)
	uint8_t bDebugPaddings : 1; // 0x8(0x1), Mask(0x40)
	uint8_t bOnlyCalcDebugTexelMappings : 1; // 0x8(0x1), Mask(0x80)
	uint8_t bUseRandomColors : 1; // 0x9(0x1), Mask(0x1)
	uint8_t bColorBordersGreen : 1; // 0x9(0x1), Mask(0x2)
	uint8_t bColorByExecutionTime : 1; // 0x9(0x1), Mask(0x4)
	uint8_t BitPad_0x9_3 : 5; // 0x9(0x1)
	uint8_t Pad_0xA[0x2]; // 0xA(0x2)
	float ExecutionTimeDivisor; // 0xC(0x4)
};

// Object: ScriptStruct Engine.LightmassPrimitiveSettings
// Size: 0x20 (Inherited: 0x0)
struct FLightmassPrimitiveSettings
{
	uint8_t bUseTwoSidedLighting : 1; // 0x0(0x1), Mask(0x1)
	uint8_t bShadowIndirectOnly : 1; // 0x0(0x1), Mask(0x2)
	uint8_t bUseEmissiveForStaticLighting : 1; // 0x0(0x1), Mask(0x4)
	uint8_t bUseVertexNormalForHemisphereGather : 1; // 0x0(0x1), Mask(0x8)
	uint8_t BitPad_0x0_4 : 4; // 0x0(0x1)
	uint8_t Pad_0x1[0x3]; // 0x1(0x3)
	float EmissiveLightFalloffExponent; // 0x4(0x4)
	float EmissiveLightExplicitInfluenceRadius; // 0x8(0x4)
	float EmissiveBoost; // 0xC(0x4)
	float EmissiveAttenuationRadius; // 0x10(0x4)
	float DiffuseBoost; // 0x14(0x4)
	float FullyOccludedSamplesFraction; // 0x18(0x4)
	uint8_t bJoinLocalLightBake : 1; // 0x1C(0x1), Mask(0x1)
	uint8_t bIgnoreBounds : 1; // 0x1C(0x1), Mask(0x2)
	uint8_t BitPad_0x1C_2 : 6; // 0x1C(0x1)
	uint8_t Pad_0x1D[0x3]; // 0x1D(0x3)
};

// Object: ScriptStruct Engine.LightmassLightSettings
// Size: 0xC (Inherited: 0x0)
struct FLightmassLightSettings
{
	float IndirectLightingSaturation; // 0x0(0x4)
	float ShadowExponent; // 0x4(0x4)
	uint8_t bUseAreaShadowsForStationaryLight : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t Pad_0x9[0x3]; // 0x9(0x3)
};

// Object: ScriptStruct Engine.LightmassDirectionalLightSettings
// Size: 0x10 (Inherited: 0xC)
struct FLightmassDirectionalLightSettings : FLightmassLightSettings
{
	float LightSourceAngle; // 0xC(0x4)
};

// Object: ScriptStruct Engine.LightmassPointLightSettings
// Size: 0xC (Inherited: 0xC)
struct FLightmassPointLightSettings : FLightmassLightSettings
{
};

// Object: ScriptStruct Engine.BasedPosition
// Size: 0x38 (Inherited: 0x0)
struct FBasedPosition
{
	struct AActor* Base; // 0x0(0x8)
	struct FVector Position; // 0x8(0xC)
	struct FVector CachedBaseLocation; // 0x14(0xC)
	struct FRotator CachedBaseRotation; // 0x20(0xC)
	struct FVector CachedTransPosition; // 0x2C(0xC)
};

// Object: ScriptStruct Engine.FractureEffect
// Size: 0x10 (Inherited: 0x0)
struct FFractureEffect
{
	struct UParticleSystem* ParticleSystem; // 0x0(0x8)
	struct USoundBase* Sound; // 0x8(0x8)
};

// Object: ScriptStruct Engine.CollisionImpactData
// Size: 0x28 (Inherited: 0x0)
struct FCollisionImpactData
{
	struct TArray<struct FRigidBodyContactInfo> ContactInfos; // 0x0(0x10)
	struct FVector TotalNormalImpulse; // 0x10(0xC)
	struct FVector TotalFrictionImpulse; // 0x1C(0xC)
};

// Object: ScriptStruct Engine.RigidBodyContactInfo
// Size: 0x30 (Inherited: 0x0)
struct FRigidBodyContactInfo
{
	struct FVector ContactPosition; // 0x0(0xC)
	struct FVector ContactNormal; // 0xC(0xC)
	float ContactPenetration; // 0x18(0x4)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	struct UPhysicalMaterial* PhysMaterial[0x2]; // 0x20(0x10)
};

// Object: ScriptStruct Engine.RigidBodyErrorCorrection
// Size: 0x34 (Inherited: 0x0)
struct FRigidBodyErrorCorrection
{
	float PingExtrapolation; // 0x0(0x4)
	float PingLimit; // 0x4(0x4)
	float ErrorPerLinearDifference; // 0x8(0x4)
	float ErrorPerAngularDifference; // 0xC(0x4)
	float MaxRestoredStateError; // 0x10(0x4)
	float MaxLinearHardSnapDistance; // 0x14(0x4)
	float PositionLerp; // 0x18(0x4)
	float AngleLerp; // 0x1C(0x4)
	float LinearVelocityCoefficient; // 0x20(0x4)
	float AngularVelocityCoefficient; // 0x24(0x4)
	float ErrorAccumulationSeconds; // 0x28(0x4)
	float ErrorAccumulationDistanceSq; // 0x2C(0x4)
	float ErrorAccumulationSimilarity; // 0x30(0x4)
};

// Object: ScriptStruct Engine.MaterialShadingModelField
// Size: 0x2 (Inherited: 0x0)
struct FMaterialShadingModelField
{
	uint16_t ShadingModelField; // 0x0(0x2)
};

// Object: ScriptStruct Engine.AttachmentTransformRules
// Size: 0x4 (Inherited: 0x0)
struct FAttachmentTransformRules
{
	EAttachmentRule LocationRule; // 0x0(0x1)
	EAttachmentRule RotationRule; // 0x1(0x1)
	EAttachmentRule ScaleRule; // 0x2(0x1)
	uint8_t bWeldSimulatedBodies : 1; // 0x3(0x1), Mask(0x1)
	uint8_t BitPad_0x3_1 : 7; // 0x3(0x1)
};

// Object: ScriptStruct Engine.GlobalInteriorFogData
// Size: 0x30 (Inherited: 0x0)
struct FGlobalInteriorFogData
{
	struct UMaterialInterface* InteriorFogMaterial; // 0x0(0x8)
	struct FLinearColor Albedo; // 0x8(0x10)
	float ExtinctionScale; // 0x18(0x4)
	float ViewDistance; // 0x1C(0x4)
	float ExcludeRange; // 0x20(0x4)
	float ExcludeOpacity; // 0x24(0x4)
	float ExtendVisibleDistance; // 0x28(0x4)
	uint8_t Pad_0x2C[0x4]; // 0x2C(0x4)
};

// Object: ScriptStruct Engine.ExponentialHeightFogData
// Size: 0x10 (Inherited: 0x0)
struct FExponentialHeightFogData
{
	float SecondFogDensity; // 0x0(0x4)
	float SecondFogHeightFalloff; // 0x4(0x4)
	float SecondFogHeightOffset; // 0x8(0x4)
	float SecondFogStartDistance; // 0xC(0x4)
};

// Object: ScriptStruct Engine.FontCharacter
// Size: 0x18 (Inherited: 0x0)
struct FFontCharacter
{
	int32_t StartU; // 0x0(0x4)
	int32_t StartV; // 0x4(0x4)
	int32_t USize; // 0x8(0x4)
	int32_t VSize; // 0xC(0x4)
	uint8_t TextureIndex; // 0x10(0x1)
	uint8_t Pad_0x11[0x3]; // 0x11(0x3)
	int32_t VerticalOffset; // 0x14(0x4)
};

// Object: ScriptStruct Engine.FontImportOptionsData
// Size: 0xA8 (Inherited: 0x0)
struct FFontImportOptionsData
{
	struct FString FontName; // 0x0(0x10)
	float Height; // 0x10(0x4)
	uint8_t bEnableAntialiasing : 1; // 0x14(0x1), Mask(0x1)
	uint8_t bEnableBold : 1; // 0x14(0x1), Mask(0x2)
	uint8_t bEnableItalic : 1; // 0x14(0x1), Mask(0x4)
	uint8_t bEnableUnderline : 1; // 0x14(0x1), Mask(0x8)
	uint8_t bAlphaOnly : 1; // 0x14(0x1), Mask(0x10)
	uint8_t BitPad_0x14_5 : 3; // 0x14(0x1)
	EFontImportCharacterSet CharacterSet; // 0x15(0x1)
	uint8_t Pad_0x16[0x2]; // 0x16(0x2)
	struct FString Chars; // 0x18(0x10)
	struct FString UnicodeRange; // 0x28(0x10)
	struct FString CharsFilePath; // 0x38(0x10)
	struct FString CharsFileWildcard; // 0x48(0x10)
	uint8_t bCreatePrintableOnly : 1; // 0x58(0x1), Mask(0x1)
	uint8_t bIncludeASCIIRange : 1; // 0x58(0x1), Mask(0x2)
	uint8_t BitPad_0x58_2 : 6; // 0x58(0x1)
	uint8_t Pad_0x59[0x3]; // 0x59(0x3)
	struct FLinearColor ForegroundColor; // 0x5C(0x10)
	uint8_t bEnableDropShadow : 1; // 0x6C(0x1), Mask(0x1)
	uint8_t BitPad_0x6C_1 : 7; // 0x6C(0x1)
	uint8_t Pad_0x6D[0x3]; // 0x6D(0x3)
	int32_t TexturePageWidth; // 0x70(0x4)
	int32_t TexturePageMaxHeight; // 0x74(0x4)
	int32_t XPadding; // 0x78(0x4)
	int32_t YPadding; // 0x7C(0x4)
	int32_t ExtendBoxTop; // 0x80(0x4)
	int32_t ExtendBoxBottom; // 0x84(0x4)
	int32_t ExtendBoxRight; // 0x88(0x4)
	int32_t ExtendBoxLeft; // 0x8C(0x4)
	uint8_t bEnableLegacyMode : 1; // 0x90(0x1), Mask(0x1)
	uint8_t BitPad_0x90_1 : 7; // 0x90(0x1)
	uint8_t Pad_0x91[0x3]; // 0x91(0x3)
	int32_t Kerning; // 0x94(0x4)
	uint8_t bUseDistanceFieldAlpha : 1; // 0x98(0x1), Mask(0x1)
	uint8_t BitPad_0x98_1 : 7; // 0x98(0x1)
	uint8_t Pad_0x99[0x3]; // 0x99(0x3)
	int32_t DistanceFieldScaleFactor; // 0x9C(0x4)
	float DistanceFieldScanRadiusScale; // 0xA0(0x4)
	uint8_t Pad_0xA4[0x4]; // 0xA4(0x4)
};

// Object: ScriptStruct Engine.ForceFeedbackAttenuationSettings
// Size: 0xC8 (Inherited: 0xC8)
struct FForceFeedbackAttenuationSettings : FBaseAttenuationSettings
{
};

// Object: ScriptStruct Engine.ActiveForceFeedbackEffect
// Size: 0x18 (Inherited: 0x0)
struct FActiveForceFeedbackEffect
{
	struct UForceFeedbackEffect* ForceFeedbackEffect; // 0x0(0x8)
	uint8_t Pad_0x8[0x10]; // 0x8(0x10)
};

// Object: ScriptStruct Engine.ForceFeedbackParameters
// Size: 0xC (Inherited: 0x0)
struct FForceFeedbackParameters
{
	struct FName Tag; // 0x0(0x8)
	uint8_t bLooping : 1; // 0x8(0x1), Mask(0x1)
	uint8_t BitPad_0x8_1 : 7; // 0x8(0x1)
	uint8_t bIgnoreTimeDilation : 1; // 0x9(0x1), Mask(0x1)
	uint8_t BitPad_0x9_1 : 7; // 0x9(0x1)
	uint8_t bPlayWhilePaused : 1; // 0xA(0x1), Mask(0x1)
	uint8_t BitPad_0xA_1 : 7; // 0xA(0x1)
	uint8_t Pad_0xB[0x1]; // 0xB(0x1)
};

// Object: ScriptStruct Engine.ForceFeedbackChannelDetails
// Size: 0xA8 (Inherited: 0x0)
struct FForceFeedbackChannelDetails
{
	uint8_t bAffectsLeftLarge : 1; // 0x0(0x1), Mask(0x1)
	uint8_t bAffectsLeftSmall : 1; // 0x0(0x1), Mask(0x2)
	uint8_t bAffectsRightLarge : 1; // 0x0(0x1), Mask(0x4)
	uint8_t bAffectsRightSmall : 1; // 0x0(0x1), Mask(0x8)
	uint8_t BitPad_0x0_4 : 4; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct FRuntimeFloatCurve Curve; // 0x8(0xA0)
};

// Object: ScriptStruct Engine.PredictProjectilePathPointData
// Size: 0x1C (Inherited: 0x0)
struct FPredictProjectilePathPointData
{
	struct FVector Location; // 0x0(0xC)
	struct FVector Velocity; // 0xC(0xC)
	float Time; // 0x18(0x4)
};

// Object: ScriptStruct Engine.PredictProjectilePathResult
// Size: 0xB8 (Inherited: 0x0)
struct FPredictProjectilePathResult
{
	struct TArray<struct FPredictProjectilePathPointData> PathData; // 0x0(0x10)
	struct FPredictProjectilePathPointData LastTraceDestination; // 0x10(0x1C)
	struct FHitResult HitResult; // 0x2C(0x88)
	uint8_t Pad_0xB4[0x4]; // 0xB4(0x4)
};

// Object: ScriptStruct Engine.ActiveHapticFeedbackEffect
// Size: 0x18 (Inherited: 0x0)
struct FActiveHapticFeedbackEffect
{
	struct UHapticFeedbackEffect_Base* HapticEffect; // 0x0(0x8)
	uint8_t Pad_0x8[0x10]; // 0x8(0x10)
};

// Object: ScriptStruct Engine.HapticFeedbackDetails_Curve
// Size: 0x140 (Inherited: 0x0)
struct FHapticFeedbackDetails_Curve
{
	struct FRuntimeFloatCurve frequency; // 0x0(0xA0)
	struct FRuntimeFloatCurve Amplitude; // 0xA0(0xA0)
};

// Object: ScriptStruct Engine.ClusterNode
// Size: 0x40 (Inherited: 0x0)
struct FClusterNode
{
	struct FVector BoundMin; // 0x0(0xC)
	int32_t FirstChild; // 0xC(0x4)
	struct FVector BoundMax; // 0x10(0xC)
	int32_t LastChild; // 0x1C(0x4)
	int32_t FirstInstance; // 0x20(0x4)
	int32_t LastInstance; // 0x24(0x4)
	struct FVector MinInstanceScale; // 0x28(0xC)
	struct FVector MaxInstanceScale; // 0x34(0xC)
};

// Object: ScriptStruct Engine.ClusterNode_DEPRECATED
// Size: 0x28 (Inherited: 0x0)
struct FClusterNode_DEPRECATED
{
	struct FVector BoundMin; // 0x0(0xC)
	int32_t FirstChild; // 0xC(0x4)
	struct FVector BoundMax; // 0x10(0xC)
	int32_t LastChild; // 0x1C(0x4)
	int32_t FirstInstance; // 0x20(0x4)
	int32_t LastInstance; // 0x24(0x4)
};

// Object: ScriptStruct Engine.HLODProxyMesh
// Size: 0x30 (Inherited: 0x0)
struct FHLODProxyMesh
{
	struct TLazyObjectPtr<struct ALODActor> LODActor; // 0x0(0x1C)
	uint8_t Pad_0x1C[0x4]; // 0x1C(0x4)
	struct UStaticMesh* StaticMesh; // 0x20(0x8)
	struct FName Key; // 0x28(0x8)
};

// Object: ScriptStruct Engine.SoundModulationParameter
// Size: 0x14 (Inherited: 0x0)
struct FSoundModulationParameter
{
	struct FName Control; // 0x0(0x8)
	float Value; // 0x8(0x4)
	uint8_t Pad_0xC[0x8]; // 0xC(0x8)
};

// Object: ScriptStruct Engine.SoundModulation
// Size: 0x10 (Inherited: 0x0)
struct FSoundModulation
{
	struct TArray<struct USoundModulationPluginSourceSettingsBase*> Settings; // 0x0(0x10)
};

// Object: ScriptStruct Engine.ImportanceTexture
// Size: 0x50 (Inherited: 0x0)
struct FImportanceTexture
{
	struct FIntPoint size; // 0x0(0x8)
	int32_t NumMips; // 0x8(0x4)
	uint8_t Pad_0xC[0x4]; // 0xC(0x4)
	struct TArray<float> MarginalCDF; // 0x10(0x10)
	struct TArray<float> ConditionalCDF; // 0x20(0x10)
	struct TArray<struct FColor> TextureData; // 0x30(0x10)
	struct TWeakObjectPtr<struct UTexture2D> Texture; // 0x40(0x8)
	EImportanceWeight Weighting; // 0x48(0x1)
	uint8_t Pad_0x49[0x7]; // 0x49(0x7)
};

// Object: ScriptStruct Engine.ComponentKey
// Size: 0x20 (Inherited: 0x0)
struct FComponentKey
{
	struct UObject* OwnerClass; // 0x0(0x8)
	struct FName SCSVariableName; // 0x8(0x8)
	struct FGuid AssociatedGuid; // 0x10(0x10)
};

// Object: ScriptStruct Engine.ComponentOverrideRecord
// Size: 0x78 (Inherited: 0x0)
struct FComponentOverrideRecord
{
	struct UObject* ComponentClass; // 0x0(0x8)
	struct UActorComponent* ComponentTemplate; // 0x8(0x8)
	struct FComponentKey ComponentKey; // 0x10(0x20)
	struct FBlueprintCookedComponentInstancingData CookedComponentInstancingData; // 0x30(0x48)
};

// Object: ScriptStruct Engine.BlueprintInputDelegateBinding
// Size: 0x4 (Inherited: 0x0)
struct FBlueprintInputDelegateBinding
{
