#pragma once

#include "../CoreUObject_classes.hpp"
#include "Engine.hpp"
#include "GeneBatch.hpp"

namespace SDK
{

// Package: GeneBatchBlueprintGlue
// Enums: 1
// Structs: 9
// Classes: 2

struct AActor;
enum class EComponentMobility : uint8_t;
struct FGeneBatchAnalyzeHLODSettings;
struct FGeneBatchAtlasCountDetails;
struct FGeneBatchMaterialInputData;
struct FGeneBatchMergeInputInfo;
struct FGeneBatchMergeResultComponentInfo;
struct FGeneBatchMergeResultInfo;
struct FGeneBatchPOI;
struct FGeneBatchParameterOptimizationConfig;
struct FGeneBatchSMCInputData;
struct FGeneBatchTableRowResultHLODData;
struct FGeneBatchTableRowResultMergeDrawSection;
struct FGeneBatchTableRowResultMesh;
struct FGeneBatchTheme;
struct UActorComponent;
struct UDataTable;
struct UGeneBatchPOISettingsObject;
struct UGeneBatchSettingsObject;
struct ULevel;
struct ULocalLightGroupBake;
struct UMaterialInterface;
struct UPrimitiveComponent;
struct UStaticMesh;
struct UStaticMeshComponent;
struct UTexture2D;
struct UWorld;
struct FGeneBatchStaticMeshMergeInfo;
struct FGeneBatchCustomLevelFilterContext;
struct FGeneBatchPOIInputData;
struct FGeneBatchStaticMeshComponentArray;
struct FMaterialFilterInfo;
struct FLocalLightGroupBakeFilterInfo;
struct FBatchConfig;
struct FStaticMeshMergeInfo;
struct FSwapVertexColorObject;
struct UBatchHelper;
struct UGeneBatchBlueprintGlue;

// Object: Enum GeneBatchBlueprintGlue.EVertexColorChannel
enum class EVertexColorChannel : uint8_t
{
	Red = 0,
	Green = 1,
	Blue = 2,
	Alpha = 3,
	EVertexColorChannel_MAX = 4
};

// Object: ScriptStruct GeneBatchBlueprintGlue.GeneBatchStaticMeshMergeInfo
// Size: 0x50 (Inherited: 0x0)
struct FGeneBatchStaticMeshMergeInfo
{
	struct FString LevelKey; // 0x0(0x10)
	struct TArray<struct UStaticMeshComponent*> InputStaticMeshes; // 0x10(0x10)
	struct UStaticMeshComponent* MergedStaticMesh; // 0x20(0x8)
	struct AActor* BindToActor; // 0x28(0x8)
	struct FString AdditionalLevelKey; // 0x30(0x10)
	struct FVector ReferenceLocation; // 0x40(0xC)
	uint8_t Pad_0x4C[0x4]; // 0x4C(0x4)
};

// Object: ScriptStruct GeneBatchBlueprintGlue.GeneBatchCustomLevelFilterContext
// Size: 0x80 (Inherited: 0x0)
struct FGeneBatchCustomLevelFilterContext
{
	uint8_t bIsInitialized : 1; // 0x0(0x1), Mask(0x1)
	uint8_t BitPad_0x0_1 : 7; // 0x0(0x1)
	uint8_t Pad_0x1[0x7]; // 0x1(0x7)
	struct TSoftObjectPtr<UGeneBatchPOISettingsObject> POISettings; // 0x8(0x28)
	struct TArray<struct FName> ShouldBuildThemes; // 0x30(0x10)
	struct TArray<struct FName> ShouldBuildPOIs; // 0x40(0x10)
	struct TArray<struct FName> ShouldLoadPOIs; // 0x50(0x10)
	struct TArray<struct FName> ShouldLoadGameplayAreas; // 0x60(0x10)
	struct TArray<struct FString> CleanLevels; // 0x70(0x10)
};

// Object: ScriptStruct GeneBatchBlueprintGlue.GeneBatchPOIInputData
// Size: 0x50 (Inherited: 0x0)
struct FGeneBatchPOIInputData
{
	struct TArray<struct FGeneBatchSMCInputData> SMCInputData; // 0x0(0x10)
	struct FGeneBatchPOI POI; // 0x10(0x40)
};

// Object: ScriptStruct GeneBatchBlueprintGlue.GeneBatchStaticMeshComponentArray
// Size: 0x10 (Inherited: 0x0)
struct FGeneBatchStaticMeshComponentArray
{
	struct TArray<struct UStaticMeshComponent*> Items; // 0x0(0x10)
};

// Object: ScriptStruct GeneBatchBlueprintGlue.MaterialFilterInfo
// Size: 0x20 (Inherited: 0x0)
struct FMaterialFilterInfo
{
	struct TArray<struct UStaticMeshComponent*> StaticMeshCompoents; // 0x0(0x10)
	struct FString MaterialNames; // 0x10(0x10)
};

// Object: ScriptStruct GeneBatchBlueprintGlue.LocalLightGroupBakeFilterInfo
// Size: 0x18 (Inherited: 0x0)
struct FLocalLightGroupBakeFilterInfo
{
	struct TArray<struct UStaticMeshComponent*> StaticMeshCompoents; // 0x0(0x10)
	struct ULocalLightGroupBake* LocalLightGroupBake; // 0x10(0x8)
};

// Object: ScriptStruct GeneBatchBlueprintGlue.BatchConfig
// Size: 0x20 (Inherited: 0x0)
struct FBatchConfig
{
	int32_t GridX; // 0x0(0x4)
	int32_t GridY; // 0x4(0x4)
	int32_t RefMaxCount; // 0x8(0x4)
	float MaxVolume; // 0xC(0x4)
	struct FString PackageName; // 0x10(0x10)
};

// Object: ScriptStruct GeneBatchBlueprintGlue.StaticMeshMergeInfo
// Size: 0x20 (Inherited: 0x0)
struct FStaticMeshMergeInfo
{
	struct TArray<struct UStaticMeshComponent*> InputStaticMeshs; // 0x0(0x10)
	struct UStaticMeshComponent* MergeStaticMesh; // 0x10(0x8)
	struct AActor* BindToActor; // 0x18(0x8)
};

// Object: ScriptStruct GeneBatchBlueprintGlue.SwapVertexColorObject
// Size: 0x28 (Inherited: 0x8)
struct FSwapVertexColorObject : FTableRowBase
{
	struct FSoftObjectPath SoftObjectPath; // 0x8(0x18)
	int32_t SwapCount; // 0x20(0x4)
	uint8_t Pad_0x24[0x4]; // 0x24(0x4)
};

// Object: Class GeneBatchBlueprintGlue.BatchHelper
// Size: 0x28 (Inherited: 0x28)
struct UBatchHelper : UObject
{

	// Object: Function GeneBatchBlueprintGlue.BatchHelper.FilterByVolume
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x780cf38
	// Params: [ Num(3) Size(0x28) ]
	static struct TArray<struct UStaticMeshComponent*> FilterByVolume(const struct TArray<struct UStaticMeshComponent*>& InStaticMeshComps, float VolumeLimit);

	// Object: Function GeneBatchBlueprintGlue.BatchHelper.FilterByVirtualTextureDeco
	// Flags: [Final|Native|Static|Public|HasOutParms|BlueprintCallable]
	// Offset: 0x780ce48
	// Params: [ Num(2) Size(0x20) ]
	static struct TArray<struct UStaticMeshComponent*> FilterByVirtualTextureDeco(const struct TArray<struct UStaticMeshComponent*>& InStaticMeshComps);

	// Object: Function GeneBatchBlueprintGlue.BatchHelper.FilterByValidMesh
